{
  "id": 10,
  "title": "You could lick this floor",
  "body": "We were lucky enough to meet a guy who cleans nasty carpet adhesive off concrete floors. He gave us a good deal, we gave him job. Simple as that.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/31_img00549iv.jpg\" />\r\n\r\nHe used a modified buffer with carbide blades to scrape the glue off the floor. It scratched the terrazo in a few places, but nothing that can't be buffed out if and when the floor is ever refinished.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/32_img00532ui.jpg\" />\r\n\r\nAfter the initial scraping, the glue shavings were swept up, shoveled into bags, and disposed off. I made the mistake of stepping on one of the glue piles... I'm still picking glue off the bottom of my shoes!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/33_img00550fe.jpg\" />\r\n\r\nThis is the floor guy's son and his friend. After the floor was buffed/scraped, they went through and applied chemical to what was left. After the glue turned to liquid they scraped it off with sharp sticks.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/34_img00565ct.jpg\" />\r\n\r\nBehold... a clean floor. I'm not sure what that thing is to the left. It looks like a giant flip flop.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/35_img00792nl.jpg\" />\r\n\r\nThis is the next project: plastering the walls. They have lots of little holes and cracks that need to be patched up, so that's what's on the agenda for this Saturday. Drop by and say hello if you're in the neighborhood.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/36_img00803cu.jpg\" />\r\n\r\nThe places where the woodwork was bolted to the masonry kind of looks like bullet holes. It's like the car garage where the St. Valentine's Massacre took place!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/37_img00810bh.jpg\" />\r\n\r\nBullet holes.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/38_img00828nj.jpg\" />\r\n\r\nMore bullet holes.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/39_img00832xq.jpg\" />\r\n\r\nWe also need to pacth the thin horizontal board where the old bulletin board used to be. The thin board will be used to display artwork... at least that's what we're planning on.",
  "author_id": 1,
  "photographer": "Dan",
  "created_at": "2005-03-04T19:41:31.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Ben Dillon",
      "body": "You COULD lick that floor.",
      "created_at": "2005-03-04T20:22:20.000Z"
    },
    {
      "author": "justin",
      "body": "Save some work for Kelley and I to do next weekend!",
      "created_at": "2005-03-04T20:29:35.000Z"
    },
    {
      "author": "Stephanie's friend Sylvia",
      "body": "Hmmm....I just might know a place where you can get a few nice pieces of art to hang on those bare walls!",
      "created_at": "2005-03-05T01:33:22.000Z"
    },
    {
      "author": "Oz",
      "body": "I think your \"flip flop\" is the head of a sander.",
      "created_at": "2005-03-05T02:46:27.000Z"
    },
    {
      "author": "Brandon",
      "body": "Speaking of building renovation, I might be a future independent theater owner some day as well.  My parents own a good-sized building in downtown Reallysmall, OH, (Washington Court House?) and I've always wanted to put it to use.  The hinderance?  Our town has about 23,000 people, is highly conservative (much to my dismay), associated with farming more than anything, and has no University within 30 miles.  I don't know if I would be able to keep one of these theaters alive with such a base... but the building had always looked pretty damn tempting.  Would you like me to e-mail some pictures?  First I would have to take them, but... :)    In a few years, when the Moxie's all the rage and I'm out of college, I could be coming to you for advice... I'm sure YOU wouldn't want to venture the Moxie into Reallysmalltown, OH...  would you?",
      "created_at": "2005-03-05T06:05:28.000Z"
    },
    {
      "author": "bjork24",
      "body": "Brandon, never say never. Do your homework, check out bigscreenbiz.com and filmtech.com and build a quick market analysis. You might look more towards Toledo or Ann Arbor. College populations are the make or break for theaters like this.",
      "created_at": "2005-03-05T12:13:41.000Z"
    },
    {
      "author": "brian of moore",
      "body": "bullet holes?  wait.. people arent allowed to shoot guns inside right?  i mean fun is fun... but then someones spleen gets ruptures.. and we are all grounded for weeks",
      "created_at": "2005-03-15T00:38:58.000Z"
    }
  ]
}
