{
  "id": 11,
  "title": "Ragtag Cinemacafe and the True/False Film Festival",
  "body": "This phlog is from our recent trip up to Columbia for the True/False Film Festival, which has become, in its two year existence, the preeminent documentary film festival in the Midwest, if not the nation. Many thanks to Paul and David for giving Nicole and I all-access passes to the festival, and to Justin and Kelley for giving us all-access passes to the bed in their guest bedroom. Gracias amigos!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/20_a5tm.jpg\" />\r\n\r\nThis is the beautiful Missouri Theater, which lives right down the street from Ragtag. Out of the four films we saw last weekend, three were here. These shots were taken just before the opening night film, <a href=\"http://www.imdb.com/title/tt0436613/\" target=\"_blank\">Murderball</a>, which was an AWESOME film.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/21_b2vo.jpg\" />\r\n\r\n<a href=\"http://www.gillioz.org\" target=\"_blank\">The Gillioz</a>, which is the historic 1,100 seat theater right down the road from the Moxie, will look like this one day. I can't wait!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/22_c1ez.jpg\" />\r\n\r\nLook at them purty winders!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/23_d8rq.jpg\" />\r\n\r\nHere's a blurry picture of the creative minds behind <a href=\"http://www.imdb.com/title/tt0436613/\" target=\"_blank\">Murderball</a>. From left: the moderator (I forgot his name), co-director and co-producer Dana Adam Shapiro, co-director Henry Alex Rubin (who I got to meet, and who Nicole has a serious crush on), and producer Jeff Mandel.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/24_e1yf.jpg\" />\r\n\r\nAh, the Ragtag. The spark that created the Moxie. Here's a nice shot of the front of their auditorium and the screen. NOTE: The screen is a standard pull-down projector screen, not a prefab, sized movie screen... hmm, not a bad idea. Also, the speakers are mounted on the walls beside and above the screen, as opposed to behind it, thus freeing up a foot and a half of space between the front row and the screen.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/25_f2di.jpg\" />\r\n\r\nBlack ceiling. Track lighting. Beautiful!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/26_g4mf.jpg\" />\r\n\r\nHere's some artwork on the walls. Notice the color scheme: red, black, white. Sound familiar? Also, the bathroom - the ONLY bathroom - is located just to the left of the frame... INSIDE the auditorium. Pretty cool, eh?!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/27_h3wy.jpg\" />\r\n\r\nMore artwork, but check out the wall behind it. It's the same bumpy, plaster that we have in our building. Hooray!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/28_i5ov.jpg\" />\r\n\r\nCouches and chairs, some more comfortable than others, but very cool nonetheless.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/29_j3iz.jpg\" />\r\n\r\nThis church is referred to as the Donald Duck church. Can you see why?\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/30_k2xe.jpg\" />\r\n\r\nHere's Nicole cradling Abbey, Justin and Kelley's cat. What a cute picture.",
  "author_id": 1,
  "photographer": "Dan",
  "created_at": "2005-03-04T20:19:48.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "Abbie told me to tell you she was made at you for misspelling her name.",
      "created_at": "2005-03-04T20:32:15.000Z"
    },
    {
      "author": "bjork24",
      "body": "She was MADE at me? What the hell does that mean? Does she work for the new MAKE magazine?",
      "created_at": "2005-03-04T20:52:14.000Z"
    },
    {
      "author": "Brandon",
      "body": "The pulldown screen at Ragtag fits in with the sofas and chairs--really college-esque--but simply for the fact that you went with theater seats, I'd say a prefab screen would fit in better with your image.  Then again, who am I, you know?\r\n\r\nYou SHOULD, however, look into some more artwork like on the bumpy plaster wall.  \"failure.\"  it just makes me smile.",
      "created_at": "2005-03-05T05:26:47.000Z"
    },
    {
      "author": "Fyse",
      "body": "Please enlighten me. I can't see why the Donald Duck church is so called!",
      "created_at": "2005-03-05T09:02:47.000Z"
    },
    {
      "author": "bjork24",
      "body": "Fyse, think of those two black vents on the bellfry as eyes... then the concrete lip as a duck bill... do you see it now?",
      "created_at": "2005-03-05T12:09:55.000Z"
    },
    {
      "author": "Fyse",
      "body": "Yes!",
      "created_at": "2005-03-05T17:51:07.000Z"
    }
  ]
}
