{
  "id": 13,
  "title": "My dad and I get plastered",
  "body": "The following phlog fails to find a fitting fiddle for fifteen football funters. If you've forgotten what the West wall looked like, please refer to <a href=\"/phlogs/10\">this phlog</a>. Away we go!<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/0_plaster17oj.jpg\" /><br/><br/>Before we could mortar the walls, someone had to go through with a wire brush drill piece and knock all the loose pieces off. That someone was me. I'm not sure what the black stuff is, but it tasted just like lead-based paint with a hint of asbestos.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/1_plaster22zi.jpg\" /><br/><br/>For mortar to stick, it has to be applied to a wet surface, so we hooked the ole garden hose to the water supply for the non-existent washer and dryer, and... that's it. I was headed for comedic gold, but I lost my train of thought.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/2_plaster36qx.jpg\" /><br/><br/>Mortar + sand + water + trowels = fun!<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/3_plaster42lp.jpg\" /><br/><br/>Here's a nice artistic shot of the wall, some fresh mortar, and the top of a hoe. Nothing funny about that.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/4_plaster56ab.jpg\" /><br/><br/>Here's me (\"young Dan\") and my Dad (\"old Dan\") plastering away. My Dad is more of a perfectionist than me, if you can believe that, so it was a big step for him to let me help plaster the walls of MY OWN theater. Thanks Dad! You can see the disapproval in his eyes. You can also a piece of steel wool sitting on the lip of the woodwork... where did that come from? Would you look at that ass!<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/5_plaster68qi.jpg\" /><br/><br/>As soon as I walk away, Dad sneaks in to double-check my work... and eyeball the steel wool.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/6_plaster74ns.jpg\" /><br/><br/>I'm the best water sprayer in the world... bar none. Are you barring anyone? You are?! How many? One? Why? No, no, no. I said bar NONE, not bar ONE. What? Ok. I'll wait. How many are you barring now? That's what I thought. See, I told you I was the best.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/7_plaster80qb.jpg\" /><br/><br/>This is what I look like after someone takes me down a notch and tells me I'm not the best water sprayer in the world. Thanks Dad.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/8_plaster91ow.jpg\" /><br/><br/>The bullet holes are no more.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/9_plaster100wt.jpg\" /><br/><br/>The sand wasn't quite as <i>fine</i> as we had hoped. Little pebbles kept falling out of the holes after the mortar dried.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/10_plaster110yv.jpg\" /><br/><br/>Here's a finished section of wall, complete with a newly formed window sill. I can't take credit for this level of craftsmanship... thanks Dad.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/11_plaster124vq.jpg\" /><br/><br/>Looking pretty good, eh? The nicest thing about having concrete floors is that you can spray everything out the front door. Unless, of course, the mayor of Springfield is walking in front of your building. Then you run the risk of accidentally spraying sandy water on his pants and having him yell, \"Hey! You just sprayed sandy water on my pants.\" And then you'd have to say, \"Sorry!\" Then, as a sign of repentance, you'd probably want to squirt yourself in the crotch a few times. It's only fair!<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/12_plaster130wb.jpg\" /><br/><br/>These holes are all that remain of an ancient stairwell that was used by Homo Ergaster. Since the health department is requiring us to fill them, I used the last bits of mortar to finish the job. Unfortunately, the act of slopping mortar into a big hole with a wooden trowel isn't as efficient as it sounds, so....<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/13_plaster148rt.jpg\" /><br/><br/>I shoved my hand into the mortar, pulled out a baseball-sized chunk, rounded it off, and launched it into the hole. The result was a very satisfying thump sound and a well-mortared hole.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/14_plaster150pg.jpg\" /><br/><br/>It's not pretty, but I'll be damned if it didn't work like a charm. Fear not, these holes will most likely end up being covered with drywall.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/15_plaster169ha.jpg\" /><br/><br/>It's a shame we have to block out the two big windows on the West wall. Would you look at that sunset!",
  "author_id": 1,
  "photographer": "Nicole",
  "created_at": "2005-03-15T05:18:24.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "You can see your underware in that one shot.  Hot.",
      "created_at": "2005-03-15T05:35:08.000Z"
    },
    {
      "author": "bjork24",
      "body": "That's not underwear, it's a tattoo of a smurf.",
      "created_at": "2005-03-15T05:37:41.000Z"
    },
    {
      "author": "nicole",
      "body": "I still think you're the best water sprayer in the world.",
      "created_at": "2005-03-15T05:56:38.000Z"
    },
    {
      "author": "Ole",
      "body": "Hey, how come I can't see the photos in the phlog? damn Firefox...",
      "created_at": "2005-03-15T08:05:38.000Z"
    },
    {
      "author": "bjork24",
      "body": "Try refreshing. ImageShack goes down once and a while.",
      "created_at": "2005-03-15T08:10:58.000Z"
    },
    {
      "author": "brian of moore",
      "body": "dont damn firefox... firefox love you<br/>... i could spray water like that.... before the war",
      "created_at": "2005-03-16T02:23:50.000Z"
    },
    {
      "author": "matt",
      "body": "The second picture looks like an Andy Goldsworthy piece only without the elements of nature and beauty.  Brilliant!",
      "created_at": "2005-03-16T09:48:33.000Z"
    },
    {
      "author": "nicole",
      "body": "I had to look up Andy Goldsworthy. Thanks for the comparison!",
      "created_at": "2005-03-17T00:22:50.000Z"
    }
  ]
}
