{
  "id": 15,
  "title": "Raising the roof",
  "body": "Before the walls could go up, the ventilation system had to be lifted as close to the ceiling as possible. We could've paid someone to do it, but that's not the \"Chilton\" way. So, last Thursday, Dad and I spent an evening raising the roof... or rather, raising the ductwork TO the roof.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/vents_1.jpg\" />\r\n\r\nBefore we started working, I checked to see if the vinyl we had left over from the \"OPENING SOON\" sign would fit over the windows. Since we're blocking them up, we need something on the back of the windows so it doesn't look tacky from the outside. This is still a work in progress.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/vents_2.jpg\" />\r\n\r\nNothing to see here... just a really cool guy (bearded) deftly maneuvering down the side of some scaffolding with a bolt of red vinyl in his hand. HOT!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/vents_3.jpg\" />\r\n\r\nThe first two steps in raising a ventilation system are 1) making sure your level is working (dad - on the left), and 2) rolling up your sleeves (me - on the right).\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/vents_4.jpg\" />\r\n\r\nNext, lift up the ductwork and place it on your head (me) while someone checks to see if it's level (dad). If you're wearing a hat, continually complain that the bead on top of your hat is digging into your skull, but yet do nothing about it.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/vents_5.jpg\" />\r\n\r\nStep four, stand and wait. Posing - optional. Beard - not optional.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/vents_6.jpg\" />\r\n\r\nHere's another good shot. Notice how high we are off the ground, yet neither myself or my dad (hidden) are the least bit frightened. Amazing what beer can do.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/vents_7.jpg\" />\r\n\r\nI'm not sure what's going on here, but it looks like I'm making the international gesture for a blowjob. No. Seriously though... that's exactly what I'm doing.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/vents_8.jpg\" />\r\n\r\nHere's my dad screwing in a sheet metal screw into the duct. You can tell by his tongue that he's focusing really hard. I guess that's better than making the blowjob gesture though.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/vents_9.jpg\" />\r\n\r\nHere's what the ducts looked like BEFORE we lifted them up.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/vents_10.jpg\" />\r\n\r\nHere's what they looked like AFTER we lifted them up. Notice the additional sheet metal screw? That's for safety.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/vents_11.jpg\" />\r\n\r\nThis is one of the screens on the window. Sometime over the last few weeks, the visage of Jabba the Hut has miraculously appeared on the window. Nicole thinks it's a sign of the apocalypse; I think it's a subversive marketing technique perpetrated by George Lucas in preparation for the May release of <i>Revenge of the Sith</i>. Either way, we're selling it on eBay.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/vents_12.jpg\" />\r\n\r\nThis is a toilet air pipe filled with GIANT cockroaches. It's located between the bathrooms. I'm not lying when I say there are at least 2,593 cockroaches in that pipe. Nor am I lying when I say they're about 3 inches long. I am, however, slightly exaggerating when I tell you that right after I snapped this picture, I put my lips over the top of the pipe and sucked them all up into my mouth. They're now living happily in my beard.",
  "author_id": 1,
  "photographer": "Nicole",
  "created_at": "2005-04-04T08:26:01.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "whitty",
      "body": "BAH!  Those cockroaches are not a good surprise ending, they are a very bad surprise ending!  You might as well have told me that Bruce Willis is really dead.  BAH!",
      "created_at": "2005-04-04T16:35:49.000Z"
    },
    {
      "author": "bjork24",
      "body": "They're friendly cockroaches though.",
      "created_at": "2005-04-04T18:10:39.000Z"
    },
    {
      "author": "Allison",
      "body": "on the bright side, it would be really fun to take a can of raid and just watch them drop off the side of the pipe.",
      "created_at": "2005-04-04T19:14:07.000Z"
    },
    {
      "author": "Oz",
      "body": "You're a funny boy, Dan.",
      "created_at": "2005-04-04T19:27:22.000Z"
    },
    {
      "author": "Rachel",
      "body": "Oh gross gross gross.  But...if those cockroaches had beards...",
      "created_at": "2005-04-04T19:42:38.000Z"
    },
    {
      "author": "Dave",
      "body": "dude. i read this with a mouthfull of burrito. you should have some kind of grossout warning.\r\n\r\nglad to see you found some new clothes.",
      "created_at": "2005-04-04T20:22:15.000Z"
    },
    {
      "author": "Nate",
      "body": "Several things:\r\n\r\n1) The beard is really coming along.  Good work!\r\n\r\n2) I see the Jabba!  That is wild, man.  The force is with my Rorschach (sp?) perception.\r\n\r\n3) The cockroach source has been located...which is the Moxie version of the Sarlaac pit (sp?) I guess.\r\n\r\n4) The cockroaches I think give the Moxie an Indiana Jones Temple of Doom type feel.  Lucas is all over the damned place.  Plus, you and Indiana are never without your hat.\r\n\r\n5) Or whip.",
      "created_at": "2005-04-04T20:24:03.000Z"
    },
    {
      "author": "nicole",
      "body": "I felt my insides crawling after finding out I was in the same room as 2000 giant cockroaches. ",
      "created_at": "2005-04-04T20:46:21.000Z"
    },
    {
      "author": "bjork24",
      "body": "You guys are really biased against cockroaches, aren't you? I bet if I found a pipe full of butterflies or lady bugs, no one would care... but as soon as I say cockroaches... I think they're kinda cute. I've named the one that lives in my left nostril. I call him Nostrilatu.",
      "created_at": "2005-04-04T20:47:18.000Z"
    },
    {
      "author": "steph v.",
      "body": "Gross.\r\n\r\nBut everything else looks like it's coming along...",
      "created_at": "2005-04-04T20:57:47.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "I recently sustained a muscle strain in my chest that makes laughing hurt.\r\n\r\nYou made me hurt. That's the best compliment I can give you.",
      "created_at": "2005-04-04T21:09:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'm glad I could hurt you, Evan.",
      "created_at": "2005-04-04T21:17:34.000Z"
    },
    {
      "author": "Fyse",
      "body": "Nostrilatu. Genius.",
      "created_at": "2005-04-04T21:42:30.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thx!",
      "created_at": "2005-04-04T21:51:29.000Z"
    },
    {
      "author": "J.R.",
      "body": "You almost made me lose it in the Library!",
      "created_at": "2005-04-04T23:59:18.000Z"
    },
    {
      "author": "erin",
      "body": "that sure is some pretty duct work. 'a' plus.",
      "created_at": "2005-04-05T01:36:25.000Z"
    },
    {
      "author": "brian of moore",
      "body": "... reminds me of Joe's Apartment\r\n... eh... well hey at least office space was good",
      "created_at": "2005-04-05T03:13:36.000Z"
    },
    {
      "author": "Nicki J",
      "body": "EW!\r\n\r\nsell the cockroaches on ebay?\r\n\r\nhey, you never know.",
      "created_at": "2005-04-05T03:59:31.000Z"
    }
  ]
}
