{
  "id": 16,
  "title": "I am a media whore, but I look damn good in sunglasses",
  "body": "For those of you who love seeing pictures of me giving interviews, this post is for you.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/interview1.jpg\" /><br/><br/>Here I am (looking a little like Chris O'Donnell) being interviewed by ABC 33. The question was \"why did you decide to auction off the naming rights to the Cinebar?\" The answer was an expertly-choreographed hand jive.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/interview2.jpg\" /><br/><br/>The next question was, \"Dan, tell us - how would you look right now if you were holding a heavy bowling ball?\"<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/interview3.jpg\" /><br/><br/>Judging by the smile on my face and the waning interest of the cameraman, this photo must have been taken whilst I was being especially riveting.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/interview4.jpg\" /><br/><br/>After the auction ended, ABC 33 came back for a follow-up. This is the face I make when I accidentally clasp my hands too tightly over my crotch.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/interview5.jpg\" /><br/><br/>This is me looking cool. Damn cool. So cool, in fact, that the cameraman (Sherm was his name) had to put a coolness filter on his camera. Without it, the viewing audience would have been blinded by my ultra-coolness.<br/><br/>Hmm. The more I look at this photo, the more it reminds me of something. What could it be? Wait a minute! It's...<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/interview6.jpg\" /><br/><br/>... the same pose from one of my senior pictures! Well, not exactly the same, but the underlying elements are there: hand in the pocket, leaning to the left, expression of assuredness with just a hint of accessibility. I wish I still had that sweater vest.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/interview7.jpg\" /><br/><br/>Since we're already on the topic of looking cool, here's another one of my senior pictures. When the cameraman asked me what theme I'd like to go for in the picture, I replied:<br/><br/>\"I want to look like a federally-sanctioned Native American Relations Agent who has just been assigned to a Hopi reservation in Northeast Arizona. The picture can be a depiction of me on my first day on assignment... stoic professionalism with just a hint of coolness. Can I wear my glasses? I look damn good in sunglasses, you know.\"<br/><br/>As you can see, the photographer was a very acquiescent fellow.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/interview8.jpg\" /><br/><br/>And finally, since we're already on the subject of Arizona and looking awesome in pictures, here's another one you can add to the pile. That's my friend Doug on the left. Can you guess what my partially blocked shirt says? ARIZONA JEANS! That, my friends, is AWESOME!",
  "author_id": 1,
  "photographer": "Nicole",
  "created_at": "2005-04-25T04:14:43.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Ben Dillon",
      "body": "I'm still trying to figure out how you went from theater pictures to Arizona Jeans... Oh well, you still look damn cool.",
      "created_at": "2005-04-25T04:26:11.000Z"
    },
    {
      "author": "bjork24",
      "body": "It was all just an elaborate scheme to post that last picture of Doug and I.",
      "created_at": "2005-04-25T04:45:18.000Z"
    },
    {
      "author": "Fyse",
      "body": "Is your hair blonde in that last photo?!",
      "created_at": "2005-04-25T16:26:17.000Z"
    },
    {
      "author": "Nate",
      "body": "Is that Chicago?",
      "created_at": "2005-04-25T17:08:47.000Z"
    },
    {
      "author": "Nate",
      "body": "No, not the picture.<br/><br/>I mean that song I can't get out of my head.<br/><br/>Never mind - it was just Peter Cetera during his solo career.",
      "created_at": "2005-04-25T17:14:24.000Z"
    },
    {
      "author": "bjork24",
      "body": "Fyse: Yes.<br/><br/>Nate: Yes.",
      "created_at": "2005-04-25T17:35:24.000Z"
    },
    {
      "author": "Oz",
      "body": "Good lord.  Where did you go to school?  Such elaborate senior pictures! ",
      "created_at": "2005-04-26T01:05:18.000Z"
    },
    {
      "author": "Mena",
      "body": "You and Doug are looking hot. Is he also married to apron making, temp sub, art house theater owner? (If not, please post relevant senior pictures portraying various degrees of coolness and hotness, warmness not necessary. thanks)",
      "created_at": "2005-04-26T17:08:22.000Z"
    },
    {
      "author": "bjork24",
      "body": "Oz: Senior pictures were really big in Springfield. You payed an outside photographer to take them for you, then you'd pass them around to all your friends... like baseball cards.<br/><br/>Mena: Doug is not married, but he wishes he was.",
      "created_at": "2005-04-26T17:52:28.000Z"
    },
    {
      "author": "Rachel",
      "body": "you look a little silly, but that city behind you is DAMN hot!",
      "created_at": "2005-04-26T18:40:16.000Z"
    }
  ]
}
