{
  "id": 17,
  "title": "La pared falsa y las cucarachas muertas",
  "body": "<img src=\"http://moxie.danchilton.com/pix/phlog/construction1.jpg\" /><br/><br/>This is me holding a big chunk of wood. Dad and I removed it so we could build a false wall along the Eastern side of the Cinebar. It took all of my strength to lift it for the camera. Seriously... that thing weighed at LEAST 30 pounds!<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/construction2.jpg\" /><br/><br/>Here I am practicing my foreman skills while dad builds the wall frame. I'm also making sure the stack of 2x4's doesn't fall over.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/construction3.jpg\" /><br/><br/>Here's my dad hammering the studs into place, but from this angle... I won't even say what it looks like!<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/construction4.jpg\" /><br/><br/>Dan the foreman says: <i>Hit the nails harder, Dad! I swear, we're never going to get open at this pace!</i><br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/construction5.jpg\" /><br/><br/>My dad designed some \"work\" shirts for us to wear while we \"worked\" on the theater. He's the only person I know who works harder than I do.<br/><br/>That's a compliment, dad.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/construction6.jpg\" /><br/><br/>After dad walked away, I sprang into action and lifted the 60+ pound wall all by myself. I always knew working with an Amish barn raising crew would come in handy one day.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/construction7.jpg\" /><br/><br/>Push Dan! PUSH!<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/construction8.jpg\" /><br/><br/>Here we are fighting over who gets to push the wall into place. As usual, Dad won.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/construction9.jpg\" /><br/><br/>After the wall was in place, Dad and I went down the line and shook hands with each and every stud.<br/><br/>Truth be told, I couldn't think of a good caption for this picture.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/construction10.jpg\" /><br/><br/>No, those aren't raisins. They're dead cockroaches. One of the tenants who lives next door to the Moxie happens to be an exterminator, so when he stopped by to introduce himself, I asked him what we should do about our <a href=\"/pix/phlog/vents_12.jpg\" target=\"_blank\">unwanted guests</a>. He quickly produced a can of ultra-strength roach killer and two raid bombs. The following pictures are the aftermath of said bombs. Dead. Roaches. Everywhere!<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/construction11.jpg\" /><br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/construction12.jpg\" /><br/><br/>Believe it or not, there's still a few rebel roaches scurrying about the theater. Thankfully, Tommy (our friendly neighbor exterminator) promised to come back and fumigate the entire first floor in exchange for some free movie passes. I don't know... I've kinda grown attached to the little buggers. Sometimes, when no one's around, I let them crawl around under my shirt.",
  "author_id": 1,
  "photographer": "Nicole",
  "created_at": "2005-04-25T04:41:28.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "muddgirl",
      "body": "I think I'm falling in love with you. Don't tell Nicole.",
      "created_at": "2005-04-25T06:28:44.000Z"
    },
    {
      "author": "matt",
      "body": "The question that these pictures beg is: \"why do you need to erect a new wall in front of an exisiting wall?\"",
      "created_at": "2005-04-25T07:04:23.000Z"
    },
    {
      "author": "bjork24",
      "body": "Muddgirl: Wha, wha, what?!<br/><br/>Matt: All the walls have to be smooth, as per the health department's instructions. The current wall isn't smooth enough.",
      "created_at": "2005-04-25T08:03:13.000Z"
    },
    {
      "author": "Fyse",
      "body": "Oh no! What became of Nostrilamus?",
      "created_at": "2005-04-25T16:29:29.000Z"
    },
    {
      "author": "Nate",
      "body": "Did the original non-smooth wall just lack game or what?  Was it Rich but not Smooth?",
      "created_at": "2005-04-25T17:18:15.000Z"
    },
    {
      "author": "bjork24",
      "body": "Fyse: Nostrilamus is still around... he's just on sabatical.<br/><br/>Nate: Apparently the walls weren't smooth enough. Our health department agent was really put off by some of the remarks our wall made towards her.",
      "created_at": "2005-04-25T17:34:59.000Z"
    },
    {
      "author": "Oz",
      "body": "I've always found that, \"Yo baby, yo baby, yo baby, yo!\" works really well with the ladies.  Feel free to pass that along to your wall.",
      "created_at": "2005-04-26T01:08:56.000Z"
    },
    {
      "author": "bjork24",
      "body": "Oh yeah!",
      "created_at": "2005-04-26T17:51:11.000Z"
    }
  ]
}
