{
  "id": 18,
  "title": "Blood, sweat, and blood",
  "body": "Unless you like watching / reading step-by-step construction guides, this phlog will most likely bore you. Hell, it may bore you even if you DO like step-by-step construction guides... I'm not making any promises.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more1.jpg\" /><br/><br/>As some of you may or may not remember, one of our restrooms (the largest one) had a blocked up door in the middle of the wall. At one point, it was a door for the bank's drive-thru, but now it's just an ugly eyesore. Enter Dan's dad!<br/><br/>Step one was to build a frame out of left over 2x4's from the false wall.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more2.jpg\" /><br/><br/>Next, screw them into the base board and cinder blocks.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more3.jpg\" /><br/><br/>Cover the frame with 3/4 inch plywood and screw it down. Remove the existing trim on both sides of the cutout and replace it with a single piece that was salvaged from the wall of the auditorium-to-be (it may not look that nice, but the trim is actually solid Walnut).<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more4.jpg\" /><br/><br/>Replace the top rail trim and add an additional piece to cover the back of the frame.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more5.jpg\" /><br/><br/>Glue a piece of 1/2 inch styrofoam directly to the cinder blocks to act as a moisture barrier. After the glue has set-up, cover the styrofoam with treated sheetrock (glue it and screw it, mate!).<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more6.jpg\" /><br/><br/>Use salvaged pieces of quarter-round and plywood to cover the broken sections of the wall and give it a more \"finished\" appearance.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more7.jpg\" /><br/><br/>Hide the joints in the paneling with wood salvaged from the walls of the art gallery-to-be. Voila... finished! When it's time to finish out the restrooms, we'll mud the joints in the sheetrock and paint over it, as well as all the woodwork. Then we'll hang something nice in the recessed area... a movie poster perhaps. Either way, it'll look a hell of a lot better once it's COMPLETELY finished.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more8.jpg\" /><br/><br/>While dad was busying himself with the restroom wall beautification project, I decided to patch the broken woodwork along the North side of the building. Unfortunately, I didn't have the camera with me when I started working, so you won't get to see what the wall looked like BEFORE I repaired it.<br/><br/>Basically, the paneling was split in two and the trim had been shattered and pulled off the wall. I have no idea how the damage occurred in the first place, but I'm guessing someone either slammed themselves into the wall or smashed it with a baseball bat. Maybe a tennis racket.<br/><br/>Either way, step one was to take salvaged strips of wood from the wall of the art gallery-to-be and shove it behind the broken section of paneling.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more9.jpg\" /><br/><br/>I then used salvaged wood screws to rejoin the two sections of paneling by screwing along the joint into the strips of wood that I shoved behind it.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more10.jpg\" /><br/><br/>Once the paneling was repaired, it was then time to replace the \"backing board\" that the trim was originally nailed to. Can you guess what I used? That's right, more salvaged wood from the art gallery-to-be! Here's a shot of the newly formed \"backing board\" made from scrap wood.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more11.jpg\" /><br/><br/>And another shot.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more12.jpg\" /><br/><br/>Once the backing board had been properly secured, I nailed the trim back into place.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more13.jpg\" /><br/><br/>I had to use another piece of salvaged Walnut to span the entire wall. You can barely make out the joint if you look a little to the left of the column. If you can't find it, that means I'm AWESOME!<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more14.jpg\" /><br/><br/>Here's a shot of the entire wall... repaired by Dan.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more15.jpg\" /><br/><br/>I didn't have enough spare Walnut to cover the portion directly under the window, so I'll have to buy a 2x10 piece this week. Once everything is repaired, all the woodwork is going to be painted over, effectively hiding a majority of the nicks and dings in the trim and paneling.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more16.jpg\" /><br/><br/>My second project was to disassemble the phone networking and burglar alarm hubs. It took quite a bit of time, but I eventually unscrewed everything from the wall (without setting of the alarm!) and gently placed it in the cubby hole above the door frame. Once that was done, I tore down the old wood paneling that ran along the left side of the frame. If you look closely, you can still see a few remaining bits towards the lower left-hand side of the picture.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more17.jpg\" /><br/><br/>I then removed the boards that the paneling was nailed to... this is a really boring phlog, isn't it?<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more18.jpg\" /><br/><br/>Here's a close-up of all the junk that I carefully disassembled and removed from the wall. I pretended like I was breaking into a bank while I dismantled the burglar alarm... it was quite exhilarating. Until the cops showed up. Then it was just sad.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more19.jpg\" /><br/><br/>Here's a shot of the Eastern wall - the part to the left will be the art gallery, while the stuff to the right (towards the false wall) will be the Cinebar. The linear outlines on the wall is where the \"salvaged\" wood came from. All told, I probably removed 18 tons of it from the wall. Notice the varying color of paint beneath the wood... each color represents a progressively tackier stage in the building's history.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more20.jpg\" /><br/><br/>Here's another shot of the Eastern wall. All of this will be the art gallery eventually.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more21.jpg\" /><br/><br/>This is the wall above the vault, towards the back of the Cinebar. The Health department has demanded that all of our walls be completely smooth in the concession area, so we have to sheetrock all of the areas that look like this. However, before sheetrock can be applied to the wall, someone had to go through with a hammer and a chisel and break off all the pointy pieces of masonry. That someone was me.<br/><br/>This picture was taken after round one of the wall versus Dan.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more22.jpg\" /><br/><br/>This was my weapon.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more23.jpg\" /><br/><br/>This was my wound.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more24.jpg\" /><br/><br/>So, I bet you're wondering how one goes about gluing sheetrock to a wall. No? You're not? Well, too bad. I'm going to show you anyways.<br/><br/>The first step is to squirt glue all over the back of the sheetrock. Make little circles where you plan on screwing the sheetrock to the wall.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more25.jpg\" /><br/><br/>Next, stick the sheetrock on the wall and screw it down.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/more26.jpg\" /><br/><br/>Lastly, secure it. The more unsafe the securing apparatus, the better. OSHA be damned!<br/><br/>That's it! Now go try it for yourself, and don't forget to take lots of pointless pictures and post them to your own phlogs.",
  "author_id": 1,
  "photographer": "Dan",
  "created_at": "2005-04-25T05:45:17.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Fyse",
      "body": "Good grief, I feel like I wasted a significant portion of my life reading that. Oh, and is that the terrible, manly cut that you mention in a previous post? Looks more like a womanly little scratch to me...",
      "created_at": "2005-04-25T16:35:26.000Z"
    },
    {
      "author": "Nate",
      "body": "Very impressive.  I will wait for \"This Old Independent Theatre\" to appear on PBS.  <br/>As long as it does not conflict with 'Joey.'",
      "created_at": "2005-04-25T17:26:22.000Z"
    },
    {
      "author": "bjork24",
      "body": "Fyse: Opening a theater isn't all nude women and cocaine, you know. We have to do boring stuff too... on occasion.<br/><br/>Nate: You and your 'Joey'... as in, baby kangaroo.",
      "created_at": "2005-04-25T17:33:39.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "Question, Dan: if you're going through all this work to carefully salvage the walnut trim, what's the point if you're going to be painting over it? Other than the obvious cost savings or recycling as opposed to buying new.",
      "created_at": "2005-04-25T18:30:27.000Z"
    },
    {
      "author": "bjork24",
      "body": "Sam: Eventually, when money isn't as tight as it is now, we'd like to go through and restore the woodwork to its original condition. Likewise with the floor. For right now, the only advantage is in the cost savings.",
      "created_at": "2005-04-25T18:35:20.000Z"
    },
    {
      "author": "Allison",
      "body": "Maybe I just have a penchant for boring things, but this was one of my favorite phlogs.  I like to watch things get built.  Meanwhile, that wimpy little cut on your finger looked SO much bigger and grosser on the main page.",
      "created_at": "2005-04-25T19:45:03.000Z"
    },
    {
      "author": "bjork24",
      "body": "Whimpy?! I didn't hurt like a whimpy cut, I'll tell you that much.",
      "created_at": "2005-04-25T20:05:24.000Z"
    },
    {
      "author": "Nicki J",
      "body": "That was the most enthralling piece of literature I've ever set my eyes on!<br/><br/>Can you taste the sarcasm?",
      "created_at": "2005-04-26T00:52:30.000Z"
    },
    {
      "author": "Oz",
      "body": "I'm disappointed in your glueing technique.  When I was glueing it and screwing it in my house (oh baby, I did A LOT of that), I liked to draw nudies pictures of women with the glue and sometimes write clever sayings I've heard in my life, like \"Oz, you're the best I've ever had.\"",
      "created_at": "2005-04-26T01:16:25.000Z"
    },
    {
      "author": "bjork24",
      "body": "Nicki J: Mmm, that sarcasm tastes great!<br/><br/>Oz: Blame the lack of glue drawing on my dad. I wasn't allowed to touch the caulking gun... it's a long story.",
      "created_at": "2005-04-26T03:16:35.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "Then, as an amateur furniture refinisher, can I offer a suggestion for painting the walnut? I'm not a professional refinisher, but I play one on TV.<br/><br/>Paint the surfaces with clear shellac first(from the lac bug. True story.) It will seal the wood and prevent the paint from seeping into grain, making for a much easier time when you go to refinish later. <br/><br/>Plus, it cleans up with alcohol. Fresh, yummy alcohol! MMMM...alcohol...",
      "created_at": "2005-04-26T17:13:12.000Z"
    },
    {
      "author": "bjork24",
      "body": "Good suggestion, Sam. I might just do that!",
      "created_at": "2005-04-26T17:50:47.000Z"
    },
    {
      "author": "Sam \"Shellac\" Spade",
      "body": "http://antiquerestorers.com/Articles/jeff/shellac.htm<br/><br/>ADVANTAGES<br/><br/>1. Non-yellowing when compared to varnish and cellulose-nitrate based lacquers.<br/><br/>2. Quick-drying. Many shellacked items can used the same day or shortly thereafter.<br/><br/>3. Wide variety of colors available.<br/><br/>4. Superior adhesion -- no other type finish can surpass it.<br/><br/>5. Excellent hardness -- it can be sanded and rubbed out well.<br/><br/>6. Excellent as a sealer coat to raise the fibers of the wood for subsequent sanding. Also seals in finishing contaminants such as silicone, waxes, dirt and oils.<br/><br/>7. Ease of repair. Because shellac re-dissolves in alcohol, scratches and other minor surface imperfections can be invisibly repaired by re-applying shellac to the damaged area. The new shellac melts into the old shellac allowing for perfect repair work.<br/><br/>8. Ease of removal. Old and new shellac can be removed with denatured alcohol which eliminates the need for harmful and toxic strippers.<br/><br/>9. Can be wiped on (padded), brushed or sprayed -- all with good results.<br/><br/>10. FDA approved -- safe for food utensils and children's toys.<br/><br/>I know too damn much about shellac for my own good.",
      "created_at": "2005-04-26T21:24:06.000Z"
    },
    {
      "author": "Surferbill",
      "body": "Is it just me, or did anyone else think the cut on Dan's hand looks like a stick man running to the left?<br/>",
      "created_at": "2005-05-20T13:10:10.000Z"
    }
  ]
}
