{
  "id": 19,
  "title": "Hey everybody, it's NICOLE!",
  "body": "To keep up with the ever increasing demand for Nicole pictures, I decided to dedicate an entire phlog to my favorite Dr. Mario opponent. For those of you who keep up with Nicole's blog, <a href=\"http://tapioca.retroflux.com\" target=\"_blank\" class=\"broken\">Tapioca Dance</a> and <a href=\"http://tapioca.retroflux.com\" target=\"_blank\" class=\"broken\">Fresh as Paint</a>, these photos won't be new to you, but for the rest of you... be prepared to be taken aback by the beauty and elegance that is... NICOLE!\r\n\r\nNOTE: I also snatched a few photos from the twin's blog - <a href=\"http://www.cincodrive.com\" target=\"_blank\" class=\"broken\">Cinco Drive</a>. Hi Stephy!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/hidden1.jpg\" width=\"425\" />\r\n\r\nNicole is more camera shy than the famed Ivory-beaked woodpecker, but on occasion she'll take a picture like this, as if she were saying, \"Here I am world, but you can't have all of me. No, no. Not yet. Instead, gaze upon my husband's retainer case and be content.\"\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/hidden2.jpg\" width=\"425\" />\r\n\r\nHere we find Nicole showing off her amazing 1/64 carat wedding ring. The stone is so magnificient that it can't be seen! Amazing! There's some turtle wax down there too. Will we ever see Nicole? The suspense is killing me!!!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/hidden3.jpg\" width=\"425\" />\r\n\r\nWhat's this? I'm not sure. That's Nickey's eye...\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/hidden4.jpg\" width=\"425\" />\r\n\r\nYet another mysterious shot of the phantom photographer... the woman behind the camera.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/apron1.jpg\" width=\"425\" />\r\n\r\nWhen she's not taking wonderful photos, Nicole also likes to sew cute little aprons. Once she's finished sewing one of her textile masterpieces, she says, \"Dan, will you come take a picture of me and my new apron?\" To which I reply, \"Uh, something something blog. Something something computer. Blah blah blah Tetris.\" So Nicole sighes, takes a picture of herself in the mirror, and I end up feeling like the world's biggest douche bag.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/apron2.jpg\" width=\"425\" />\r\n\r\nIt's hard to believe that she makes these out of curtains and pillow cases. Seriously... it's hard to believe. Try for yourself.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/apron3.jpg\" width=\"425\" />\r\n\r\nI think this was one of her first aprons. She wears it from time to time... like when she's cooking, eating, cleaning, writing a blog entry, watching TV, reading, sleeping, or showering.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/shoes.jpg\" width=\"425\" />\r\n\r\nThese were the shoes that Nicole wore to Stephanie's wedding two weeks ago. Aren't they purty?!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/shakes.jpg\" width=\"425\" />\r\n\r\nThis is what Nicole looks like after she takes a whiff of my dark beer. D-R-U-N-K! Ha ha! Just kidding... she's not drunk, she's totally wasted! I'm sure she'll set the story straight in the comments.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/bjork.jpg\" width=\"425\" />\r\n\r\nMmmm, Bjork. That's the cutest Halloween costume of all time - hands down... my pants!!! Ha ha ha. I'm sorry. That was wrong.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/dancing.jpg\" width=\"425\" />\r\n\r\nNo, she's not having a violent coughing fit... she's DANCING! When Nicole dances, she swivels her hips back and forth, pumps her arms up and down, and makes that funny grunting noise like Ricky Gervais did on <i>The Office</i> when he danced. Don't remember? Here's <a href=\"http://homepage.mac.com/elliottday/theoffice/sounds2/brentdance.mp3\" target=\"_blank\">a clip</a>. Perfick.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/harlem.jpg\" width=\"425\" />\r\n\r\nHere's Nicole feeding \"pretend hay\" to Harlem, Nicole's mom's horsey.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/joel_girls.jpg\" width=\"425\" />\r\n\r\nAnd here's Joel, my new brother-in-law, flanked by the twins. Do you see the way Nickey (on the right) is looking at him? She never looks at me like that. GEEZ!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/nic_mel.jpg\" width=\"425\" />\r\n\r\nIn a desperate bid to be chosen as participants on one of those \"What Not To Wear\" shows on TLC, Nicole and her friend Melissa tried to look as haggard as possible for the camera. Having been born without fashion sense, I think they look fine.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/scrape.jpg\" width=\"425\" />\r\n\r\nThis is Nicole scraping wallpaper trim from the wall of our guest bedroom. THE END!\r\n\r\nIn conclusion, Nicole is an alright gal. I'd love for her to be in more phlogs, but that would mean 1) I'd have to take the pictures, which I'm not very good at, and 2) Nicole would have to be willing to have her picture taken, which she's not very good at. Don't worry though, I'll keep working with her until she gets to the point where she can have her picture taken with a Dr. Pepper in her pants and a smile on her face... mmm, Dr. Pepper.",
  "author_id": 1,
  "photographer": "Misc.",
  "created_at": "2005-04-29T06:20:43.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Fyse",
      "body": "Did Nicole pre-approve this phlog, or are you now in trouble?!",
      "created_at": "2005-04-29T11:44:54.000Z"
    },
    {
      "author": "nicole",
      "body": "No, no pre-approving on this one. I was quietly enjoying a book while I hear Dan giggling to himself in the other room. He thinks he's soooo funny sometimes.\r\n\r\nBut did he half to include the dancing photo? Come on!\r\n\r\nAnd Dan, Melissa's gonna C-I-L-L you for posting her picture when we look like that! She doesn't always dress like that, folks.",
      "created_at": "2005-04-29T16:03:40.000Z"
    },
    {
      "author": "nicole",
      "body": "er...have...not half...\r\n\r\n\"But did he half to include the dancing photo? Come on!\"",
      "created_at": "2005-04-29T16:04:16.000Z"
    },
    {
      "author": "whitty",
      "body": "Yay, for Nicole!  Hey, I have those shoes that you are wearing with your stripey and cherry apron, but you have far better gams!  All my aprons must be floor length.",
      "created_at": "2005-04-29T16:31:40.000Z"
    },
    {
      "author": "steph v.h.",
      "body": "I dig it the most....Ow!",
      "created_at": "2005-04-29T16:34:32.000Z"
    },
    {
      "author": "Oz",
      "body": "You've never answered my question about all this work you're doing to your place.  Aren't you renting?  Are they suspending the rent while you invest all this time, energy, and money into making it more fabulous?",
      "created_at": "2005-04-29T17:17:20.000Z"
    },
    {
      "author": "bjork24",
      "body": "Which place, Oz? The theater or our house? In both cases, rent is being withheld while we get everything up and runnning. Aren't landlords great!",
      "created_at": "2005-04-29T17:29:23.000Z"
    },
    {
      "author": "Rachel",
      "body": "Yay Nicole! Thanks for putting the photos up Dan.",
      "created_at": "2005-04-29T19:29:12.000Z"
    },
    {
      "author": "Oz",
      "body": "I meant the house.  Thanks for the clarification!",
      "created_at": "2005-04-29T21:25:27.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "I think halfing have a photo of Nicole is perfick.\r\n\r\ner...have...not half... and the other way, too.",
      "created_at": "2005-04-29T23:56:34.000Z"
    },
    {
      "author": "Fyse",
      "body": "FYI This phog looks screwed up in IE. You remember AGES ago when your front page looked all funny? Same deal, with the main container leaping down below another. One of the photos wider than the container, perhaps?\r\n\r\nIn my defence, I was only using IE on another computer. I am of course an enlightened FireFox user.",
      "created_at": "2005-04-30T04:06:14.000Z"
    },
    {
      "author": "Ole",
      "body": "Is it safe to assume the twin took the hypen route rather then the going with Steph HHHHHHHHHH?!!",
      "created_at": "2005-04-30T07:15:05.000Z"
    }
  ]
}
