{
  "id": 2,
  "title": "El Edificio: As it was",
  "body": "These pictures were taken several months ago, but I wanted to post them so you could see what the building looked like before any work had been done to it. So here it is, 408 W. Walnut Pre-Moxiefied.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/111_img00129xo.jpg\" />\r\n\r\nIf you ask me, I think we have one of the nicest facades out of any of the other buildings downtown. The dark green material to the left of the door is real marble. You can also see both entrances in this picture: the double doors off of Walnut and the side door coming in from the parking lot (look to the right of the scooter... it's nestled between the bushes). The white wooden door leads to the loft apartments above the theater.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/112_img00129le.jpg\" />\r\n\r\nHere's a shot from the back of the building. Not much to see back here, aside from Nicole eyeballing the dumpster.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/113_img00128li.jpg\" />\r\n\r\nOnce inside, this is the view out the double doors that lead onto Walnut. Notice the nice tile entry.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/114_img00124tn.jpg\" />\r\n\r\nThis is the view through the side entry, which leads to a small parking lot that our customers can use.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/115_img00121nq.jpg\" />\r\n\r\nThe building used to be occupied by a youth outreach center. This is all their stuff.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/116_img00122he.jpg\" />\r\n\r\nThis is the view from the double doors that face Walnut. The white room to the left will be demolished to make room for the concession area.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/117_img00126kh.jpg\" />\r\n\r\nThis is one of the two bathrooms on site. The picture doesn't quite do it justice, as the bathroom is roughly the size of a small hotel room. I'm not kidding either. It's serioulsy 10' by 10'.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/118_img00123xb.jpg\" />\r\n\r\nThis is one of the back rooms. All the plumbing comes into this room, which means we'll have to install our sinks and dishwasher back here. I might convert a section of it into a make-shift office too.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/119_img00123gt.jpg\" />\r\n\r\nThis is the much bally-hooed safe door. The safe itself isn't very bally-hooed, but the door... man, people can't get enough of it!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/120_img00121gp.jpg\" />\r\n\r\nHere's the inside of the vault. It's currently set up as 2 rooms, but we might end up tearing the dividing wall out.\r\n\r\nThat concludes our tour of the building.",
  "author_id": 1,
  "photographer": "Dan",
  "created_at": "2005-01-06T06:10:27.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "einahpets",
      "body": "Need a landscape architect or someone for curb appeal? No? Ok, maybe next theater then.",
      "created_at": "2005-01-06T21:54:54.000Z"
    },
    {
      "author": "bjork24",
      "body": "Perhaps for Moxie Toledo.",
      "created_at": "2005-01-06T22:00:40.000Z"
    },
    {
      "author": "Oz",
      "body": "Are you guys living above the theater?  If not (or if there is more than one apartment), listening to the movies played day and night will be a real treat for the renters.",
      "created_at": "2005-01-06T23:42:04.000Z"
    },
    {
      "author": "bjork24",
      "body": "No, we won't be living above the theaters. We're going to install new sound insulation and acoustical tiles to buffer the sound. It shouldn't be too bad.",
      "created_at": "2005-01-06T23:46:49.000Z"
    },
    {
      "author": "Ronda",
      "body": "Here is a coincidence for you: two landscape architects live right above the theater.",
      "created_at": "2005-01-29T03:15:05.000Z"
    }
  ]
}
