{
  "id": 25,
  "title": "Ach Vee Ay Sea - Part One",
  "body": "Since the HVAC guys aren't done yet, this will have to be a two part phlog.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/052005/hvac1.jpg\" width=\"425\" />\r\n\r\nQuestion: What can you do with midget sledge hammer (a.k.a. a maul) that creates a mess like...\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/052005/hvac2.jpg\" width=\"425\" />\r\n\r\n... this?\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/052005/hvac3.jpg\" width=\"425\" />\r\n\r\nI mean, look at this mess! Is that a spool of string tied to wrench? What the hell?!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/052005/hvac4.jpg\" width=\"425\" />\r\n\r\nAh ha!\r\n\r\nAnswer: Knock the crap out of an old chimney to make room for the big HVAC duct!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/052005/hvac5.jpg\" width=\"425\" />\r\n\r\nSee! Thanks to my amazing maul-rtial arts, the big duct can be pushed all the way over to the West wall. This picture was taken through the periscope of a little submarine costume that I like to wear on occasion.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/052005/hvac6.jpg\" width=\"425\" />\r\n\r\nVoila! Behold the screen wall in all it's glory (sans-sheetrock, obviously... and paint... and a screen)! Moving the big duct freed up over a foot of usable screen space! Also, note how the ancillary duct has been moved BEHIND the screen wall into the entryway. That will allow us to get the screen as high as possible on the wall.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/052005/hvac7.jpg\" width=\"425\" />\r\n\r\nHere's where the duct is going to hang out. If it gets bored, it can always chat up the speakerboxx.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/052005/hvac8.jpg\" width=\"425\" />\r\n\r\nSince we moved the ancillary duct to the OUTSIDE of the auditorium, we had to compensate for the loss of air flow... and this is how we did it.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/052005/hvac9.jpg\" width=\"425\" />\r\n\r\nAir is diverted from the end of the ancillary duct and piped in above the auditorium's exit door.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/052005/hvac10.jpg\" width=\"425\" />\r\n\r\nCheck out this crazy maze of ducts! I'm not quite sure why they insulated the ducts inside the projection booth, but I assume it's because the city demanded it.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/052005/hvac11.jpg\" width=\"425\" />\r\n\r\nSee those vents on the back wall? The people in the back of the auditorium are going to freeze their arses off! Ha ha!\r\n\r\nI'm just kidding. Kind of.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/052005/hvac12.jpg\" width=\"425\" />\r\n\r\nThis is a hole that the HVAC guys cut through the wall. It might not look like much here, but you have to remember that the dividing walls in the theater are 18 inches of pure concrete... and steel bars. I bet it took them quite awhile to bore through.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/052005/hvac13.jpg\" width=\"425\" />\r\n\r\nHere's the plug that came out of the hole from the last picture. That's a five gallon bucket on the right. Also, see the dark spots on the right side of the concrete plug? Those are pieces of steel bar. AWESOME!\r\n\r\nI'm going to keep that concrete plug as a reminder of something. I haven't quite figured out what it's going to remind me of, but I'm keeping it either way.",
  "author_id": 1,
  "photographer": "Dan",
  "created_at": "2005-05-20T23:15:39.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "whitty",
      "body": "Nice plug.",
      "created_at": "2005-05-20T23:19:15.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks.",
      "created_at": "2005-05-20T23:19:37.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "You should use the plug as a pedestal for something in the theater (Perhaps art work, a bust of yourself, or your hat.). It could be a problem, however, that the plug is only 18 inches tall.",
      "created_at": "2005-05-21T02:33:18.000Z"
    },
    {
      "author": "Tawny",
      "body": "I claim dibbs on a seat in the back of the theatre! I love to freeze my arse off!!",
      "created_at": "2005-05-22T01:52:12.000Z"
    },
    {
      "author": "Nate",
      "body": "Duct Tales!  (a-Woo-hoo!)",
      "created_at": "2005-05-24T15:41:05.000Z"
    }
  ]
}
