{
  "id": 26,
  "title": "Chairs, chairs everywhere, but not a place to sit",
  "body": "Loading and unloading 80 aluminum chairs sucks! You might not think aluminum chairs are heavy, but I'm here to tell you... they are. Real freakin' heavy. I also think the individual parts of a theater chair were purposefully designed to only allow three or fewer pieces to be moved at one time. Sheesh.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/052005/chairs1.jpg\" width=\"425\" /><br/><br/>Here's my parent's old farm truck with the U-Haul trailer I rented in tow. Truth be told, Nicole and I love driving around in that truck... truth, man. Truth.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/052005/chairs2.jpg\" width=\"425\" /><br/><br/>This is (was) our garage... pre-chairs.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/052005/chairs3.jpg\" width=\"425\" /><br/><br/>BOOM! Look at all those seat bottoms! Imagine if they sprouted legs and arms and eyes and mouths and started chasing you around like those <a href=\"http://www.camchatting.com/play/everytimeyoumasturbategodkillsakitten.jpg\" target=\"_blank\">Japanese monsters that kill kittens whenever you masturbate</a>! That would be freaky.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/052005/chairs4.jpg\" width=\"425\" /><br/><br/>Here they are... nice and neat. The seats on the left are an inch bigger than the ones on the right. By interspersing seats of varying sizes, it will be easier to stagger the seats so everyone can see... or at least have a fighting chance at seeing the screen.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/052005/chairs5.jpg\" width=\"425\" /><br/><br/>The garage is 30% full. Thanks a lot... SEATS!<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/052005/chairs6.jpg\" width=\"425\" /><br/><br/>I have nightmares about loading and unloading all these seat legs. Honestly, I've never moved anything so bulky and cumbersome. They weren't that heavy, but as soon as I'd pick one up, eight of them would jump on me and start punching me in the neck. It was terrible!<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/052005/chairs7.jpg\" width=\"425\" /><br/><br/>The seat bottoms and legs are planning their revolt.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/052005/chairs8.jpg\" width=\"425\" /><br/><br/>Some of the seat legs had electrical junction boxes with wires sticking out of them. It was obvious that they were the leaders of the seat legs, so I had to separate them from the rest of the seat army.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/052005/chairs9.jpg\" width=\"425\" /><br/><br/>The garage is now 42% full.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/052005/chairs10.jpg\" width=\"425\" /><br/><br/>The seat backs... OH, the seat backs! Each ones weighs roughly 90 pounds, so I could only \"comfortably\" carry seven or eight at a time. When the revolution begins, the backs will form the front line of the attack. They're bruisers... each and every damn one of them!<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/052005/chairs11.jpg\" width=\"425\" /><br/><br/>Together at last, the seats are now planning their attack... even as I type this I can hear their strained whispers coming from the garage. If we have a tornado and my car gets hail damage, I'm going to beat the crap out of every piece of chair in this picture.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/052005/chairs12.jpg\" width=\"425\" /><br/><br/>The garage is now 58% full.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/052005/chairs13.jpg\" width=\"425\" /><br/><br/>This is what the inside of a 6x12 U-Haul trailer looks like. It has a sort of Zen beauty to it, don't you think?",
  "author_id": 1,
  "photographer": "Dan",
  "created_at": "2005-05-20T23:40:28.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Fyse",
      "body": "You know what worries me most? How interesting I find these phlogs. I'm beginning to realise I'll never die happy without visiting The Moxie at some point. Not good.",
      "created_at": "2005-05-21T04:27:53.000Z"
    },
    {
      "author": "Caleb",
      "body": "Question for you (actually more of a double-checking)...<br/><br/>Are there going to be 80 total seats in the Moxie? Or is that just how many you got in this shipment?",
      "created_at": "2005-05-22T10:53:01.000Z"
    },
    {
      "author": "Ben",
      "body": "Can you actually imagine more than 80 pople fitting into the Moxie?  That would be a nightmare worse than the unloading seat legs one.<br/><br/>Unless, of course, those more-than-80-people were all exact clones of Scarlett Johannson.",
      "created_at": "2005-05-22T23:37:18.000Z"
    },
    {
      "author": "brian of moore",
      "body": "electrical junction boxes?  <br/>im not sure what that means.. but if you are going to shock us in the middle of watching a movie.. count me in.. ... <br/>its kinda like the vibration in an xbox controller.. as if you are really IN the movie",
      "created_at": "2005-05-23T22:09:16.000Z"
    }
  ]
}
