{
  "id": 28,
  "title": "A man walks into a bar...",
  "body": "... and says, \"Daniel, quit leaving these damn bars sticking out all over the place!\"\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/061905/cinebar1.jpg\" width=\"425\" />\r\n\r\nThe first step in building the Cinebar counter was to layout the cabinet base and plane it down until it was perfectly level (not an easy task in our building since EVERYTHING is either out of square or at a slope).\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/061905/cinebar2.jpg\" width=\"425\" />\r\n\r\nThe next step was to fall asleep and then wake up to this... \"Hey! Why do you have to work so fast, Dad?! I didn't get a picture of any of the steps between the base being laid out and this! No fair!\"\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/061905/cinebar3.jpg\" width=\"425\" />\r\n\r\nHere's my Dad banging his head against the new cabinet he built. Why is he banging his head you ask? Because I just told him that the HVAC guys and the electrician wouldn't be done for another 8 months.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/061905/cinebar4.jpg\" width=\"425\" />\r\n\r\nMoving right along. At this stage in the construction, we could open shop and sell splinters.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/061905/cinebar5.jpg\" width=\"425\" />\r\n\r\nEventually, the Cinebar counter will be covered with cool looking formica - top (shiny black) / front (brushed steel). Of course, we won't be putting any of it on until the very, VERY end. Formica is as easy to break as it is expensive.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/061905/cinebar6.jpg\" width=\"425\" />\r\n\r\nDad put plastic all over the top to ward off any wayward sub-contractors. Have you seen how sticky their hands are?\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/061905/cinebar7.jpg\" width=\"425\" />\r\n\r\nAfter finishing the Cinebar counter, Dad wiped his brow and threw some wood at the pass-through above the bar... this is what the result looked like. Amazing!",
  "author_id": 1,
  "photographer": "Dan",
  "created_at": "2005-06-20T08:00:30.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Mark S",
      "body": "Hey, when your Dad's finished could you send him around to my place to help my house mate with his DIY?\r\n\r\nMy bedroom looks like a bit like the Moxie at the mo.\r\n\r\nI'm not kidding ...\r\n\r\nM",
      "created_at": "2005-06-20T18:03:53.000Z"
    },
    {
      "author": "Grey Hodge",
      "body": "Wow, your dad is one hell of a carpenter. Good job wrangling the folks into working for you! Woo!",
      "created_at": "2005-06-20T20:16:23.000Z"
    },
    {
      "author": "Caleb",
      "body": "I must say, it looks like you guys are getting so close! Keep up the great work. And for the love of Benzo, don't open on July 22!! (Or you will miss the presence of myself, Nicki J, Erin, and my girlfriend Stephanie)",
      "created_at": "2005-06-21T04:43:38.000Z"
    }
  ]
}
