{
  "id": 30,
  "title": "More vents and concrete and stuff",
  "body": "A pitted, bumpy, sloped floor is not ideal when it comes time to lay vinyl. Hell, it's not even ideal for cassette tapes! *rim shot* Here's how we went about leveling the floor, with some HVAC pictures thrown in for good measure.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/071005/cement1.jpg\" width=\"425\" /><br/><br/>The biggest dip was in the concession area... but enough about my dad! Ha ha ha! I kill me. Here's old man Dan \"floating\" a massive amount of concrete in the Cinebar area. Thanks to his handy work, the only person who will have frequent falls in the Cinebar will be me.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/071005/cement2.jpg\" width=\"425\" /><br/><br/>More floating.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/071005/cement3.jpg\" width=\"425\" /><br/><br/>Here's a couple examples of my handy work. This was a hole I filled near the lady's restroom.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/071005/cement4.jpg\" width=\"425\" /><br/><br/>This was another hole I filled in the doorway of the projection booth. There were many more examples, but I don't want to bore you.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/071005/hvac1.jpg\" width=\"425\" /><br/><br/>No, that's not an attacking tripod from <i>War of the Worlds</i> - it's a massive heap of HVAC. Somewhere in that tangled mess of duct and insulation... lies a... heart... of... I forgot what I was going to say.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/071005/hvac2.jpg\" width=\"425\" /><br/><br/>Hey! Check it out! It's the exhaust vent for the projection booth. Could these pictures get any more exciting?!<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/071005/hvac3.jpg\" width=\"425\" /><br/><br/>This is the giant exhaust hole for the giant heat exchanger that sits atop the giant lady's restroom. It's just big enough to hold three adolescent boys and a buffalo nickel. Anybody catch the reference???<br/><br/>That blurry bit in the lower left corner is the arm of the <a href=\"http://images.google.com/images?q=michelin%20man\" target=\"_blank\">Michelin Man</a>. He happened to be running by just as I snapped this picture.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/071005/hvac4.jpg\" width=\"425\" /><br/><br/>This is the intake hole. The end.",
  "author_id": 1,
  "photographer": "Dan",
  "created_at": "2005-07-11T07:00:39.000Z",
  "author": "Dan",
  "comments": []
}
