{
  "id": 34,
  "title": "Paint is not spelled P-R-A-I-N-T",
  "body": "This phlog was made to prove that my <a href=\"/posts/209\">magnetic paint theory</a> really works. Check it...\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/082005/paint1.jpg\" width=\"425\" />\r\n\r\nThe grayish blob on the back wall is magnetic paint. The white circle just above the arch is a magnet. The floating orbs are photographic manifestations of a Native American tribe that lived nearby... most likely Kickapoo.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/082005/paint2.jpg\" width=\"425\" />\r\n\r\nAs you can see, we painted two big sections with the magnetic paint. I'm going to be throwing crazy magnets ALL OVER THE PLACE!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/082005/paint3.jpg\" width=\"425\" />\r\n\r\nThere you go... free advertising for Fitz's soda in St. Louis, Missouri. Thanks for the magnet Fitz's! And before you ask, the wall itself isn't magnetic... it has bits of iron in it so that magnets will stick TOOOOOOOOOO it. It won't pull the watch off your wrist or magically unhook your bra, so stop insisting otherwise!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/082005/paint4.jpg\" width=\"425\" />\r\n\r\nAfter applying the magnetic paint, we then painted over it with regular paint. Coincidentally, the color we chose for the Cinebar looks a lot like the color of the magnetic paint. Now everyone thinks the entire wall is magnetic, so they keep throwing their bra at it. Seriously. Cut it out!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/082005/paint5.jpg\" width=\"425\" />\r\n\r\nThis photo doesn't really fit in, but I thought it was funny. Is she dancing or threatening me with kung-fu? We'll never know.",
  "author_id": 1,
  "photographer": "Dan",
  "created_at": "2005-08-22T07:53:41.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nicole",
      "body": "I'm shooing you away. ",
      "created_at": "2005-08-22T18:16:45.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Wax on, wax off.",
      "created_at": "2005-08-22T19:48:56.000Z"
    },
    {
      "author": "Marie Robinson",
      "body": "where did you get the magnetic paint? I can not find it anywhere!!!",
      "created_at": "2006-04-16T01:18:16.000Z"
    }
  ]
}
