{
  "id": 35,
  "title": "Screen this!",
  "body": "If there's one thing that represents the core of our business, it's my dashing good looks. Having a nice screen ranks pretty high too. Here's how our beautiful screen came to be...\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/082005/screen1.jpg\" width=\"425\" />\r\n\r\nFirst, the screen frame was attached to the wall and bolted to the ground.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/082005/screen2.jpg\" width=\"425\" />\r\n\r\nThen foam was inserted around the center speaker to make sure all of the noise heads towards the seats instead the street.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/082005/screen3.jpg\" width=\"425\" />\r\n\r\nThis is how the stork delivered the screen. Isn't she lovely?\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/082005/screen4.jpg\" width=\"425\" />\r\n\r\nThe screen is filled with lots and lots of little holes (also known as \"perforations\"). And yes, it will strain 23 pounds worth of spaghetti.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/082005/screen5.jpg\" width=\"425\" />\r\n\r\nUncle Larry and I carefully unwrapped the screen and used springs to attach it to the frame.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/082005/screen6.jpg\" width=\"425\" />\r\n\r\nEvery so often, the screen manufacturers inserted a giant sheet of anti-static paper. As I was unraveling the screen, one of the giant dryer sheets landed on my head, clung to my hat, and absconded with it. I look like a hatless Roman.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/082005/screen7.jpg\" width=\"425\" />\r\n\r\nOnce the screen was secure, Larry and I went from edge to edge pulling the springs into place.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/082005/screen8.jpg\" width=\"425\" />\r\n\r\nTada! A real movie screen. The only thing I don't like about it is how close it will be to people standing on the stage. I'm incredibly paranoid that someone is going to stand on the stage and accidentally slice the screen up with one of those cool switch blades that are illegal in most states. That would really, REALLY suck.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/082005/screen9.jpg\" width=\"425\" />\r\n\r\nNicole and I covered the screen with twin sheets (2 for $5 at Wal-Mart) so the drop ceiling installers wouldn't accidentally hurt it, but once the digital projector was installed, it was time for the sheets to come down. This picture (and the one following) is of me removing the sheets while the inaugural movie (Shrek) is being played (calibrated) on the screen.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/082005/screen10.jpg\" width=\"425\" />\r\n\r\nI've disappeared into the screen!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/082005/screen11.jpg\" width=\"425\" />\r\n\r\nOnce all the sheets were down, and I was able to regain control of the DVD, I slipped in one of my favorite movies - <i>A Film Showing Nothing But Boobs</i>. Of course, I didn't snap any pictures of A.F.S.N.B.B. - this is a family blog, after all - but I did get a good shot of <i>Star Wars</i>.",
  "author_id": 1,
  "photographer": "Dan & Nicole",
  "created_at": "2005-08-22T08:20:29.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "pretty",
      "created_at": "2005-08-22T09:24:56.000Z"
    },
    {
      "author": "Al",
      "body": "This is almost a real theater!!",
      "created_at": "2005-08-24T18:08:34.000Z"
    }
  ]
}
