{
  "id": 36,
  "title": "This is how the chairs got to where they are today",
  "body": "If you ever find yourself in our theater wondering, \"how were these chairs installed?\" this phlog is just for you.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/082005/chairs1.jpg\" width=\"425\" /><br/><br/>The first task was to clean the floor. Nicole really went to town with the hammer drill and wire brush... so I had to call her and say, \"Hey, I need you back at the theater so you can use the hammer drill and wire brush to get the glue off the floor.\" After I called her, Nicole returned from town and removed the glue with the hammer drill and wire brush.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/082005/chairs2.jpg\" width=\"425\" /><br/><br/>Once all the little bits of glue were swept up and eaten, I swooped down with my mop of sweet, sweet floor sealant.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/082005/chairs3.jpg\" width=\"425\" /><br/><br/>Look at that floor shine! Go ahead... LOOK AT IT!<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/082005/chairs4.jpg\" width=\"425\" /><br/><br/>This photo is supposed to be rotated 90 degrees clockwise, but I'm too lazy to go back and change it. If the photo were right side up, I'd probably say something about how good my arm looks or make a comment about a rack of beef, but since it's rotated the wrong way I'll just pretend like it's a picture of me falling down a big hole onto a row of chairs.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/082005/chairs5.jpg\" width=\"425\" /><br/><br/>Here's me and Uncle Jerry bolting down chairs. I think this photo was snapped while I was chasing a fly with a putty knife. Pay particular attention to the two hoses coming out of my butt.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/082005/chairs6.jpg\" width=\"425\" /><br/><br/>This is my cousin Julie testing out the chairs. Apparently she doesn't like them.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/082005/chairs7.jpg\" width=\"425\" /><br/><br/>And there they are, folks! Seventy-five freakin' movie seats... some more comfortable than others, but that's what the Moxie's all about! Uncomfortable seats! Woo hoo!",
  "author_id": 1,
  "photographer": "Nicole & Dan",
  "created_at": "2005-08-22T08:34:44.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Aaron Scott",
      "body": "Oh, good! It looks like you left a few spaces open for my friend Gwyn.",
      "created_at": "2005-08-22T17:38:19.000Z"
    },
    {
      "author": "whittler",
      "body": "You actually look like you knew what you were doing. Maybe someone will see this and commission you to start work on decking out some aeroplanes.",
      "created_at": "2005-08-23T07:27:09.000Z"
    },
    {
      "author": "Kate",
      "body": "Wow, it looks like a real theater and everything.  This is really cool.",
      "created_at": "2005-09-12T01:19:59.000Z"
    }
  ]
}
