{
  "id": 38,
  "title": "The Moxie's on the map",
  "body": "After months and months of waiting, our brand new sign is finally up. Steve Croxton (known as stevie_g on the forums) came by the theater, and stood out in the rain, just so he could document this historic occasion. Thanks Steve!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/041007/2.jpg\" width=\"425\" />\r\n\r\nThe sign arrived on the back of a big truck. This marked the first time I had seen it outside of the shop. It looked even bigger than I had remembered. The weather was calling for rain, but it was just overcast at this point.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/041007/3.jpg\" width=\"425\" />\r\n\r\nHere's the sign up against the building... specifically so you can see how tall it is (8 feet) in relation to the door. It always made me a wee bit nervous when they moved it around on the crane.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/041007/4.jpg\" width=\"425\" />\r\n\r\nUp it goes!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/041007/5.jpg\" width=\"425\" />\r\n\r\nAnd then it just stops... and hangs there.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/041007/6.jpg\" width=\"425\" />\r\n\r\nBefore they could attach it to the wall, they had to manually line it up and mark where they needed to drill. For as big as it is, the sign isn't terribly heavy, so they could push it around quite easily.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/041007/7.jpg\" width=\"425\" />\r\n\r\nHere they are lining it up...\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/041007/8.jpg\" width=\"425\" />\r\n\r\nAnd here I am looking like a twig.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/041007/9.jpg\" width=\"425\" />\r\n\r\nOnce the holes were marked, they pulled the sign away from the wall, and the guys moved in with there drills. This was just about the time when it started to rain. The sign looked pretty cool just hanging in the air; twirling in the wind.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/041007/10.jpg\" width=\"425\" />\r\n\r\nGettin' drilled.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/041007/11.jpg\" width=\"425\" />\r\n\r\nFast forward an hour: the rain let up, they managed to wire the sign without electrocuting themselves, and it was lit up for the first time.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/041007/12.jpg\" width=\"425\" />\r\n\r\nHere's some of our staff oogling the finished product.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/041007/13.jpg\" width=\"425\" />\r\n\r\nAnd there it is... finally! It looks really cool at night, but pictures don't quite do it justice. You'll just have to drive by and see it for yourself.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/041007/14.jpg\" width=\"425\" />\r\n\r\nAnd here I am... showing off a pair of the world's largest eye bags... but proud. Mighty proud.",
  "author_id": 1,
  "photographer": "Steve Croxton",
  "created_at": "2007-04-11T01:40:41.000Z",
  "author": "Dan",
  "comments": []
}
