{
  "id": 40,
  "title": "The march of progress",
  "body": "It's a been awhile since our last progress update, so here's the latest round of photos from loyal Moxie Photog, Mr. Steve Croxton.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/072508/1.jpg\" width=\"425\" />\r\n\r\nThis is the trenched-out area where the bathrooms will be — girls on the right, boys on the left... three holes each!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/072508/2.jpg\" width=\"425\" />\r\n\r\nThis photo, and the one above, were taken much earlier than the rest (as you'll soon see). The framed-in wall in the background divides our space from the business next door. The bathroom pipes are sticking up in the foreground to the left, and the guys in the background are standing in the trench around the new Cinebar.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/072508/bathroom1.jpg\" width=\"425\" />\r\n\r\nHere's the bathroom after the trench has been filled and smoothed, and the auditorium roughed-in... this is what it looked like last week.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/072508/bathroom2.jpg\" width=\"425\" />\r\n\r\nAnd here's what it looks like now, from a similar angle. The bathroom wall and columns make a natural cubby where we'll build a standing bar for popcorn seasonings, etc., as well as have room for some table and chairs or a long bench.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/072508/bathroom3.jpg\" width=\"425\" />\r\n\r\nAnother shot of the bathroom from last week...\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/072508/bathroom4.jpg\" width=\"425\" />\r\n\r\n... and here's what it looks like now. We'll have a water fountain on the wall that separates the restroom doors (guys to the right, gals to the left).\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/072508/cinebar1.jpg\" width=\"425\" />\r\n\r\nThis is a view of where the new Cinebar will be, if you were standing in the open lobby area in front of the restrooms. There appear to be a couple handsome fellows in the background... let's move a bit closer.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/072508/cinebar2.jpg\" width=\"425\" />\r\n\r\nThe framed wall in the background is two distinct rooms. The one on the left will be the storage / mop closet, while the one on the right (beneath the stair well) is a tiny office. The handsome figures seem to be sharing the same male pattern baldness (well, the one on the left is, the one on the right just has a big scar on the back of his or her head).\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/072508/cinebar3.jpg\" width=\"425\" />\r\n\r\nHere's another shot from the same angle. The walls to the storage room and office have been sheetrocked, and the Cinebar will take up all the space in front of them.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/072508/cinebar4.jpg\" width=\"425\" />\r\n\r\nAh ha! Those handsome figures were none other than my dad and I... and Nicole has appeared from thin air! I'm recounting how many beers I drank before lunch, while Nicole stares on in thirsty lust toward my dad's giant cup of iced tea.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/072508/big1.jpg\" width=\"425\" />\r\n\r\nHere we are in the auditorium(s). This is a little confusing, mainly because the projection booth hasn't been built yet, but what you're seeing here will be the larger of the two auditoriums. The screen will take up most of the wall in this shot. The pipes on the ceiling have to be elevated another foot or so, which is what's holding up the progress in here.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/072508/big2.jpg\" width=\"425\" />\r\n\r\nThis is the screen wall, with the exit door into the hallway. The large theater will have an identical layout to our current one — aisle on the right, enter in the back, exit up front.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/072508/big3.jpg\" width=\"425\" />\r\n\r\nThis is the large auditorium's exit door, but we're looking INTO the theater in this shot.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/072508/small1.jpg\" width=\"425\" />\r\n\r\nHere we are in the small auditorium. Its aisle will be on the left, but the entrance is still in the back (that's what she said) with the exit up front.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/072508/small2.jpg\" width=\"425\" />\r\n\r\nThis is the exit door to the small auditorium, looking INTO the theater. There's actually a little cubicle here to help block light and sound from entering the theater if people leave during a movie.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/072508/small3.jpg\" width=\"425\" />\r\n\r\nAnd again... the exit door... leading out into the lobby.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/072508/hall1.jpg\" width=\"425\" />\r\n\r\nThis is the view up the theater hallway towards the back door.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/072508/hall2.jpg\" width=\"425\" />\r\n\r\nHere we are back inside the auditoriums looking at what will be the entrance to both theaters. That hole in the wall leads to the hallway, so when you enter it, you'll either go right into the big theater or left into the small one. Think of it like the entrance into all the theaters at Springfield 8, only you end up in different auditoriums depending on which door you choose.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/072508/hall3.jpg\" width=\"425\" />\r\n\r\nAnother view down the hallway, but this time towards the lobby.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/072508/back.jpg\" width=\"425\" />\r\n\r\nAnd, finally, here's a shot from our spectacular FREE parking lot, which is at your disposal whenever you come see a movie.\r\n\r\nOk, that's it. More to come!",
  "author_id": 1,
  "photographer": "Steve Croxton",
  "created_at": "2008-07-26T06:30:38.000Z",
  "author": "Dan",
  "comments": []
}
