{
  "id": 5,
  "title": "Demolition begins",
  "body": "<img src=\"http://moxie.danchilton.com/pix/phlog/95_pic7rz.jpg\" />\r\n\r\nAs you can see, the demolition is well on it's way. The wall that used to divide the back area from what is going to be the auditorium is now gone. Our concession area will begin where the demolition stopped.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/96_pic0tw.jpg\" />\r\n\r\nHere's me giving a tour to Nicole's parents. We're standing in what's going to be a very narrow, anxiety-inducing hallway from the front door to the concession area.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/97_pic2rw.jpg\" />\r\n\r\nHere's some wood.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/98_pic7kk.jpg\" />\r\n\r\nHere's me performing yet another sobriety check before attempting to cross the nail-ridden debris.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/99_pic8go.jpg\" />\r\n\r\nThe small bathroom has had a wall removed to make it handicap accessible. Once that's complete, we'll have two humongous restrooms.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/100_pic5nu.jpg\" />\r\n\r\nHere's a close-up view of where the demolition came to a stop. I think I'm going to have the contractor bring the bottom part of the wall back a little further so we can have a direct view of the side door from the concession area.\r\n\r\nSome other points of interest in this picture: the door in the foreground is going to be sealed off and blended in with the wall. The pass-through with the green formica is where we'll sell tickets on busy nights, and the door behind the pass-through will remain as the only access into the concession / box office area.",
  "author_id": 1,
  "photographer": "Nicole",
  "created_at": "2005-01-07T09:08:17.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "Look! You can make water while turning the light switch on and off.",
      "created_at": "2005-01-07T10:40:22.000Z"
    },
    {
      "author": "einahpets",
      "body": "My mom looks HOT.",
      "created_at": "2005-01-07T18:31:06.000Z"
    }
  ]
}
