{
  "id": 6,
  "title": "Ch.. ch.. ch.. chair",
  "body": "Yes, it's true. We've decided to use standard theater seating instead of sofas and chairs. I'll explain in a future post, but for right now, here's what you need to know: these chairs were salvaged from an old theater in Flagstaff, Arizona. I think they hail from the 50s or later. They're fairly small, but in great condition. They're made out of aluminum, and sit quite near to the ground, which is good in a level floor auditorium. The guy we're buying them from has 1,400 of them stored in a warehouse in Springfield. He looks just like Jon Voight and he's awesome, but more on that later. Here's what the chairs will look like:\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/88_pic1cb.jpg\" />\r\n\r\nNotice the condition these chairs are in. Everything's 100% original.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/89_pic1lv.jpg\" />\r\n\r\nA lot of them have seat numbers on the front, but they'll peel off with little difficulty.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/90_pic2of.jpg\" />\r\n\r\nHere's a nice shot of the backside. No dents, no mars, no gum, no nothing! These chairs are SWEET!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/91_pic9jg.jpg\" />\r\n\r\nThe bottom of the seat is roughly five inches of nice plush foam. The upholstery is a redish / orangish affair that will look great in our dark auditorium.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/92_pic1tj.jpg\" />\r\n\r\nHere's an action shot of a typical customer watching a thriller... with a dog.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/93_pic0sx.jpg\" />\r\n\r\nHere's an action shot of a typical customer watching a comedy... with a dog.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/94_pic0lt.jpg\" />\r\n\r\nHere's an action shot of a typical customer watching a drama... with a dog.",
  "author_id": 1,
  "photographer": "Nicole",
  "created_at": "2005-01-07T09:38:22.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Stephanie",
      "body": "Wow...if I can bring Donegal and Wicklow I'll order my plane tickets now!  Oh, and I should reserve my Moxie tickets, as well...what's the first movie going to be?\r\nWait...who cares?  The dogs will watch anything.",
      "created_at": "2005-01-07T10:34:48.000Z"
    },
    {
      "author": "justin",
      "body": "JOHN VOIGHT IS HOT LIKE FIRE!",
      "created_at": "2005-01-07T10:38:18.000Z"
    },
    {
      "author": "einahpets",
      "body": "I love Bogey.",
      "created_at": "2005-01-07T18:30:27.000Z"
    },
    {
      "author": "Aaron",
      "body": "Ooo, here's a pretty important question: what's the cuddle factor of these seats? Can I put an arm around the person next to me without half of my body falling asleep? Maybe you can just stick your church pew in the back for the frisky kids.",
      "created_at": "2005-01-07T18:32:54.000Z"
    },
    {
      "author": "Aaron",
      "body": "Wait, wait, wait—I didn't even think about how sacreligious that might be (but maybe that would make it hottt)...",
      "created_at": "2005-01-07T18:33:43.000Z"
    },
    {
      "author": "Oz",
      "body": "What?  No sofas!  No arm chairs!  I have to admit, I'm disappointed.",
      "created_at": "2005-01-07T18:46:44.000Z"
    },
    {
      "author": "Dave",
      "body": "what would be pretty funny is if you put wheels on them and slanted the theater floor. then everyone would just roll down to the front under screen and get bunched up there.",
      "created_at": "2005-01-07T19:07:13.000Z"
    },
    {
      "author": "Jimmy",
      "body": "I think they absolutely look great.  Hasn't the, um, average butt gotten significantly wider since the 1950s, though?",
      "created_at": "2005-01-07T19:36:28.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Yeah.  Dan and Nicole are too skinny!\r\n\r\nActually, Dan, the chairs look fantastic!",
      "created_at": "2005-01-07T20:48:54.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "In my hometown, the community theatre holds its shows in a very old building with very old seats. In the warmer months, the red seats tend to bleed onto light colored clothing with just a bit of body heat and perspiration.\r\n\r\nHave you checked if these spiffy seats are colorfast?",
      "created_at": "2005-01-08T01:00:23.000Z"
    },
    {
      "author": "Fyse",
      "body": "I've gotta agree with Jimmy's point. Is the Moxie gonna have trouble accomodating larger film-goers in these chairs?",
      "created_at": "2005-01-08T06:42:01.000Z"
    },
    {
      "author": "justin",
      "body": "Fat people shouldn't be allowed to see movies.  Although, they'll probably spend more at the Cine Bar.  Did I say that out loud?",
      "created_at": "2005-01-09T23:10:32.000Z"
    },
    {
      "author": "Nicholas",
      "body": "Dan, if you can fit 1400 seats into the Moxie I'll pee myself and record it for all to see. speaking of recordings, if you have the footage from the interview I'll gladly digitize it for you and encode in RM, QT, WM, or whatever you need...",
      "created_at": "2005-01-11T06:47:31.000Z"
    },
    {
      "author": "Trinity",
      "body": "Why peel off the numbers?  It gives the chairs Moxie.  Maybe I can incorporate a moxie joke into every comment.",
      "created_at": "2005-01-12T02:53:05.000Z"
    },
    {
      "author": "qds@yahoo.com",
      "body": "Very interesting. Mike",
      "created_at": "2006-06-17T16:34:03.000Z"
    }
  ]
}
