{
  "id": 7,
  "title": "Dan sings for his supper... er, breakfast",
  "body": "Another boring set of pictures of me talking into a camera. What I won't do for publicity! The following photos were taken during at our 7:30 AM interview last Tuesday.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/80_pic1bv.jpg\" /><br/><br/>This is the last time you'll see me with my hands in my pockets.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/81_pic7yo.jpg\" /><br/><br/>This is strange, because for every picture after this one my hands are clasped gently in front of my crotch. Yet, when you watch the video, you'll see my arms flailing violently in all directions. I'm a fluent gesticulator.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/82_pic6fp.jpg\" /><br/><br/>I'm hitting a C note here. Just warming up really.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/83_pic1ds.jpg\" /><br/><br/>This is the face I make when someone tells me I can't sing.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/84_pic9wx.jpg\" /><br/><br/>Here's a picture of the reporter and I holding hands as we tiptoe through the debris. Nicole was livid!<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/85_pic6tc.jpg\" /><br/><br/>There's no getting around it... everyone's gotta see the bank vault.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/86_pic6ns.jpg\" /><br/><br/>This picture was taken the morning after the interview when we had to be at the theater at 5:30 in the AM. I'm sleeping with my eyes open.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/87_pic2qd.jpg\" /><br/><br/>During the live feed, Rachel (the reporter) sat down in our sample chair and it tipped over. She caught herself just in the nick of time, but it's still pretty funny.",
  "author_id": 1,
  "photographer": "Nicole",
  "created_at": "2005-01-15T01:08:46.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Aaron",
      "body": "You still haven't unpacked your clothes, have you?",
      "created_at": "2005-01-15T05:29:55.000Z"
    },
    {
      "author": "bjork24",
      "body": "No, we haven't, but if you look closely you'll notice that I'm wearing a different shirt on each subsequent day. The jacket never changes. It's sewn on to my neck.",
      "created_at": "2005-01-15T05:34:27.000Z"
    }
  ]
}
