{
  "id": 8,
  "title": "The COMING SOON sign",
  "body": "The story begins at 4:00 PM on a sunny Thursday afternoon. Don't let the sun fool you - it was freezing outside!<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/66_pic6nt.jpg\" /><br/><br/>Here's the happy papa holding up our brand new vinyl sign. Isn't it adorable?!!<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/67_pic7sa.jpg\" /><br/><br/>The first step was to lay the sign out and admire it from above.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/68_pic4ji.jpg\" /><br/><br/><i>They will see us waving from such great heights</i><br/><i>Come down now, they'll say</i><br/><i>But everything looks perfect from far away</i><br/><i>Come down now, but we'll stay</i><br/><br/>Those lyrics have nothing to do with this shot, but I kinda look constipated when I think, don't I? Actually, this photo was snapped at the exact moment that I realized our sign was too big to hang on the pre-drilled hooks.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/69_pic3fn.jpg\" /><br/><br/>This is the sign hanging from its ill-fated position. I was so mad when I found out that it wouldn't fit... I don't even want to talk about it.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/70_pic1gq.jpg\" /><br/><br/>LOOK OUT! Here comes mad Dan storming through the door!!! A little skater punk walked by and flipped me off right after this picture was taken. I shit you not. If I ever see him again, I'm going to break his 7 year-old-body over my knee.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/71_pic9lf.jpg\" /><br/><br/>After an hour worth of cussing and crying, we made a quick trip to Lowe's so I could buy supplies to build a frame for the sign. I bought:<br/><br/>• Two 2x2x8 pieces of treated lumber - $1.59 each<br/>• Eight 3\" eye bolts - $0.52 each<br/>• Parachute rope from the Army Surplus store - $7.99<br/><br/>This is a picture of me lining up the boards before I drill them.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/72_pic4dv.jpg\" /><br/><br/>This is me drilling the 2x2's. No matter how hard I drilled them, they still couldn't tell me the capital of Idaho.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/73_pic0qc.jpg\" /><br/><br/>After the holes were drilled, it was time to insert the eye bolts and tighten them with the world's greatest tool... the VICE GRIP!<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/74_pic1bo.jpg\" /><br/><br/>This looks like the beginning of an American Funniest Home Video clip. BONK!<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/75_pic7uv.jpg\" /><br/><br/>Here's the 2x2's with the eye bolts. Damn, they're hot!<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/76_pic9fj.jpg\" /><br/><br/>I then used the parachute rope to attach the boards to the top and bottom of the sign.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/77_pic8bv.jpg\" /><br/><br/>Here's the finished product. The bottom 2x2 acts as a weight to pull the sign taut. Who's the bad ass NOW, Ty Pennington? Let me tell you who... ME!<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/78_pic1ht.jpg\" /><br/><br/>Here's a nice shot of my butt while I tie the sign to the building.<br/><br/><img src=\"http://moxie.danchilton.com/pix/phlog/79_pic3xx.jpg\" /><br/><br/>And there it is. Isn't it great? I used foam weather stripping on the back of the bottom board to reduce the effect of it bouncing off the nice green marble and/or the aluminum door frame. The bottom board only hangs about 9 feet off the ground, so I won't be surprised if the punk kid who flipped me off comes back and tears it down.<br/><br/>I know what you look like, kiddo, and if I ever get my hands on you... I'll call your mother and break your precious skateboard over my knee!",
  "author_id": 1,
  "photographer": "Nicole",
  "created_at": "2005-01-15T01:26:19.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Aaron",
      "body": "I've never had a logo that big before!<br/><br/>And it's Boise, by the way (God I hope so).",
      "created_at": "2005-01-15T06:21:00.000Z"
    },
    {
      "author": "bjork24",
      "body": "YOU should drill the boards next time.",
      "created_at": "2005-01-15T06:22:27.000Z"
    },
    {
      "author": "Fyse",
      "body": "What does being 'flipped' mean?",
      "created_at": "2005-01-15T08:23:01.000Z"
    },
    {
      "author": "bjork24",
      "body": "Flipping someone off is the same thing as \"flashing the bird\"... or extending one's middle finger and brandishing it. What do you call that in the UK?",
      "created_at": "2005-01-15T12:58:08.000Z"
    },
    {
      "author": "Oz",
      "body": "I love my vice grips too.",
      "created_at": "2005-01-15T21:52:18.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i have a book on 'bird' watching<br/>its rather entertaining...<br/>the punk kid story was quite humorous<br/>hes obviously quite the rebel.. flipping people off for no apparent reason is very hip",
      "created_at": "2005-01-15T23:27:52.000Z"
    },
    {
      "author": "Fyse",
      "body": "I dunno what we'd call it. Maybe that phrase is used here, but I'm too old and out of touch to have heard it.",
      "created_at": "2005-01-16T14:45:41.000Z"
    },
    {
      "author": "mike",
      "body": "I can't wait to see a movie in your theater, Dan. Cool sign. Nice butt shot. <br/><br/>How come you didn't sneak your url on the sign? ",
      "created_at": "2005-01-16T22:05:23.000Z"
    },
    {
      "author": "Laurie",
      "body": "HAHAHAHAHAHAHA!  Oh God, that is TOO FUNNY!  Dan'l, you shoulda been a comedian.  Maybe I should send Josh out to covertly look for the flipper-offer.  Wanna bet he knows him? If so, looks like Josh gets a new board!!<br/><br/>Sidenote..Go down to the square, where the fountian is, and look for the bum sleeping on a bench.  He is actually Mr. Undercover Cop who's job is to bust skateboarders grinding on the concrete THINGIES.  Josh had the pleasure of meeting him once with a couple friends, when they got busted skating there, and OH BOY, did he get a rude awakening. His board got impounded,( yes, impounded, and a ticket to boot) and we actually had to go down to the police station to get it back, as well as watch Josh get a lecture on the illegal aspects of boarding on public property.  He aint been back since. Smart boy!<br/><br/>Oh, and by the way, the sign looks awesome.  Jake drove by and saw it, and thats when he was all...DANIEL STOLE THE PRACTICE SPACE?!?!?!?!<br/><br/>Too damn funny! ",
      "created_at": "2005-01-17T06:57:57.000Z"
    },
    {
      "author": "Mark",
      "body": "In defence of my fellow Brits, I do know what 'flipping the bird' means. It's ussually called 'giving the finger' over here. Fyse man, you need to get more 'with it'. Your ar letting the side down. Word. Peace out.<br/><br/>Mark",
      "created_at": "2005-01-17T19:52:14.000Z"
    },
    {
      "author": "Mark",
      "body": "BTW - Dan: what are your plans for the sign once you open?<br/><br/>Mark",
      "created_at": "2005-01-17T19:53:34.000Z"
    },
    {
      "author": "cr",
      "body": "a masterful awe-inspiring bit of signage the likes of which i've never before seen. and i can tell you, i've seen a-many. <br/><br/>had you been using chewing gum and squirr-el fur to construct the frame you almost would have had a macgyver moment. but don't worry, there's always next time.",
      "created_at": "2005-01-18T12:53:05.000Z"
    },
    {
      "author": "cqwqkc@yahoo.com",
      "body": "Unbelievable! Liam O' Keefe",
      "created_at": "2006-06-16T18:11:31.000Z"
    },
    {
      "author": "phentermine",
      "body": "Good site. Thanks.\n<A href='http://www.phentermine-tut.100freemb.com'>phentermine</A>",
      "created_at": "2006-06-25T22:51:25.000Z"
    }
  ]
}
