{
  "id": 9,
  "title": "Welcome back to the Moxie",
  "body": "Welcome to the Moxie! My name is Dan and I'm going to be your guide for this portion of the tour. Please step inside and pay particular attention to the...\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/40_pic4rx.jpg\" width=\"425\" />\r\n\r\n... wonderful tiled entryway. If you stare at it long enough, you can play Tetris in your mind.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/41_pic9ao.jpg\" width=\"425\" />\r\n\r\nHere's a close-up of the marble that covers a majority of the building's facade and continues inside the entry. It's actually dark green, but the sun and reflection tend to desaturate the color a bit.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/42_pic9mt.jpg\" width=\"425\" />\r\n\r\nHere's our mailbox. Is that aluminum tube siding cool, or what?\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/43_pic4hn.jpg\" width=\"425\" />\r\n\r\nNow, when you enter the building from Walnut, this is the first thing you'll see... a big empty room. It's hard to envision from this picture, but if you can imagine everything from the columns to the wall as chairs, you've got a pretty good idea of what we're aiming for. The aisle will run on the left side of the columns, and the screen will be about where the camera is. The auditorium will extend back to a little ways beyond the furthest window. Everything will be enclosed within a soundproof wall... does that make sense?\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/44_pic8uz.jpg\" width=\"425\" />\r\n\r\nHere's the old drop box safe. If's surrounded by a couple feet of solid concrete, which means it's not going anywhere. It'll be out in the lobby, so we'll probably use it as a place to put \"grabables\" (i.e. Moxie calendars, movie postcards, etc.). Yay for added character!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/45_pic7dq.jpg\" width=\"425\" />\r\n\r\nThis duct work will actually be inside the auditorium. That white PVC pipe that runs between the main duct and the wall is a drain pipe... as in, toliets drain into this pipe. It will be heavily insulated, along with the ceiling, to help minimize any unwanted noise or liquid \"leakage\".\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/46_pic5tf.jpg\" width=\"425\" />\r\n\r\nThis is the Eastern wall. It will be the hallway from the Walnut entrance to the concession / lobby. The woodwork is solid walnut. We're going to patch it up with the wood we tore out of the auditorium space. This entire wall will be painted, so try to picture it without a giant bulletin board shadow right in the middle. Also, the white board that runs the length of the wall - except where it breaks for the once existent bulliten board - will be where we hang the artwork.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/47_pic2sh.jpg\" width=\"425\" />\r\n\r\nThis is the Western wall. We love those windows, but since they fall inside the auditorium, we're going to have to cover them up. What a shame.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/48_pic5bg.jpg\" width=\"425\" />\r\n\r\nHere's a nice shot of the terrazo floor with the WONDERUL carpet adhesive. Once the adhesive is removed, we'll probably end up painting the floors since the terrazo isn't in the best condition.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/49_pic0cc.jpg\" width=\"425\" />\r\n\r\nThis is what the floor would look like if you were a raccoon... or a opossum.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/50_pic7ab.jpg\" width=\"425\" />\r\n\r\nThis is where the concession and box office will be located. Try to envision a cabinet between the partial wall and the Eastern wall. Better yet, here's a rough conceptualization...\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/51_pic9qx.jpg\" width=\"425\" />\r\n\r\nThis will be the FRONT of the Cinebar. As you can see, there are two pass-throughs. The first is so we can see the door that leads to the parking lot (next picture), and the second will be used in case we get REALLY busy and need to form several lines.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/52_pic0is.jpg\" width=\"425\" />\r\n\r\nHere's the view through the first pass-through. The parking lot outside the door belongs to our building, which is a nice feature to have in downtown Springfield.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/53_pic2bi.jpg\" width=\"425\" />\r\n\r\nThis is towards the back of the Cinebar area. I bet you can't guess what used to be here. If you guessed \"a flight of stairs,\" you're wrong. The correct answer is \"a plant.\" \"Opossum\" would also be an acceptable reply.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/54_pic3xv.jpg\" width=\"425\" />\r\n\r\nHey hey! More drain pipes!!!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/55_pic4ml.jpg\" width=\"425\" />\r\n\r\nHere's another view of the two pass-throughs from the back of the Cinebar. The doorway I'm standing in will be the entrance to the concession area.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/56_pic3kj.jpg\" width=\"425\" />\r\n\r\nHere's the handle to the vault, which is located in the back of the Cinebar.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/57_pic6zw.jpg\" width=\"425\" />\r\n\r\nCheck this floor out! It's painted - by whom, I know not - but it sure looks cool! Maybe we can paint the rest of the floor with a similar faux tile look. What do you think?\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/58_pic3bu.jpg\" width=\"425\" />\r\n\r\nThis is what the electrical outlets in the vault look like.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/59_pic7lu.jpg\" width=\"425\" />\r\n\r\nHere's a close-up of one of the outlets. I won't be sticking my tongue in there anytime soon, that's for damn sure!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/60_pic0vt.jpg\" width=\"425\" />\r\n\r\nHere's a nice patch of exposed brick in the vault area. I'll probably beat my head against this section of wall several times throughout the course of our venture.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/61_pic2wt.jpg\" width=\"425\" />\r\n\r\nThis is the newly finished SECOND bathroom. The wall was brought out so it would be flush with the wall of the first bathroom. Now they're both handicap accessible and excessively HUGE!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/62_pic1mw.jpg\" width=\"425\" />\r\n\r\nHere's the inside of the new bathroom. I could park four cars in there. Maybe five, if it's a Japanese model.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/63_pic1qh.jpg\" width=\"425\" />\r\n\r\nThis room, which is parallel to the vault, will be our \"prep\" area. The bathtub will be replace with a three compartment sink and all kinds of other sinks that the health department requires us to have. In the end, we'll probably go bankrupt buying sinks and pipes. Damn pipes.\r\n\r\nCheck out the door in the back. It's kinda cool, because if you try to open it...\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/64_pic4ry.jpg\" width=\"425\" />\r\n\r\n... this is what happens. It adds an air of mystery to what lies within. Luckily, my trusty digital camera is small enough to fit through the hole in the grate.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/phlog/65_pic2xb.jpg\" width=\"425\" />\r\n\r\nHere's what's inside. Pretty disappointing, eh? I was hoping for piles of money or a box with John Goodman's career in it (that's where it went!).\r\n\r\nAnd that about wraps it up for your detailed tour of the Moxie prior to construction. Work should begin in earnest within the next couple weeks, so stay tuned for more!",
  "author_id": 1,
  "photographer": "Dan",
  "created_at": "2005-02-16T12:26:49.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "Those are some rather large bathrooms.  It reminds me of the one in the City Museum, with the 30 foot high cielings.  Where you had to poop in a room larger than the house you grew up in.",
      "created_at": "2005-02-16T20:14:34.000Z"
    },
    {
      "author": "bjork24",
      "body": "Believe it or not, that's the smaller of the two bathrooms.",
      "created_at": "2005-02-16T21:58:24.000Z"
    },
    {
      "author": "einahpets",
      "body": "Whew. You guys have some work cut out! If you need help, I'll fly down and help. I need a break from here.",
      "created_at": "2005-02-16T22:08:29.000Z"
    },
    {
      "author": "bjork24",
      "body": "Sounds like a plan!",
      "created_at": "2005-02-16T22:25:14.000Z"
    },
    {
      "author": "Allison",
      "body": "Ack!  If there's any hope for it, you shouldn't paint a lovely terrazzo floor.  I bet the terrazzo would look really nice in your concession area even if you cover it up in the theatre.  There must be some sort of carpet adhesive solvent that will easily clear up the old glue.  Then you can use Mr. Clean or lighter fluid to get rid of the dirt.  Lighter fluid loosens all kinds of muck.  (I wouldn't be surprised if it also takes up carpet adhesive).",
      "created_at": "2005-02-17T00:24:48.000Z"
    },
    {
      "author": "Lor",
      "body": "I'm amazed by your driving ability if your able to park four cars in that room! Your parallel parking must be amazing!",
      "created_at": "2005-02-17T01:52:38.000Z"
    },
    {
      "author": "Nicholas",
      "body": "i have a friend that works for CAA; Goodman's agent actually sent out an interoffice that said \"despite what you might have heard, John Goodman is not dead.\" i'm not kidding.",
      "created_at": "2005-02-23T05:14:47.000Z"
    },
    {
      "author": "brian of moore",
      "body": "awww... poor john goodman... that was depressing",
      "created_at": "2005-02-24T06:00:34.000Z"
    },
    {
      "author": "zbgv pylrajk",
      "body": "nfgshjrdx fxlnsbq prdzit uwrqhyacg hwrtmac kgqmyc pomty <A href=\"http://www.cldveui.lborgmapk.com\">hueyfpk beplizao</A>",
      "created_at": "2006-06-25T07:24:32.000Z"
    }
  ]
}
