{
  "entries" : [
    {
      "author": "Dan",
      "body": "For all of you who don't feel like commenting... you have no excuse now. You MUST sign this guestbook.",
      "created_at": "2004-06-09T01:28:18.000Z"
    },
    {
      "author": "Chuck",
      "body": "I knew this guy before he was famous. :)",
      "created_at": "2004-06-09T18:33:01.000Z"
    },
    {
      "author": "...?",
      "body": "you links = deck.",
      "created_at": "2004-06-09T19:05:51.000Z"
    },
    {
      "author": "Kameron M. Franklin",
      "body": "Good luck with the theatre. I look forward to reading about your success.",
      "created_at": "2004-06-09T20:03:35.000Z"
    },
    {
      "author": "Mark Jackson",
      "body": "What good Ideas you have. Here in Guelph Ontario we have a cinema with a similar concept. The people who own it have built it up over the years. Today it includes a bookstore, a theatre, a restaurant and a cafe. They have created a theatre going experience that the Multiplexs can't match.",
      "created_at": "2004-06-09T23:54:19.000Z"
    },
    {
      "author": "Luke",
      "body": "I never really have anything to comment, but I'll happily sign this. Great blog - an interesting read - keep it up :p",
      "created_at": "2004-06-10T00:39:05.000Z"
    },
    {
      "author": "Oz",
      "body": "Signing the guestbook like a good little girl...",
      "created_at": "2004-06-10T02:26:19.000Z"
    },
    {
      "author": "Tim",
      "body": "Nice blog!  I'm part of a movie review website, and if you want to trade links, just email me.",
      "created_at": "2004-06-10T07:31:26.000Z"
    },
    {
      "author": "peekayjee",
      "body": "I love this latest form of communication.",
      "created_at": "2004-06-10T19:15:31.000Z"
    },
    {
      "author": "Morag_Ivers",
      "body": "Good thing those bloggy people added you to the Blogs of Note, because this one rocks.\r\n\r\nI recommend you show the Garden State in your theatre",
      "created_at": "2004-06-10T19:33:48.000Z"
    },
    {
      "author": "The Tyger",
      "body": "Dan, had to take a peek at your blog after you left the comment at Life at TJ's Place about the weather where you are being \"creamy\" ... because it describes exactly where I'm living. Bleccch.\r\n\r\nI *love* Eddie Izzard! Rock on!",
      "created_at": "2004-06-11T00:07:55.000Z"
    },
    {
      "author": "Carl",
      "body": "Would love to have something like Cinema 24 in West Virginia, but anything that opens with this idea, we have had three attempts at a tea/coffee house that has failed after 6 months each.  The trick is to get the college and community behind you.  Secondly, I just love it when someone has a dream that they can share with their wife and go for it.  Working together and there is nothing that can not be done.  Remember that you have support way out in Southern West Virginia.",
      "created_at": "2004-06-11T04:08:44.000Z"
    },
    {
      "author": "Will",
      "body": "Awesome blog, Awesome business venture. I hope the movies you play will be chronicled somewhere inter-web-ish, because not every burg is lucky enough to have somebody finding and showing these films.",
      "created_at": "2004-06-11T06:04:21.000Z"
    },
    {
      "author": "Bryan",
      "body": "When you're ready to start franchising, let us know.  Enjoyable reading.",
      "created_at": "2004-06-11T22:29:27.000Z"
    },
    {
      "author": "Mark S",
      "body": "Very interesting. I'm a bit of a film buff, but have never worked behind the scenes so this blog is really enlightening.\r\nI have an art house cinema near where I live in Manchester UK (http://www.cornerhouse.org/) which I couldn't live without. So I hope everything works out for your venture.",
      "created_at": "2004-06-12T02:42:13.000Z"
    },
    {
      "author": "Eric Nash",
      "body": "Hello, Dan, I'm Eric Nash. I see your message. You don't read Chinese, it's ok, I was saying your experiment is a good one. Hope you a success.\r\n\r\nWhat do we live for? to make something happen. And you are almost there.\r\n\r\nFeel free to contact me.",
      "created_at": "2004-06-12T10:00:37.000Z"
    },
    {
      "author": "Kaustav Basu",
      "body": "Its a shame that no one else has signed your guest book. I have recently created my own blog site. When I came across your site I thought it was quite neat. Keep up the good work",
      "created_at": "2004-06-12T19:49:06.000Z"
    },
    {
      "author": "redpolkachaddi",
      "body": "im from india, so everything u write about is very fascinating. though i did filmstudies and have a skeletal knowledge of art films, my country folk still subsist on our own version of hollywood: bollywood. it sucks... and art films are only for the super-elite.",
      "created_at": "2004-06-13T10:40:05.000Z"
    },
    {
      "author": "Dancing Rain Girl",
      "body": "Love your blog. Would like to blog roll you on my site. I too have a new business and its great to see how others are going right along just like myself. Happy Blogging and Aloha from The Big Island of Hawaii!",
      "created_at": "2004-06-13T12:20:46.000Z"
    },
    {
      "author": "Crystal Riley",
      "body": "I am so impressed with the thought put into cinema24. Not just the blog, but the whole project, sounds horribly well thoughtout and planned. If my hunch is correct as to where midwestburg truly is, I can't wait to visit, and have a glass of wine while watching a great movie!",
      "created_at": "2004-06-13T22:43:32.000Z"
    },
    {
      "author": "Jimmy",
      "body": "I'm sooooo enjoying the blog.  Your project is interesting, and the blog is well-written and muy attractive.  Best of luck!",
      "created_at": "2004-06-14T03:07:20.000Z"
    },
    {
      "author": "riawan",
      "body": "Nice and neat blog:D I like the arrangement of your blog, and also the colour! I must say that I wish that I can do it too into my own blog because I'm new on this! Anyway nice to know you...",
      "created_at": "2004-06-15T12:58:44.000Z"
    },
    {
      "author": "Kandes",
      "body": "Just stopping by...saying hi...and all that stuff.  I was just browsing some blog sites and yours is really cute.  Keep up the good work and check mine out.",
      "created_at": "2004-06-15T20:27:28.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "Good looking blog, great content.\r\n\r\nFrom one dreamer to another, good luck on your venture.",
      "created_at": "2004-06-16T06:41:59.000Z"
    },
    {
      "author": "Jennifer Vail",
      "body": "congrats on actually doing this!!\r\ni am an ex-projectionist and miss those days...i think every ex-projectionist thinks they can run a theatre at some point, i wish you lots of luck!!",
      "created_at": "2004-06-16T07:33:41.000Z"
    },
    {
      "author": "Andrew",
      "body": "Good Luck!",
      "created_at": "2004-06-16T23:40:31.000Z"
    },
    {
      "author": "Keith",
      "body": "Hi,\r\n\r\nThis is very interesting.  Thanks for doing this.\r\n\r\nk",
      "created_at": "2004-06-17T16:10:13.000Z"
    },
    {
      "author": "iNfinity",
      "body": "I really like the design of your blog! I was wondering how you made it.... PHP? or did u use something like Blogger?",
      "created_at": "2004-06-18T18:47:49.000Z"
    },
    {
      "author": "Safire11",
      "body": "I LOVE your blog it is awesome Best of luck!",
      "created_at": "2004-06-18T20:17:44.000Z"
    },
    {
      "author": "britny",
      "body": "yea ur seeting is cool",
      "created_at": "2004-06-19T02:16:44.000Z"
    },
    {
      "author": "Village Idiot",
      "body": "Your blog is very interesting. Good job.",
      "created_at": "2004-06-19T04:55:33.000Z"
    },
    {
      "author": "fabian druid  tan",
      "body": "gd luck,great read...",
      "created_at": "2004-06-19T16:08:02.000Z"
    },
    {
      "author": "avid reader",
      "body": "Hey, your blog rocks. Good info, and nice reading.  Good luck.",
      "created_at": "2004-06-20T00:32:51.000Z"
    },
    {
      "author": "anonymous",
      "body": "what a surprise to find that the blog of note i've been meaning to check out for a few days belongs, in fact, to the gentleman (and lady) who i met at the midwestburg film meeting only a few days ago. rest assured, the filmmakers involved (directly across the table from you drinking a grape soda) are as excited about your venture as the two of you. and yes, midwestburg is a tough place to raise funding. we've been trying for a year for our film. i too have a blog, chronicling (sp?) our progress on said film. for anonymity's sake, i'll not post names or links. hopefully the midwestburg soon-to-be film commission email list will propogate soon and i can communicate with you directly. until then, good reading...and thank you for keeping the record of your progress.",
      "created_at": "2004-06-20T07:02:58.000Z"
    },
    {
      "author": "anonymous",
      "body": "by the by, i too used to work for a publishing company. we published the baffled parents series.",
      "created_at": "2004-06-20T07:10:17.000Z"
    },
    {
      "author": "Sarah",
      "body": "hi \r\nblog is cool - very interesting to read  - i like your style of writing you sound like a cool nerd :) ( I mean that in the nicest possible way)\r\nGood luck with everything I hope the midwestburgian people love it - by the way I live in Perth Western Australia I would love to know where the heck midwestburg is!!",
      "created_at": "2004-06-20T11:10:15.000Z"
    },
    {
      "author": "BOB Kimn",
      "body": "Nice blog, keep up the good work.:)",
      "created_at": "2004-06-21T18:04:33.000Z"
    },
    {
      "author": "B.W.",
      "body": "Just started reading and already hooked. I'm dreaming of opening a drive in here in the Midwest and trying to find all the information I need (other than constuction estimates and a site) such as how to broadcast the sound, where to buy the movies and the going rates, pay rates for staffing, etc...all the things I don't know because I'm just a movie lover who wants to switch from medicine to movies! I'll be back!",
      "created_at": "2004-06-21T21:38:19.000Z"
    },
    {
      "author": "kdwcomputing",
      "body": "you are a cinema freak?\r\nMe to \r\nI live in Belgium and i go to the kinepolis in Brussels or in Mechelen \r\nI hope that you sign in my gb?\r\n\r\ngreetz",
      "created_at": "2004-06-24T11:56:44.000Z"
    },
    {
      "author": "Stephanie Bunn",
      "body": "I really enjoy reading your blog...whenever Midwestburg's location is revealed, I may have to make a trip!",
      "created_at": "2004-06-25T00:23:46.000Z"
    },
    {
      "author": "whitty",
      "body": "Holy Crap!  I live in Midwestburg!  I totally randomly happened across your blog and started reading it because I thought \"hey, that's cool, I would like to do the same thing.\"  Then on reading further, I realized that Midwestburg sounds eerily familar, too familar.  Again, Holy Crap, I live in Midwestburg!  I totally forgive you for stealing my idea, because you are actually doing it.  However, if you also stole the uber awesome building I was dreaming of, I might have to kick you in the pants.  Man, this is awesome.  I want to help, can I help, I mean, I will definately go to your movies and buy your moonpies, but do you need someone to haul crap around or scrub things, because I will totally do that too.  Even put up fliers, as I work at \"Midwestburg Private University\" and would have access to a small portion of your patronage.\r\n\r\nMy dream theater was going to be called the Whitmark, run my me and my brother Mark, in the awesome downtown theater that is a sin in its current incarnation as a church.\r\n\r\nAlso, I nearly peed myself when I made the connection.  I am so excited!",
      "created_at": "2004-07-15T02:05:10.000Z"
    },
    {
      "author": "Allison",
      "body": "I just wanted to let you know that I read your blog.  I'm a graduate student right now, but after I finish my degree and find a place that I want to settle down, I'm planning to open and run a semi-professional musical theatre.  I like reading about your experiences so I can know what I have to look forward to.  Thanks!",
      "created_at": "2004-06-26T03:06:43.000Z"
    },
    {
      "author": "Cookie Gurl",
      "body": "Hi Cinema 24 if that is your name! I love your dogs, they are well cute! Go on my web page I have written about COOKIES!!!!\r\nCookie Gurl\r\nPS I am not a creep I just like looking at other people's websites!",
      "created_at": "2004-06-27T21:08:53.000Z"
    },
    {
      "author": "Cookie Gurl again!",
      "body": "I just realised how dumb my comment looks compared to all of the other ones! Sorry for wasting your time! And don't go on my web page you will think it is STUPID! (and it is)\r\nStupid me",
      "created_at": "2004-06-27T21:11:24.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Fascinating reading, always a pleasure. Keep up the great work! (and good luck!)",
      "created_at": "2004-07-01T00:03:57.000Z"
    },
    {
      "author": "Brandon Smith",
      "body": "I absorb the modern style of your writing better than the caffiene in my coffee, and that's saying a lot.  Not only does the topic interest me (entrepreneurship, audio/visual tech, connection to the thinking american world), but even if it didn't, I'd still be hooked like a perch. Your stuff should be published, and I'm not talking online.",
      "created_at": "2004-07-05T08:51:50.000Z"
    },
    {
      "author": "Juls",
      "body": "I think you are funny. I like your blog keep up the good work!-",
      "created_at": "2004-07-07T19:49:56.000Z"
    },
    {
      "author": "tim",
      "body": "whooooa! how did you get your blog to be soo pimp? seriously the template is pretty cool where did you find it?",
      "created_at": "2004-07-09T00:25:05.000Z"
    },
    {
      "author": "Marco Sousa",
      "body": "Excellent Blog, nice wprk indeed! Congratulations []",
      "created_at": "2004-07-09T00:32:11.000Z"
    },
    {
      "author": "Dan",
      "body": "I got the template through MTV's new show \"Pimp My Blog.\"",
      "created_at": "2004-07-09T00:36:02.000Z"
    },
    {
      "author": "Wickwire",
      "body": "You are funny sez I.  That is all.",
      "created_at": "2004-07-10T00:27:51.000Z"
    },
    {
      "author": "Leslie K. Siegel",
      "body": "I used to have the neatest projector collection. One such item was a wonderful 1920's, black projector with a crank, and film feeder. It was so old, but so well preserved. I love the days of early film, they were so fresh, but now so musty. TThanks from LKS",
      "created_at": "2004-07-10T08:59:35.000Z"
    },
    {
      "author": "Mr.T the Messiah",
      "body": "After weeks of not bothering to look at this recommended site on blogger.com, my clicking finger slipped and I accidently landed on your site.  I must say, I am impressed especially by the flash film.  For a site I didn't intend to visit, I am now hooked and will watch your every move.  If you have time, why don't you accidently click on my website.",
      "created_at": "2004-07-11T04:49:40.000Z"
    },
    {
      "author": "mod",
      "body": "never been thot that i'll be telling a blogger that i love their blog since i love my own too much :D no, KIDDING.. but really, what uve been done to ur blog was only making mine awfully ashamed to itself. \r\n\r\noh yes sir, i simply love ur blog....\r\n\r\n:)",
      "created_at": "2004-07-14T01:43:47.000Z"
    },
    {
      "author": "Marvin Beatty",
      "body": "Just browsing - Nice Work!",
      "created_at": "2004-07-18T04:17:49.000Z"
    },
    {
      "author": "JohnnieBlogger",
      "body": "very good job...",
      "created_at": "2004-07-18T22:19:28.000Z"
    },
    {
      "author": "Konstantin Rabinovich",
      "body": "great website! wish i could work in a small theater, sounds like an awesome place. Keep doing what your doing! \r\n\r\nlates :)",
      "created_at": "2004-07-20T09:14:32.000Z"
    },
    {
      "author": "Erika",
      "body": "Nice move, requesting submissions. I'll have to try that if my design doesn't get finished soon.",
      "created_at": "2004-07-24T05:46:55.000Z"
    },
    {
      "author": "Liz",
      "body": "I currently work @ a theater in NY so I hope u guys have great success!!!!!!!!!",
      "created_at": "2004-07-26T08:27:17.000Z"
    },
    {
      "author": "Babble Fish",
      "body": "Awesome Blog..\r\nKeep up the good work!",
      "created_at": "2004-07-26T17:27:58.000Z"
    },
    {
      "author": "Gaychel",
      "body": "Contrary to popular opinion, I do not think you're funny.  Silly, yes.  Funny, eh.  There are only two truly great comedians still alive today.\r\n1) Patrick Duffy\r\n2) John Ritter...oh wait.",
      "created_at": "2004-08-18T09:08:06.000Z"
    },
    {
      "author": "Amy",
      "body": "I miss you, Mr. Pants.",
      "created_at": "2004-08-18T23:39:40.000Z"
    },
    {
      "author": "Shannon",
      "body": "Just wanted to wish you good luck!  It is a dream of mine to one day do what you are doing, so to read about everything you go through is not only interesting, but educational.  That you do so with such wit and vitality is an added bonus.",
      "created_at": "2004-08-19T01:33:51.000Z"
    },
    {
      "author": "Just a visiting wench...",
      "body": "Very nice blog, doing some surfing and dropped in here..glad I did! Must say, I love the quote at \"The Moxie Shop\". The honesty is quite refreshing!\r\n\r\nGreat job, you have done here!",
      "created_at": "2004-09-10T00:06:55.000Z"
    },
    {
      "author": "Sybille Amber",
      "body": "All the best to you and The Moxie.",
      "created_at": "2004-09-13T14:40:50.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "Signing the guestbook again for two reasons. One, re-signing (resigning???) with the redesigning of the site. Two, I don't sign nearly enough guestbooks, and I'm feeling terribly guilty about it. And three, you told me to. Please do not tell me to jump off a bridge.",
      "created_at": "2004-09-23T16:22:27.000Z"
    },
    {
      "author": "caitlin",
      "body": "i am so jealous of what you all are doing, i am already telling everyone about the Moxie!",
      "created_at": "2004-10-04T23:12:41.000Z"
    },
    {
      "author": "Bella",
      "body": "I adore your blog. What's great is that you took a topic that could potentially be mundane (come on, the details can become boring : ) and made it wonderful. Your writing is funny and fast paced. Thanks for keeping me entertained. If you have a second, check out my blog as well, I could use your critique.",
      "created_at": "2004-10-08T09:49:10.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "Signing the guesbook again for TWO reasons. One, I cannot count. Two, I cannot edit. Three... oh, just shoot me.",
      "created_at": "2004-09-23T16:23:50.000Z"
    },
    {
      "author": "Sancho",
      "body": "Love the site! The topic, the design, the witty posts, the live nude Dan.. err.. well you get the idea.",
      "created_at": "2004-10-11T01:57:09.000Z"
    },
    {
      "author": "Eve Sibley",
      "body": "Dear Moxie Family,\r\nI'm so excited to discover like-minded folk trying to attain the same goals! I am also in the process of creating/financing etc. a small arthouse theatre here in Brooklyn, NY, and would love to exchange business plan details/ theatre design information/ etc. Please e-mail me back because I so truly believe that we small business people have to stick together, don't you think? My main obstacle currently is making the business plan as solid and realistic (while still turning a profit) as possible.\r\nAny tips or tricks you could impart would be greatly, greatly appreciated. And I'm glad to reciprocate.\r\n\r\nThank you so much, your site is extremely witty and informative, and best luck in your project.\r\n\r\nSincerely,\r\nEve Sibley\r\nsleve76@aol.com",
      "created_at": "2004-10-14T01:25:17.000Z"
    },
    {
      "author": "Fyse",
      "body": "Just realised I never did get round to signing this. Shocking oversight, and I apologise. Very interesting blog, and with The Moxie rapidly becoming a reality, I've got a feeling there is plenty more to come...",
      "created_at": "2004-10-26T18:12:37.000Z"
    },
    {
      "author": "nathan",
      "body": "holy balls i have been dreaming about this for years. i think it was this week that i was telling my friend that springfield needs an art house theater. good luck and i hope this all comes together. i cant wait!",
      "created_at": "2004-11-18T11:03:49.000Z"
    },
    {
      "author": "film geek",
      "body": "Hey Dan--\r\n\r\nYou stole my idea!  My little brother goes to Mizzou and told me about the Ragtag.  It sounded like a perfect idea for the booming downton progress of Springfield.  Anyway, my dad and I have discussed it and he told me to come up with the research and business plan and we would go from there.  Looks like you beat me to it.  I'm really excited for you and wouldn't mind being one of those college students to serve popcorn for you.  Drop me a line and let me know anyway I can help in the meantime.\r\n\r\nGood luck!",
      "created_at": "2004-11-19T03:59:58.000Z"
    },
    {
      "author": "Jasmine Huda",
      "body": "Trying to get in touch with you re Moxie Cinema...please call [omitted].\r\nJasmine Huda\r\nSpringfield 33 News",
      "created_at": "2004-12-24T02:52:00.000Z"
    },
    {
      "author": "B.W.",
      "body": "Love, Love, Love it. I've been reading since the beginning and hoping you'll invite those of us loyal to your cause to the grand opening.  Or at least a first week showing!! I'll make the drive.",
      "created_at": "2004-12-27T22:45:27.000Z"
    },
    {
      "author": "whittler",
      "body": "Hail there Moxians. You have my best wises in your cinematic endeavours. Alt cinema rocks!",
      "created_at": "2004-12-31T10:10:44.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "I've been reading \"The Moxie Blog\" for quite a while now, but I just realized that I hadn't signed the guestbook yet. My apologies. Anyway, I will continue to read, comment, and support The Moxie, and if at all possible, I will take a road trip to Springfield for the opening.",
      "created_at": "2005-01-16T09:07:44.000Z"
    },
    {
      "author": "Kate",
      "body": "Wow!  I'm so excited about this whole thing!  I walk downtown almost every day, and was I ever surprised to hear about the work going on at your locale.  Was thrilled to see the new banner, and I can't wait for you to open.  If my band played mellower music, I'd offer our services, but we're not exactly the artistic type, . . . anyway, me and the fam will be sure to spend money this summer.  Thanks for doing this.",
      "created_at": "2005-01-20T09:43:26.000Z"
    },
    {
      "author": "Luke",
      "body": "Hey, the site looks great.  Are you guys in need of a projectionist, usher, or any employees by chance?  Just thought I would ask online, seeing as you are probably very busy at the \"construction zone.\" I have plenty of experience, just drop me a line. \r\nlae767s@smsu.edu",
      "created_at": "2005-01-21T03:48:39.000Z"
    },
    {
      "author": "Andy",
      "body": "I'm excited about this, but have zero idea what kind of movies the moxie will be bringing in. That's an important part of the theatere business, you know.",
      "created_at": "2005-01-21T21:22:31.000Z"
    },
    {
      "author": "Levy",
      "body": "Hey Dan,\r\n\r\nLong time reader, first time signer.  Oh yeah, I posted a comment once, too.  I love reading the blog, ever since the \"Quick jab to the celiac plexus, and I'm away! WHISK!\" (June or something).  Good luck getting all open and started, and I hope you find your hat!\r\n\r\nLevy\r\n\r\nP.S. Did you look between the milk and the cold ones? \r\nhttp://homestarrunner.com/hs18.html",
      "created_at": "2005-01-22T14:29:25.000Z"
    },
    {
      "author": "Crystal Nicely",
      "body": "phlogaway",
      "created_at": "2005-01-28T07:18:15.000Z"
    },
    {
      "author": "Tawny",
      "body": "Love the site! I'm so excited for your theatre to open! If there is anything I can do to help, just e-mail me! Best of luck!",
      "created_at": "2005-01-29T02:09:10.000Z"
    },
    {
      "author": "Angela",
      "body": "You rock!",
      "created_at": "2005-01-29T03:20:57.000Z"
    },
    {
      "author": "Jennifer Manning Pierson",
      "body": "Attention Dan and Nicole or whoever deals with the artwork: My husband (Olof Yngvald Pierson) and I (Jenny) are local visual artists EXTREMELY interested in showing 2004-05 paintings at the Moxie. We have returned to the Midwest following about 4 years in South California. I teach Painting/Drawing/Design at SMS and Drury and am in 3 Springfield venues with new paintings. Olof and I are exhibiting a solo show of recent works at College of the Ozarks, but want to introduce our body of recent work to Springfield. The MOXIE would be perfect!! Our work will be ready for show by the end of this month, and new works are in proress continuously. Please contact us so that we may send images of our work in application for a show. THANKS! Jennifer Manning Pierson, 22 East Walnut, Fair Grove, MO 65648, Telephone 417-759-2742, E-mail meringue55@hotmail.com",
      "created_at": "2005-01-30T22:16:08.000Z"
    },
    {
      "author": "Jennifer Manning Pierson",
      "body": "UMM. That's \"progress!\" JM. Pierson",
      "created_at": "2005-01-30T22:22:06.000Z"
    },
    {
      "author": "Lynn",
      "body": "Hey: I'm ready for my bitch Beau Brayfield to give me that blow job he promised me last year!",
      "created_at": "2005-02-07T22:14:24.000Z"
    },
    {
      "author": "Zack Smith",
      "body": "Bravo!!!  I'm glad somebody stepped up to execute this project.  I may be interested in Pay Pal'ing you a donation (thank god for tax returns) for some of your expenses.  I would like to ask a few questions, \"offline\".  Could someone please email me?  I'm dumb and could not find contact info on this blog.\r\n\r\nMany thanks and good luck!!\r\n\r\nZack",
      "created_at": "2005-02-17T08:24:31.000Z"
    },
    {
      "author": "Joe Netzer",
      "body": "So I have been hearing all this talk about you opening this movie theater and have have been scoureing the internet up and down, left and right; Eurka i found it.  I am just stoping by to say Hi and good luck, Later.\r\n\r\nJoe Netzer",
      "created_at": "2005-02-12T02:14:33.000Z"
    },
    {
      "author": "AmyJo",
      "body": "Hi Dan~\r\nMy boyfriend's name is Dan Chilton also, and we've been getting quite a few phone calls, and mail for \"Dan at the Moxie\"  We've returned the mail, and tried to call people back informing them that they have the wrong Dan. If you'd like to pass along a number where you can be reached that we can tell them to call instead, email me, and let me know.\r\nHave a great night!",
      "created_at": "2005-02-21T06:58:39.000Z"
    },
    {
      "author": "Anthony Thompson",
      "body": "Great blog and site!!!\r\n\r\nI am looking at an existing theater here in Minneapolis and find your site to be a great source of information.\r\n\r\nGood luck with your theater!",
      "created_at": "2005-02-22T00:15:09.000Z"
    },
    {
      "author": "Nate",
      "body": "Dan,\r\nIf you would, please contact me via e-mail.  I have yet more media coverage to give you.  It's just a school rag but I promise it won't be too involved.  Most of what I need is on the website, but of course I need to interview you, likely for less than a half hour.  Like you got enough to do.\r\nThat cool?  Look forward to hearing from you.",
      "created_at": "2005-02-24T19:50:09.000Z"
    },
    {
      "author": "Alex",
      "body": "I just found you guys through a link on Make Magazine (http://make.oreilly.com/). I live in Springfield and have long lamented our lack of non-mainstream film. Princess Mononoke was shown here for only a single week, as was Branagh's Hamlet, and even those are Big Movies. I can't wait to come see the place once it's open!",
      "created_at": "2005-03-14T21:52:37.000Z"
    },
    {
      "author": "Pat",
      "body": "I can't wait for The Moxie to open. Plus I have to say that I love what you are doing with your blog. I have a little entrepreneurial project of my own and I have been looking for a good examples of blogs that track a start up venture. Little did I know that I would find one in my own town. Who knew?",
      "created_at": "2005-03-15T03:57:46.000Z"
    },
    {
      "author": "Kirsten",
      "body": "Love your blog!  Watching the Moxie progress has been very interesting and I must say.......entertaining.  I can totally relate on a personal and business level.  Good luck to you and your crew - we can't wait for you to open!\r\n  Kirsten, Stacy, Mike, Quint, Lauren, Emma & Morgan",
      "created_at": "2005-03-16T03:04:25.000Z"
    },
    {
      "author": "Debbie",
      "body": "I'm so excited for you guys AND the community. I know it's scary and a lot of hard work, but it's almost baseball season and ya just gotta have heart.  Have you heard that Flying Tiger just got legal representation from the same firm that signed Blair Witch?  There's some buzz about a TV series, and professional marketers have picked up the film to represent at Cannes!  Hope you guys will run it soon. What a gorgeous view it gives of the Ozarks and we sure want more films made here.  Best of luck!  A Future VERY Loyal Patron!",
      "created_at": "2005-02-26T21:41:41.000Z"
    },
    {
      "author": "peg",
      "body": "Couldn't find a way to contact you other than by signing 'the blog.' Have info about a film I think you'll be interested in showing. Local Springfield musician (Lyal Strickland) has a song in it. Film is a feature called \"Purgatory House\" that was written by and starring a 14-yr. old girl from Ohio. Winner of six film festival awards & has rave reviews! Call Peggy at Community Free Press 447-2130 and let me know where I can forward this info to. LOVE the blog!!! You should compile all of this into a novel someday - naw, even better ... a screenplay. Hang in there, one day you will look back on all of this and laugh. Remember the community is cheering you on - everyone wants you guys to succeed.\r\n\r\n\"Not everything that can be counted, counts. And not everything that counts can be counted.\" – Albert Einstein",
      "created_at": "2005-03-18T01:03:12.000Z"
    },
    {
      "author": "Laurie",
      "body": "Daniel and Nicole...thank you both for your support through this.  Uncle dan and Aunt Sam have helped so much.  I just wanted you both to know that I appreciate everything you have done, and Dana, Bless her heart, the clothes helped so much.  All the thanks in the world would not express how much it means to me.  Please, if you can, be there for the boys.  I dunno how we will get through it, but we will.\r\n\r\nI love you both, and thank you again.\r\n\r\nWith all my Love,\r\nLaurie",
      "created_at": "2005-03-23T06:19:18.000Z"
    },
    {
      "author": "Ryan Wade",
      "body": "I love reading your blog, and I can't wait for the Mozie to open.  Thanks for all your doing.",
      "created_at": "2005-03-26T00:36:53.000Z"
    },
    {
      "author": "Ryan Wade",
      "body": "Moxie....not Mozie.\r\n\r\nsorry",
      "created_at": "2005-03-26T00:38:47.000Z"
    },
    {
      "author": "Sarah Wilson-DeWald",
      "body": "Love the site!! Can't wait to see \"Nine Grounds\" on your screen.. (www.blackmeadow.com if your intersted in showing to soon to be completed, completely local, high quality flick. :) Keep up the great work and of course helping expand the local film community.. Talk soon.. SarahWD",
      "created_at": "2005-04-09T01:55:26.000Z"
    },
    {
      "author": "SarahWD",
      "body": "Hello all Moxie and Movie fans.. to help further encourage the growth of the film community here in Springfield I have decided against my better judgement to go ahead and post this press release here...  keep up the bidding on the cinebar and support the love, passion and art that is film making by helping the moxie reach their goals and open for business.  The Moxie is much needed and highly anticipated.. Thanks again Dan and Nicole for your vision and drive!\r\n\r\n\r\nBLACK MEADOW\r\nPRODUCTIONS\r\nPRESS RELEASE\r\nFor Immediate Release\r\n\r\nWho:  Black Meadow Productions       What: A scene for a local film being shot.\r\nWhere: McDonald Arena, SMSU Campus 901 S. National\r\nWhen: April 24, 2005 3pm - 7pm\r\nMedia Contacts : Keith Moncrief, Sarah Wilson-DeWald or Bryon Blakey\r\n    Phone: 417-832-1670 between 10am - 5pm M-F  \r\nFax :417-866-2888\r\nEmail: Black@blackmeadow.com   (elysium55@yahoo.com)\r\nWebsite: www.BlackMeadow.com\r\nLocal Filmmakers call for extras!\r\nThe award winning filmmakers of Black Meadow Productions needs \r\npeople for a scene in their next feature.\r\n\r\n Black Meadow Productions would like to announce that they are in need of extras for their latest feature called “Nine Grounds”. \r\n The scene which is to be shot at McDonald Arena on the SMSU Campus will be filmed on April 24th from 3pm to 7pm.\r\n If you are interested in appearing in the film, please contact Black Meadow Productions by phone at (417) 832-1670 from 10am to 5pm Monday through Friday or online at www.Blackmeadow.com before 5pm April 23rd.\r\n There will be door prizes given out during the shoot. \r\n Nine Grounds is an action/drama about a father’s search for his kidnapped son.\r\n Black Meadow productions won multiple awards for their first feature “ Crime Family” at the 2004 Cinemerge Video festival. \r\n Copies of “Crime Family” can be purchased locally at CD Warehouse, Best Buy, Circuit City, Barnes & Noble, and online at Amazon dot com.\r\n\r\nAttention Members of the Media: If you would like to attend this event please contact us by Friday April 22nd and we will make members of the cast available to you for interviews",
      "created_at": "2005-04-11T11:04:11.000Z"
    },
    {
      "author": "Jed",
      "body": "This is going to be a kick ass project by a kick ass pair of people. Oh and I will do whatever I can to help out whenever I can. This includes but not limited to: killing, self sacrifice, funding, fundraising, pimping myself out, anorexia, piming out my mother, reading a book, abstinence (maybe not), Fear Factor and punching baboons at the zoo. I fucking hate baboons. Give me a call if you need anything. Well I'll talk to you later, ass.",
      "created_at": "2005-04-12T03:59:10.000Z"
    },
    {
      "author": "OUTLAND",
      "body": "All at The Outland are looking forward to your opening. We'll spread the word. V cool.",
      "created_at": "2005-04-14T21:33:26.000Z"
    },
    {
      "author": "GO Magazine",
      "body": "From one new endeavor to another, GO Magazine can't wait for the Moxie to open! When local multiplexes have two screens of Deuce Bigalow but no Broken Flowers, there's a problem. You guys are doing a great job and GO is looking forward to a great working/moviegoing relationship.\r\n\r\nMatt Lemmon, editor",
      "created_at": "2005-08-18T18:28:52.000Z"
    },
    {
      "author": "Deb Larson",
      "body": "Cool site.  Hey, keep your chin up and it'll happen soon!\r\nCan't wait!",
      "created_at": "2005-07-05T20:19:47.000Z"
    },
    {
      "author": "Mike Strain Jr.",
      "body": "Dan & Nichole, Keep up the good work & I raise a glass for the future! Congrats you two!  Mike Strain Jr.\r\n Cinemerge Film & Video Festival\r\n        Oaktree Studios Motion Picture Productions\r\n              Fantasy Creations FX  Special make-up effects",
      "created_at": "2005-05-11T22:12:50.000Z"
    },
    {
      "author": "Adam Celing",
      "body": "I have just stumbled across your blog after my initial research into starting a small theatre of my own. I think it is a great resource and I can't tell you how entertaining I find your entries. I'm a graphic designer by trade, but in my heart and head I'm a theatre owner and movie lover. Your progress is insightful and inspiring for me to continue with my theatre plans. And as you eluded to in your recent post, making your blog entries into a book when all is said and done would be a sweet finish to your trials and tribulations. I for one would buy it. Anyway keep up the good work and keep posting, I need a good place to refer to when I get further in my plans. Excellent work.",
      "created_at": "2005-05-26T01:28:02.000Z"
    },
    {
      "author": "Adam Celing",
      "body": "And since I threw out there that I do design work, I would like to offer my services in any way I can on that level to help you guys get off the ground. \r\nI can't resist the urge to help a kindred spirit. Plus I like the way you are taking the look of the identity. Sometimes all a dreams realization takes is a little MOXIE. Oh that was bad. Anyway keep it up.",
      "created_at": "2005-05-26T02:08:40.000Z"
    },
    {
      "author": "Steve Croxton",
      "body": "Since I've been a reading the blog, contributing a random comment on occasion, bought a T-shirt and even shook Dan's hand, I better sign the guestbook. Keep pushin` Danno!",
      "created_at": "2005-05-27T20:26:23.000Z"
    },
    {
      "author": "laurie",
      "body": "Daniel...I don't know what to say.  I had no idea that Shade had passed on, but I have a clue why it was hidden from me.  This explains why dad called me after 10 pm on a friday night.  I know how much a part of your life he was, as well as your sister and parents.  ( keeping identities quiet, as per your wishes).  \r\n\r\nLoss is great, and the grieving process vast, yet all we can do is love that is lost, pray for our loved one, and hope, na expect, that they are in a greater place than you and I.  Tis what I wish, hope for, and desperately cling to each and every day.\r\n\r\nGod bless you in your acceptance in Shade's transition from flesh to spirit.  He is well kept in the arms of The Higher Power whom has now taken Shade into a world without pain, nor suffuring, and is now chasing those darned squirrels...this time catching each and every one.\r\n\r\nHe is safe now, without pain, rest assured, Dan'l.  \r\n\r\nLet Shade reveal in the light this day.\r\n\r\nAll my love,\r\n\r\nYour cousin,\r\n\r\nLaurie",
      "created_at": "2005-07-02T07:41:37.000Z"
    },
    {
      "author": "Patrick in NC",
      "body": "I'm not sure why, but this site fascinates me. A love-child of This Old House and a small business course at a local college, with great dry humor and all wrapped around the promise (you do promise, don't you?) of movies someday. \r\n\r\nPlease keep the blog going even after you've opened, and write a book about the whole thing one day. I'll be there one day to visit my donated first-aid kit. \r\n\r\nAnyone reading this, if you've come this far give these people some money for Pete's sake.",
      "created_at": "2005-06-16T03:18:52.000Z"
    },
    {
      "author": "Missouri Film Alliance of Springfield",
      "body": "Dan and Nicole, we are so glad to have you two as founding members. \r\nWe are looking forward to a great Festival next March with\r\nThe premier of The “Show Me” MISSOURI Film Festival”\r\nSponsored by The Missouri Film Alliance of Springfield. This annual event will feature independent films from around the USA and the World, with a strong focus on the many talented filmmakers from Missouri. There will be fun for the whole family with a special portion set-aside for kids from grade school to high school. There will be programs designed to educate and inspire young filmmakers.\r\n\r\nAll the Members Of MFAS Welcome You!",
      "created_at": "2005-06-20T17:47:04.000Z"
    },
    {
      "author": "BenRod",
      "body": "Dan, you should check out cafepress.com for your T-shirts, etc.  You may like their setup.  I use them on my website to sell shirts and stuff, and it works out really well, because they make them as you order them. plus, you can still order them in bulk for special events, and you get 35% off bulk orders.  Not to mention you can still use the online coupons on bulk orders.\r\n\r\nPlus, you can use PHP to alter the store and put it on your site.  check it out on my site: <a href=http://www.porchclub.org/forum/store.php> here.</a>",
      "created_at": "2005-07-08T08:57:36.000Z"
    },
    {
      "author": "Mark",
      "body": "Thanks for the great site i really enjoied it !!\r\nI have bookmarked your site, and will be back often.",
      "created_at": "2005-07-09T06:26:12.000Z"
    },
    {
      "author": "TomG",
      "body": "Thanks for the tour.  The next time I make it to town I will be there with a box of popcorn and watching a movie.  See you then.",
      "created_at": "2005-07-25T22:48:21.000Z"
    },
    {
      "author": "Rustam",
      "body": "So good! And super idea!",
      "created_at": "2005-08-18T23:58:14.000Z"
    },
    {
      "author": "Thomas Umphres",
      "body": "You should show the amazingly brillian \"Songs from the Second Floor\".\r\n\r\nI'm really excited about your theater.  Great job.",
      "created_at": "2005-09-23T08:15:55.000Z"
    },
    {
      "author": "April",
      "body": "As a native Springfieldian, let me just say that I never thought I'd see the day that we'd have an independent movie theater in our community.  Thank you so much for providing some higher culture and excitement to my hometown!  For nearly two-thirds of my life, I've been watching and waiting with baited breath as the older sections of Springfield have been slowly but surely improving.  My hat is off to you and your wife for being a part of that improvement.  My husband and I are sooo very excited about becoming \"regulars\" at your fine establishment; in fact, we plan on coming to both movies showing today! See you there...",
      "created_at": "2005-09-29T19:54:13.000Z"
    },
    {
      "author": "Jeff P",
      "body": "Dan:\r\n\r\nyou mentioned:\r\n\"of smaller, lesser-known films that have traditionally been unattainable\"\r\nDo you mean independent film ?\r\nSince you have only a month remaining, I would seriously consider a more direct webpage that's specific to your business model and continue using the blog as a sub-site. Perhaps you want to focus more on the \"vision\" then snaps of you painting.\r\n\r\nI can help you in the internet promotional area if you want. My company specializes in e-promotion and client - vendor management for small companies. \r\n\r\nGood Luck\r\nJeff P",
      "created_at": "2005-07-25T18:43:31.000Z"
    },
    {
      "author": "Derek the local college student",
      "body": "I fully intend to bring huge groups of friends/dates/campus functions/whatever to movies at your theatre. The anticipation is running very high, so please don't die or anything like that.",
      "created_at": "2005-07-09T21:35:47.000Z"
    },
    {
      "author": "Michelle",
      "body": "hey--left a message on the blog but thought this would be better--\r\n\r\nthanks for doing this dan. I am very excited to be a part of what you're doing. we need more culture here--and i hope that the MOXIE will be a place to feel \"cultured.\" \r\ni want to be part of it.  can you have coffee there?",
      "created_at": "2005-07-10T20:00:34.000Z"
    },
    {
      "author": "John",
      "body": "Any chance of showing \"Leningrad Cowboys Go America\"?\r\n\r\nHere, I'll save you the trouble: http://www.imdb.com/title/tt0097728/",
      "created_at": "2005-09-20T20:47:04.000Z"
    },
    {
      "author": "Roxanne",
      "body": "As a local springfieldian, I am UBER excited about the Moxie. its about time, downtown got the flavor it needed, I usually try to avoid the downtown scene, but I will be spending a considerable amount of time there soon! Thanks guys for doing what ive wanted to for a long time, you should put a movie request line on your site too so once in a while we can choose! thanks again\r\nroxi, springfield",
      "created_at": "2005-09-21T01:42:21.000Z"
    },
    {
      "author": "colette wanless-sobel",
      "body": "Hello, Moxie Blog people.\r\n\r\nBest wishes on launching your independent cinema business.\r\nNot only are you doing something many of us only dream of doing, but you are sharing the \"birthing process.\"\r\n\r\n~Colette",
      "created_at": "2005-07-17T02:18:17.000Z"
    },
    {
      "author": "Joey Borovicka",
      "body": "I'm a local artist looking for places to exhibit my work. I would like to contact you, but your contact page doesn't seem to be working. If it's not fixed soon I'll just write you a letter. Anyway, you can see some of my work on my website. I'm currently working on a series of small paintings that would look very handsome in an intimate gallery space such as yours.\r\n\r\nThanks!",
      "created_at": "2005-07-13T20:28:15.000Z"
    },
    {
      "author": "Di",
      "body": "=) cool web!!!!!!",
      "created_at": "2005-07-14T20:36:36.000Z"
    },
    {
      "author": "Doris Day",
      "body": "Dearest Dan and Nicole and Bogart,\r\nI wish you didn't live so far away and I didn't live so far away, then we could still get together and watch old movies and make cookies and craft projects.  The Cathedralfete is coming up soon and I want to have a booth this year to sell soap but Rock Hudson says that it is not practical.  By the way, you should make homemade baby bath products for your new niece/nephew/it.\r\nDoris",
      "created_at": "2005-07-20T23:16:02.000Z"
    },
    {
      "author": "April",
      "body": "OMG!  Just looking through more of your extensive website, and I saw that your first screentest was the Pagan Poetry video!  That is Michael's and my song, dude!  We have that DVD, too.  When are you gonna mention that we were your first double-feature customers? Huh?  It's been like 11 hours now;  what could you have possibly been doing that was so engaging that you couldn't post such an important announcement?  Seriously, though, we loved your place and thoroughly enjoyed our experience there.  You guys are really nice (or else you're good actors), but it works in your favor either way!  And I'm impressed that although the Moxie has a hip, sophisticated, professional atmosphere, it feels really comfy and cozy.  Well done!  On second thought, make mine medium-rare...",
      "created_at": "2005-09-30T17:19:40.000Z"
    },
    {
      "author": "Chrissy",
      "body": "Ah! I'm going to be a student at Evangel in about one month and I'm SO EXCITED to have something great like this to go to...having a hard time comparing my beautiful Minneapolis, MN to Springfield in terms of cool stuff to do. Looking forward to it immensely..",
      "created_at": "2005-07-19T21:59:41.000Z"
    },
    {
      "author": "Mark Fleming, President/CEO",
      "body": "SUPER IDEA AND GREAT THINKING OUT OF THE BOX.\r\n\r\nI AM CONSIDERING INVESTING.",
      "created_at": "2005-08-02T19:48:02.000Z"
    },
    {
      "author": "April",
      "body": "I promise I'll quit hogging the guestbook after this one thing I feel utterly compelled to do.\r\n\r\n                     ))< >((\r\n                     FOREVER\r\n\r\nTee-hee! I just had to get that outta my system!",
      "created_at": "2005-09-30T17:26:12.000Z"
    },
    {
      "author": "Glen",
      "body": "I've just dicovered your blog by accident whilst looking for projectors online. I'm still going through your May 2004 archive,(and should catch up to date by early next month). As Chief Projectionist for an Art house cinema for the last 15 years I'm finding your blog so far lands pretty close to home,( even though we are on different continents). GOOD LUCK!",
      "created_at": "2005-08-27T07:34:24.000Z"
    },
    {
      "author": "melissa",
      "body": "i am really excited about seeing movies that i couldn't see before. wow!! open soon!!!!",
      "created_at": "2005-08-28T05:29:20.000Z"
    },
    {
      "author": "Adamvox",
      "body": "Hey guys, \r\n\r\nWe made it to the Moxie for my birthday on Sunday the 9th and saw Broken Flowers. Good flick. We will be back for Grizzly Man, The Aristocrats, and if you get Capote I will be there for that as well!\r\n\r\nAdam and NLTL\r\n\r\nP.S. \r\nLet me know if you wanna our music at the Moxie!",
      "created_at": "2005-10-11T21:34:56.000Z"
    },
    {
      "author": "Jaime",
      "body": "I am very interested in the movie theatre business.  Unfortunately I have no schooling on any kind of theatre.  I have also found out that there seems to be no information on this subject in libraries or the net.  I'm wondering if maybe you can help me out with this.  Keep in mind I need all the help I can get, even the very basics.  Thanks for any help at all!",
      "created_at": "2005-10-14T04:18:53.000Z"
    },
    {
      "author": "Linda Giacomi",
      "body": "Even though i live a little far , i will now be going to the Moxie.  Im very excited and look forwrd to a blast !",
      "created_at": "2005-10-24T01:49:14.000Z"
    },
    {
      "author": "Jessica",
      "body": "love the site.  but how do i get one of those amazing moxie t-shirts?",
      "created_at": "2005-11-09T10:35:01.000Z"
    },
    {
      "author": "Mike Fleming",
      "body": "You have a very nice website here, I enjoyed looking at it.\r\nBest of Wishes to you.",
      "created_at": "2005-07-23T07:30:01.000Z"
    },
    {
      "author": "Ben Mozer",
      "body": "Holy Crap,  You guys stole my idea...well i'm sure you didn't steal it, but this is word for word what my wife and i want to do in Ft. Collins Colorado.  Literally no different.  We just moved back to L.A. to start it up and i'm doing research on it right now.  I'm going to keep reading, but expect an email from me.  I would really like to ask a few questions. \r\n\r\nThanks for the site,\r\n\r\nBen",
      "created_at": "2005-07-23T21:53:25.000Z"
    },
    {
      "author": "ben again",
      "body": "sorry, typo on my last post\r\n\r\n\"back to LA\" should be From LA to Ft. Collins.",
      "created_at": "2005-07-23T23:35:47.000Z"
    },
    {
      "author": "dave",
      "body": "how far am i willing to travel to see a movie? well the moxie is a bit far (i live in detroit) but i love to fantasize that you are the proprietor of an old-fashioned movie-house that is just around the corner...",
      "created_at": "2005-12-09T23:56:55.000Z"
    },
    {
      "author": "Carl White",
      "body": "As a movie buff and big fan of independent movie theatres I very much enjoyed my visit to your web site. I hope to visit some day. Keep up the good work.\r\n\r\nThanks,\r\nCarl White\r\nhttp://www.WebTickets.com",
      "created_at": "2006-09-27T04:59:45.000Z"
    },
    {
      "author": "Stefan",
      "body": "Nice site ...too funny ;-)",
      "created_at": "2006-10-23T00:06:35.000Z"
    },
    {
      "author": "Leonardo",
      "body": "Just browsing your site - Nice Work!",
      "created_at": "2006-11-10T11:26:37.000Z"
    },
    {
      "author": "Dustin",
      "body": "BRING BACK SHORTBUS FOR ONE MORE ROUND... some folks missed the bus and really need to get on it this time.",
      "created_at": "2006-12-10T13:12:04.000Z"
    },
    {
      "author": "Tom Dimock from the Great White North",
      "body": "Hi Dan,\r\n\r\nI have read back through your Blog since the beginning (the beginning of your site's inception, not time, I'm old but not that old)  I stumbled on it late January and was so interested I decided to read it all.  Since then I have come back to your blog every so often just to see how you are doing.\r\n\r\nI want to say I really admire your courage and tenacity to go into this business. I wish you the best as you continue to work  at building your business.  With all the changes in the industry that is to come (I have visted Bigscreenbiz forum and have read the concerns of the independant owners especially with the coming of Digital) I wish you the best. I suspect you will do alright.   \r\n\r\nBy the way, I am writing as a northern neighbour, here in New Brunswick,  Canada.  http://www.tourismfredericton.ca/en/index.asp..sorry about the tourism link, it just has more info if you are interested.\r\n\r\nAll the Best\r\nTom",
      "created_at": "2007-04-25T21:56:46.000Z"
    },
    {
      "author": "Joe G",
      "body": "Just stumbled onto your blog, and it has reawakened my never ending desire to open an art-house movie theater close to my hometown here in N.C. (where we all strive to read at a fourth-grade level and tobacco is indeed considered a vegetable).  I've only read your May/June 2004 blog entries so far, but I look forward to reading the rest soon.  I wish you continued success!",
      "created_at": "2008-01-07T08:23:19.000Z"
    },
    {
      "author": "Dawn Harris",
      "body": "Hi there,\r\nJust looking in, great website!!!! I got the link from a short film called Apollo. They used my Artwork for the puzzle .....my 3 seconds of fame lol!!\r\n\r\nOne day I hope to visit Springfield but at the moment I live in England. Good luck with the ongoing improvements, and in everything else you do",
      "created_at": "2008-07-01T16:57:42.000Z"
    },
    {
      "author": "lexipainter",
      "body": "This is quite possibly the most addictive blog I have ever read. \r\n\r\nI worked at a theater for around 5 years and always loved it and missed many aspects (like building and threading movies). My sister recently suggested that we open an independent theater so I decided to start doing some research. A quick google search later and I'm here, reading your blog from 2004! I've only read probably two or three months worth, but I will definitely return for more. Obviously it all worked out, it's killing me that I have to read though it one page at a time.. I wish It was all in a book.. Maybe you should consider putting it in a book?\r\n\r\nEither way, thanks for the blog! What I've read so far is great, and also, congrats for your obvious success!",
      "created_at": "2008-10-04T07:33:35.000Z"
    },
    {
      "author": "Jim Flowers",
      "body": "I'm a huge fan of MOXIE and you guys clearly have it.  If you're interested/willing, I'd like to write a post about your demonstration of the power of personal moxie in the success of a business start-up.",
      "created_at": "2009-02-07T18:56:15.000Z"
    },
    {
      "author": "Austin Shinn",
      "body": "I drove from Little Rock AR to your theater. The drive was worth it! I want to bring others.",
      "created_at": "2010-07-21T10:21:47.000Z"
    }
  ]
}