{
  "id": 1,
  "title": "Introduction, Part 1",
  "body": "Four years ago this month, I walked into a local multiplex theater to start a summer job that would change my life. Over the three short months of my employment at the Aztec Theater, I fell in love with a coworker, who would later become my lovely wife, and became enthralled with the idea of running my own movie theater, which will hopefully become my profession.<br/><br/>My name is Dan and I'm currently a 23 year old Web Engineer for one of the world's largest textbook publishing companies. My wife, Nicole, is also 23 years old and also works at the same company I do, but as a Marketing Coordinator. We have a timid dog named Bogart (Bogey for short) who cocks his head everytime (and I mean every single time) you go \"Woot Woo,\" but you have to do it like in the Garnier Fructis commercial, or else he won't care. We're currently living in St. Louis, but are planning on moving if we're able to secure financing for our theater.<br/><br/>Our theater will be located in Midwestburg, which is the town where I was born and raised. It's a good sized town with close to 400,000 people (in the metropolitan area) and several universities sprinkled throughout the region. Midwestburg's downtown is currently being revitalized - old decrepit buildings are being turned into trendy lofts, warehouses are being converted into arts centers, new locally-owned restaurants and boutiques are popping up left and right, and, if all goes well, our theater, Cinema 24, will be counted among the many new businesses that are making Midwestburg's downtown worth visiting again.<br/><br/>I plan on spending the next five days giving the back-story of our theater, our plans, our current situation, our lives, and this blog... which I'm currently writing while I should be busy at my real job.  This sporadic, choppy post will have to do for today... hopefully my writing will progress as I continue to add posts to this blog. Hopefully.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-05-24T20:35:16.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Justin",
      "body": "I love you.",
      "created_at": "2005-01-05T00:55:15.000Z"
    },
    {
      "author": "bjork24",
      "body": "Wow. You win the prize for the most delayed comment. Seven and a half months after the original post. Congratulations!",
      "created_at": "2005-01-05T00:59:37.000Z"
    },
    {
      "author": "Fyse",
      "body": "Can I win for an even more delayed comment? Perhaps if I also say I love you?! No? Bah...",
      "created_at": "2005-03-08T05:30:42.000Z"
    },
    {
      "author": "bjork24",
      "body": "You and Justin must share the prize of most delayed comment.",
      "created_at": "2005-03-08T05:32:20.000Z"
    },
    {
      "author": "Matt",
      "body": "How do I weigh in? Just stumbled upon your theatre establishing antics and was thoroughly enthralled reading up the history of posts... I'm located in a cess pit in merry old england, our local indie cinema closed 3 years ago and has been standing boarded up ever since. I'll be glad to hear when your place opens, sounds like it should be worth the long-haul =)",
      "created_at": "2005-04-02T14:33:57.000Z"
    },
    {
      "author": "Untitled",
      "body": "J",
      "created_at": "2005-12-13T12:07:44.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 13,
      "name": "Other job"
    }
  ]
}
