{
  "id": 100,
  "title": "V-Day",
  "body": "<b>From:</b> Kent (SBA loan underwriter)\r\n<b>To:</b> Dan (SBA loan wanter)\r\n\r\nI have discussed Generic Springfield Bank funding $25,000 of the loan request with my supervisor.  He feels we would be willing to do this with an SBA guarantee and parents co-signing.  The only thing we need to be aware of is the SBA still may require outside collateral be pledged to the deal.  We will do our best.  I have an SBA application I need to get into your hands.  Is there a fax number I could use for that?  Thanks\r\n\r\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\r\n\r\n<b>RECIPE:</b> One independent art-house theater\r\n\r\n<i>Ingredients:</i>\r\n1 loan of $25,000 from SBA\r\n1 loan of $25,000 from SFDC\r\n1 large sweaty wad of Dan and Nicole's savings\r\n1 building in downtown Springfield\r\n\r\nFirst, use the money from SBA and SFDC to purchase theater equipment through dealer in Portland, Oregon. Next, look at the rest of the money and slowly come to the realization that you only have $25,000 left. Panic until frazzled. Once emotions have cooled, calmly gather yourself and start the arduous task of purchasing inventory, renovating, decorating, buying old, but comfy furniture, and turning the otherwise un-theater-like building into an independent art-house theater. Hire two to three hapless college-aged students to help serve popcorn. Stir. Open by Valentine's Day weekend, 2005.\r\n\r\nPlease note: If it takes too long to complete the recipe, loan repayments and rent for the building will be due before the theater opens. Working two or more temporary jobs until the theater opens may help offset these costs. Hopefully.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-11-11T22:00:46.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Einahpets",
      "body": "Good luck. You can do it...all night long.",
      "created_at": "2004-11-11T22:04:54.000Z"
    },
    {
      "author": "bjork24",
      "body": "Woah... that made me blush. A tad.",
      "created_at": "2004-11-11T22:06:31.000Z"
    },
    {
      "author": "nicole",
      "body": "Gasp! I never thought about it, but we could so show Vaggie Tales on V-Day! But I think that takes years of work in advance...",
      "created_at": "2004-11-11T22:46:34.000Z"
    },
    {
      "author": "bjork24",
      "body": "We'll leave the live-theater performances to the live-theater venues.",
      "created_at": "2004-11-11T22:50:18.000Z"
    },
    {
      "author": "nicole",
      "body": "There's a film version. So there.",
      "created_at": "2004-11-11T23:01:59.000Z"
    },
    {
      "author": "bjork24",
      "body": "There.",
      "created_at": "2004-11-11T23:03:09.000Z"
    },
    {
      "author": "Oz",
      "body": "Congratulations!!!!!  It's going to be scary, but from here on out, when you're terrified, just think back on this whole loan thing and say to yourself, \"We got through that, and we'll get through this too.\"\r\n\r\nHow cheesey am I?  Maybe you should just down a six-pack and cry yourself to sleep.  Yeah, that.",
      "created_at": "2004-11-11T23:14:33.000Z"
    },
    {
      "author": "bjork24",
      "body": "Well, we're not through the woods yet. We still have to get approval from SBA. If that goes through, then I'll down some celebratory beer.",
      "created_at": "2004-11-11T23:20:45.000Z"
    },
    {
      "author": "whitty",
      "body": "Well, I know where we're going on our Valentines date!  Hurrah!  \r\n\r\nAnd I am totally volunteering to help paint stuff or pick up stuff or clean stuff or stuff stuff.",
      "created_at": "2004-11-12T00:19:15.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks, Whitty! We've got a lot of stuff that needs to be stuffed with stuff.",
      "created_at": "2004-11-12T00:21:13.000Z"
    },
    {
      "author": "whitty",
      "body": "Er, \"we\" being my husband and I.  I was not hitting on Dan. Not that I wouldn't, but my marital obligations preclude me. How awkward.",
      "created_at": "2004-11-12T00:23:07.000Z"
    },
    {
      "author": "bjork24",
      "body": "Damn. I thought I had a date for Valentine's day for a minute. Oh well. I guess I'll have to go with the missus now.",
      "created_at": "2004-11-12T00:28:04.000Z"
    },
    {
      "author": "Luke",
      "body": "You guys should apply to have one of those reality tv design shows redesign your theater (or at least the lobby) for their show.\r\n\r\nThose shows are evil, but think of the help you could get.  And it would be free!  While You Were Out or In A Fix could hook you up.",
      "created_at": "2004-11-12T00:44:15.000Z"
    },
    {
      "author": "bjork24",
      "body": "It's funny you mention that, Luke, because that's exactly what Nicole and I were talking about this morning. If only we had cable so we know what shows are out there.",
      "created_at": "2004-11-12T00:46:27.000Z"
    },
    {
      "author": "Einahpets",
      "body": "The problem with those shows are that you have no say on your design. If you go to designer's challenge, you have to use your own budget, but at least you'd be on tv.",
      "created_at": "2004-11-12T01:17:55.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'm not very keen on the idea of being on TV. We'll just have Nicole stand in front of the camera.",
      "created_at": "2004-11-12T01:25:50.000Z"
    },
    {
      "author": "Luke",
      "body": "I just realized that from an accounting stand-point that might be a pain in the neck.  I'm pretty sure that you guys would have to pick up the value of the renovations as income.  I might be wrong though.\r\n\r\nI still think it would be worth it.\r\n\r\nI'm such a nerd.\r\n\r\nAnd Steph is right...sometimes those designers are total ass-clowns and ruin everything.",
      "created_at": "2004-11-12T02:25:29.000Z"
    },
    {
      "author": "bjork24",
      "body": "Damn ass clowns!",
      "created_at": "2004-11-12T02:26:27.000Z"
    },
    {
      "author": "nicole",
      "body": "Damn Hilde. Gluing straw on the walls.",
      "created_at": "2004-11-12T02:30:17.000Z"
    },
    {
      "author": "bjork24",
      "body": "Hey now! This is getting a little out of hand.",
      "created_at": "2004-11-12T02:33:00.000Z"
    },
    {
      "author": "Carmi",
      "body": "My fingers are crossed for you. What you're planning would certainly merit a trip from London, Ontario for a visit!",
      "created_at": "2004-11-12T02:48:04.000Z"
    },
    {
      "author": "bjork24",
      "body": "Wow! That would be one of the longest trips yet... unless, of course, Fyse flies over from the UK.",
      "created_at": "2004-11-12T02:49:04.000Z"
    },
    {
      "author": "Fyse",
      "body": "I wish, Dan, I wish, but the real London is quite a long way away. (I'm not actually from London, I'm from 30 miles north, but I guess that's the same place by US standards. England is synonymous with London to you Yanks anyway, right?!)\r\n\r\nI currently struggle to feed myself, so a transatlantic flight might be rather an extravagance. I might have to wait till I'm no longer an impoverished student...",
      "created_at": "2004-11-12T05:25:02.000Z"
    },
    {
      "author": "bjork24",
      "body": "Wait, wait, wait. You mean to tell me that there's more than one city in England? I thought London was the name of your country! *wink* *wink* *nudge* *nudge* Say no more.",
      "created_at": "2004-11-12T05:57:18.000Z"
    },
    {
      "author": "Fyse",
      "body": "Ah, a Python fan, no? That would certainly be in any list of the top British comedy (though obviously it's not a sit-com).\r\n\r\nI think the nudges come before the winks by the way.\r\n",
      "created_at": "2004-11-12T06:50:02.000Z"
    },
    {
      "author": "Randy",
      "body": "How much of that are you going to need to cough for the first film(s) you'll be showing?  In fact, what is the first film you'll be showing?  Have you given it any thought or is it taboo to do so at this point in the game?\r\n\r\nRegardless if you give me a place to stay (I'm willing to sleep in the theater), and make sure I don't starve to death (I like day old popcorn), I'll work for free. :)",
      "created_at": "2004-11-12T11:59:24.000Z"
    },
    {
      "author": "bjork24",
      "body": "Randy: we don't have to cough up anything for the first films. Unlike first runs, independent films typically don't require guarantees or hefty distribution percentages. We haven't started booking yet, b/c even by our most optimistic estimate, we're still 3 months away from opening. Booking will be down the month before we open.",
      "created_at": "2004-11-12T19:23:10.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
