{
  "id": 101,
  "title": "Post #100",
  "body": "Since there's not much to report in the way of progress today, and since Friday tends to be this blog's least visited day of the week, I'm going to list off a few thoughts that I've had. Why? Because I can... and it's my 100th post, so give me a break.<br/><br/><ul><li>Why choose white shoes? Say it fast a few times and think about it.</li><br/><li>The word \"kind\" has always seemed strange to me. It's one of those words that the more I say it and write it, the more it doesn't seem to really be a word. This only happens when I use it in the context of \"different variations,\" but not of \"congeniality.\"</li><br/><li>Several years ago, I was driving my car when I came to a fairly busy intersection. The light was red, so I slowed down and came to a stop alongside an old minivan. The driver of the minivan turned his head and stared at me, as did the children in the backseat. I wrote this behavior off as being somewhat disturbing, but not enough to freak me out, so I instead focused my attention on the traffic light, willing it to turn. Once it turned green, I accelerated and began to move through the intersection - that's when I realized that I was the only car moving. Every other car around me, the ones in my lane, the opposing lanes, and all oncoming lanes, were at a stand still. Even more strange, all the drivers and their passengers were staring at me in the same manner as the people in the minivan. I continued on my merry way and came to the logical conclusion that all the people in the various cars at the intersection were actually time travelers. As it turns out, I become a person of substational historical importance in the future, and all the time travelers had paid enormous wads of money to travel back in time to that exact moment so they could watch me drive by in my 1992 Toyota Corolla. Simple as that.</li><br/><li>Whenever I say or hear the word \"intersection\", I immediately get a mental close-up of Richard Gere in his car slidding sideways in slow motion towards the camera.</li><br/><li><i>Arrested Development</i> may very well be the best show on American television today.</li><br/><li>I'm a sucker for fart jokes, pratfalls, and people getting bonked in the crotch by flying objects. With that being said, I'd like to rescind my last statement and claim <i>America's Funniest Home Videos</i> as the WORLD'S funniest television show!</li><br/><li>It's pop, not soda.</li></ul><br/>Ok, I'm done.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-11-12T22:00:13.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "WhimsyChick",
      "body": "Agreed. It IS pop.",
      "created_at": "2004-11-13T01:05:09.000Z"
    },
    {
      "author": "bjork24",
      "body": "Whimsy, we're what some people might called \"enlightened.\"",
      "created_at": "2004-11-13T01:06:13.000Z"
    },
    {
      "author": "whitty",
      "body": "RE: Fart jokes.  Please tell me you have watched the fart soundtrack for Wet Hot American Summer.  I laughed so hard I was drooling.<br/><br/>America's Funniest Videos never fails to crack me up, but for me it is the crotch shots and animals being dumb.  GENIUS! ",
      "created_at": "2004-11-13T01:09:38.000Z"
    },
    {
      "author": "bjork24",
      "body": "Whitty: I haven't seen the fart soundtrack to Wet Hot Summer, but I have seen the farting preacher, which may or may not still be floating around on the internet somewhere... priceless.",
      "created_at": "2004-11-13T01:12:19.000Z"
    },
    {
      "author": "Oz",
      "body": "You had me until fart jokes.  Then I turned away a took a big gulp of my SODA.",
      "created_at": "2004-11-13T02:33:05.000Z"
    },
    {
      "author": "bjork24",
      "body": "What can I say, I am what I am... fart jokes and all.",
      "created_at": "2004-11-13T02:35:43.000Z"
    },
    {
      "author": "justin",
      "body": "Whitty:  When I was in school, a university organization would play a different movie every week on the big screen in one of the halls.  One week they played Wet Hot American Summer, but someone in the front row asked the dude to play the farting audio track instead of the standard one, so he did.  A lot of people that had never seen the movie before thought it was the dumbest thing ever.  Classic.",
      "created_at": "2004-11-13T03:38:23.000Z"
    },
    {
      "author": "Rachel",
      "body": "You know I'm tired of this \"pop\" thing.  It doesn't make any sense.  \"Pop\" is for things that actually do so like \"popcorn\" and \"grandpop\" not for \"soda\" which is actually what it is.  Maybe it bubbles, but it doesn't pop...I mean I guess it does when you open it...but it certainly doesn't when you have it in a glass...it fizzes.  I would be okay with you calling it \"fizz\" but \"pop\"...jesus that's absurd.",
      "created_at": "2004-11-13T04:08:27.000Z"
    },
    {
      "author": "Newell",
      "body": "Fart jokes make me happy. As does soda. Screw pop all to hell and back.",
      "created_at": "2004-11-13T04:11:14.000Z"
    },
    {
      "author": "Aaron",
      "body": "Arrested Development IS the best show on television today, now that the Office has finished. This is a fact. I thought of both shows today and smiled.<br/><br/>Oh! And when I went to see the Incredibles with a friend, we snuck in a muffin (her) and a scone (me) and smiled and thought to myself \"OMG this is what the Moxie will be like! Cinema and scones!!!\"",
      "created_at": "2004-11-13T04:20:21.000Z"
    },
    {
      "author": "bjork24",
      "body": "I am partially drunk and cannot type.",
      "created_at": "2004-11-13T12:14:27.000Z"
    },
    {
      "author": "Dave",
      "body": "\"I am partially drunk and cannot type.\"<br/><br/>yeah. but are you drunk *and* stuffed with cheese dip? i am. <br/><br/>oh the humanity!",
      "created_at": "2004-11-14T09:09:42.000Z"
    },
    {
      "author": "Carmi",
      "body": "Where I come from (Quebec), it's boisson gazeuse. It's also been anglicized to soft drink. When I moved to Ontario, it took me a few years to get used to \"pop\".<br/><br/>No matter what we call it, it still does horrid things to the old GI tract. Give me juice any day.<br/><br/>I loved this post, BTW. Miscellaneous musings about the fringes of life tend to stick in the mind longest. Wonderfully written.",
      "created_at": "2004-11-14T23:10:57.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Carmi!",
      "created_at": "2004-11-14T23:32:03.000Z"
    },
    {
      "author": "Einahpets",
      "body": "In my 8th grade speech class I did a pet peeve speech on the word pop used for soda...I remember ending it saying that for everyone that uses the word pop, I would pop them in the nose...that's what my great-uncle told his roomate in the nursing home. He would pop him in the nose if he didn't shut up. Crotchety old men. I love em'.",
      "created_at": "2004-11-15T18:42:21.000Z"
    },
    {
      "author": "aron",
      "body": "its soda.",
      "created_at": "2004-11-19T23:02:24.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 7,
      "name": "Lists"
    },
    {
      "id": 12,
      "name": "Thoughts"
    }
  ]
}
