{
  "id": 102,
  "title": "Bridget Jones's Boobies",
  "body": "When I originally set up the new version of this blog, I had intended on using the \"Reviews\" pigeonhole to talk about films we were showing at the Moxie, but after seeing <a href=\"http://www.imdb.com/title/tt0317198/\" target=\"_blank\">Bridget Jones: The Edge of Reason</a> last night, I felt it was high time to break it in a bit. Before I begin, let me apologize to my lovely wife who enjoyed this movie in much the same way as I enjoyed the Star Wars prequels - irregardless of how the critics felt. She loves all things \"Bridget Jones\" and was happy to see all of her favorite characters reunited on the big screen once again. So, Nicole, you can stop reading at this point, because it only gets worse from here on in.\r\n\r\nNow, let the review begin:\r\n\r\nInstead of saying \"the first movie\" and/or \"the sequel\", I will refer to the movies as Bridget Jones version 1.0 and Bridget Jones version 2.0. Why? Because 1) the movies are nothing more than slightly modified versions of each other, as opposed to being complimentary films that build off each other's distinct narratives, and 2) I am a nerd. For all intents and purposes, Bridget 2.0 is a complete rehash of 1.0, minus the humor and likeability quotient. It's all the same characters, doing all the same stuff, with NOTHING new. Bridget is still slightly overweight and unsure about men. Daniel Cleaver is still an arrogant arse (that's Britglish for butt), and Mark Darcy still moves very, very slowly.\r\n\r\nAside from the characters, the plot is remarkably thin, which may be Helen Fielding's fault, but since I've never read the book, I can't make that judgment. The editing was poor as well, giving the sense that some, if not most, scenes were inserted solely to adhere to the book... or vice versa. There's a very awkward girl-on-girl kiss towards the end that seemed so strained, so put-upon, so ridiculous, that I wasn't even the least bit aroused. And I'm not the only one who feels this way... <a href=\"http://ozzilynbean.blogspot.com/2004/11/impractical-nature-of-candles.html\" target=\"_target\">Oz</a> does too, and if you don't see the importance in that correlation, perhaps you should read her blog more often.\r\n\r\nThe only enjoyable part of the movie were Bridget's wobbly bits, which, by all accounts, have grown to AT LEAST 25% to 30% of what they were in Bridget 1.0. Will Zelleweger win an Oscar for her ability to rapidly inflate (Bridget 2.0) and deflate (Chicago) her hoo haws? I doubt it, but she definitely earns an A for Affort... or possibly a B for Buxom.\r\n\r\nNow that I've alienated myself from my female readership, I'll take a moment to talk about Tom Hanks and the rumor that he'll be playing Robert Langdon in Opie's version of <i>The DaVinci Code</i>. As much as I love Tom Hanks, I think he brings TOO much to the character. His immense affability and charm forces a smile onto the face of every helpless soul who looks his way. There will be no period of initial doubt with Tom Hanks as Robert Langdon. The audience will love him from the git-go... or should I say Kum-n-Go (inside Springfield joke).\r\n\r\nIf it were up to Nicole and I, we'd cast <a href=\"http://www.movies-on-dvds.com/bill_pullman.jpg\" target=\"_blank\" class=\"broken\">Bill Pullman</a> to play Robert Langdon. Let's face it, Pullman is still creepy enough to assure that at least 70% of the audience will not be smiling when he comes on screen. If he does a good job, everyone loves him, if he doesn't, oh well... the audience will have had a more complete cinematic experience by forming their own thoughts about Pullman, and not been forced to smile in remembrance of that time when the statue peed on Tom Hank's head in <i>The Money Pit</i>.\r\n\r\nAlso, Bill Pullman looks a lot like <a href=\"http://www.writerswrite.com/journal/may00/dan4.jpg\" target=\"_blank\" class=\"broken\">Dan Brown</a>, who in turn kind of looks like <a href=\"http://www.r-3.com/email/images/bezos.gif\" target=\"_blank\" class=\"broken\">Jeff Bezos</a>, who we all know looks just like <a href=\"http://www.discoverkate.com/movies/david-gale/press_20011222_houston-spacey.jpg\" target=\"_blank\" class=\"broken\">Kevin Spacey</a>. So in the end, I guess it really doesn't matter who plays Robert Langdon as long as the movie stars <a href=\"/post/81\">Natalie Portman</a> or Bridget Jones's Boobies.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-11-15T22:14:40.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Stephanie",
      "body": "hey, I loved the original book and movie, but I'm not as excited about the new film.  Of course, we won't actually watch it till Netflix sends it our way...\r\n\r\nI don't the Renee is that fab; she's a little too cloying in all her roles.  As much as I adored Whole Wide World, I kept wishing she was in a lot less of it!\r\n\r\nAnd I'm getting kind of sick of seeing Tom inevery Ronnie film; who do they think they are, anyway?  Hepburn and Cukor?  Grant and Hitchcock?  give me a break...",
      "created_at": "2004-11-15T22:40:45.000Z"
    },
    {
      "author": "bjork24",
      "body": "Happiness, Netflix be thy name.",
      "created_at": "2004-11-15T22:43:44.000Z"
    },
    {
      "author": "Einahpets",
      "body": "Bridget was enjoyable, however, the second book was totally different than Bridget 2.0. The book made me laugh and laugh, while the move only made me chuckle slightly.\r\n\r\nAs for Tom, I think Bill Pullman has it! Loved him in While You Were Sleeping. I'll picture Bill when I read DaVinci Code...",
      "created_at": "2004-11-15T23:10:44.000Z"
    },
    {
      "author": "bjork24",
      "body": "Do my moves make you chuckle, Stephy?",
      "created_at": "2004-11-15T23:11:42.000Z"
    },
    {
      "author": "Einahpets",
      "body": "I mean, the movie made me chuckle...no Dan, you make me laugh and laugh.",
      "created_at": "2004-11-16T00:04:08.000Z"
    },
    {
      "author": "bjork24",
      "body": "Woo hoo!",
      "created_at": "2004-11-16T00:07:05.000Z"
    },
    {
      "author": "Oz",
      "body": "I disagree with you that 2.0 is the same as 1.0.  The overall theme, yes--one girl, two guys, many misunderstandings.  However, 1.0 was BELIEVABLE.  It was a rather simple story set simply and executed simply.  The things that happened were not incredibly out of the ordinary.  But 2.0!  Okay, hookers, thieves and drug addicts in a Taiwan jail DO NOT ALL SPEAK ENGLISH!  And being in a jail IS NOT LIKE HAVING A SLUMBER PARTY!  And REALLY HOT GIRLS don't fall in love with ugly (sorry Rene, but you were UGLY in this movie) fat girls who are obviously straight and obviously hate hot girls!  I could go on and on (I basically have already), but all of these ridiculous, far-fetched elements were completely absent from 1.0.  That's why when it got to the kiss, I was like NO PLEASE GOD NOT ONE MORE STUPID THING.\r\n\r\nBut Rene's huge boobies did occupy my time while I was ignoring the dialogue and plot.  I particularly liked the shot at the law dinner where you see her in profile, and the twins looked like they were on their way off of the shelf they were perched so precariously on.  Go, girls!  Be free!",
      "created_at": "2004-11-16T00:08:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "I was rooting for them to pop out when she was running down the hallway to Darcy's office. Perhaps that will be on the unrated version once the DVD comes out.",
      "created_at": "2004-11-16T00:10:32.000Z"
    },
    {
      "author": "Dave",
      "body": "i'd love to see Hanks play a cannibalistic psychopath.",
      "created_at": "2004-11-16T02:39:04.000Z"
    },
    {
      "author": "bjork24",
      "body": "Didn't you see Forest Gump?",
      "created_at": "2004-11-16T02:56:06.000Z"
    },
    {
      "author": "whitty",
      "body": "I was just discussing Renee's ta-tas with my student worker.  Possibly inappropriate, but anyway, we were concerned for Ms Zelleweger's health what with all the boobily and bodily inflation and deflation.  I would NOT call her fat in this movie- I know from fat- but she is so very thin in Chicago.  Can't be healthy going up and down.  \r\n\r\nAnd for what it is worth, I like her fat.  She looked like a dancing broomstick in Chicago.",
      "created_at": "2004-11-16T03:30:39.000Z"
    },
    {
      "author": "bjork24",
      "body": "She was dee-sss-cuss-ting in Chicago.",
      "created_at": "2004-11-16T03:51:42.000Z"
    },
    {
      "author": "Newell",
      "body": "I haven't read the DaVinci Code yet (or any of Dan Brown's other books) but from what I've heard of the character (I know a lot of people who HAVE read the books), I just can't see Hanks as Langdon. I've never been a big Hanks fan anyway. He's one of those actors that almost everyone seems to love... except me. It's not so much that I have anything against him, it's just that I don't like a lot of the movies he's been in. Just like John Cusack. Don't like a lot of his movies. ",
      "created_at": "2004-11-16T04:01:49.000Z"
    },
    {
      "author": "bjork24",
      "body": "What? You don't like Tom Hanks! That's positively unAmerican... I'm afraid I'm going to have to report you to the Department of Homeland Security, Newell.",
      "created_at": "2004-11-16T04:05:17.000Z"
    },
    {
      "author": "Fyse",
      "body": "Have you read the book, Dan? There's a bit where the Langdon is actually described as looking like Harrison Ford. When I read that, I thought 'He's trying to pre-cast the movie', and the more I read, the more it seemed a movie would be inevitable.\r\n\r\nMr Ford would be perfect, if only he weren't so damn old now.",
      "created_at": "2004-11-16T05:24:47.000Z"
    },
    {
      "author": "nicole",
      "body": "There were some good previews before Bridget, though...yay for Topher Grace! He should be Robert Langdon. Yeah.",
      "created_at": "2004-11-16T05:26:22.000Z"
    },
    {
      "author": "Fyse",
      "body": "If I remember, there's an attractive female cryptographer involved in the plot too. How about Audrey Tautou for that?!",
      "created_at": "2004-11-16T05:27:07.000Z"
    },
    {
      "author": "bjork24",
      "body": "Mmmm, Audrey Tautou.",
      "created_at": "2004-11-16T05:49:53.000Z"
    },
    {
      "author": "Fyse",
      "body": "Well said, Dan, well said.",
      "created_at": "2004-11-16T06:04:40.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks.",
      "created_at": "2004-11-16T06:38:56.000Z"
    },
    {
      "author": "John",
      "body": "This is going to sound lame, but I couldn't get  through reading The DaVinci Code. I just couldn't get into it... The story was good, but the writing drove me crazy.\r\n\r\nI kept thinking, \"For heaven's sake, stop with the over-the-top-too-flowery descriptions, please!!!\" I put the book down after about 100 pages.\r\n\r\nHowever, my wife and I recently went on a 12-hour roadtrip (12 hours each way) and did listen to the audio book. As we were listening to it, we tried to imagine who would play each part. \r\n\r\nI guess this is a lot of information (probably too much, just like The DaVinci Code) just to tell you that Tom Hanks never entered our minds. Just ain't seein' it.\r\n\r\nIn other totally unrelated book news, have you ever read Life of Pi?",
      "created_at": "2004-11-16T12:26:26.000Z"
    },
    {
      "author": "nicole",
      "body": "I agree with the writing style, John. I kept laughing at all the cheesy dialog. It read like it was being written for easy adaptation into a script. Hmmmm...\r\n\r\nI read the Life of Pi last year and really enjoyed it. ",
      "created_at": "2004-11-16T18:21:12.000Z"
    },
    {
      "author": "Einahpets",
      "body": "When I read Angels and Demons, I started writing down the corny lines. They were fun to repeat to people.",
      "created_at": "2004-11-16T18:56:24.000Z"
    },
    {
      "author": "Fyse",
      "body": "It was cheesy, yeah, and not very well written. Parts of it were really quite clumsy.\r\n\r\nBut I confess to being totally and utterly swept up by it, to the extent of reading right through the night to finish it. Say what you will about the style of the man's prose, he can write a hell of a gripping story line.",
      "created_at": "2004-11-17T05:29:20.000Z"
    },
    {
      "author": "Sybilline",
      "body": "Hi\r\n\r\nI would be delighted to know who sing\"Such a lovely lady\" on Bridjet Jones II.\r\n\r\nThank you\r\n\r\nSybil",
      "created_at": "2006-04-13T15:52:50.000Z"
    }
  ],
  "categories": [
    {
      "id": 10,
      "name": "Reviews"
    }
  ]
}
