{
  "id": 104,
  "title": "Firefox is totally radical",
  "body": "See that COOL lookin' Firefox button over on the left? It's the hot hit. If you're not using Firefox yet... shame on you. Why don't you go shop at Wal-Mart and club some baby seals while your at it! Geez.<br/><br/>What's that you say? You don't even know what Firefox is? Well, in that case, let me explain it with the help of the Beatle's eternal classic, <i>Yesterday</i>:<br/><br/>Firefox,<br/>All other browsers seem so unorthodox,<br/>Because you work so well and never lock... up<br/>Oh, I believe in Firefox<br/><br/>Suddenly,<br/>I get half the pop-ups I used to see<br/>Thanks to Firefox's increased security<br/>Oh, Firefox is completely FREE<br/><br/>Why... do... you still use IE or Opera?<br/>I... said... something stupid, now I long for Firefox!<br/><br/>Firefox,<br/>Tabbed browsing is so easy to use<br/>Now I need a place to hide some booze<br/>With Firefox, you cannot lose<br/><br/>Why... do... you still use IE or Opera?<br/>I... said... something stupid, now I long for Firefox!<br/><br/>Firefox,<br/>Open source makes it really robust<br/>Now I'm suffering from browser lust<br/>Oh, Firefox is a total must... have<br/><br/>Mmm, mmm, mmm, mmm, mmm, mmmmmmm, mmm<br/><br/>Download it TODAY! Word to your mother.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-11-18T01:57:12.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Stephanie",
      "body": "Oh, Dan.  That was worthy of a serious giggle.  Thanks.",
      "created_at": "2004-11-18T02:18:11.000Z"
    },
    {
      "author": "bjork24",
      "body": "Glad you liked it! GO FIREFOX!",
      "created_at": "2004-11-18T02:19:13.000Z"
    },
    {
      "author": "whitty",
      "body": "I still heart Safari.  Am I in the stone age?<br/><br/>And yes, I am doing no work today.  Only posting randomly on blogs.",
      "created_at": "2004-11-18T03:05:33.000Z"
    },
    {
      "author": "bjork24",
      "body": "No, you Mac fans can heart Safari all you want... it's the best thing Mac has to offer right now. If I had a Mac, I'd probably heart all over Safari.",
      "created_at": "2004-11-18T03:08:10.000Z"
    },
    {
      "author": "Oz",
      "body": "I have the Mozilla browser.  This is the same thing, isn't it?  Well, I prefer to use Safari, but I go to Mozilla for a few things here and there when a site isn't programmed for Safari (like writing posts for Blogger).  For whatever reason, I've never warmed up to Mozilla all the way.  I get complete pop-up blocking with Safari, and I just like it better.",
      "created_at": "2004-11-18T03:35:20.000Z"
    },
    {
      "author": "bjork24",
      "body": "Well, Firefox is made by Mozilla, but the Firefox browser is light years better than the original Mozilla version. You should give it a try sometime... upgrade your old Mozilla version.",
      "created_at": "2004-11-18T03:42:41.000Z"
    },
    {
      "author": "Shannon",
      "body": "Okay, okay, so Firefox IS better...<br/><br/>But that doesn't mean I have to stop shopping at Wal Mart, does it?  Or clubbing baby seals, for that matter...",
      "created_at": "2004-11-18T04:28:46.000Z"
    },
    {
      "author": "Fyse",
      "body": "I hear rumour that you can now get the full Google toolbar for Firefox. Is this true, or just a cruel hoax?",
      "created_at": "2004-11-18T04:36:15.000Z"
    },
    {
      "author": "bjork24",
      "body": "Shannon: keep clubbin' away!<br/><br/>Fyse: it's true. I have several search bars built into my Firefox. It's GRRRRRREAT!",
      "created_at": "2004-11-18T04:51:00.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "I heart Safari too, though I do have Firefox installed here for... some reason. I just can't seem to remember why I have it here. Hmm. I think it has something to do with a laundry basket in my foyer. I just can't remember.",
      "created_at": "2004-11-18T05:25:35.000Z"
    },
    {
      "author": "whitty",
      "body": "Where'd Benzo go?",
      "created_at": "2004-11-18T05:28:50.000Z"
    },
    {
      "author": "bjork24",
      "body": "Man oh man, this is turning into a Safari love-fest!<br/><br/>Kerrie: watch out for that laundry basket... old people tend to trip over them.<br/><br/>Whitty: Benzo is on vacation, but you can always visit him in the R.A.Q. section.",
      "created_at": "2004-11-18T06:11:25.000Z"
    },
    {
      "author": "nicole",
      "body": "Do you have a \"Heart On\" for Firefox? Ha ha. Heart on. Get it?",
      "created_at": "2004-11-18T06:20:22.000Z"
    },
    {
      "author": "whittler",
      "body": "The thing I love about Firefox is the way you can configure it to search. Eg regardless of what page I am on, I can type in \"di ersatz\" and it will do a Dictionary.com search for the word \"ersatz\". You can configure this for most searchable sites, including Google. This page tells you how - http://kb.mozillazine.org/index.phtml?title=Firefox_:_Tips_:_Quick_searches",
      "created_at": "2004-11-18T11:22:08.000Z"
    },
    {
      "author": "Einahpets",
      "body": "I think firefox is what is on Joel's work computer. Yay! We joined the bandwagon. Well, he did, not me.",
      "created_at": "2004-11-18T18:40:02.000Z"
    },
    {
      "author": "Fyse",
      "body": "That was a good link, whittler. I've now got all the search engines I could ever want set up for ridiculously easy access.<br/><br/>Dan, I couldn't find a version of the full Google toolbar for Firefox. I know there's the simple version in the top corner, but I miss all the additional features like the highlight, image search and blog-this buttons. Ah well, I'm still definitely better of with Firefox.",
      "created_at": "2004-11-18T20:50:25.000Z"
    },
    {
      "author": "bjork24",
      "body": "Fyse: they had it for all the previous versions. Wait about a week or so and check back on the extensions page. The developers will need to make it compatible with v1.0.",
      "created_at": "2004-11-18T20:52:29.000Z"
    },
    {
      "author": "Lor",
      "body": "Did you get paid for that?<br/><br/>Actually, Firefox should pay you for that, it should be their jingle.",
      "created_at": "2004-11-18T22:34:37.000Z"
    },
    {
      "author": "bjork24",
      "body": "That one was por gratis.",
      "created_at": "2004-11-18T22:36:43.000Z"
    }
  ],
  "categories": [
    {
      "id": 11,
      "name": "Techish talk"
    }
  ]
}
