{
  "id": 106,
  "title": "Memory lane",
  "body": "As Nicole and I were packing up all of our earthly belongs for our big move down to Springfield (35 days and counting), I came across a short \"research\" paper that I wrote a little over four years ago. Considering our current situation, I find it to be quite inspiring, so I thought I'd share it with the class:<br/><br/><i>*note: everything is verbatim - spelling errors and all. The only change was the omission of my source's last name.</i><br/><br/>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -<br/><br/><b>Independent From Independent Film</b><br/><br/>Touted as one of this year's best films, \"The Tao of Steve\" has garnered numerous awards and critical acclaim, including major recognition at the Sundance Film Festival.  It's a film about an overweight, pot smoking, kindergarten teacher who, over the years, has developed a Zen-like set of rules for attracting the opposite sex.  The film's protagonist, Dex, spends most of his time preaching his rules to his three roommates, who view him as a modern Don Juan.  It’s not until Dex meets back up with an old high school flame, Syd, that he starts to question how well his system really works.  Sound like a good movie?  A movie you’d like to see?  Well, you better fill the car up with gas, because you won’t be seeing it in Springfield any time soon.  Nor will you being seeing any number of other quality independent films play in this town.<br/><br/>Springfield has long had a reputation for snubbing films from smaller venues, a practice which is quite unfitting to a city its size.  I’ve lived here for over twenty years and on the occasion when a good quality film does hit the big screen, I’ve had to drive to St. Louis or Kansas City, or even Joplin, to see it.  Springfield’s apparent shortage of lesser known films has been the butt of jokes with movie fans throughout the region.  I can remember many times hearing my film professor, Dr. David Daley, mock Springfield for its habit of shunning away independent film.<br/><br/>So why does Springfield do this?  What does the Queen City have against the independent film venue?  I worked over the summer at the Springfield 8 Movie Theater, one of the only theaters in town that screens independent films, and witnessed, first hand, Springfield's view on the independent venue.  They have none.  Nicole [Chocolate-lover], a two year veteran at the Springfield 8, says that she’d be surprised to sell more than three tickets to any particular showing of an independent film.  \"Whenever we do get a smaller film, it’s not advertised as well as it should be,\" [Chocolate-lover] said.  \"I think that’s a big factor in the lack of enthusiasm… no one ever knows it here.\"<br/><br/>On a recent trip to MU, I attended a small screening of an independent film in a tiny coffee shop / theater downtown.  It was a memorable experience.  Everyday, this small theater, which couldn’t hold more than thirty people at a time, would screen several obscure independent films, sometimes mixing in the occasional political satire or cult favorite, to a predominantly college aged audience.  Could such an establishment survive in Springfield?  A city which is over three times the size of Columbia and has a nearly equal population of college students?  We may never know.  MU goes a long way to tout smaller films on its campus, offering special student screenings several times a week.  SMS doesn't seem to care all that much about exposing its student body to independent film.  That’s where the problem lies; no one cares.<br/><br/>So I urge this upon you, next time an independent film finds its way to our fine city, please take the time to go watch it.  It may not have a multi-million dollar budget or big name actors, but sometimes a break from those generic Hollywood conventionalities can be surprisingly refreshing.  Who knows, you might even enjoy yourself!  Upon which time you should go to the manager of the theater and thank them for screening such an excellent film.  It’s time to open your eyes, Spr<br/>ingfield.  If ever we’re to grow into a bright, shiny, cosmopolitan city then we must make some alterations to our conservative mode of thought about film.<br/><br/>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -<br/><br/>Pretty cheeky, eh? As you may or may not have surmised, Nicole [Chocolate-lover] is none other than Nicole [stealer of the last of Dan's chocolate chip cookie dough], who also happens to be my lovely, charming, and oh so thieving wife. I'm never going to let you live that down, Nicole. Never.<br/><br/>If only I could travel back in time and let myself in on my future:<br/><br/><b>2004 Dan</b> - Cheer up 2000 Dan, you're going to start your own independent, art-house theater in Springfield in less than 5 years!<br/><b>2000 Dan</b> - Really? That's awesome!<br/><b>2004 Dan</b> - Yeah, and it's going to be just like the Ragtag in Columbia that you spoke so highly of.<br/><b>2000 Dan</b> - SWEET! How did you get the money to swing that.<br/><b>2004 Dan</b> - Heh heh... it's funny that you should ask that. Uh...<br/><b>2000 Dan</b> - You don't have the money do you?<br/><b>2004 Dan</b> - Well, not TECHNICALLY... but our chances are looking pretty good.<br/><b>2000 Dan</b> - And you've already quit your day-job haven't you?<br/><b>2004 Dan</b> - Yes.<br/><b>2000 Dan</b> - Damn you!<br/><b>2004 Dan</b> - NO! Damn YOU for writing this paper and getting ME in over my head!<br/><b>2000 Dan</b> - In over YOUR head?! That's my head too, guy!<br/><b>2004 Dan</b> - Don't you ever call me GUY... BUDDY BOY! I'm going to totally trash you on my blog.<br/><b>2000 Dan</b> - Your what?<br/><b>2004 Dan</b> - A blog. It's like an online diary that anyone and everyone online can read.<br/><b>2000 Dan</b> - Should I kill myself now or wait a few years?<br/><b>2004 Dan</b> - I'd forgotten how witty I was... and still AM.<br/><b>2000 Dan</b> - Nice beard.<br/><b>2004 Dan</b> - Thanks.<br/><br/>And for those of you who are interested: I received, dare I say EARNED, an A+ on that paper. Jealous? Yeah, well you should be. Of course, I haven't always been an academic heavyweight. Check out this test answer from an English class way back in 1996:<br/><br/>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -<br/><br/><b>Final Exam - The Scarlet Letter</b><br/><br/>Essay question: <i>Dimmesdale is a hypocrite. Explain.</i><br/><br/>My answer: <u>Dimmesdale, what a hypocrite!</u> Rev. Arthur Dimmesdale, father of Pearl Prynne, is a preacher and active member on the Boston Church Scene. The problem with old Arthur is that he is a practitioner in hypocrisy. To defend my statement, I would like to implore upon some examples from the text. He is a preacher, true to the cloth, although he is a sinner, bad to the bone, and those two mix to make a hypocrite. That one was obvious, here is another. He agrees to run away with Hester, but only after he can make himself look good at the election sermon! What a fink! I’ve shown you all I can. Please give me full credit for creativity. I deserve it.<br/><br/>Teacher's comment: \"ya, right!\"<br/><br/>Grade on essay question: 2/20<br/><br/>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -<br/><br/><b>1996 Dan</b> - What is it again?<br/><b>2000 Dan</b> - He said it was some kind of online diary or something.<br/><b>1996 Dan</b> - You mean like through AOL?<br/><b>2000 Dan</b> - I don't know... something like that.<br/><b>1996 Dan</b> - Man. That's far out. How did we look?<br/><b>2000 Dan</b> - We've really gone downhill. Forget what they say about looking your best at 25.<br/><b>1996 Dan</b> - I think I look my best right now.<br/><b>2000 Dan</b> - So do I.<br/><b>1996 Dan</b> - Really? Thanks.<br/><b>2000 Dan</b> - I was talking about myself.<br/><b>1996 Dan</b> - Oh.<br/><b>2000 Dan</b> - He did, however, how an AMAZING beard.<br/><b>1996 Dan</b> - Fuckin' A, dude! That's sweet as hell.<br/><b>2000 Dan</b> - I know.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-11-22T09:17:41.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "c",
      "body": "\"that one was obvious, here is another\": 1996 dan had some cheek.     ....still crossed.",
      "created_at": "2004-11-22T14:55:15.000Z"
    },
    {
      "author": "muddgirl",
      "body": "i can't wait till i'm as old as you, and can look back at like, 2004 muddgirl and make fun of her essays. man my essays suck.",
      "created_at": "2004-11-22T15:08:34.000Z"
    },
    {
      "author": "nicole",
      "body": "I'd also like to point out that Dan made up that quote from me. Cheeky monkey. ",
      "created_at": "2004-11-22T18:16:50.000Z"
    },
    {
      "author": "einahpets",
      "body": "Teachers are way too hard. Obviously the no student left behind act hadn't started when you got that 2/20. Now it would be a 12/20 just so you get to pass and move on.",
      "created_at": "2004-11-22T18:39:16.000Z"
    },
    {
      "author": "bjork24",
      "body": "C: Aye, ever the cheeky monkey was I.<br/><br/>Muddgirl: Careful what you wish for. One day you're young, the next day you're almost 25, which is almost 40, which is almost dead! Woe is me!<br/><br/>Nicole: Are you trying to get me arrested for academic dishonesty or something?<br/><br/>Einahpets: It would've helped if I had actually read the assigned text, but I had better things to do. Mainly, sleep.",
      "created_at": "2004-11-22T19:26:15.000Z"
    },
    {
      "author": "Fyse",
      "body": "I don't reckon ageing is linear, though. I have a theory, based on personal experience and observation, that whilst 18 is the same 19 is the same as 20 is the same as 21, 22 is a whole different kettle of fish. I think it's cos if I wasn't a lazy slacker who took a year out, I would have graduated by now.<br/><br/>I don't anticipate getting any older till 30 now. I reckon that's the next big watershed moment when you think 'woah, all my friends have kids and I'm still a bum who sits on my arse all day playing playstation, with a beard'. Less than five years, eh Dan?",
      "created_at": "2004-11-22T21:52:43.000Z"
    },
    {
      "author": "bjork24",
      "body": "Fyse, you're doing an awful lot of reckoning for an Englishman. I don't follow your logic on the non-linear aging, but I do appreciate your shout out to my FABULOUS beard.",
      "created_at": "2004-11-22T22:02:03.000Z"
    },
    {
      "author": "Fyse",
      "body": "I don't suppose there is any logic to it. Just a large dollop of self-delusion.<br/><br/>Dan? We need pictures, and we need them now.",
      "created_at": "2004-11-22T22:33:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "Pictures of what?",
      "created_at": "2004-11-22T22:36:59.000Z"
    },
    {
      "author": "Fyse",
      "body": "Of what?! Your FABULOUS beard of course! It sounds highly amusing. I mean... er... cool. Highly cool.",
      "created_at": "2004-11-22T22:55:53.000Z"
    },
    {
      "author": "bjork24",
      "body": "I don't know. Posting pictures of myself breaks the 4th wall between writer and audience, and, as an actor, surely you can understand.",
      "created_at": "2004-11-22T23:01:42.000Z"
    },
    {
      "author": "Fyse",
      "body": "Huh?!",
      "created_at": "2004-11-22T23:12:09.000Z"
    },
    {
      "author": "bjork24",
      "body": "Just keep your eye on Nicole's photo blog, I'm sure my beard will show up eventually.",
      "created_at": "2004-11-22T23:56:45.000Z"
    },
    {
      "author": "Oz",
      "body": "It's a good idea, envisioning a conversation between yourself then and now.  I might have to use that trick myself.  Five yeras ago, I couldn't have imagined that I'd have the life I have now.",
      "created_at": "2004-11-23T05:36:58.000Z"
    },
    {
      "author": "Tim",
      "body": "Stupid Dimmesdale.",
      "created_at": "2004-11-23T05:57:54.000Z"
    },
    {
      "author": "bjork24",
      "body": "Oz: I'm copyrighting the future/past dialogue, so if you use it, you have to pay me $75,000.<br/><br/>Tim: Fuckin' A, dude!",
      "created_at": "2004-11-23T06:01:39.000Z"
    },
    {
      "author": "whittler",
      "body": "Just make sure you don't touch the 2000 Dan. That would mean anti-matter meeting matter and the world would implode - at least in accordance with Dr Who.",
      "created_at": "2004-11-23T08:44:13.000Z"
    },
    {
      "author": "bjork24",
      "body": "Too late. We already held hands... and he spotted for me while I bench-pressed 39 pounds.",
      "created_at": "2004-11-23T09:19:01.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 14,
      "name": "Dialogue"
    }
  ]
}
