{
  "id": 108,
  "title": "Home for the Holidays",
  "body": "Here comes the SNOW! Just in time for our 3.5 hour roadtrip down to Springfield for Thanksgiving. Yippee! The only thing that could make driving down a multi-lane highway with millions of holiday travelers even more enjoyable, would be doing so in the snow. I can't wait!<br/><br/>Actually, this trip should end up being quite eventful. I finally get to break the news about the theater to my grandparents. Up until now, they've had no idea we were planning on moving down... and for good reason. The only thing that makes my grandmother happy and allows her to sleep well at night, is the knowledge that her favorite grandson has a good paying, stable job. My grandfather bounced from job to job back in his day, much to the chagrin of my grandmother, so keeping up the appearance that all is/was well with MY job was very important. But now it's time to spill the beans. I hope she takes it well. We shall see.<br/><br/>Well, I'm off. Happy Thanksgiving to all... except for those of you who live in England.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-11-25T00:38:33.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Oz",
      "body": "Have a great Thanksgiving!  I hope it's NOT like *Home for the Holidays*!",
      "created_at": "2004-11-25T02:17:20.000Z"
    },
    {
      "author": "Fyse",
      "body": "Hey, can't I have a happy Thanksgiving too? I hear tell it's like Christmas dinner, which is no bad thing in my book.<br/><br/>A friend of mine here has an American girlfirend who was over here studying last year, on an exchange scheme from MIT. Her mother then flew over from the US as a suprise and cooked her daughter, her daughter's boyfriend and <i>all his flatmates</i> a full Thanksgiving dinner. You can imagine the jealousy. It was cold blooded torture, it was...",
      "created_at": "2004-11-25T04:18:43.000Z"
    },
    {
      "author": "stephvoss",
      "body": "Yay! I'm staying at your place tonight with you not there! I'm going to roll all over the floor and be a Bogie hair magnent...and then eat all your food.",
      "created_at": "2004-11-25T06:16:24.000Z"
    },
    {
      "author": "Newell",
      "body": "Mmm... Boxing Day.",
      "created_at": "2004-11-25T08:17:09.000Z"
    },
    {
      "author": "Mark",
      "body": "\"except for those of you who live in England\"<br/><br/>Harsh man, harsh.<br/><br/>Mark<br/>Manchester, UK ",
      "created_at": "2004-11-25T18:45:19.000Z"
    },
    {
      "author": "bjork24",
      "body": "Oz: I hope it's not like that movie too!<br/><br/>Fyse: People in England can't have a Happy Thanksgiving... you guys made your bed roughly 400 years ago when the Pilgrims had to flee the mother land... now you have to sleep in that bed. Sans Thanksgiving turkey. Mmmm, Thanksgiving Turkey.<br/><br/>Steph: If you can get 20% of the hair on the floor, I'll buy you dinner at Stir Crazy on Sunday night.<br/><br/>Newell: What's the traditional Boxing Day food?<br/><br/>Mark: See the reply to Fyse's post. You dirty Brit!<br/><br/>*not: Ha ha, just kidding about the British thing. I love all Brits... and I mean ALL of them.",
      "created_at": "2004-11-25T22:18:25.000Z"
    },
    {
      "author": "Fyse",
      "body": "Ooh, this talk of beds reminds me of 'pig in a blanket'. D'you have those with Thanksgiving dinner? It's little sausages wrapped in bacon. Simply scrumptious...",
      "created_at": "2004-11-26T04:40:57.000Z"
    },
    {
      "author": "Newell",
      "body": "Uh... cardboard???",
      "created_at": "2004-11-26T08:09:46.000Z"
    },
    {
      "author": "nicole",
      "body": "I'd move to the UK in 10 seconds if it weren't for the whole quarantine-my-dog-for-six-months thing. I mean, London has something like FOUR Lush stores. Can you believe it? ",
      "created_at": "2004-11-28T00:06:40.000Z"
    },
    {
      "author": "Shannon",
      "body": "Hope you had a wonderful Thanksgiving and that breaking the news wasn't too difficult.  I have some news to break to my parents that I know they aren't going to like.  Luckily for me, I wasn't able to make it home for Thanksgiving, so I've been delaying the inevitable.  <br/><br/>After all, isn't that what holidays are all about?  Well, that and the turkey.  Mmm...turkey.  ",
      "created_at": "2004-11-28T21:45:27.000Z"
    },
    {
      "author": "Oz",
      "body": "LOL at the blog's new masthead!",
      "created_at": "2004-11-29T20:05:52.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Oz. I've had that up there for the last two weeks, and you're the first person to notice.",
      "created_at": "2004-11-29T20:12:01.000Z"
    },
    {
      "author": "justin",
      "body": "I noticed it, I just refused to comment.",
      "created_at": "2004-11-29T20:16:01.000Z"
    },
    {
      "author": "bjork24",
      "body": "That's just like you, Justin.",
      "created_at": "2004-11-29T20:18:10.000Z"
    },
    {
      "author": "whitty",
      "body": "Hey!  I noticed and asked where Benzo went!  No props for whitty. <br/><br/>So, has all the finger crossing done any good?  Any news?",
      "created_at": "2004-11-29T21:02:04.000Z"
    },
    {
      "author": "bjork24",
      "body": "Whitty! That's true, you did ask where Benzo was... so you get props for being the first reader to notice the new header. As for the news... more on that soon.",
      "created_at": "2004-11-29T21:32:01.000Z"
    },
    {
      "author": "justin",
      "body": "Could I get props for second to notice?  And by props, I mean \"propellers.\"  I want you to give me a large boat propeller.",
      "created_at": "2004-11-29T22:43:00.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    }
  ]
}
