{
  "id": 109,
  "title": "Leaving on a jet plane",
  "body": "My director has deemed it necessary to send me to Philadelphia to train a couple \"generic co-workers\" in the fine art of maintaining the horrendously archaic application suite I wrote for the department. My plane leaves in a little less than six hours, and I feel like crap.<br/><br/>I spent the majority of my Thanksgiving break working on the house we're going to be inhabiting in Springfield. The house was built sans-insulation, so I spent most of Friday ripping off sheetrock from all the exterior walls. The house also sags towards the center, thanks to a shoddy central heating and air installation, so I spent most of Saturday rolling around in the spider-infested crawlspace trying to build several composite beams that would correct the house's terrible posture. Sunday was spent putting up insulation and new sheetrock on all the walls I had demolished on Friday.<br/><br/>To make a long story short, my lungs and throat are triple coated with sheetrock dust, 40 year old dust, cobwebs, cricket legs, fiberglass insulation, and brown gravy. I went to the doctor this morning and he prescribed some throat medicine and cough suppressants for me. The cough suppressants have narcotics in them, so I'll probably be arrested at the airport when I try to bring them on board.<br/><br/>Also, I never got a chance to break the news to my grandparents about the theater. My grandfather came down with an upper respiratory infection on Thanksgiving and wasn't feeling up to visitors for the duration of our visit. They know we're moving down, they just don't know for what reason. Either way, they'll figure it out sooner or later. We'll be down for good in less than a month.<br/><br/>In theater-related news, the Generic Springfield Bank guy sent our loan request to the SBA early last week. Unfortunately, the SBA sent it back with a request for more information from our guarantors (a.k.a. our moms). Our moms filled out the requested forms and refaxed them to the Generic Springfield Bank guy on Friday. The loan was again sent off to the SBA late Friday. So, if you haven't crossed your appendages yet, do so now, and for those of you who have already crossed every limb, mini-limb, and limb of a limb on their body, cross them tighter and hold.<br/><br/>My throat hurts like none other, so I'm going to cut this short. I'm not sure if I'll be able to update the blog while I'm away over the next couple days, so please take a moment to peruse some of the fine quality links in the link bucket. I highly recommend Nicole's photo blog (<a href=\"http://tapioca.urlblue.com/photos\" target=\"_blank\" class=\"broken\">Fresh as Paint</a>), not because she's my wife, but because she takes pretty pictures. She spent the weekend steaming wallpaper at our house in Springfield. What a trooper!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-11-29T23:05:19.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Dave Adams",
      "body": "Wow, sounds like an exhausting weekend.  Yet it's great to be so productive.  What area of town are you guys moving to?",
      "created_at": "2004-11-30T00:21:29.000Z"
    },
    {
      "author": "bjork24",
      "body": "We'll be on the SW side of town. I would be more specific, but since this is the internet and all, I don't want people showing up on at door. Suffice it to say, we're close to a Wal-Mart Supercenter AND a nudie bar.",
      "created_at": "2004-11-30T00:24:43.000Z"
    },
    {
      "author": "nicole",
      "body": "Nudie bar! Nudie bar! AND the Adult Video store!",
      "created_at": "2004-11-30T00:42:45.000Z"
    },
    {
      "author": "Rachel",
      "body": "I'll pay you $25 for those narcotic drops!",
      "created_at": "2004-11-30T01:21:03.000Z"
    },
    {
      "author": "bjork24",
      "body": "Nicole: Great! Now everyone knows where we live!<br/><br/>Rachel: Drops?! It's a gigantic jar, like the kind you buy pickles in at Sam's Club or Costco.",
      "created_at": "2004-11-30T01:23:07.000Z"
    },
    {
      "author": "Dave",
      "body": "\"It's a gigantic jar, like the kind you buy pickles in at Sam's Club or Costco.\"<br/><br/>tie a rope to it and wear it around your neck like Bill Murray in 'What About Bob'. Airport security will think you're just a harmless eccentric and wave you right on through.",
      "created_at": "2004-11-30T01:38:45.000Z"
    },
    {
      "author": "bjork24",
      "body": "I haven't seen that movie in FOREVER, but I will pretend I have and say, \"Yeah, I know what you mean.\"",
      "created_at": "2004-11-30T01:41:29.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Oh, I was just vaguely curious.  I wondered with all the work you'd done if you'd picked up a fixer-upper in the West Central neighborhood just off downtown.  It would have been nice and close to the theatre.<br/><br/>Haven't you talked about your cars on here?  I now have more than enough info to stalk you.",
      "created_at": "2004-11-30T01:42:40.000Z"
    },
    {
      "author": "bjork24",
      "body": "You're writing from my home computer, aren't you?",
      "created_at": "2004-11-30T01:45:19.000Z"
    },
    {
      "author": "nicole",
      "body": "Nudie bars! Nudie bars!",
      "created_at": "2004-11-30T01:55:52.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ok ok! You can work at one if you want! Geez!",
      "created_at": "2004-11-30T01:58:56.000Z"
    },
    {
      "author": "justin",
      "body": "Mmm...nudie bars.",
      "created_at": "2004-11-30T02:38:20.000Z"
    },
    {
      "author": "bjork24",
      "body": "Indeed.",
      "created_at": "2004-11-30T02:47:12.000Z"
    },
    {
      "author": "whitty",
      "body": "It frightens me that I know that area better than I should... oh, my sordid past.",
      "created_at": "2004-11-30T03:55:05.000Z"
    },
    {
      "author": "whittler",
      "body": "Composite beams. Full on! They sound load bearing. I know boats!",
      "created_at": "2004-11-30T04:36:11.000Z"
    },
    {
      "author": "Oz",
      "body": "Wow, that home improvement stuff sounds torturous!  Are you buying this place?  Renting?  That's a lot of work to put into a rental.  So you're coming to my fair city, eh?  Now that I think about it, there is a different aura around here.....",
      "created_at": "2004-12-01T02:32:41.000Z"
    },
    {
      "author": "Chuck",
      "body": "I tell ya - you start a new website and nobody ever adds you to their link pool. For shame, Dan. :)",
      "created_at": "2004-12-02T00:24:27.000Z"
    },
    {
      "author": "Oz",
      "body": "Yer a ballsy one, Chuck.  I don't see a link to the Moxie on your blog.",
      "created_at": "2004-12-02T19:46:02.000Z"
    },
    {
      "author": "bjork24",
      "body": "The Oz speaks true.",
      "created_at": "2004-12-02T19:47:51.000Z"
    },
    {
      "author": "Chuck",
      "body": ":) I'm an up-and-coming young blog. ",
      "created_at": "2004-12-03T21:28:52.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 13,
      "name": "Other job"
    }
  ]
}
