{
  "id": 11,
  "title": "Blogs of Note",
  "body": "I was just informed by Chuck of <a href=\"http://www.caliblog.com\" target=\"_blank\" class=\"broken\">Caliblog</a> that Cinema 24 has being listed as a blog of note on <a href=\"http://www.blogger.com\" target=\"_blank\">Blogger</a>. I don't know what to say... a little over a week ago <a href=\"http://www.justinglow.com\" target=\"_blank\">Justin</a> was my only loyal reader and no one had even heard of this site. Now I'm getting comments and I don't know what to do. I guess I'll have to start proofing my blog a bit closer now. I usually don't post on the weekend, but I felt this was blog-worthy.\r\n\r\nAs far as theater progress goes, the mini business plan is done, except for the executive summary, and we're currently working like mad to finish the BIG business plan before we go to Midwestburg on the 14th for the <a href=\"/posts/7\">film forum</a>. Before the forum, Nicole and I will be meeting with a gentleman from a very large bank to discuss finances. I won't say our theater hinges on the success of this meeting, but I won't deny its enormity either. I have a nervous stomach, so let's hope I can restrain myself from puking all over this guy's desk.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-06-06T19:41:46.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Penni",
      "body": "Congrats on being a blog of note!",
      "created_at": "2004-06-11T23:25:30.000Z"
    },
    {
      "author": "Hellman Jackson",
      "body": "so far I have spotted a number of serious errors that are entirely unacceptable. Please kill yourself immediately.",
      "created_at": "2004-06-11T23:25:50.000Z"
    },
    {
      "author": "Brian",
      "body": "Congratulations on the listing... yours looks like one that might be worth following along. Good luck with the theater!",
      "created_at": "2004-06-11T23:26:08.000Z"
    },
    {
      "author": "Mr Emu Sing",
      "body": "Wouldn't have found you unless you were a blog of note, it's well deserved. I look forward to following your progress in establishing yourself as an independant exhibitor. If the US is anything like the UK it's an uphill struggle!",
      "created_at": "2004-06-11T23:26:32.000Z"
    },
    {
      "author": "Goose",
      "body": "Though a I work for a major studio here in LA, making me the Wal-Mart to your metaphorical Mom-and-Pop venture (really, for that to be the case I'd have to own a Regal Cinemas or something, but let's not argue), I wish you the ultimate success in your journey.\r\n\r\nMay I make a small suggestion? Take at least 50% of your available operating budget and blow it all on advertising for your first three months. The market for smaller theaters is out there - you simply have to let them know you exist. Sure, you might have to bite the bullet and play a couple of safe films (Bergman, Fellini, etc.) to get kickstarted, but it'll come. I can safely say that I know a bucketfull of people who would watch \"The Cabinet of Dr. Caligari\" on Halloween. Before drinking commences.\r\n\r\nI'm sure I'm repeating things you've already considered. As a film student and screenwriter I'm excited for you. If I can be of any help, please get in touch with me via my blog (http://goosetown.blogspot.com). I've participated in the race to finance a few independent films and may be able to point you in the direction of potential investors.",
      "created_at": "2004-06-11T23:26:52.000Z"
    },
    {
      "author": "Will",
      "body": "Great site. Just found you through Blogs of Note. I'm going to offer a completely impractical suggestion - on-site day care. My wife and I would take in about 10 times the number of movies we do now if there was some viable option for our daughter (we're of the camp that says screaming kids and films don't go together - we seem to be in the minority). I know, completely ridiculous, but my wife is actually contemplating opening a gym with an attached day care. We'd also pay double the ticket price for this luxury. Now what's up with this no-butter shit? I'm a popcorn fanatic, but it ain't no good without no butta.",
      "created_at": "2004-06-11T23:27:15.000Z"
    },
    {
      "author": "Cedar",
      "body": "Found you because you are a \"Blog of Note\". Congratulations.\r\n\r\nI'm on the board of directors for an independent/foreign film group in the Washington DC area and will bookmark your blog and site for future reference. Thanks so much for your blog!",
      "created_at": "2004-06-11T23:27:35.000Z"
    },
    {
      "author": "Kimya",
      "body": "I finished my latest entry and decided to check out the \"blogs of note.\" Yours is a very interesting one, to say the least.  Good luck on owning your theatre.  I look forward to reading more about your journey to ownership.  Congratulations on being a blog of note.  I didn't read the other comments, so maybe someone else said it first,but...One suggestion: as a mother of four, it would be nice if there were Mommy Days.  At one of the local arthouse theatres here, on Mommy Days, children are most welcome--crying babies and all.  It makes it easy for me, a single mother to enjoy a film and nurse my youngest, while exposing my older ones to a bit of culture.",
      "created_at": "2004-06-16T08:08:25.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
