{
  "id": 110,
  "title": "Just flew in...",
  "body": "... and boy are my arms tired! Also, I just received this e-mail from the Generic Springfield Bank guy (I thought it might be a little post-worthy):<br/><br/>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -<br/><br/>Good news, the SBA has approved your request.  The loan amount will be $25,000, with the rate of prime plus 2.75% adjusting monthly.  The SBA fee is $425, which has to be paid at closing.  [Generic Springfield] Bank’s fee will be $200, plus some UCC filing fees.  The loan term is for 7 years and all funds must go to purchase equipment.  We will need a list and description (with serial numbers) of all equipment purchased with a value of $500 or more.  You, Nicole, [mom 1] and [mom 2] will all be guaranteeing the note.  The equipment will need to be insured, we have a commercial insurance department that can assist with that if needed.  I will also need copies of all your LLC papers, and business license.  Ann [Omit] at the city will need to send me verification of their loan and that loan needs to close and fund either the same day or before ours and they will need to allow us to be in first lien position on the business assets (that is standard).  At or before close, you will need to furnish proof of your $10,000 cash injection.  I know this sounds like a lot, but it is all standard on these deals.  My colleague, Paulette [Omit], will help coordinate the processing and closing of your loan.  Please get the above information to her or I as it becomes available.<br/><br/>Thanks and congratulations on the start of a new business venture.<br/><br/>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -<br/><br/>I think Nicole and I might go out and celebrate.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-12-02T07:23:30.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Aaron",
      "body": "HOLEEEE SHIT!<br/><br/>So is that \"the\" loan? Wait, that's just $25k, right? Another $50k to go? Give me a running tally, right now.<br/><br/>Anyway, that's great to hear! BRING ME SOME MOXIE!<br/><br/>Speaking of which, I saw the word \"moxie\" in an issue of Time the other day...word is getting 'round.",
      "created_at": "2004-12-02T08:16:49.000Z"
    },
    {
      "author": "bjork24",
      "body": "It's the first 43% of the loan, the next 43% comes from the SFDC, but they couldn't give that to us until we had the SBA loan. The last $10,000 comes out of our tiny little pockets.",
      "created_at": "2004-12-02T08:19:40.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Whoa! Congrats, Dan and Nicole! That's thrilling news!  For you and for us!",
      "created_at": "2004-12-02T09:52:08.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thrilling news for EVERYONE!",
      "created_at": "2004-12-02T10:07:41.000Z"
    },
    {
      "author": "muddgirl",
      "body": "Congratulations! You've had all my best wishes recently...",
      "created_at": "2004-12-02T10:41:55.000Z"
    },
    {
      "author": "Mark",
      "body": "Congrats-a-bloody-lations!<br/>It's free Moxies all round!<br/><br/>M",
      "created_at": "2004-12-02T17:14:31.000Z"
    },
    {
      "author": "einahpets",
      "body": "Yay! Can I come help celebrate? I'm good at that...",
      "created_at": "2004-12-02T18:55:48.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks for all the CONGRATS guys!",
      "created_at": "2004-12-02T19:24:20.000Z"
    },
    {
      "author": "Oz",
      "body": "That is super-duper-fucking-cool!  I'll have to plan a springtime trip to Springfield (I know how you love aliteration) and check out the new hotspot!",
      "created_at": "2004-12-02T19:43:45.000Z"
    },
    {
      "author": "bjork24",
      "body": "Woo hoo!",
      "created_at": "2004-12-02T19:47:31.000Z"
    },
    {
      "author": "justin",
      "body": "yay!",
      "created_at": "2004-12-02T20:26:59.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Oh...congratulations, you guys!  If not for the extreme cold, I'd wear my The Moxie tank top in celebration....but, brrrr....",
      "created_at": "2004-12-02T20:31:33.000Z"
    },
    {
      "author": "Mark Maynard",
      "body": "I'm so happy for you guys. I really do hope things continue to go well.",
      "created_at": "2004-12-02T21:03:40.000Z"
    },
    {
      "author": "John",
      "body": "Congrats! You guys should go out and see a movie to celebrate.",
      "created_at": "2004-12-02T22:28:30.000Z"
    },
    {
      "author": "Fyse",
      "body": "Woot woot!!<br/><br/>Now, where can I steal a transatlantic plane ticket from? Hmmmmm...",
      "created_at": "2004-12-02T23:28:04.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'm drowning in congratulations... help! Help! Help! No, seriously, keep it up.",
      "created_at": "2004-12-03T01:27:46.000Z"
    },
    {
      "author": "Brandon",
      "body": "As if it hasn't been said enough,<br/><br/>Congrats, guys.  You inspire me.",
      "created_at": "2004-12-03T18:34:45.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Brandon!",
      "created_at": "2004-12-03T19:29:14.000Z"
    },
    {
      "author": "whitty",
      "body": "A little late, but I say 'Hoorah!' for purely selfish reasons - more movies for me!  Oh, and congrats to you as well.  I had total confidence that it would work out for the (my) best!  Now the hard stuff.",
      "created_at": "2004-12-03T22:36:05.000Z"
    },
    {
      "author": "Chris Love",
      "body": "Starting a theater is something I've wanted to do for years. I started reading your blog from the beginning today. Thanks for writing about your experiences. It's giving me hope that I might be able to do it, too!<br/><br/>Congrats on the loan a year and 3 months ago! Don't tell me what happens next!",
      "created_at": "2006-03-25T04:14:29.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
