{
  "id": 111,
  "title": "Quicksand",
  "body": "You never realize how much work starting a small art-house theater is until the government hands you a check and says, \"get to work.\"\r\n\r\n*note: I couldn't think of a name for this little thought, so I used the title of the song that's playing on my iPod right now.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-12-03T01:26:31.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "einahpets",
      "body": "I'll help. I work 3 out of 40 hours a week.",
      "created_at": "2004-12-03T01:45:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "I hope your boss doesn't read that.",
      "created_at": "2004-12-03T01:47:48.000Z"
    },
    {
      "author": "nicole",
      "body": "My part of the process is being kicked into high gear! Ordering food! Making business alliances! Writing press releases! Painting the walls red! Finding artists who want to display their work! Looking for furniture! Buying a new calendar! Applying for business licenses! It just doesn't stop!",
      "created_at": "2004-12-03T01:55:23.000Z"
    },
    {
      "author": "bjork24",
      "body": "It never stops!",
      "created_at": "2004-12-03T01:59:02.000Z"
    },
    {
      "author": "Fyse",
      "body": "I've been following your blog for something like five months now, and I'm in awe of how much you've achieved so far. I'm sure you'll hurdle all remaining barriers just as succesfully. Once again...\r\n\r\nWoot woot!!",
      "created_at": "2004-12-03T04:27:57.000Z"
    },
    {
      "author": "bjork24",
      "body": "Aw shucks, Fyse. Thanks for the compliment!",
      "created_at": "2004-12-03T05:10:44.000Z"
    },
    {
      "author": "John",
      "body": "I'm in awe of how much you've accomplished too; it's inspiring to see all the hard work paying off. \r\n\r\n(And since one of my dreams would be to open up a little movie theater in Homer, Alaska, I feel like I'm learning what half the battle would be like)",
      "created_at": "2004-12-03T10:17:34.000Z"
    },
    {
      "author": "Oz",
      "body": "Yes, there is something terrifying about your dreams becoming a reality.  Living them in your head is wonderful!  Living them in reality is terrifying!  I'm actually thinking about doing something huge too, but unlike you, I seriously doubt I'm courageous enough to do it.  Most likely, my dream will just live in my head.\r\n\r\nPS  Nice new masthead man. :)",
      "created_at": "2004-12-03T18:49:42.000Z"
    },
    {
      "author": "bjork24",
      "body": "John: Whenever you need any help on your theater in Homer, Alaska, you know where to turn... the Homer Chamber of Commerce.\r\n\r\nOz: The is something very scary about your dreams becoming a reality. I once had a dream that Bjork and I were swimming in a pool and we were kissing underwater and then babies started to appear everywhere. I'm not sure if they were my and Bjork's kin, but I refuse to kiss underwater anymore, just to be safe.",
      "created_at": "2004-12-03T19:26:32.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Homer?  I have a friend who lives in Seldovia!",
      "created_at": "2004-12-04T08:56:56.000Z"
    },
    {
      "author": "Chuck",
      "body": "Much love, Dan. ",
      "created_at": "2004-12-04T17:45:08.000Z"
    },
    {
      "author": "Shannon",
      "body": "I know it must be a lot of hard work, but how rewarding to be putting all that work into something you truly love...I'm very envious of the great opportunity you have to do that.  We should all be so lucky.  \r\n\r\nBest of luck with everything!",
      "created_at": "2004-12-05T08:16:38.000Z"
    },
    {
      "author": "Mark",
      "body": "I've applied for a job as Cinemas Administrator at my local art house cinema, the Cornerhouse.\r\n\r\nhttp://www.cornerhouse.org/recruitment/CinemasAdministrator-Details.doc\r\n\r\nWish me luck\r\n\r\nM",
      "created_at": "2004-12-06T18:31:22.000Z"
    },
    {
      "author": "bjork24",
      "body": "That looks like a sweet job, Mark. Good luck and have fun!",
      "created_at": "2004-12-06T19:15:20.000Z"
    },
    {
      "author": "Mark",
      "body": "Thanks Dan. Maybe we can do business in the future?\r\n\r\nM",
      "created_at": "2004-12-06T22:33:07.000Z"
    },
    {
      "author": "bjork24",
      "body": "Perhaps.",
      "created_at": "2004-12-06T22:54:49.000Z"
    }
  ],
  "categories": [
    {
      "id": 12,
      "name": "Thoughts"
    }
  ]
}
