{
  "id": 112,
  "title": "This is a strange one",
  "body": "You're going to hate me for this.<br/><br/>There's currently something going on with the theater that I'd love to write about, but I can't. There's a slight chance that by writing about it here on the blog, we'd be giving away too much, too quickly. If all goes well, I should be able to share it with you in the very near future, but for right now, we'll all have to chill and wait it out.<br/><br/>So if I wasn't going to tell you in the first place, why did I even bring it up? Well, that's a good question. I briefly considered not mentioning it at all, but then I changed my mind. Partly because I couldn't think of anything else to write (this latest development is the only thing on my mind), and I also wanted to leave a marker so I could refer back to this post when I finally reveal what's going on.<br/><br/>Now, to help you earse this post from your head so you won't be worrying about the fate of the Moxie all day, here's a joke:<br/><br/>Q: What did the blonde say when she opened a box of Cheerios?<br/>A: Wow, donut seeds!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-12-06T20:14:11.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "Did you find a large bag of cash in the vault?",
      "created_at": "2004-12-06T20:21:15.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yes. Damn, you're good!",
      "created_at": "2004-12-06T20:29:30.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "You sent Nicole to the casinos to \"invest\" the loan proceeds before you have to pay for the equipment, didn't you?  Tsk, tsk.",
      "created_at": "2004-12-06T20:34:59.000Z"
    },
    {
      "author": "einahpets",
      "body": "Here's a blond joke for all (my favorite at the moment).<br/><br/>A blond girl came home from kindergarten and was so proud of her counting lesson that she told her mom all about it.<br/><br/>Mom, we learned to count at school today and the class could only count to 5 and I could count to 6. Is that because I'm blond?<br/><br/>Yes, it's because you're blond.<br/><br/>The next day, the daughter came home so happy because she could say the alphabet to G when the other kids could only get to E.<br/><br/>Is that because I'm blond? She asked.<br/><br/>Yes, it's because you're blond, the mom said.<br/><br/>On the third day, the daughter came home so proud because in gym, all the other girls had flat chests and she had a 36 C. See mom! I have a huge chest and the other girls don't. Is this because I'm blond?<br/><br/>No, it's because you're 24, said the mom.",
      "created_at": "2004-12-06T20:36:22.000Z"
    },
    {
      "author": "bjork24",
      "body": "Dave: Close, but not quite.<br/><br/>Einahpets: That's classic!",
      "created_at": "2004-12-06T20:39:03.000Z"
    },
    {
      "author": "Oz",
      "body": "I played this game with my mother this weekend.  I said, \"Oh, I found a really cool Christmas present for you...but of course I can't tell you what it is.\"  Later that day (we were at the mall) she had a bag in her hand and said, \"You can't look in here--it's a present for you and it's great.\"  And now you, Dan?   For shame!",
      "created_at": "2004-12-06T21:19:01.000Z"
    },
    {
      "author": "bjork24",
      "body": "Turst me, after I divulge what's going on, you'll all understand why I had to keep the info on the down-low. Don't hate me because I'm beautiful.",
      "created_at": "2004-12-06T21:22:15.000Z"
    },
    {
      "author": "whitty",
      "body": "Can't you even say if it is bad or good?  Or will I have to name my next ulcer Moxie?",
      "created_at": "2004-12-06T21:26:49.000Z"
    },
    {
      "author": "bjork24",
      "body": "Whitty: I can't say with any certainty whether it's good or bad at this point. Don't you worry, you'll still get your Moxie. In fact, I might need to enlist your help in the coming days. Stay tuned.",
      "created_at": "2004-12-06T21:28:43.000Z"
    },
    {
      "author": "Dave",
      "body": "I KNOW! Brad Pitt and Jennifer Aniston, selling popcorn on opening night. <br/><br/>I got it, didn't I? If you don't respond I'll assume I got it. So just don't respond and I'll know it's all good.",
      "created_at": "2004-12-06T22:00:30.000Z"
    },
    {
      "author": "bjork24",
      "body": "Dave: The first rule about the Moxie is you do not talk about the Moxie. The second rule about the Moxie is if you're new here, you have to serve popcorn. The third rule about the Moxie is Dan is AWESOME, and you do not talk about the Moxie.",
      "created_at": "2004-12-06T22:03:26.000Z"
    },
    {
      "author": "Oz",
      "body": "Isn't one of the rules that everyone involved with the Moxie must look for Dan's hat?",
      "created_at": "2004-12-06T23:52:50.000Z"
    },
    {
      "author": "bjork24",
      "body": "It is now.",
      "created_at": "2004-12-07T00:02:21.000Z"
    },
    {
      "author": "Tim",
      "body": "I bet you're going to tell us that you woke up this morning and discovered the Moxie was all a dream, Newhart-style.",
      "created_at": "2004-12-07T02:30:54.000Z"
    },
    {
      "author": "bjork24",
      "body": "Not quite, but I'm filing that for when I need to close everything down.",
      "created_at": "2004-12-07T02:39:48.000Z"
    },
    {
      "author": "matt",
      "body": "alls i'm saying is that if it does or doesn't work out, good or bad, you have to say what it was.  people drop bombs like this sometimes, and then when it doesn't work out, they never go back and say, 'oh yeah, that thing i mentioned, it wasn't so cool.'  so please, i'm sure it'll be cool, but you have to at least say!",
      "created_at": "2004-12-07T03:27:54.000Z"
    },
    {
      "author": "bjork24",
      "body": "Matt, you have my word. I promise I'll reveal what's going on as soon as the time is right. Good or bad.",
      "created_at": "2004-12-07T03:43:39.000Z"
    },
    {
      "author": "Fyse",
      "body": "I've got a great joke, but I just realised that it wont mean anything to you Yanks. I'm guessing you don't even know who Alex Ferguson and Ruud Van Nistelroy are, though you may have heard of David Beckham.<br/><br/>So in conclusion, that was a pointless comment.<br/><br/>You're a cruel man, torturing us like this. Do you think you're writing a script for a soap opera? Every post must contain a cliff-hanger?",
      "created_at": "2004-12-07T05:05:12.000Z"
    },
    {
      "author": "bjork24",
      "body": "Fyse, don't act like you don't like it.",
      "created_at": "2004-12-07T05:19:19.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
