{
  "id": 113,
  "title": "This is a call...",
  "body": "Dear Springfield readers,\r\n\r\nIf you've been keeping silent about the Moxie up until now, do so no longer. It's time to start spreading the word - get a good street-level buzz going. Go climb on top of the nearest roof and/or tree and yell it from there. Shake hands with the person beside you (unless, of course, you're reading this in a public restroom) and let them know where you'll be seeing great independent film in 2005. Let the Moxie ring from the Home Depot on the South side to the Lowes on the North side, from Justice Jewelers in the East to Paradise Adult Superstore in the West. Make every cashew chicken joint jittery with excitement and anticipation for the Moxie's coming. We can do this!\r\n\r\nGo team Springfield, GO!\r\n\r\nSincerely,\r\nDan\r\n\r\nPS - for all you non-Springfieldians, keep doing what you're doing... but with more MOXIE!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-12-07T22:55:36.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Dave Adams",
      "body": "This is why I want that gray t-shirt!",
      "created_at": "2004-12-07T22:58:41.000Z"
    },
    {
      "author": "bjork24",
      "body": "Dave: when I get back from lunch, I'll see what I can do about getting you a gray Moxie shirt.",
      "created_at": "2004-12-07T23:00:18.000Z"
    },
    {
      "author": "Aaron",
      "body": "Wait, who else is on team Springfield?\r\n\r\nThis will most likely run in this week's SBJ. I have a space for it on page 9.",
      "created_at": "2004-12-07T23:31:43.000Z"
    },
    {
      "author": "Nicole",
      "body": "Will you send us any articles, Aaron?",
      "created_at": "2004-12-07T23:43:00.000Z"
    },
    {
      "author": "bjork24",
      "body": "All Springfieldians are on team Springfield, Aaron. You're just the most prolific of them.",
      "created_at": "2004-12-07T23:48:29.000Z"
    },
    {
      "author": "Aaron",
      "body": "Yes. I can even offer you a four week trial subscription!",
      "created_at": "2004-12-07T23:57:22.000Z"
    },
    {
      "author": "bjork24",
      "body": "I don't think we'll need the trial subscription. Nicole's dad is a subscriber and he saves them for us. Thanks for the offer though!",
      "created_at": "2004-12-08T00:04:19.000Z"
    },
    {
      "author": "einahpets",
      "body": "Springfield township is the township right next to mine in Ohio. I'll go and shout out the news to them.",
      "created_at": "2004-12-08T00:43:04.000Z"
    },
    {
      "author": "bjork24",
      "body": "Most excellent.",
      "created_at": "2004-12-08T00:49:00.000Z"
    },
    {
      "author": "whitty",
      "body": "Hey, I am prolific.  \r\n\r\nAnd I didn't know we were supposed to be keeping mum about the Moxie.  Um, I've been telling everyone I know.  Admittedly, that really isn't alot of people.  Now I shall continue to do so but with more gusto... or moxie, whichever.",
      "created_at": "2004-12-08T01:14:42.000Z"
    },
    {
      "author": "bjork24",
      "body": "Whitty: Yes, you are prolific. Aaron's just been around a lot longer. Your support is much appreciated!",
      "created_at": "2004-12-08T01:21:16.000Z"
    },
    {
      "author": "whitty",
      "body": "Well, I was thinking prolific as in like abundant.  All the fellas say, 'that whitty sure is abundant.'  Okay, I am rambling and obviously avoiding work so I will finish this worthless comment with: YAY for the Moxie!",
      "created_at": "2004-12-08T01:34:08.000Z"
    },
    {
      "author": "bjork24",
      "body": "And YAY for Whitty!",
      "created_at": "2004-12-08T01:39:10.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "I'm just teasing you, Dan.  Don't make a special effort for my hue needs.",
      "created_at": "2004-12-08T02:20:50.000Z"
    },
    {
      "author": "bjork24",
      "body": "That's a good thing, Dave, b/c CafePress didn't have any gray shirts. Those bastards!",
      "created_at": "2004-12-08T02:24:34.000Z"
    },
    {
      "author": "whittler",
      "body": "Hey Dan, which Springfield is it (what state?)? I'm a bit of an atlas-head.",
      "created_at": "2004-12-08T03:13:52.000Z"
    },
    {
      "author": "nathan springer",
      "body": "hey dan i am a student at sms and i was want to do my final story in my journalism class about the moxie, if there is any way i could get some more info from you write me an e-mail with some kind of contact info. if it is good enough it will be published in the student paper or the news leader, thanks.",
      "created_at": "2004-12-08T08:30:07.000Z"
    },
    {
      "author": "bjork24",
      "body": "Whittler: Springfield, Missouri. Home of Brad Pitt, Cashew Chicken, and the Simpsons.\r\n\r\nNathan: Check your e-mail.",
      "created_at": "2004-12-08T18:41:57.000Z"
    },
    {
      "author": "Oz",
      "body": "I'm doing what I'm doing.  I feel so left out.",
      "created_at": "2004-12-08T20:57:47.000Z"
    },
    {
      "author": "bjork24",
      "body": "Don't feel left out, Oz. You're still my number one commenter!",
      "created_at": "2004-12-08T21:02:35.000Z"
    },
    {
      "author": "Lor",
      "body": "Alas, I am too far away from Springfield to shout about it. I'm pretty sure I could set up some form of large megaphone to spread the word, but it might take me a while to organise.",
      "created_at": "2004-12-08T21:07:20.000Z"
    },
    {
      "author": "bjork24",
      "body": "Do what you can, Lor.",
      "created_at": "2004-12-08T21:11:13.000Z"
    },
    {
      "author": "Nicholas",
      "body": "Congrats all! Your info is now onlinein a press release at missourifilm.com so everyone in the Film Alliance can get excited.",
      "created_at": "2004-12-09T01:22:54.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Nick! I was looking all over for that link...",
      "created_at": "2004-12-09T01:33:27.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
