{
  "id": 114,
  "title": "Let the press roll",
  "body": "As first posted and written by <a href=\"http://tapioca.urlblue.com/2004/12/moxie-cinema-press-release-1.html\" target=\"_blank\" class=\"broken\">Nicole</a>:<br/><br/>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - <br/><br/>For Immediate Release<br/><br/>Contact:<br/>Dan the Man<br/>Moxie Cinema, LLC<br/>314.867.5309<br/><br/>Springfield’s premiere art-house theater opens early 2005<br/><br/>Springfield, MO, December 5, 2004: Springfield movie lovers now have a reason to celebrate. Moxie Cinema, Springfield’s premiere independently owned art-house theater opens its doors in early 2005.<br/><br/>Located downtown at 408 West Walnut Street, Moxie Cinema’s mission is to create a unique and inviting venue for the exhibition of smaller, lesser-known films that have traditionally been unattainable in the Springfield market. By providing intriguing film series and offering a cinematic experience that differentiates itself from the typical multiplex affair, the Moxie will create a one-of-a-kind service that will benefit the downtown community along with the rest of the metropolitan area.<br/><br/>Along with showing films, the Moxie also serves as an art gallery, displaying works from local and regional artists, as well as a wine bar, where patrons can enjoy a glass of beer or wine during their show.<br/><br/>Springfield native Dan the Man, along with his wife Nicole, are owners and operators. They have based the Moxie after Ragtag Cinemacafé, an independent theater located in Columbia, MO. “The Moxie will address a long-standing void of smaller, independent films in the Springfield market,” the Man says. “Knowing the type of success these theaters have seen across the nation, and given our own love of movies, it had always been a dream of ours to move back to Springfield and open one downtown.”<br/><br/>To help book films that fit the Springfield market, the owners are working closely with founding Ragtag Cinemacafé member Paul Sturtz, along with the newly formed Missouri Film Alliance of Springfield.<br/><br/>“This is the most exciting development in Springfield’s cultural arts scene in 50 years, when there used to be an arts cinema at the Kickapoo theater on Commercial Street,” says William Brandon Bowman, Director of An Arts Patronage and member of the Missouri Film Alliance of Springfield.<br/><br/>Tentative opening for Moxie Cinema is mid-February, 2005.<br/><br/>####",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-12-09T01:40:08.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Dave Adams",
      "body": "*marks calendar*<br/><br/>I'll be standing outside the door on February 15.",
      "created_at": "2004-12-09T01:58:04.000Z"
    },
    {
      "author": "bjork24",
      "body": "Me too! But I'll be standing INSIDE the door, asking for your help to free me.",
      "created_at": "2004-12-09T02:02:31.000Z"
    },
    {
      "author": "Oz",
      "body": "Cool!  Sounds very official.  Hey, are you guys going to have some kind of opening day shindig?  Many of your loyal readers might try to finagle a way to be there....",
      "created_at": "2004-12-09T03:00:11.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Oz. I appreciate the thought, but we don't expect out loyal readers to come out for opening weekend! If you ever find yourself in our neck of the woods, we'd love for you to stop by, but don't go out of your way to get there. Shucks!",
      "created_at": "2004-12-09T03:05:10.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "So what's your first film going to be?  Mid-February is a lot closer than I was expecting!",
      "created_at": "2004-12-09T03:18:29.000Z"
    },
    {
      "author": "bjork24",
      "body": "Well, to be honest, Mid-February is very tentative... and optimistic. We've still got a lot of stuff to do between now and then. If we can open by Valentine's Day weekend, we'd be tickled pink... and probably run Amelie.",
      "created_at": "2004-12-09T03:33:42.000Z"
    },
    {
      "author": "Dave",
      "body": "Kickapoo?",
      "created_at": "2004-12-09T05:29:20.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Kickapoo is an Indian tribe that used to be native to the area, but the name remains on streets and high schools.",
      "created_at": "2004-12-09T05:56:27.000Z"
    },
    {
      "author": "bjork24",
      "body": "Brad Pitt went to Kickapoo High School.",
      "created_at": "2004-12-09T07:52:49.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "Like Oz said, I'm sure there are at least a few of us who have hoping to take a trip down your way for the grand opening. You've taken me through the process, and I can't wait to see the results!",
      "created_at": "2004-12-09T16:54:29.000Z"
    },
    {
      "author": "einahpets",
      "body": "When I was a cheerleader for the Glendale Falcons, we had a little saying about Kickapoo...<br/><br/>\"Kickapoo,  you suck.<br/>Glendale's gonna win,<br/>BIG RED!\"<br/><br/>Ah, how I miss those good ol' days of rivalry.",
      "created_at": "2004-12-09T18:41:31.000Z"
    },
    {
      "author": "bjork24",
      "body": "Whimsy: You guys are crazy! Crazy, but cool.<br/><br/>Eniahpets: If I had $100 for every cheer that made sense, I'd be broke, broke, BROKE!",
      "created_at": "2004-12-09T21:04:00.000Z"
    },
    {
      "author": "Fyse",
      "body": "It's alright for some, living so close. I'm gonna have to settle for lots of photos, and of course an account of the proceedings on at least four blogs!",
      "created_at": "2004-12-10T04:49:32.000Z"
    },
    {
      "author": "bjork24",
      "body": "We'll make sure you're well updated, Fyse.",
      "created_at": "2004-12-10T05:07:07.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
