{
  "id": 115,
  "title": "Careful what you wish for",
  "body": "I asked my parents what they wanted for Christmas and their reply was, \"Oh, I don't know. We need sweaters*. You know, like the kind you can wear with jeans.\" \r\n\r\n* Before I continue, I'd like to note that the term \"sweater\" is completely ambiguous within my family. To us, a sweater is any torso-covering garment that is a) long sleeved, b) thicker than a shirt, and c) not a jacket, coat, or wetsuit. For example: Bill Cosby wears heavily patterned sweaters. When you go jogging in the morning, don't forget to throw on a sweater. Do you like my new button-up sweater? I want one of those fleece pull-over sweaters from Old Navy!\r\n\r\nSo, my parents want new sweaters for Christmas. The only problem is, I don't know what kind of sweaters my parents wear these days. My fashion sense is severely limited, especially when shopping for my elders. But as destiny would have it, Nicole and I were at Office Depot last night when I spotted a specialty printing paper that I never knew existed... that's right, I bought a 12 pack of <a href=\"http://www.avery.com/us/Main?action=product.Details&catalogcode=WEB01&node=10211041&productcode=3271\" target=\"_blank\" class=\"broken\">ink jet fabric transfers</a>! How sweet is that?\r\n\r\nAfter purchasing the miracle paper, we jogged over to Michael's (craft store, not to be confused with Neverland ranch) and bought two red sweaters. The sweaters aren't really, really dark red (#880000), but they're not too light (#FF9999) either. I'd say they're somewhere in between (#F50E0E). I hope the transfers show up alright. Assuming they do, I'm going to make a big transfer across the front that says:\r\n\r\n<center><b>I HELPED START\r\nTHE MOXIE\r\nAND ALL I GOT\r\nWAS THIS STUPID\r\nSWEATER!</b></center>\r\nIsn't that great? Of course, \"THE MOXIE\" will be replaced with the actual Moxie logo, but everything else will be big block letters (I'm thinking AvantGarde Full or Century Gothic, two of my favorites).\r\n\r\nIf the sweaters turn out okay, I might just ditch the CafePress store and start churning them out by hand. Woo hoo! I wish I knew of a better place to buy good-quality custimizable items. I think Nicole is going to make some aprons and pillow cases for us to use. Uh oh, I probably shouldn't have said that, as we're buying gifts for a few people who happen to read this blog.\r\n\r\nPerhaps I've said too much.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-12-10T01:00:36.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "I want some Moxie stuff.",
      "created_at": "2004-12-10T01:12:42.000Z"
    },
    {
      "author": "bjork24",
      "body": "If you send me your speedo, I'll iron a logo across the butt. Make sure you wash it first though.",
      "created_at": "2004-12-10T01:16:31.000Z"
    },
    {
      "author": "justin",
      "body": "Deal.",
      "created_at": "2004-12-10T01:18:50.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ante.",
      "created_at": "2004-12-10T01:23:13.000Z"
    },
    {
      "author": "justin",
      "body": "Slaw.",
      "created_at": "2004-12-10T01:27:50.000Z"
    },
    {
      "author": "whitty",
      "body": "I don't want to be a humbug, but a red \"sweater\" might require \"dark t-shirt transfers\" seen here: <a href=\"http://www.avery.com/us/Main?action=product.HierarchyList&node=10210964&catalogcode=WEB01\" target=\"_blank\">link</a>\r\n\r\nTransfers for dark clothes are opaque and therefore make the colors show up better.  Man, I feel like such a jerk having to break that news to you, but I am a nerd about iron-ons.  That being (over) said, an excellent concept!",
      "created_at": "2004-12-10T01:28:57.000Z"
    },
    {
      "author": "nicole",
      "body": "Looks like it's back to Office Depot tonight. Does that mean we can stop by Deals and get some leg warmers!?",
      "created_at": "2004-12-10T01:30:50.000Z"
    },
    {
      "author": "bjork24",
      "body": "Whitty: But what it I only big black letters? I don't care to have a white background. Will that work?\r\n\r\nNicole: Maybe.",
      "created_at": "2004-12-10T01:36:07.000Z"
    },
    {
      "author": "whitty",
      "body": "hmmmm, well, then the transfers you have may be the way to go.  But either way, cut as close to the letters as possible.  \r\n\r\nI'm not sure about how the white on the Moxie logo would turn out.",
      "created_at": "2004-12-10T02:26:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'm torn. I don't know what to do!!!",
      "created_at": "2004-12-10T02:32:12.000Z"
    },
    {
      "author": "Aaron",
      "body": "Bad news—the Moxie article won't run in this week's SBJ. We are really tight this week and it wasn't the only story held. Maybe next week?",
      "created_at": "2004-12-10T02:52:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "Aaron: That's fine. I think the News-Leader is running a small blurb in the weekend section tomorrow. Just let us know when it runs.",
      "created_at": "2004-12-10T02:53:59.000Z"
    },
    {
      "author": "Dave",
      "body": "ahh, just use a sharpie. they won't know the difference.",
      "created_at": "2004-12-10T04:17:19.000Z"
    },
    {
      "author": "bjork24",
      "body": "So true... so true.",
      "created_at": "2004-12-10T05:06:43.000Z"
    },
    {
      "author": "Oz",
      "body": "I think the sweaters should be yellow in order to connote their cheesiness.  :)",
      "created_at": "2004-12-10T06:28:56.000Z"
    },
    {
      "author": "Mark",
      "body": "Hey, just had a look at your CafePress site. You should add the new Moxie URL to the back of the Ts.\r\n\r\nPlus, once you've opened and are up and running, have you considered using their book publishing service to publish your sucess story?\r\n\r\nM",
      "created_at": "2004-12-10T18:41:06.000Z"
    },
    {
      "author": "einaphets",
      "body": "When I was the beer girl for our golf tournaments and put clever sayings on my iron on transfers like \"Hands full, I'll hold your balls\"...anyways, those iron on ones are el cheapos. They'll crack and fade the first time you wear them.\r\n\r\nJoel has a shirt that says \"chicks dig Kenny G.\" It's a blue shirt with a white iron on transfer and you can see the transfer. So, I'd go for a white sweatshirt. \r\n\r\nJust my opionion though...",
      "created_at": "2004-12-10T18:46:07.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    }
  ]
}
