{
  "id": 116,
  "title": "Freedom of the Press",
  "body": "Every time a story appears in print about me, or with a quote from me, something always goes wrong. Either my quote is taken out of context, or my name is misspelled (how hard is it to spell \"The Man\"?), or the \"nude\" picture ends up being printed. It's never-ending. Today's Moxie blurb is no exception. See for yourself:<br/><br/>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - <br/><br/><b>Art film venue arriving downtown</b><br/><u>Theater updates:</u><br/><br/><i>Plans are moving forward for the Moxie Cinema, report owners Dan and Nicole [Aweseme-heads].</i><br/><br/>The art-house theater should open by mid-February at 408 W. Walnut St., a property owned by arts advocates Andrew and Ellen [Owners]. The venue will show lesser-known films now rare in Springfield's market, the [Aweseme-heads] say. It will also serve as a wine bar, and like so many downtown businesses, as an art gallery space.<br/><br/>* as per usual, last names have been omitted to protect the innocent.<br/><br/>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - <br/><br/>This appeared on the front page of the Life section in the <a href=\"http://www.news-leader.com\" target=\"_blank\">Springfield News-Leader</a> (print version only). So what's wrong with the blurb, you ask? Well, let me break it down:<br/><br/>1. The building owners were not mentioned in the <a href=\"/posts/114\">press release</a>, and even had they been, I certainly would not have omitted Doug's name (the third owner of the building) or referred to them as \"arts advocates.\"<br/><br/>2. Read the first point again, but with more emphasis on the second half.<br/><br/>After reading this, I immediately sent an apologetic e-mail to Doug and Andrew, who were not surprised by the journalistic liberties taken by the reporter. In fact, the reporter happens to be an acquaintance of Andrew, Ellen, and Doug. Either way, I guess it's not too big a deal, but I still feel bad that Doug's name was left out.<br/><br/>On a different note, <a href=\"http://www.417magazine.com\" target=\"_blank\">417 Magazine</a> called me yesterday to do an interview for their big Downtown Issue, which will be running in March. I'll withhold an opinion(s) about 417 Magazine until after the article comes out. I have no past experience with them, so I don't know how likely they are to take my quotes out of context and make me look like a pro-Taliban wife beater. The 417 reporter was quite nice, and seemed very supportive of the theater, but that could've been an act. You never know with those journalistic types. My wife especially.<br/><br/>With my luck, the reporter will stumble across my blog, read this post, interpret my ramblings as anti-journalistic bravado, and rewrite her story to make me into a pro-Coleman (as in Gary) Red Sox fan.<br/><br/>I love reporters. I really do!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-12-10T23:32:28.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nicole",
      "body": "If you're so concerned, you should refuse to do interviews. I personally think the blurb is fine. They only have so much time and information to work with! Give us reporters some slack (Ok, I'm not a reporter anymore, but I know what it's like). Any press is good press.",
      "created_at": "2004-12-10T23:43:06.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'll press you!",
      "created_at": "2004-12-10T23:44:46.000Z"
    },
    {
      "author": "justin",
      "body": "If I had a dime for everytime my quotes got fucked up by the time they went to print, I'd have at least a dollar!",
      "created_at": "2004-12-10T23:55:59.000Z"
    },
    {
      "author": "bjork24",
      "body": "I remember that one quote from you where you said, \"I like to drink beer while I get my hair cut. I beat puppies.\" Did you really say that?",
      "created_at": "2004-12-10T23:59:33.000Z"
    },
    {
      "author": "justin",
      "body": "No, what I really said was: \"I like to drink beer while I get my hair cut.  I <i>eat</i> puppies.\"",
      "created_at": "2004-12-11T00:02:34.000Z"
    },
    {
      "author": "bjork24",
      "body": "Man, they totalled screwed your quote UP!",
      "created_at": "2004-12-11T00:05:33.000Z"
    },
    {
      "author": "justin",
      "body": "I'm suing for damages.",
      "created_at": "2004-12-11T00:06:51.000Z"
    },
    {
      "author": "Oz",
      "body": "I was wondering about your posting your opinions about reporters on this blog.  If they do ANY research AT ALL (not that they will, but if they do), they'll easily find this blog.  I just assumed your tirade was another example of your gigantic testicles.<br/><br/>But just look at it this way.  You're paying your dues.  When you get rich and Moxie famous, you can require final approval of any articles written about you or the Moxie before they go to press.",
      "created_at": "2004-12-11T01:32:14.000Z"
    },
    {
      "author": "John",
      "body": "Had the reporter had been a true journalist, we might have gotten the REAL scoop: That you'll be serving wine in Dixie Cups.",
      "created_at": "2004-12-11T02:36:58.000Z"
    },
    {
      "author": "bjork24",
      "body": "Oz: Have no fear, this post will come back to bite me in the rear. Why do I say such things when only bad tidings this brings?<br/><br/>John: It's true. Our wine, beer, AND pop will be served in Dixie cups... for $4.00 each!",
      "created_at": "2004-12-11T03:03:05.000Z"
    },
    {
      "author": "justin",
      "body": "what do you mean by \"pop?\"",
      "created_at": "2004-12-11T12:02:37.000Z"
    },
    {
      "author": "Dave",
      "body": "how much if you just pour it in my hand?",
      "created_at": "2004-12-11T20:51:13.000Z"
    },
    {
      "author": "Nicholas",
      "body": "dan, it goes with the territory. greg, the editor of 417, is very nice--but yes, his mag might bend a word or two (they misattributed a quote to me and made bucky bowman an MFA grad at twenty). but these are minor things--if you are getting press, it's good. and there's nothing wrong with insisting on a correction printed in a future edition--which means more press! yay!",
      "created_at": "2004-12-13T04:18:14.000Z"
    },
    {
      "author": "einaphets",
      "body": "Will I be able to sneak my own case of beer in? Be that obnoxious girl in the front cracking open a beer can and then throwing moon pies at the screen?",
      "created_at": "2004-12-13T18:36:15.000Z"
    },
    {
      "author": "bjork24",
      "body": "Justin: pop<br/><br/>Dave: fity cent<br/><br/>Nicholas: Any press is good press, unless it's press about how they found your fingerprints, along with those of the little boy who's sueing you for molestation, on the pages of your dirty magazines.<br/><br/>Einaphets: Yes, you can be that obnoxious girl.",
      "created_at": "2004-12-13T19:32:57.000Z"
    },
    {
      "author": "Nicholas",
      "body": "Oh. I thought that was good press too. Crap, now I'm going to have to tell my mom not to buy next week's US weekly--or tear out my picture. That little twerp is gonna pay...",
      "created_at": "2004-12-15T02:25:34.000Z"
    },
    {
      "author": "bjork24",
      "body": "ha ha",
      "created_at": "2004-12-15T02:26:41.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
