{
  "id": 117,
  "title": "Good day",
  "body": "Yesterday was a good day, and let me tell you why:<br/><br/><b>Ye old vendor switch</b><br/><br/>Since our loan is a little less than what we had originally hoped for, I've been making a conscious, yet subtle, attempt to find a new equipment vendor in hopes of saving us a little bread on the backend. Our current provider has been extremely helpful, and he comes highly reccommended, but he's located in Portland, Oregon, which puts the shipping costs alone somewhere in the neighborhood of a newer used car. Bottom line: we don't have that kind of money to throw around, and even if we did, I sure as hell wouldn't be blowing it on shipping!<br/><br/>So, after washing away the guilt of leaving our current vendor, I set off to find a new one who was located within our time zone. Lo and behold, there's one in St. Louis! How could I have missed that? To be fair, the St. Louis vendor doesn't have quite the same track record as the Portland one, but that has a lot to do with size. The Portland operation is a BIG company, while the St. Louis one is run by two brothers who took over the business after their dad retired. Both brothers have experience running theaters on their own, and they have technicians who live within an hours drive to Springfield.<br/><br/>If everything works out with the St. Louis vendor, we'll be saving at LEAST $5,000 on shipping. I can just rent a U-Haul and drive up to St. Louis to pick everything up. It's a win-win situation! Woo hoo!<br/><br/><b>Another interview</b><br/><br/>I gave another lengthy phone interview yesterday; this time for the <a href=\"http://www.sbj.net\" target=\"_blank\">Springfield Business Journal</a>. Unlike my interview with 417 Magazine, I was a bit more prepared this time... I hope. In my own head, I came off sounding quite knowledgable and business-like. It's always a treat for me when I get to reveal my age and hear the reporter gasp.<br/><br/><b>Dan</b> - ... which we used to visit when we were going to Mizzou.<br/><b>Reporter</b> - When did you and your wife graduate?<br/><b>Dan</b> - 1903.<br/><b>Reporter</b> - Good lord!<br/><br/>The story is scheduled to run this coming Monday, so if any of you readers out there happen to be currently employed by SBJ and can get your hands on a free copy or four (hint hint, Aaron), please let me know. As always, I'll post the press as soon as it hits my hands. Note: alway, ALWAYS avoid alliteration.<br/><br/><b>Weather</b><br/><br/>The sky was crisp and clear yesterday, and although the mercury is currently registering a tad below the 20 degree mark, I'm hoping the weather will hold until we get a chance to pack up and move to Springfield. I'll be a wee bit peeved if the clouds decide to open up and dump a foot of snow on us during the move. Damn clouds!<br/><br/><b>Feeling fine</b><br/><br/>I also have a good feeling that <a href=\"/posts/112\">the thing I couldn't talk about last Monday</a> is slowly receding into the past. I have no evidence to prove this, just a general feeling. Either way, I think the eventual unveiling of the problem that plagued the Moxie early last week is nigh upon us. Stay tuned folks!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-12-14T19:49:49.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "einaphets",
      "body": "1903? I thought it was 1905. And $5000 to save? Sounds like a weiner to me!",
      "created_at": "2004-12-14T19:59:59.000Z"
    },
    {
      "author": "bjork24",
      "body": "Were you speaking English right then?",
      "created_at": "2004-12-14T20:08:15.000Z"
    },
    {
      "author": "whitty",
      "body": "You know, the allusion to last Monday's secret is killing me.  KILLING ME!",
      "created_at": "2004-12-14T20:20:29.000Z"
    },
    {
      "author": "bjork24",
      "body": "Tut tut, good Whitty. All secrets shall be revealed in due time... due time... do time... dew time. Mountain Dew! AH! Where am I?",
      "created_at": "2004-12-14T20:22:17.000Z"
    },
    {
      "author": "nicole",
      "body": "Good weather? I'm FREEZING and still haven't warmed up. I'm in my cube with a coat and scarf on, and my feet are still numb from Dan and Bogey stealing all my covers last night. Brrrr.",
      "created_at": "2004-12-14T20:53:54.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ha ha! You were cold!",
      "created_at": "2004-12-14T21:31:22.000Z"
    },
    {
      "author": "justin",
      "body": "God damn those clouds!",
      "created_at": "2004-12-14T21:46:54.000Z"
    },
    {
      "author": "bjork24",
      "body": "Stupid clouds!",
      "created_at": "2004-12-14T21:50:50.000Z"
    },
    {
      "author": "Oz",
      "body": "20 degrees seems like good weather to you?  Only in the midwest....",
      "created_at": "2004-12-15T00:29:28.000Z"
    },
    {
      "author": "bjork24",
      "body": "That's right. It was 20 degrees when I wrote this post at 8:49 am, now at 1:30 pm it's 85 degrees. Woot woot for Missouri weather!",
      "created_at": "2004-12-15T00:33:25.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Since you are saving so much money, I look forward to the five dollar discounts on the first thousand That's Damn Huge(tm) orders of popcorn.",
      "created_at": "2004-12-15T01:24:24.000Z"
    },
    {
      "author": "bjork24",
      "body": "Wha ha ha ha ha ha ha... *wipes eyes*... ah, ha ha... he he heh. Oh, Dave. That's classic!",
      "created_at": "2004-12-15T01:28:13.000Z"
    },
    {
      "author": "Nicholas",
      "body": "Dammit Dan, now you're just revelling your own hype. :p Unless you singlehandedly diverted the course of an asteroid without simultaneously getting dental caps, or found a way to give us all a free tin of Altoids, I'm going to have to kick you in the shins for the suspense talk.",
      "created_at": "2004-12-15T02:22:47.000Z"
    },
    {
      "author": "bjork24",
      "body": "icksnay on the oidsaltay alktay!",
      "created_at": "2004-12-15T02:25:26.000Z"
    },
    {
      "author": "Fyse",
      "body": "Bah, all this talk of temperatures in terms of and archaic temperature scale. When are you Americans gonna go metric, eh?",
      "created_at": "2004-12-15T16:00:35.000Z"
    },
    {
      "author": "John",
      "body": "When are you making the move?<br/><br/>It was 80 degrees here yesterday. Not that I'm bragging of anything, because it seems way too warm to be the holidays.",
      "created_at": "2004-12-15T21:39:51.000Z"
    },
    {
      "author": "bjork24",
      "body": "Fyse: -7 degrees. Is that better?<br/><br/>John: We're moving on the 30th of December.",
      "created_at": "2004-12-16T02:38:10.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 14,
      "name": "Dialogue"
    }
  ]
}
