{
  "id": 119,
  "title": "If you only read one post...",
  "body": "It’s been 10 days since I dropped a hint that <a href=\"/posts/112\">something was amiss in Moxieville</a>, but now it’s time to come clean… as promised.<br/><br/>The Moxie doesn’t exist. It’s just an elaborate fabrication I made up to get listed on Google’s Blogs of Note. My real name is Wangus Bilge, I’m 13 years old, and I live in the attic of an old Montgomery Wards in <a href=\"http://www.google.com/url?sa=X&oi=map&q=http://maps.yahoo.com/py/maps.py%3FPyt%3DTmap%26%26csz%3DOkay%2BOK%2B%26Get%25A0Map%3DGet%2BMap\" target=\"_blank\">Okay, Oklahoma</a>.<br/><br/>NOT!!!!<br/><br/>It’s actually the attic of a Carl’s Junior. Sigh.<br/><br/>Seriously though. Here’s the truth… are you sitting down? If not, please do. Now stand up again. Okay, you really need to be sitting down for this. Here it is:<br/><br/>There’s a nasty rumor circulating around Springfield that another couple of entreprenuers are trying to open an art-house theater downtown! Here’s the lowdown:<br/><br/><b>The seed is planted</b><br/><br/>Andrew called to break the news on the 3rd of this month (two days after our SBA loan was approved). Apparently, two <a href=\"http://www.drury.edu\" target=\"_blank\">Drury</a> graduates had contacted Andrew’s realtor to inquire about the building at 408 West Walnut (our building) for use as an art-house theater. According to the realtor, the two men stated that they were going to be opening a single screen art-house theater within the next two months. Further questioning revealed that they were:<br/><br/>1. Both attorneys, only a few years out of law school<br/>2. Fully funded with their own personal financing<br/>3. Going to run the theater while one of them continued to practice law<br/>4. Operating on a business plan they had perfected as a senior project in college<br/><br/>I immediately sprang into action and contacted <a href=\"http://www.morawk.com/aaron/\" target=\"_blank\" class=\"broken\">Aaron S.</a> down in Springfield. Not only is Aaron our logo designer and Moxie music manager, but he also happens to be a recent Drury graduate himself, which put him in an ideal position to find out more information for us. Immediately after e-mailing Aaron, I sent a similar missive to Paul, our booking agent / mentor, in Columbia.<br/><br/>Within a few hours, Aaron wrote back with good news: he hadn’t heard anything about these upstart crows, nor had anyone he spoke with. That was good news. Whoever these people were, they had little to no street buzz about their theater project. I thanked Aaron and asked him to keep an ear to the ground from hence forth. *Aaron, if your ear is still to the ground, you might want to lift it up for a minute, wash it off, and put it back.<br/><br/>Paul’s reply revealed a few more clues. Being one of the original co-founders of what could easily be argued as <a href=\"http://www.ragtagfilm.com\" target=\"_blank\">Missouri’s preeminent independently-owned art-house theater</a>, Paul gets numerous e-mails asking for his advice from people wanting to start Ragtag-esque theaters of their own. In late November, he received two e-mails, from what he assumed were brothers, asking for advice on starting a single screen art-house theater in Springfield. Paul replied that they needn’t worry, because <a href=\"http://www.moxiecinema.com\">the Moxie would be opening in early 2005</a>, but he never heard back from them. Were these the Drury upstarts? Who knows. Maybe so, maybe not. Either way, the revelation was a gut check in every sense of the word… two words, actually.<br/><br/>For a moment it looked as though the paranoia I had described back in May was coming to fruition:<br/><br/><a href=\"/posts/5\">Introduction #5</a>:<br/><br/><i>If all goes well (investors are found, finances are secured, leases are signed), I'll divulge the real names of the theater, the town, etc.. Until those milestones are crossed, Cinema 24 will remain cloaked in anonymity, because I'd hate for a wayward Midwestburg businessman (or woman),<br/> with more money than brains, happen upon this blog and steal our idea just to turn a quick buck.... psh, good luck!</i><br/><br/><b>Determination and resolve</b><br/><br/>Moxie Cinema was not going to be outdone by a couple of rich, ill-prepared attorneys who think that starting an art-house theater is so simple that it can be done in two month’s time. By looking at the clues I was given, I came up with a few hypothesizes of my own:<br/><br/>1. Andrew said the Drury graduates were both attorneys, two years out of law school, BUT Drury doesn't have a law school, so I'm ASSUMING that at least one of them went to the University of Missouri Law School in Columbia, where they would have most definitely visited the Ragtag and, like so many other Springfieldians, envisioned such a theater in their own downtown. The fact that they e-mailed Paul adds truth to this assumption.<br/><br/>2. While it may be true that they have enough money to fund their entire project on their own, I highly, highly, HIGHLY doubt they're anywhere near as technically prepared as we are. If they're just now looking for buildings, there's no way they could open a theater in two months. The fact that they thought a theater could be opened under such a tight deadline shows how little they've researched their project.<br/><br/>Those hypothesizes helped me sleep better at night, but despite how ill-prepared they seemed, I wasn’t going to underestimate them. If there’s anything I’ve learned from watching the Apprentice, it’s to never underestimate your competition. Instead, I decided to assume that they were just as well-prepared as Nicole and I, and if the Moxie was going to prevail, we’d have to double our efforts and act quickly.<br/><br/><b>Spreading the word</b><br/><br/>On Monday, I elected not to discuss the problem on my blog, because as far as I knew the competition could be reading it on a daily basis, following our progress and taking steps to beat us to the punch. Nicole drafted our first press release over the weekend, and by Tuesday morning every news and media outlet in Springfield had a copy of it sitting in their inbox. The <a href=\"http://www.news-leader.com\" target=\"_blank\">News-Leader</a> was the first to report our progress in a small blurb that I mentioned last week. Since then, our story has appeared on the <a href=\"http://www.missourifilm.com\" target=\"_blank\">Film Alliance of Springfield’s</a> website, the “<a href=\"http://www.itsalldowntown.com\" target=\"_blank\">It’s All Downtown</a>” website, and was reported on by <a href=\"http://www.ksmu.org\" target=\"_blank\">Springfield’s local NPR radio station</a>. I’ve also been interviewed for upcoming stories by <a href=\"http://www.417magazine.com\" target=\"_blank\">417 Magazine</a> (story will run in a special downtown edition in March), <a href=\"http://www.sbj.net\" target=\"_blank\">Springfield Business Journal</a> (story will run on Monday), and the <a href=\"http://www.cfpmidweek.com\" target=\"_blank\">Community Free Press</a> (our press release will run on Tuesday and a bigger story will run in the following edition).<br/><br/>Our goal was to destroy our competition’s motivation... take the wind out of their sails. If they decide to continue with their theater, we want them to know what they’re up against. The Moxie is backed by the newly formed Film Alliance of Springfield, the Arts Patronage Initiative, Ragtag Cinemacafe, and numerous members of the arts community who have voiced their support for our project. We already have connections with the SMS and Drury Film departments, funding from the SBA and the SFDC, but most importantly, we have a building! At best, our all-encompassing media coverage will send our competition packing. At worst, it will force them to meet us on the battlefield and start garnering some press of their own. Either way, the Moxie is ready, and we’re not going down without a fight!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-12-17T02:56:55.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Justin",
      "body": "Say the worst DID happen, and they started opening up their own... it's already too late for them!  They will forever be known as \"the unoriginal theater that stole someone elses idea.\"  The fact that you have press now is perfect.  I'm sure that if they did move forward, many publications would be interested in writing a piece about a group of lawyers who like to steal ideas.",
      "created_at": "2004-12-17T03:04:52.000Z"
    },
    {
      "author": "bjork24",
      "body": "Exactly. It's all about spin and striking when the iron's hot. I wonder how many more metaphors I can use?",
      "created_at": "2004-12-17T03:07:17.000Z"
    },
    {
      "author": "Justin",
      "body": "23.",
      "created_at": "2004-12-17T03:08:30.000Z"
    },
    {
      "author": "bjork24",
      "body": "I don't know that many!",
      "created_at": "2004-12-17T03:09:26.000Z"
    },
    {
      "author": "Rex",
      "body": "Whew! You scared me, Dan ... I thought you were going to confess that you and Nicole spent all of the startup money getting simultaneous sex change operations.",
      "created_at": "2004-12-17T03:21:34.000Z"
    },
    {
      "author": "bjork24",
      "body": "I wasn't going to announce that until AFTER Christmas, Rex, but thanks for ruining the surprise! Geez.",
      "created_at": "2004-12-17T03:34:45.000Z"
    },
    {
      "author": "Shannon",
      "body": "Seeing as how they're lawyers, and fairly green ones at that, I'd say you have nothing to worry about. If they're anything close to good lawyers, they'll realize you've beat them to the punch and pack it in.  Otherwise, they'll go down in flames.  Either way, you're safe. ",
      "created_at": "2004-12-17T04:42:08.000Z"
    },
    {
      "author": "Dave",
      "body": "if they do open a theater, just send someone in there with a pillowcase full of rats. problem solved.",
      "created_at": "2004-12-17T06:10:46.000Z"
    },
    {
      "author": "bjork24",
      "body": "Shannon: I hope you're right!<br/><br/>Dave: That's your solution for EVERYTHING!",
      "created_at": "2004-12-17T07:33:30.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "The drama is thrilling!  This is better than The OC!",
      "created_at": "2004-12-17T08:08:16.000Z"
    },
    {
      "author": "bjork24",
      "body": "It's funny you should mention that, because I'm often told how I look like the main guy on the OC... the hot one.",
      "created_at": "2004-12-17T08:13:56.000Z"
    },
    {
      "author": "whitty",
      "body": "Phew!  My ulcer thanks you for finally letting the cat out of the bag.  Viva la Moxie!",
      "created_at": "2004-12-17T08:42:52.000Z"
    },
    {
      "author": "bjork24",
      "body": "Your ulcer is welcome.",
      "created_at": "2004-12-17T08:44:34.000Z"
    },
    {
      "author": "Rachel",
      "body": "My liver says thanks.  I've been getting drunk every night just to be able to sleep with all this anticipation.  Or maybe I've just been getting drunk because I'm an alcoho...nope, definitely the anticipation",
      "created_at": "2004-12-17T10:59:07.000Z"
    },
    {
      "author": "bjork24",
      "body": "Your kidney is welcome, and you're an alcoho... nope!",
      "created_at": "2004-12-17T11:05:30.000Z"
    },
    {
      "author": "Carl",
      "body": "Now if they are just two years out of law school I would imagine that they still have loans to pay off from school and their practice would just be starting to make a profit.",
      "created_at": "2004-12-17T16:59:15.000Z"
    },
    {
      "author": "Oz",
      "body": "I'm not worried, Dan.  After all, you are the man.  And if they're reading this blog, they've seen that picture of you in your Slash outfit, and that MUST have terrified them.",
      "created_at": "2004-12-17T18:00:11.000Z"
    },
    {
      "author": "Aaron",
      "body": "Well, good, cuz I just got out of the shower. <br/><br/>BTW, I wound up in St. Louis (still at the airport) until five yesterday, impatient from waiting on EVERYTHING. But I still like St. Louis. I took the long way around the city and we drove by the arch and the stadium and the big wide deep muddy Mississippi. And, according to her, after sitting on a plane on the tarmac of Logan International, it's not hard at all to love Missouri to death. Dude, Moxie begins with MO! Here's to state pride.",
      "created_at": "2004-12-17T18:22:10.000Z"
    },
    {
      "author": "Aaron",
      "body": "Oh, and I believe I'm also in charge of human resources, right? I have another person who would like to work/help out on top of the others that have expressed interest. And, like Penmac, I won't take a cut of their wages.",
      "created_at": "2004-12-17T18:26:36.000Z"
    },
    {
      "author": "einaphets",
      "body": "This is all too exciting. My heart beats with antici...pation.",
      "created_at": "2004-12-17T18:31:34.000Z"
    },
    {
      "author": "Fyse",
      "body": "Oz, we were all terrified by the photos of Dan as Slash. Particularly <i>that</i> photo... *screams and beats side of head in attempt to dislodge nightmre image*<br/><br/>There's no way these guys are a threat to you. You'll be up and running well before them, even if they do go through with their evil, <i>evil</i> plans. I reckon it might have been one of them that stole your hat too...",
      "created_at": "2004-12-17T19:22:45.000Z"
    },
    {
      "author": "bjork24",
      "body": "Carl: Unless, of course, they have mondo rich parents who will pay their way through any endeavor they choose.<br/><br/>Oz: You're right. I am the man, and I did look pretty damn good in that Slash outfit.<br/><br/>Aaron: Perhaps it would be in our best interest if we hired all of our jobs to you. Nicole and I will just sit back and rake in the 23 dollars of annual profit.<br/><br/>Eniaphets: I have a feeling your quoting a song, but I can't figure it out!<br/><br/>Fyse: Let me get this straight - you want me to REPOST the picture of my butt in my Slash costume. Okay, man... whatever floats your boat!",
      "created_at": "2004-12-17T19:31:09.000Z"
    },
    {
      "author": "Stephanie",
      "body": "I know you guys are going to be fine...you have worked so hard and put so much into this.  And so many people (many who never have and most likely never will meet you) are pulling for you.  <br/>not to mention all the support in the community...<br/><br/>And besides...lawyers?  C'mon...they don't stand a chance against Dan the Man and his lovely wife, Nicole.",
      "created_at": "2004-12-17T22:16:27.000Z"
    },
    {
      "author": "bjork24",
      "body": "Stephanie: You're far too kind. Thanks!",
      "created_at": "2004-12-17T22:18:36.000Z"
    },
    {
      "author": "film geek",
      "body": "I am the guy who e-mailed Paul Sturtz!  If you look at your guestbook I signed it and it explains everything.  I e-mailed him just to get an idea of what I was looking at, and he told me about your endeavor.  I've read your blog and have realized what a big undertaking it is.  It was just in the dream stages, nothing serious.  Anyway, that should solve the Paul e-mail clue.",
      "created_at": "2004-12-18T12:09:51.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ah ha! That makes sense. Thanks for the clue, Film Geek. It still doesn't help us find the Drury upstarts though... have you heard anything about them yourself?",
      "created_at": "2004-12-18T23:24:06.000Z"
    },
    {
      "author": "geek",
      "body": "No I haven't heard anything about the Drury guys.  I did hear that they are putting in a 4 screen multiplex and shopping center over by Springfield Brew Co. though.  Btw, I saw a Moxie sticker up at Jimmy John's the other day, it made me smile.  ",
      "created_at": "2004-12-19T02:32:47.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ah yes, College Station. That's several years down the road. They'll be a 1st run theater, so we shouldn't have a conflict of interest.",
      "created_at": "2004-12-19T02:36:21.000Z"
    },
    {
      "author": "nicole",
      "body": "A Moxie sticker at Jimmy Johns? In Columbia, or does Springfield have one now?",
      "created_at": "2004-12-19T04:01:13.000Z"
    },
    {
      "author": "geek",
      "body": "Sprinfield has one now that is across from Harpo's.  Try the Gargantuan, it won't disappoint.  ",
      "created_at": "2004-12-19T04:16:49.000Z"
    },
    {
      "author": "bjork24",
      "body": "Cool.",
      "created_at": "2004-12-19T05:04:59.000Z"
    },
    {
      "author": "Ill-Prepared Attorney",
      "body": "Shouldn't you little Moxie-types be more worried about getting your theater opened rather than about possible competition?",
      "created_at": "2005-06-27T05:45:25.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
