{
  "id": 12,
  "title": "Intermissions",
  "body": "Today's post will focus on a point of contention that I've been batting around in my head ever since Nicole and I started researching this venture - intermissions. Now, a lot of you might already be balking at the thought of having an intermission in today's fast-paced world of \"bring 'em in, move 'em out\" multiplexes, but hear me out. Intermissions can be good for all of us. In fact, Nicole and I have been to several art-house theaters where intermissions were used, and no one in the audience seemed to mind.<br/><br/>A short 10 minute intermission allows movie-goers to get up and stretch, go to the bathroom (in the restrooms, not as they're stretching), and MOST IMPORTANTLY make another trip to the Cinebar for another glass of wine / beer / grocery bag of popcorn / box of dots / etc.. The patrons who choose to remain in their seats could take a moment to discuss the film without being shushed, look at the exhibited art on the auditorium walls, play snake on their cell phone, or quietly twiddle his or her thumbs. Sounds lovely, doesn't it? You, the viewer, can do all of the aforementioned activities without missing any of the movie, and I, the film exhibitor, can make a little extra money at the Cinebar, which, as I <a href=\"/posts/9\">mentioned before</a>, is the only way we can stay afloat.<br/><br/>Of course, as with all business decisions, there are other issues beyond personal gain and audience convenience that will determine whether we can have intermissions or not. You see, whenever you contact a distributor and ask them to show one of their films, you have to sign a contract that specifies certain things, mainly the distribution fee, length of engagement, etc.., but hidden deep in the fine print is a little clause that strictly prohibits interruption or modification of any kind to the exhibited film. Not only that, but it's becoming increasingly more difficult to find a good stopping point for an intermission in modern day films.<br/><br/>So should we or shouldn't we run intermissions? Well, in the beginning we were going to have no choice but to run them, since we were planning on using reel-to-reel projectors in our theater. Reel-to-reels (<a href=\"http://moxie.danchilton.com/pix/grum/jlarson2.jpg\" target=\"_blank\">picture</a>) are gigantic projectors that have a 6,000 foot reel on top that feeds film down through the head to a 6,000 foot take-up reel on the bottom. A 6,000 foot reel only holds about an hour and 15 minutes worth of film, so somewhere along the line we'd have to stop the film so we could thread up the second half of the movie. What better time for an intermission?<br/><br/>A lot of theaters in the old days had two reel-to-reel projectors, one was thread up with the first half and the other with the second half, and whenever the change over occurred (watch for the cigarette burn at the upper right-hand side of the screen... <i>Fight Club</i> describes it really well), the projectionist would simply hit a button and projector 1 would stop as projector 2 started. If done correctly, the audience would be oblivious to the change-over. Of course, this scenario would only work if you had 2 reel-to-reel projectors PER auditorium, which we don't have money for. If we were to use reel-to-reel, we could only afford 1 projector per screen, which would mean we would have to allow for an intermission while we threaded up the second half of the film.<br/><br/>As you can see from the <a href=\"http://moxie.danchilton.com/pix/grum/jlarson2.jpg\" target=\"_blank\">picture</a> of the reel-to-reel projector, they require a lot of ceiling space, which, unfortunately, is something we don't have. The ceilings at Cinema 24 are low... I'm talking 13 feet low. We have to get our projector as high to the ceiling as possible, and if we stuck with reel-to-reels we'd be giving up at least 3 feet of usable space above the projector. So we decided to go with platters (<a href=\"http://moxie.danchilton.com/pix/grum/noyo8.jpg\" target=\"_blank\">picture</a>).<br/><br/>Platters allow projectionists to build-up an entire film on one platter that would, in turn, feed the projector, thus eliminating change-overs, rethreading, and the need to rewind 6,000 foot reels. If done correctly, a platter can be started and left unattended until the end of the film. They're wonderful machines, but if we have one, we most likely can't have intermissions. So I guess the question is moot, since we're going to have a platter-fed system, it's obvious that we can't circumvent our contractual obligation to show our films in their entirety... or can we? What do you think, intermissions or no?",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-06-07T20:02:14.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "I think intermissions are a good idea, but I can see where in the contracts some directors/writers/whoevers wouldn't want their film interrupted. An intermission also allows the audience to go out for a cigarette, which I assume will be banned inside the theater. <br/><br/>Also, if you had an intermission, you could make a fun 1950's-esque dancing hot dog intermission cartoon in Flash and project that during the intermission.",
      "created_at": "2004-06-11T23:28:38.000Z"
    },
    {
      "author": "J.",
      "body": "Great topic! In my neck of the woods, cinemas per force have intermissions. It is, I'm sure, partly for technical reasons but also for important, financial reasons. The ten minutes of intermission are utilised by the cinema to display advertisement slides. From jet-ski retailers to the Mexican restuarant down the road to the tacky opticians downtown, a mindboggling range of enterprises choose to advertise this way. If there are no advertisements, then posters of forthcoming films flash on the screen. <br/><br/>It is a good device, definitely. But invariably, a badly-placed intermission kills the viewing experience. This is increasingly what is happening these days because most Hollywood and European cinema (art-house and commercial) is not made with an intermission in mind. Finding that break point takes a refined sense of aesthetic at the best of times, and at the worst of times, it just may not be there. <br/><br/>To answer your final question - should we have intermissions? - is tremendously difficult. Your hands are quite tightly tied, it would seem, anyway. But in an ideal world, I think I'd vote for an intermission. I guess ultimately I believe that a good film's momentum may be broken by an intermission, but not destroyed. Most of the time at least.",
      "created_at": "2004-06-11T23:28:57.000Z"
    },
    {
      "author": "The Hey",
      "body": "I think having an intermission in your situation would be a swell idea. Just because you have a platter system doesn't mean you cannot have an intermission.<br/><br/>You can just build the one print up on 2 platters with intermission snipes on the end of the last reel of first part of the print. (Drive Ins put these snipes on the very end of the first feature before intermission. If might be a good idea to make sure that the reel change doesn't occur in the middle of a scene or even better find a reel change with a fade in/out. Also a good idea not to try this with a film less than 2 hours long.<br/><br/>As a projectionist I have had several films that had intermissions like Gone With the Wind and Lawrence of Arabia. The best thing about those films was that there was a reel that went before part 2 that was simply black with overture music. That allowed me to program the automation to signal the start of the second part of the film. Obviously you do not have those with today's prints but if can get ahold of some intermission snipes (check out http://www.driveintheatre-ownersassociation.org/index.html for help obtaining these). That would be just as good.",
      "created_at": "2004-06-11T23:29:27.000Z"
    },
    {
      "author": "VJ",
      "body": "I think intermissions are a gr8 idea. If you look at Indian Movies (Hindi, Tamil, ...) there is always a intermission. A 10 minute break to stretch out.. get some food..go to the restroom so that you can drink more soda..lol.. anyways. intermissions hasve always been there in indian movies..in live in arizona, and when the local indian association plays movies at the theater, we always have an intermission.",
      "created_at": "2004-06-11T23:29:50.000Z"
    },
    {
      "author": "Umm Hamza",
      "body": "Hi,<br/><br/>I love intermissions. Once upon a time, I worked for restaurant theatre in Indianapolis that had intermissions for its movies. Best idea ever for both parties: customer gets a break, gets to take a bathroom break, and gets to yak without pissing anyone off; the theatre has the opportunity to sell more stuff (since movie theatres make most of their money off everything but the movie ticket...)<br/><br/>Nice blog... I don't like Blogger's comment interface, however... its repetitive.",
      "created_at": "2004-06-11T23:30:20.000Z"
    },
    {
      "author": "Leary",
      "body": "Yes definitely, intermissions. Especially in today's world of three hour movies!!!",
      "created_at": "2004-06-11T23:30:45.000Z"
    },
    {
      "author": "Rox",
      "body": "well I've got a question and has nothing to do with your post other than I own an online entertainment and education company so was interested in what you had to say. Does your \"publishing\" automatically update correctly? I can't get my last blog to post on the front page of www.wsntv.com/blog from blogger.com publishing. It simply put the last one into the June archives. Thanks in advance for help. Rox",
      "created_at": "2004-06-11T23:31:05.000Z"
    },
    {
      "author": "jaynie",
      "body": "I went to the cinema just yesterday, and the movie was over two hours long. About half way through, I was fidgetting in my seat I had to use the bathroom so bad. But I am one of those people that absolutely hate getting up in the middle of a movie. I simply can't hande missing more than a minute of a movie I paid almost seven dollars to see. I think your intermission idea is great. I wish I had a chance to get up and grab another soda or refill my popcorn. Most of all, I would have loved to have gotten up and used the restroom without missing my movie! Oh, and I happen to be working on a few projects involving projectors, and I think I have a few suggestions if you get the chance!",
      "created_at": "2004-06-11T23:31:27.000Z"
    },
    {
      "author": "Shatterstar",
      "body": "I would say that you should go with the intermisson, isnt it true that theaters make more money off of concessions anyway? So if you just stop the projector, and claim to be re-threading it, you could make people go and buy more stuff.",
      "created_at": "2004-06-11T23:31:53.000Z"
    },
    {
      "author": "miss",
      "body": "I love intermissions. Something sadly missing from local cinemas.",
      "created_at": "2004-06-11T23:32:13.000Z"
    },
    {
      "author": "zach",
      "body": "I'm not sure i necessarily share your enthusiasm. Filmmakers no longer construct their work in two acts. Intermissions in contemporary films often disrupt narrative, flow, and spacing in ways which i think can be destructive to the experience of moviegoing. And while i recognize the importance of concessions to theater revenue, people can do that during the evr increasing nuimber of previews and commericals screened prior to features.",
      "created_at": "2004-06-11T23:32:33.000Z"
    },
    {
      "author": "Cap",
      "body": "I had to say that film-makers these days do not make their movies to have intermissions these days, however, they don't make them for commercials on television either, do they?<br/>I'm a big fan of intermissions at the movies. A friend and I discussed it only the other day. Especially when it comes to movie marathons and such, you are ALWAYS in need of more food, drink and toliet breaks. Not only will you get an audience more willing to come back because they were comfortable, you will make that little bit extra on the candy bar at half time.<br/><br/>You may think that you will get people complaining about having the movie stopped half way through. Think about it though, with movies getting longer and longer every day - toliet breaks become more wanted and an icecream more desired...",
      "created_at": "2004-06-11T23:32:54.000Z"
    },
    {
      "author": "Dries",
      "body": "Especially in longer films--think Lord of the Rings--an intermission would be useful. Many other forms of performance have intermissions (theater, opera, the symphony) so why should film not have an intermission?",
      "created_at": "2004-06-11T23:33:13.000Z"
    },
    {
      "author": "Steve",
      "body": "I'm kinda on the fence here. Lord knows that I'm not necessarily in disfavor of intermissions. But I think it's on a case-by-case basis. There's a lot of films that could handle an intermission. Especially the bad ones. But then again, there are certain films (\"Eternal Sunshine of the Spotless Mind\" and \"Dogville\" are two recent examples) that would have their flow or build or whatever you wish to call it disrupted by a ten-minute break. (And feel free to note, by the by, that this comment comes from a guy who can't watch most films on video without needing a break every thirty minutes.) I think, as a business decision, it makes a lot of sense, especially considering the attention span of the average moviegoer these days (again, I offer myself as an example... a guy who couldn't find time to watch \"The Godfather Part II\" until he was sick and bedridden). But as an aesthetic decision, it's not quite that easy.",
      "created_at": "2004-06-11T23:33:38.000Z"
    },
    {
      "author": "Harriet",
      "body": "oh I miss intermissions! Every time I take my children to the movies I think about when I was a kid and my dad taking us out to get a choc top at intermission. I would love a few minutes in the middle of a movie to rush the kids off to the toilet etc.. but in the big theatres of today it would just be a drama anyway, with hordes of people leaving and coming back in. Thanks for bringing on a moment of nostalgia, and good luck with your venture :o)",
      "created_at": "2004-06-11T23:34:00.000Z"
    },
    {
      "author": "Ozzilyn Bean",
      "body": "Personally, I'm on the fence about intermissions. But knowing that the theater, especially an art house theater, is making most of its money from concessions, I could be won over by the idea of intermission. Perhaps you could offer two different showings of a movie to appease both preferences. For instance, all the movies which start between 6pm-8pm have intermissions. The next showing, starting between 8:30pm-10:30pm do NOT have intermissions. You alternate back and forth, or have just one showing without intermission per day for the die-hards who want their movie with its original flow.<br/><br/>Of course, you still have to get around the contract....",
      "created_at": "2004-06-11T23:34:25.000Z"
    },
    {
      "author": "Jay",
      "body": "I'd rather wear a diaper and piss my pants than pause during the climax. But I'm a pig that way.",
      "created_at": "2004-06-11T23:34:49.000Z"
    },
    {
      "author": "Stefan",
      "body": "I agree with the poster who said that it's a \"case-by-case\" decision on your part. I can think of plenty of films for whom an intermission would be a mood-killer to many viewers (think of \"Memento\" had it been interrupted).<br/><br/>My other piece of advice would be warn viewers ahead of time -- before the movie, or even in your ads, on the phone, on your (presumably in construction) website -- that the movie will include an intermission. That way, people can adjust their expectations accordingly.<br/><br/>As for concessions (I know, different post, but I'm too lazy to post twice), my one request is that the prices be comparatively reasonable -- the prices at my local Southwestern Megaplexes are what keep me from getting any concessions except the occasional frozen yogurt (mmmmm... frogurt!)<br/><br/>Great blog. You're doing something I've daydreamed about for a number of years, so I look forward to reading about it some more...",
      "created_at": "2004-06-11T23:35:14.000Z"
    },
    {
      "author": "jarrod",
      "body": "Intermissions are great both financially and socially I think, though probably not necessary for shorter films. Gives a different feel from your normal megaplex movie experience.",
      "created_at": "2004-06-11T23:35:33.000Z"
    },
    {
      "author": "La Lucuma",
      "body": "Intermissions seem so quaint now given the onslaught of sensory stimulation we are currently given at the movie theaters. They had them in the theater we used to go to in Maputo, Mozambique, and it was a really nice opportunity to stretch your legs and get some of that nice popcorn made with sugar instead of salt. I don't agree with the folks who say that some movies shouldn't be interrupted because I think an intermission would always give you a good chance to mull over what's been going on, and as many people have said, chat about it without being shushed. So that's my vote in favor.",
      "created_at": "2004-06-11T23:36:02.000Z"
    },
    {
      "author": "nodmonkey",
      "body": "I made a comment about my desire to see the return of intermissions on my own weblog. If you can, then I say do... when the movie stretches into 2 hours at least. Also, you would have to make your own judgement as to when is suitable, I take it some movies would just be quite spoilt by a forced intermission. You seem tasteful enough to know that. So go for it!",
      "created_at": "2004-06-11T23:36:22.000Z"
    },
    {
      "author": "Projectionist",
      "body": "Intermissions are fine if you're showing some four hour Bollywood epic, but for anything less than two hours they break the momentum (and if you've got more than one screen can be a nightmare for the ushers).<br/><br/>Platters are great - if only because they minimise the amount of back-breaking lifting the projectionist has to do. But be warned - when you're buying your equipment, make sure you invest in some film clamps (and make sure there's always somebody willing to help the projectionist move a large film, even when the cinema is busy); platters don't wind particularly tight reels, and I've seen too many films strewn across the projection room floor because the centre popped out while the projectionist was trying to move it by his or herself. Clamps will secure any 90-180 minute films, and cost much much less than a couple of hundred refunds and replacing a damaged print!",
      "created_at": "2004-06-14T00:01:10.000Z"
    },
    {
      "author": "stefani",
      "body": "Hi, I'd like to vote in favor of intermissions, especially if the movie is more then two hours long.  At two hours clocktime there will be plenty of time for the movie to rebuild any momemtum it has lost, and when I'm sitting there with that mega-coke I just can't wait that long and wind up either missing 10 minutes of the movie or or sitting very uncomfortably for the last (half) hour.  Please please please have them for long movies.  Just make sure you have enough stalls in the ladies room to accomodate the girls.",
      "created_at": "2004-06-15T01:07:30.000Z"
    },
    {
      "author": "Steve",
      "body": "Here's a couple questions. <br/><br/>I begin the production of feature length film in April 06. The estimated run time of the film, less trailing credits, is about 100 minutes. <br/><br/>I am a lover of the intermission and I've thought about adding an extra 900 feet of film on every print just to ensure that one exists regardless of the exhibitor.  With digital cinema, there is virtually no extra cost. Distribution would allow the exhibitors to play the film's intermission or sub their own. The film's intermission might be something as simple as a fish swimming on a solid white screen with a 10:00 minute countdown clock, music. Nothing you would miss.<br/><br/>My questions are: Is a 100 minute film too short to have an intermission?<br/><br/>Would an in-film intermission defeat the purpose of having one?  Would you leave your seat? <br/>    <br/><br/>    ",
      "created_at": "2005-06-14T22:27:36.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
