{
  "id": 120,
  "title": "Hey look, Part 3",
  "body": "<b>Art house theater to open in center city</b><br/>By Jill Henry<br/><a href=\"http://www.sbj.net\" target=\"_blank\">Springfield Business Journal</a>, December 20, 2004<br/><br/><i>Independent film is theme behind Moxie Cinema</i><br/><br/>With all the development and revitalization, it's no secret that downtown Springfield has got Moxie. More is on the way.<br/><br/>Moxie Cinema, an art house theater, will open downtown in March 2005. Dan and Nicole [Silly Putty] plan to open the theater in about 2,600 square feet of leased space on the first floor of 408 W. Walnut St., a 6,000-square-foot building owned by Andrew and Ellen [Owners] and Doug [Owner].<br/><br/>Andrew [Owners] said that the rate and terms of the lease with Moxie Cinema have not been finalized. The building, which was built in 1930s, was renovated by the [Owners] and [Owner] in 2002 and has three residential lofts upstairs. The most recent downstairs tenant, The Rare Breed Youth Drop-In Center, moved to 215 S. Campbell Ave. about two months ago, [Owners] said.<br/><br/>The [Silly Putty]s, Springfield natives and 2003 graduates of the University of Missouri-Columbia, are patterning Moxie Cinema after a favorite hangout of theirs in Columbia, Ragtag Cinemacafe.<br/><br/>\"Each film was prefaced by someone coming out and personally introducing the film, talking to the audience. It really put a face on the theater because we would see the owners and we'd see the people who were running it and get to know them,\" Dan [Silly Putty] said. \"It was so different than what you're used to at a multiplex.\"<br/><br/>The Moxie will have a wine bar and an art gallery showing works of regional artists.<br/><br/>\"It's going to be a small theater, something most people aren't accustomed to. We're going to hopefully have chairs and sofas instead of movie theater seats to relay a nice, laid back, relaxed atmosphere,\" [Silly Putty] said.<br/><br/>The [Silly Putty]s are contacting downtown businesses to set up symbiotic relationships - to serve coffee or baked goods at the theater and to bring more visitors downtown. They're also considered joining forces with restaurants to offer dinner-and-a-movie certificates.<br/><br/>Nancy Dornan, a longtime downtown Springfield theater visionary, has given the Moxie her stamp of approval - even as she works to get the Gillioz Theatre back in action.<br/><br/>\"It's a wonderful, wonderful addition to downtown,\" said Dornan, president of the board of directors for the Gillioz. \"Based on my experience with art film houses in other areas, I think we're long overdue for it and I think it will be a smashing success.\"<br/><br/>The target opening date for the Gillioz, Dornan said, is Oct. 11, 2005, to celebrate the 79th anniversary of its original opening. Dornan said that the Gillioz will be part of First Friday Art Walk for the next three months and, with heat and restrooms in place, is now able to host its own fund-raising events.<br/><br/>The complex that houses the Gillioz and the Jim D. Morris Arts Center was renamed the Ronald and Nancy Reagan Center in August when the House Appropriation Committee approved $500,000 for restoration. The Gillioz has been approved for a matching federal grant from Save America's Treasures, a program administered by the National Park Service, which will help to bring the 78-year-old historic Gillioz back to life as a center for the arts.<br/><br/>With the Gillioz preparing to open and a first-run movie theater in the works at the proposed College Station development, [Silly Putty] said that the Moxie would fill a void in the Springfield market. \"The more screens the better,\" he said. \"Exposing Springfield to these smaller films that have been passing it by is our main goal.\"<br/><br/>Kirby Cobb, an independent filmmaker and founder of the Independent Filmmaker's Coalition in Kansas City, said that art house theaters and small screens are vital for the distribution of independent films. \"It has become easier to actually produce the films, but getting them into the<br/>aters has become much more difficult,\" Cobb said. \"These smaller theaters are the perfect outlet and revenue source for independent films. They appeal to a much overlooked market and allow for more latitude with regards to content and creativity.\"",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-12-20T22:10:42.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "einaphets",
      "body": "So, there's another art-house opening? Wow, when it rains, it pours.",
      "created_at": "2004-12-20T22:34:11.000Z"
    },
    {
      "author": "sliqmick",
      "body": "I Love SillyPutty.... or was that David Putty.....um, er,...Vegetable Lasagne!",
      "created_at": "2004-12-20T22:34:59.000Z"
    },
    {
      "author": "bjork24",
      "body": "Einaphets: No, we're the only art-house theater. The Gillioz isn't going to be art-house.<br/><br/>Sliqmick: I don't know what you're talking about, but I dig it!",
      "created_at": "2004-12-20T22:44:00.000Z"
    },
    {
      "author": "nicole",
      "body": "I think it's a very nice article. I especially wish my last name was Silly Putty. That would be cool.",
      "created_at": "2004-12-21T01:50:36.000Z"
    },
    {
      "author": "bjork24",
      "body": "It's never too late to have our last name changed!",
      "created_at": "2004-12-21T01:56:57.000Z"
    },
    {
      "author": "Fyse",
      "body": "Good article. Lots of postive comments and encouragement. I wish someone would open a Ragtag-esque cinema where I live. You know, in a city of 100,000 people we don't even have a first-run cinema, let alone anything else. We're desperate for our very own Mr and Mrs Silly-Putty!<br/><br/>I love Silly Putty. And did you ever get those little pots of slime? The ones that farted when you shoved a finger in? Those were the days...",
      "created_at": "2004-12-21T05:59:44.000Z"
    },
    {
      "author": "bjork24",
      "body": "Fyse: my family had at LEAST 5 cans of the farting slime. My mom would die laughing anytime she heard it.",
      "created_at": "2004-12-21T07:31:42.000Z"
    },
    {
      "author": "Nicholas",
      "body": "The Gillioz will be doing mostly live venues and classics (His Girl Friday, <a href=\"http://imdb.com/title/tt0058548/?fr=c2l0ZT1kZnxteD0yMHxzZz0xfGxtPTIwMHx0dD1vbnxwbj0wfHE9U2FudGEgQ0xhdXMgQ29ucXVlcnMgdGhlIE1hcnRpYW5zfGh0bWw9MXxubT1vbg__;fc=1;ft=2;fm=1\">Santa Claus Conquers the Martians</a>--which I bought today on DVD).<br/><br/>I had the He-Man Slime Pit--which was awesome except it dissolved the fuzz off of Mossman and made him \"I use Nair\"-Man.<br/><br/>-N-",
      "created_at": "2004-12-25T07:58:39.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
