{
  "id": 126,
  "title": "This just in: Dan makes new post.",
  "body": "Hello all. Happy 2005, and welcome to my first post as a born-again Springfieldian. I'd like to tell you that I'm writing this from our new house, but I'm can't, because that would be a filthy lie. I'm actually writing it from my parent's house... in the nude. The house is nude, not me.\r\n\r\nAs it turns out, our house isn't quite \"livable\" yet. You see, we can't move in until we have hot water, but we can't have hot water until we install the new hot water heater, but we can't install the new hot water heater until we grout the tile, but the tile can't be grouted until it's cut and glued down, but the tile can't be cut and glued down until the cabinets have been fixed (we ripped out several sections), but the cabinets can't be fixed until Nicole and I find temporary jobs, but we can't go to a job interview until we take showers, but we can't take showers until the shower is installed, and the shower won't be installed until we have hot water, which, as I said before, won't be possible until we hire a red-sideburned Irishman to chop us a cord of wood. Make sense? Good.\r\n\r\nIn all actuality, we should be moving into our new abode in a few short days. In the meantime, Nicole and I will be busying ourselves with stuff like: painting, mopping, building cabinets, meeting with building owners, talking with reporters, unpacking, showering (see preceding paragraph), not eating, and taking in baby gibberish to Bogey. With that being said, here's a nice little pseudo-blurb that appeared in today's paper:\r\n\r\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \r\n\r\n<i>This excerpt comes from a lengthy column by Steve Koehler titled \"'05 wish list: Improve movie variety, quit using God as cudgel.\"</i>\r\n\r\nWe need a better selection of movies. When are movie houses going to realize some of us are looking for more than the latest kiddie cartoon movie or some moronic comedy schlock?\r\n\r\nI saw a recent list of the top 10 movies of 2004 and fewer than half had been in Springfield, including \"Sideways,\" a candidate for film of the year.\r\n\r\nUnfortunately, independent films and documentaries don't appear to be welcomed by our first-run theaters.\r\n\r\nThere could be good news, however, with a scheduled February opening of a Walnut Street theater to show art and independent films.\r\n\r\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \r\n\r\nYay! The word continues to spread.\r\n\r\nI just glanced down at my amazing hands and noticed that they're covered in paint. I better go take a quick shower.\r\n\r\nBefore I go, I'd like to do a couple things:\r\n\r\n1. Give a big thank you to Adam and Jamie for helping us move out, and to Doug, Chris, Nancy and Bob, my sister, and my folks for helping us move in.\r\n\r\n2. Write a diamonte:<center>\r\n\r\nHands\r\nAmazing Dirty\r\nPainting Hammering Tickling\r\nGloves Knuckles Apple Desk\r\nTeaching Writing Scolding\r\nNice Pretty\r\nTeacher</center>\r\n\r\n3. Congratulate you, the reader, if you've read this far. Congratulations.\r\n\r\n4. Pick your minds. Here's the deal. We, as customers, prefer convenience over inconvenience, but we, as business owners, don't like to lose money. So, would you be completely put off and/or pissed if you went to the Moxie only to find that we were CASH ONLY? I hate not being able to use my debit card, but let me tell you, processing credit transactions is like throwing money out the window, into a waiting truck, and then having it driven miles and miles away where it is guarded over by an axe-wielding, red-sideburned, wood-cutting Irishman. So, how would you feel? If you've read this far and don't leave your two cents in the comments section, I will damn you to Rolla.\r\n\r\nUntil next time... Adios.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-01-02T05:05:15.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Lor",
      "body": "Happy New Year! Congratulations on the move. Only two months till the Moxie opens. I'm kinda excited, even though I live so far away I'll never be able to visit.\r\n\r\nI'd only be annoyed if I waited in a long que then got told \"sorry cash only\" because that's embarrasing or if all I had was my card and there was no ATM.",
      "created_at": "2005-01-02T05:26:55.000Z"
    },
    {
      "author": "justin",
      "body": "Cash-only sucks, I think.  How much do you get charged for each transaction?  What if you put up a sign saying \"please try and keep credit card transactions to $10 and more!\"?  ",
      "created_at": "2005-01-02T05:32:49.000Z"
    },
    {
      "author": "whitty",
      "body": "Cash only does indeed suck mainly because I hardly carry cash, however, there is at least two no fee ATMs between my house and the Moxie so I would be okay with it.  AND you are right down the street from my credit union (which doesn't have an ATM, but that is another story), so really, it isn't a huge inconvience to me personally.  While I know that you are basing all of the Moxie's business around me, it might not be convenient for everybody.\r\n\r\nI know that the downtown grocery store makes you send at least $5 bucks to use your credit card.  It is no big deal, I just by more gum. \r\n\r\nPhew, now I don't have to go to Rolla.",
      "created_at": "2005-01-02T05:50:41.000Z"
    },
    {
      "author": "whittler",
      "body": "It wouldn't bother me. But I'm together enough to front up to a movie house with a bit of cash in my pocket (right next to the sunshine). But as you have probably gleaned from earlier commenters, consumers EXPECT to be able to use plastic. This is always a tough issue for small business (duh, bit obvious Whittler).",
      "created_at": "2005-01-02T06:15:47.000Z"
    },
    {
      "author": "bjork24",
      "body": "I need to find out how close the nearest ATM is to the Moxie. The cost for processing our own transactions is $250 per annum, $10 per month, 1.79% of the price and $0.20 per transaction. That's roughly $0.35 per ticket. Pretty shitty if you ask me.",
      "created_at": "2005-01-02T09:00:00.000Z"
    },
    {
      "author": "Dave",
      "body": "what about the barter system? how many beers can i get for a live chicken?\r\n\r\nseriously. cash only is a pain in the ass.",
      "created_at": "2005-01-02T11:23:15.000Z"
    },
    {
      "author": "c",
      "body": "Ha, as an alternate view: it's always cash only at the theatre for me. i prefer it, find it expedient. none of this waiting for \"acceptance\" and such, holding up the line. but i also have something personal against usings cred/deb cards for small purchases.\r\ncards are evil and the lugs what hornswaggle innocent small-business-types into bucking up precious profits for the \"convenience\" of it all are a purer form of said evil. it's robbery, hands down.\r\n\r\nin my exp: laying out an avenue for plastic is a sad necessity, folks use them for everything. i think if more people realized how rotten the whole racket is they'd alter their spending habits to support the little guys [rather, i hope they would].\r\n\r\nin the real world, you need to have the service available.  in an ideal world, there's an atm near-by and eager movie goers have the $ before getting in line.\r\n\r\nHappy house fixin'",
      "created_at": "2005-01-02T15:32:01.000Z"
    },
    {
      "author": "Oz",
      "body": "I would be annoyed by not being able to use my credit card.  However, I have been to a movie theater--and a big one at that--that was cash only.  They had an ATM in the lobby, so that helped.  Although I DID have to get to the front of the line to find out that it was cash only.  I recommend big signs saying \"Cash Only.\"  How difficult would it be to get an ATM in your lobby?  I'd look into that.  You might even make money off of it if you can \"own\" it or whatever (I really have no idea how ATMs work).  Even if it belonged to the bank, what would it hurt them to have another ATM out there?\r\n\r\nOz, why are you harping on the ATM thing so much?  Well, here's the dealio.  If I was an idiot and did not see the sign stating that the Moxie was cash only (quite possible) and then I waited in line, got turned away, and then had to leave to walk a block to go to an ATM and return....I just don't think I'd do it.\r\n\r\nAnd another thing, if you're charging like $8 a beer (typical), people would have to bring a bunch of cash with them, you know, if they wanted to get loaded.  You certainly wouldn't want anyone NOT to be able to spend money on your concession stand because they'd already used all their money buying a movie ticket.",
      "created_at": "2005-01-02T19:09:54.000Z"
    },
    {
      "author": "Jennifer Neil",
      "body": "Hey, Dan,\r\n\r\nI live in Canada and am very envious.  Our city doesn't have a rep theatre, either, and it's two hours to Toronto!  Good luck and Congratulations!\r\n\r\nAs for the \"Cash Only,\" thing, it will be slightly inconvenient as people have become dependent on all those little plastic cards.  If, however, you put up a big sign that says \"Cash Only, Please,\" in a very visible spot, customers can't say they haven't been warned before they go to the Box Office.  Although this is only common sense, you'd be surprised how many little businesses around here forget to warn their customers about stuff like this.  Something to keep in mind, though, word of mouth is powerful advertising.  As your business grows (and I have no doubt that it WILL), your customers will let their friends know, and smart journalists will let their readers know about your policy.  The first few months will be rocky, but after people are aware of the \"Cash Only\" thing, it'll be smooth sailing.\r\n\r\nAnother idea is for YOU to buy an ATM to put near the Box Office for the convenience of your customers.  Hey, if Mom 'n' Pop variety stores can have them, why can't you?  I'm not sure how much it is to pick one of these babies up, but the service charges pretty much pay you back.  If you haven't already, I recommend you look into it.\r\n\r\nCan I also say I think you and Nicole are very, very brave?  I've been thinking of this kind of thing for a long time, and never had the guts to do it.  My hat is off to you!",
      "created_at": "2005-01-02T19:12:14.000Z"
    },
    {
      "author": "Al",
      "body": "In 2005, \"cash only\" is absurd.  35 cents of a ticket is a lot?  Please.  It's a pittance compared to the lost revenue of a single pair of customers.  \r\n\r\nThe only way you should even consider it if if you have an ATM in the lobby.  But, seriously, it shouldn't even be considered then.  The world runs on plastic.  ",
      "created_at": "2005-01-02T19:29:45.000Z"
    },
    {
      "author": "bryan",
      "body": "Personally, I think taking plastic is an evil necessity, but at the same time there was a theatre here in atlanta that only took cash.  they have since changed, but they did start out that way.  i think oz brings up the best point... alcohol.  people that purchase alcohol will probably purchase more if they can drop the cost on their plastic buddy.\r\n\r\ni'm sure you already know, but stay away form discover and amex and that'll help.  good luck.",
      "created_at": "2005-01-02T19:30:07.000Z"
    },
    {
      "author": "whitty",
      "body": "After confering with Timmy, we have come to the conclusion that there is only ONE ATM in all of downtown Springfield at the bank on McDaniel. That sucks.  And it is a considerable distance from the Moxie.\r\n\r\nOn the other hand, it might mean that people are already coming downtown loaded with cash.   ",
      "created_at": "2005-01-02T22:40:45.000Z"
    },
    {
      "author": "Brandon",
      "body": "If you're looking to get college students on the bandwagon, the card rules their lives now just like everybody else's.  Building up your credit during your college years is now the \"smart\" thing to do...  even so, I think the concept of cash only WITH A PURPOSE could benefit your image.  Post a few nicely written and constructed signs around the lobby and waiting areas saying that: \"Credit card use might be convenient, but it is promoting the 'first-run theatre' attitude of society.  Do you want the newest, latest thing at the expense of being psychologically deceived by all-powerful credit corporations?  I didn't think so... If you did, you wouldn't be here!  You'd be at Wal-Mart, or watching yet another movie starring The Rock.  So thank you for holding up the little guy.  I know you'll be glad you did.\"\r\n\r\nYou don't have to mention at all that you just dont wanna lose money through processing.  Good luck.",
      "created_at": "2005-01-03T01:33:02.000Z"
    },
    {
      "author": "Ben D.",
      "body": "A cash-only policy wouldn't bother me, but that's probably because I'm 17 years old, I don't have a credit or debit card, and I don't live in Springfield, so I wouldn't be a frequent visitor to the theater. Although, I will most likely get a debit card before college, and I may even be living in Missouri next year. \r\n\r\nAnyway, I can understand how the policy would upset the average customer. Just think, what if Brad Pitt does decide to stop by your theater and he has to deal with the cash-only policy? You know how celebrities love their credit cards. Then again, he would most likely have a load of cash with him as well.",
      "created_at": "2005-01-03T04:42:38.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "The only place in town that I frequent that's cash only is Andy's and they have an ATM.  I think cash only is fine IF you have an ATM in the lobby.  One of those withdrawal-only small models like you see in all the gas stations shouldn't be too expensive (I have no idea).\r\n\r\nBut if you can't do that I think you have to give in and take credit cards.  I never use credit at movie theatres, but I think most people expect to be able to use their cards everywhere.  Mickey D's and BK take credit nowadays.\r\n\r\nMinimum purchases would be okay.  Family Video requires $10 minimum, but they will credit it to your store account if you are getting less.  You could do the same.  If someone wanted to pay for one ticket with a credit card, you could require a 10 dollar minimum and just give them a gift certificate for the remaining.",
      "created_at": "2005-01-03T05:49:06.000Z"
    },
    {
      "author": "bjork24",
      "body": "Geez guys! All your comments are so helpful...\r\n\r\nI just cried a little.\r\n\r\n*blushes*\r\n\r\nNow I don't know what to do. Both sides of the spectrum were argued with equal moxie. I think I'm going to go take a shower and contemplate.",
      "created_at": "2005-01-03T05:56:03.000Z"
    },
    {
      "author": "nicole",
      "body": "I like the gift certificate idea. Being the one who will most likely run the box office, I'm not sure if that would be a hassle or not, but it's got my vote for now. As for me, I prefer plastic option. I can't help it. I haven't seen what a dollar bill looks like in ages! My purse can only hold so much.",
      "created_at": "2005-01-03T06:14:31.000Z"
    },
    {
      "author": "Al",
      "body": "FYI, I'm 99% sure your deal with Visa/MC says you cannot do a \"minimum\" charge.  Some break this rule, especially small mail order, but you can't get away with it live and in person.\r\n\r\nI had never considered it, but it is true about \"average purchase by customer\" going way up when it's on a credit card.  McDonalds trial run showed the average credit card trany was $1.50 more than cash.  \r\n\r\nIf you are to be taken seriously, you gotta take cards.",
      "created_at": "2005-01-03T06:33:32.000Z"
    },
    {
      "author": "Fyse",
      "body": "I've gotta go down VERY firmly on the 'accept plastic' side of the debate. I can obviously only go on my experience this side of the Atlantic, but here it is <i>very</i> rare to find a place that wont accept credit cards. Even the tiny sandwich shop near me at uni accepts plastic because students <i>love</i> their credit/debit cards. Credit cards may be an evil, but you'd be fighting a losing battle.\r\n\r\nFor what it's worth, I think cards are the way forward, especially with the new 'chip and pin' system being introduced in the UK. You got anything like that in the US?\r\n\r\nAnd those non-bank cash machines are evil. In the UK they charge &pound;1.50 per transaction, and I refuse to use them on principal.\r\n\r\nWhat a long comment. Good luck with making your house habitable!",
      "created_at": "2005-01-03T08:13:29.000Z"
    },
    {
      "author": "Mina",
      "body": "My parents are small business owners, for them, a cash only policy is not even an option. For beginners, those rental ATM machines come with complicated contracts and minimum quotas ($X amount of transactions must be reached each month, or you face a hefty penalty fee) eitheir that, or they charge ridiculous rental fees. Also, ATM's must always be stocked with cash from the owners/business sales. Of course, their is always the threat of robbery, and depending on your location (I'm obviously not from downtown Springfield) such large amounts usually become targets for criminals. Finally, from a consumer's point of view, I hate spending that extra $2.50 on ATM fees. I would much rather pay .35 cents more for a ticket. \r\n\r\nThe minimum purchase deal is something I always see with small businesses, although I have never heard of credit card companies banning the practice.\r\n\r\nAnyways, too make a lengthy story short, you just gotta accept plastic. Although it may seem harsh, a previous poster was right on the money (credit card?); you won't be taken seriously otherwise. ",
      "created_at": "2005-01-03T09:25:43.000Z"
    },
    {
      "author": "Devin",
      "body": "Just have an ATM in the Lobby and lots of Cash Only signage. Mast ATM's can be handled like a Vending Machine (Where you get some of the fees associated with it) Or Partner with a local bank and see what they say. I hate that my Favorite theatre is cash only on the concessions. Especially when I am in a hurry and they don't have an ATM.\r\n",
      "created_at": "2005-01-03T17:36:24.000Z"
    },
    {
      "author": "einahpets",
      "body": "I'd prefer using my cards. But could I just flash a dazzling smile or something?",
      "created_at": "2005-01-03T18:47:04.000Z"
    },
    {
      "author": "Carl",
      "body": "Many times I do not have that much cash in the wallet.  Therefore would make it up to the window and if I did have enough to get in , would not have any to buy the wine and teats (where you will make your money from).  So in cash only I would get a fairly cheap movie, but not the full experince and you may one break even.",
      "created_at": "2005-01-03T19:50:17.000Z"
    },
    {
      "author": "justin",
      "body": "Is Ragtag cash-only? I think it is. The type of people who will frequent the theater will be understanding in the fact that you're a small <i>independent</i> theater, so the luxuries of a larger establishment might not exist.  Come to think of it, I don't even think the larger theaters here in Columbia take cards.  If they have, I've never used them. But I have used the ATM in the lobby.\r\n\r\nI think your best bet is to find out where the closest ATM is, and possibly have a small map in the lobby pointing customers to it.  If it's far away, talk with other businesses near by to see if they'd want to help (financially) get an ATM that's closer to all of your businesses.",
      "created_at": "2005-01-03T20:32:07.000Z"
    },
    {
      "author": "Scott G.",
      "body": "Can you get a free ATM located at the Moxie?  I think you have to allow plastic, the charges are just one of the costs of doing business",
      "created_at": "2005-01-03T21:49:06.000Z"
    },
    {
      "author": "Luke",
      "body": "I often avoid places with cash-only policies because debit cards rule.  I just never have cash since the rise of teh debit card.  It would be somewhat off putting, but if the Moxioe were the only place to see an indie movie, I would make due.\r\n\r\nYou guys should talk to an ATM company.  That would be a big help I think, and you wouldn't need to worry about the debit and credit card fees.",
      "created_at": "2005-01-04T20:43:12.000Z"
    },
    {
      "author": "matt",
      "body": "keep in mind that if you are cash only, you will likely lose customers simply because what might have been a knee-jerk spur of the moment 'let's see a movie' decision becomes a 'oh shit, but they don't take credit cards, i have no cash/i am broke, never mind' decision.  unfortunately, a lot of folks buy things on credit that they can't really afford, movie tickets included, and you'll more than make up for the fees by not losing the business.",
      "created_at": "2005-01-04T22:04:50.000Z"
    },
    {
      "author": "Dan Magnum's Boyfiend",
      "body": "Happy New Year Daniel; all my love and this year, as always, just remember to bend over; \r\n\r\nCUZ DADDY'S DRIVING!",
      "created_at": "2005-01-06T10:42:11.000Z"
    },
    {
      "author": "bjork24",
      "body": "Who's Dan Magnum, and why does he have a boyFIEND?",
      "created_at": "2005-01-06T20:07:09.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
