{
  "id": 127,
  "title": "Credit cards and hard work",
  "body": "Today marks our first Moxie business day in Springfield. To mark the occasion, Nicole and I are busying ourselves with meetings, errands, and lots and lots of phone calls. I have a mobile command center set up on the floor of my dad's computer room so I can have easier access to all of my business information / contacts, but mostly so I can surf porn sites a bit more inconspicuously.<br/><br/>I'd like to give a big thanks to everyone who left their two cents about whether we should accept plastic or not. I saw a lot of people who hadn't commented before, which makes me think I should threaten damnation to Rolla more often. NOTE: If you're reading this and you're from Rolla... I'm so sorry.<br/><br/>So, after much consideration, I think we've decided to accept credit cards. Here's why:<br/><br/>1. <b>Convenience</b> - Duh. The more forms of currency we accept, the more likely our customers are to spend their hard-earned moohlah.<br/><br/>2. <b>Spendability</b> - I know that's not a word, but bear with me. If we only accept cash, customers will come to the Moxie with a set amount of money they can spend, but if we accept plastic, their credit line's the limit! I don't want to sound greedy, but allowing people to spend as much money as possible can't be a bad thing.<br/><br/>3. <b>Internet ticketing</b> - We're going to sell tickets online (with an additional $0.50 service charge), so we'll definitely need to be able to accept credit cards. We might as well get one merchant account and use it for both store fronts (online and brick-n-mortar).<br/><br/>4. <b>Super cool member cards and gift certificates</b> - If we have credit card readers (magnetic strip), our software suite will allow us to make and use <a href=\"http://www.plasticprinters.com/\" target=\"_blank\">super cool membership cards and gift certificates</a> for the Moxie! No matter how you slice it, that's just plain awesome.<br/><br/>5. <b>College students</b> - We'd be foolish not to consider the spending habits of one of our largest marketing segments, college students. If my stats are still up-to-date, then modern college students only love the following seven things: using credit cards, buying things online, drinking beer, wearing flip-flops, posters of John Belushi and/or Che Guevara, sleeping in, and carrots. Who am I to deny them these simple pleasures?<br/><br/>6. <b>Pity signage</b> - Along with our credit card acceptance, we're still going to hang a few signs that let people know our TRUE feelings. For instance, \"The Moxie would appreciate it if you'd use cash for purchases under $10.00. You see, our credit and debit processing center employs hundreds of thousands of tiny puppies with big wet eyes and floppy ears to process your transaction. That high pitched scratchy noise you hear every time we swipe your card isn't the modem. It's the death cries of at least 8 to 12 helpless little pups.\"<br/><br/>7. <b>I don't cotton to ATM's</b> - The closest ATM to downtown Springfield is somewhere in Chicago and having one installed is expensive and, in most respects, a tad bit tacky. I don't know about you, but I'd much rather incur the processing fee than be chased around the lobby by an ATM that looks like R2-D2 and has lasers and scalpels coming out of it.<br/><br/>I think there were more reasons, but time keeps on slippin', slippin', slippin' into the future and Nicole and I have a million errands to complete. Thanks again for all the constructive comments, kind readers. As you can see from my list of reasons, we took each and every one of them to heart. My heart is heavy with your caring comments. SO heavy. I'll have more polarizing questions to bounce off of you in the near future, but until then... be safe, and if you can't be safe, be careful, and if you can't be careful, eat carrots.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-01-03T21:27:10.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Aaron",
      "body": "How often to expect online ticket sales to be used? I assume you'll have a pretty complex box office tracker to keep track of seats sold. I guess my concern would be over-booking the seats because you might have a bunch of net-orders and a bunch of people show up at the box office on the same night for a popular show.<br/><br/>And could you bring the Life Aquatic back around? I've already seen it twice at the Sixteen and I really don't want to go back there (people were parking in the grass on Saturday!), but I just might have to. Tomorrow.",
      "created_at": "2005-01-03T21:42:36.000Z"
    },
    {
      "author": "Aaron",
      "body": "Oh, and Great Southern has an ATM inside their entrance at their location on South Street, and based on their FDIC 2004 market shares (as reported by the Springfield Business Journal), they hold the largest market share for banks in the city.",
      "created_at": "2005-01-03T21:44:33.000Z"
    },
    {
      "author": "einahpets",
      "body": "Glad to see you were flexible with everyone's suggestions. If I lived in Springfield, I would have to make a point to have cash to see the movies...and eat.",
      "created_at": "2005-01-03T22:59:49.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Thanks for the update!  I think it's the right decision, but you can be sure my wife and I will only pay cash.  The membership card/stored balance thing sounds great!  My only question: as Moxie members, will we get discounts on the Belushi posters?",
      "created_at": "2005-01-03T23:13:21.000Z"
    },
    {
      "author": "Justin",
      "body": "Dan, I'm going to get you a gift certificate to the Moxie for a late Christmas present.",
      "created_at": "2005-01-04T02:03:18.000Z"
    },
    {
      "author": "whittler",
      "body": "and if you can't eat carrots, tame an otter and stroke it.",
      "created_at": "2005-01-04T07:34:09.000Z"
    },
    {
      "author": "Fyse",
      "body": "Everyone who has enjoyed reading this blog as much as I have, go to...<br/><br/>http://2005.bloggies.com<br/><br/>...and get nominating!",
      "created_at": "2005-01-04T18:52:35.000Z"
    },
    {
      "author": "Al",
      "body": "As for the stored value cards, I'd give folks a 10-20% bonus (pay $50, get $60 on your card).  I'm sure the float makes up for it, and many folks will either lose or not use the card anyway.  ",
      "created_at": "2005-01-04T20:15:45.000Z"
    },
    {
      "author": "Oz",
      "body": "I was quite surprised by your opinion of ATMs.  My reaction to seeing one anywhere is, \"Oh, how convenient!\"  Anywho, I think you're making the right decision with taking credit cards.  If your bread and butter will be concession sales, you want people to be able to get however much then want without being limited by the good judgement they used when placing cash in their wallets.",
      "created_at": "2005-01-04T23:49:24.000Z"
    },
    {
      "author": "matt",
      "body": "Bravo on the sensible move to allow people to overextend themselves to your chagrin!  Now one thing I've been wondering--you seem like a down to earth couple who wants to cut through the BS and likes to swim against the current.  Are the small sodas going to cost $3.50?  I'm just wondering cause it's not often you see a theater built from the ground up and every time I go to an Indie theater I think \"gosh, would it kill anyone not to gouge the hell out of people for $.50 worth of popcorn?\"",
      "created_at": "2005-01-05T02:12:45.000Z"
    },
    {
      "author": "bjork24",
      "body": "Matt, our small popcorns and pops (sodas) will cost around $1.50 each. Since we're saving quite a bit of money on the distribution, we thought we'd pass those savings on to the customer through lower concession prices. Aren't we rad?!",
      "created_at": "2005-01-05T02:18:00.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Dan, what's your policy going to be on bringing in outside food and drink?  I ask only because I'm curious.<br/><br/>My wife and I went to Paris recently and saw a movie (Eternal Sunshine--in English with French subtitles!) and half the audience had openly brought crepes and snacks to munch on.<br/><br/>I know that's a cultural difference, but I was just wondering if you'd thought about it.",
      "created_at": "2005-01-05T02:31:16.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Not that I want to bring stuff in, I just wonder how you'll handle it.",
      "created_at": "2005-01-05T02:31:42.000Z"
    },
    {
      "author": "bjork24",
      "body": "We will throw all offenders into the bank vault, lock it, and throw away the key. Being as we only have one set of keys, this punishment will only work once.<br/><br/>In all honesty, we're not going to come down hard on people who bring in their own food. If they bring in a bucket of Popeye's fried chicken and it's disturbing other movie-goers, then we might have to talk.",
      "created_at": "2005-01-05T02:34:31.000Z"
    },
    {
      "author": "nicole",
      "body": "At Springfield 8, the general rule was if we didn't sell it at the concession stand, they could bring it in. I don't think anyone openly announced this, though. I remember one guy getting mad because we didn't have spoons for his ice cream sundae he brought in.<br/><br/>The two times I saw movies in Paris (both films were French with no subtitles), the ticket takers said, \"You know, this doesn't have subtitles?\" Psh.",
      "created_at": "2005-01-05T02:59:39.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
