{
  "id": 128,
  "title": "Attention Springfield readers...",
  "body": "Tune your television sets to ABC 33 for the 5:00 news tonight. There's going to be a story about the Moxie starring yours truly! Extra points for those of you who can spot the pimple I tried to hide with concealer. You can rest assured, I'll be taping it, but I don't know how I'm going to get it onto the blog. Double points for anyone who can capture the video directly onto their computer and send me the file. Either way, I'll post a transcript at the very least.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-01-05T02:34:48.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "whitty",
      "body": "YAY! a reason to not go to the gym! ",
      "created_at": "2005-01-05T03:05:09.000Z"
    },
    {
      "author": "Fyse",
      "body": "Exciting stuff! I hope you manage to get it onto the site somehow.\r\n\r\nYou haven't changed banner picture in a while. Surely you haven't run out of ideas?!",
      "created_at": "2005-01-05T03:18:36.000Z"
    },
    {
      "author": "Justin",
      "body": "Dan pukes mid way through.",
      "created_at": "2005-01-05T04:00:02.000Z"
    },
    {
      "author": "whitty",
      "body": "Nice, however, I was really hoping you'd be wearing the Slash costume - you know, for street cred.",
      "created_at": "2005-01-05T04:11:15.000Z"
    },
    {
      "author": "Justin",
      "body": "So how was it?  Did the TV really add 10 pounds?",
      "created_at": "2005-01-05T04:34:20.000Z"
    },
    {
      "author": "bjork24",
      "body": "I sounded like a dork, but other than that, it was pretty good. I just got a call from a guy in Springfield who has a bunch of used seats that he wants to sell us. Sweet!",
      "created_at": "2005-01-05T04:38:07.000Z"
    },
    {
      "author": "Justin",
      "body": "Oh.  You should have gotten drunk first, then you could have talked in a really high voice!",
      "created_at": "2005-01-05T04:43:30.000Z"
    },
    {
      "author": "nicole",
      "body": "Ha ha. Dan's drunk voice. That always makes me laugh. I thought he did a very nice job.",
      "created_at": "2005-01-05T04:55:07.000Z"
    },
    {
      "author": "Laurie",
      "body": "Oh, Lordie!  It's not everyday dad calls me and tells me to watch something on TV, beings he tends to say I watch too MUCH of it!  I got to see your thingie ( not that thingie, shesh) and you did really great!  Naturally, I only had about a ten minute warning to call everyone and their bro to watch, and as USUAL, both kids were out and about.  ANYWHO, long story short, when Jake popped in about 15 minutes ago, I was telling him all about it, and he was all \" I saw something about The Moxie on morawk,com\" So needless to say, mad dash to 'puter, quick run to morawk, and voila! Here I am!\r\n\r\nCongrats on the new endeavor, and count on us getting the word out.\r\n\r\nAll my love to you both!\r\nLaurie ( that would be your cousin, remember? :P)",
      "created_at": "2005-01-05T05:10:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "Hey Laurie! Glad you found the blog. Aaron, the guy who runs MoRawk, is a good friend of ours and designed the Moxie's logo, which is why our banner popped up on his site. Anyways, good to have you around, and I hope to hear from you soon.",
      "created_at": "2005-01-05T05:16:33.000Z"
    },
    {
      "author": "Laurie",
      "body": "LOL! Jake was wondering why it was on there, now I can tell him...when he gets back from the boonies where his girlfriend lurks..at 3 am...and comes in to ask whats for dinner.  \r\n\r\nBeing I STILL don't have your email addy, and I am hanging out on one of jake's hotmail accounts and can't recieve any mail( I'm hiding from the throngs of laurie-worshipers on my account IMs, dontcha know :P), I figured I would post his site links to the band, and hope to high heaven you and Nic get as big of a kick outta hearing the bands new shtuff as I do...So does dad. There is something seriously wrong when my father be-bops his head along to punk music, and is beginning to know the lyrics by heart.  WOO HOO for modern parents. ~eye-roll inserted here~ \r\n\r\nSo here ya go....have at it and let me know what you think, ok?\r\n\r\nhttp://www.purevolume.com/playingwithmatches\r\n\r\nsidenote: The song, Shot in the Dark, has the acapella group from SMS on it.  Its one of my favorites!\r\n\r\nhttp://www.playingwithmatchesrock.com/\r\n\r\nThe inside info on the CD release party is, according to Mike from Riat records, February 4, 9 PM at the Rockwell.  You and Nic should come, and we can all get trashed and give Josh a hard time while he sells merch! ha ha ha..Inside joke..will explain at a later date!\r\n\r\nNow off to take the dog out to take a wiz.\r\n\r\nMOXIE WILL ROCK!  I can't wait! And thank you for the saving of us poor souls avoiding the dreaded R2-D2 with scalpels and laser lights.  The world is truly a safer place!\r\n\r\n~snicker~",
      "created_at": "2005-01-05T05:55:53.000Z"
    },
    {
      "author": "Aaron",
      "body": "Yeah, so I was hoping they would replay it at 10 but apparently there's this football game on or something. I hope you got a good recording of it. At least they probably won't connect the Moxie to man-boy love.",
      "created_at": "2005-01-05T10:11:47.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Congrats on the continuing positive press! I hope the logistics of getting set up are going as well.",
      "created_at": "2005-01-05T11:02:47.000Z"
    },
    {
      "author": "Rachel",
      "body": "I want to see this clip.  You MUST find a way to get it on here.  MUST.\r\n\r\nP.S. Why no Nicole in the show?  Are you trying to edge her out of the enterprise slowly?",
      "created_at": "2005-01-05T11:54:09.000Z"
    },
    {
      "author": "bjork24",
      "body": "Nicole is too shy to talk to the press. She gets flustered and starts drool. It's her decision, not mine.",
      "created_at": "2005-01-05T17:59:03.000Z"
    },
    {
      "author": "einahpets",
      "body": "Yip!",
      "created_at": "2005-01-05T18:28:40.000Z"
    },
    {
      "author": "Oz",
      "body": "I WANT VIDEO!",
      "created_at": "2005-01-05T20:42:26.000Z"
    },
    {
      "author": "nicole",
      "body": "Truth is, I have a pimple. On my cheek. I'm that vain.",
      "created_at": "2005-01-05T23:58:58.000Z"
    },
    {
      "author": "John",
      "body": "You used concealer for the pimple on your ass?",
      "created_at": "2005-01-06T07:07:07.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
