{
  "id": 13,
  "title": "Business plan rant",
  "body": "I made a promise in a <a href=\"/posts/4\">previous article</a> that I would devote an entire post to the joy of business plan writing, so here I go...<br/><br/>Writing a business plan is not fun. If anyone ever tells you \"if you don't enjoy writing your business plan, you won't enjoy running your business,\" don't believe them. It's a lie. Secretly, they want you to think that running a business is hard, tedious work, but deep down inside we all know that running your own business is pure, unadulterated bliss and that if your job ever gets tough or mundane, you simply take an extended vacation! Yippee! You're the boss, right? Free Mimosas for everyone!<br/><br/>I think the biggest problem with writing a business plan is the amount of required redundancy. You explain your business in the \"Executive Summary\", then again in the \"Business Concept\", and one more time in the \"Explain Your Business Again, Slave!\" section. It's like you're taking your idea and grinding it into the ground, rehashing every detail until you've explained it at least 30 times. Please don't get me wrong, I'm not doubting the benefit of having a overly-detailed business plan. Not at all. I just hate writing the same thing over and over again.<br/><br/>I wish I could write our business plan in screenplay format. That would be swell...<br/><br/><i>[ Flutey, dreamy music accompanied with wavy matte effect ]</i><br/><br/><b>INT. DAYTIME - OFFICE OF THE BIG TIME LOAN OFFICER</b><br/><br/><b>Loan Officer</b> - So tell me Dan, why is your idea deserving of this? <i>( lifts two large bags of coins off his desk, each emblazoned with a red dollar sign )</i><br/><br/><b>Dan</b> - Well, Mr. Officer, I believe that Nicole and I...<br/><br/><b>Nicole</b> - Hello.<br/><br/><b>Dan</b> - ... that Nicole and I have a stellar idea for a business that's going to make you a very rich man.<br/><br/><b>Loan Officer</b> - Really?<br/><br/><b>Dan</b> - No, not really, Mr. Officer, but now that I have your full attention let me show you our pro formas.<br/><br/><i>[ Screen lowers from ceiling and pro forma appears ]</i><br/><br/><b>Dan</b> - As you can see from the graph, our idea ranks very high on the \"good\" axis... nearly off the chart, as it were. Now, in the next slide... <i>( nods his head to alert the slide handler to proceed )</i>... you'll see that this post is quickly going nowhere.<br/><br/><b>Loan Officer</b> - What?<br/><br/><b>Dan</b> - Mimosas for everyone!<br/><br/><b>Nicole</b> - Yipee!<br/><br/>Argh, I'm sorry, but this post is going nowhere fast. It's been a tough day, so this was bound to happen. I had to sit through a 3 hour meeting this morning that went way, WAY over schedule, AND my pants were ripped by a wayward spring poking out of the booth at the restaurant where I ate lunch. Sitting through corporate meetings makes me feel like Cary Elwes on <i>The Princess Bride</i> when he had his life sucked out of him. I hate them.<br/><br/>To wrap things up, I'm still in the midst of finishing the business plan, so I don't think now would be the best time to describe my overall feeling about writing it. It's like if you asked someone to describe their ex-spouse during the divorce proceedings... of course the feelings will be extreme and, for the most part, largely exaggerated. After some time has passed, and I've distanced myself from the act of writing it, I'll rehash this topic and maybe, just maybe, post the business plan for all to see.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-06-08T18:53:12.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Kameron",
      "body": "Heh, welcome to my life. As a technical writer, I've had redundancy burned into my brain. Now, I, too, am starting my own business and am faced with the dreaded prospect of putting together a business plan to woo investors.<br/><br/>At least it motivates me to keep working on my fiction.",
      "created_at": "2004-06-11T23:37:45.000Z"
    },
    {
      "author": "Jason Malatesta",
      "body": "yeah - but some of us are business geeks and actually enjoy writing business plans that explain things to people who make decisions and try to convince them that they should invest or let you keep your job....",
      "created_at": "2004-06-11T23:38:12.000Z"
    },
    {
      "author": "-----Neteazy-----",
      "body": "as well I need some help with mine, however, i went out and did some research and found the Business Plan Pro 2004 software (from Palo Alto) to help me out. so far it is going well with all the specifics. but as that i have never had a business before, i am still out there doing as much legwork as i can and still running into questions. <br/><br/>good luck to all, keep up your dream. try and increase your business 1% everyday. <br/><br/>Cya<br/>N3t",
      "created_at": "2004-06-11T23:38:36.000Z"
    },
    {
      "author": "Ace Macool",
      "body": "I'm not really interested in your business plan as I never forsee myself writing one but anyone who namechecks The Princess Bride in a post is ok by me. Love that movie.<br/><br/>Really great blog too.",
      "created_at": "2004-06-11T23:39:03.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 13,
      "name": "Other job"
    },
    {
      "id": 14,
      "name": "Dialogue"
    }
  ]
}
