{
  "id": 130,
  "title": "The Man-CHAIR-ian Candidate",
  "body": "So, the cat's out of the bag, and the Moxie is going to have standard theater seating. You're probably wondering \"Why Dan? Why? You'd promised us sofas and big soft chairs, not tiny theater seats! Is there no god?\" Well, let me try to answer this as best I can:<br/><br/><b>Our auditorium is incredibly small</b> - I can't stress this enough. We're talking 35 by 16 feet of usable space, and since our viability as a business and a theater depends on the number of seats we can fill, the auditorium dictates nearly every design choice we make. It made me go buy it some cheese yesterday. Twice.<br/><br/><b>Seating capacity</b> - Here's the bottom line: with sofas and plush chairs, we're looking at a potential capacity of between 40 and 50 people... if that. You have to remember that sofas are not only wide, but they're deep too. The deeper the sofa, the more distance we have to put between rows. The more distance between rows, the fewer rows we can have. It's a vicious cycle. How can I compromise putting in a couch that holds three when I know that the same space can easily hold four customers in theater seats? I can't.<br/><br/><b>Operating costs per seat</b> - Operating at an average occupancy of 40% per annum, each and every seat we put in the auditorium is equal to roughly $3,000 in gross profits. With 40 seats, we'd be lucky to stay open for half a year. With 50 seats, we'd have to sell out nearly every single weekend show (a very difficult task) to turn a profit. With more than 60 seats, the Moxie would (should) be self-sufficient enough that we will be able to turn enough of a profit to pay our employees a decent wage and put food on the table.<br/><br/>So where does that leave us? Well, we have two scenarios: Use sofas and chairs and give our customers a comfortable six month's worth of movie-going fun before we have to close our doors, OR use theater seats, stay viable, make a profit, and eventually upgrade to a larger building with 2 or 3 screens and plenty of room for sofas and chairs... or at least really plush theater seat rockers. The choice is rather obvious, don't you think?<br/><br/><b>Think of the distributors</b> - Distributors laugh at small theaters. They mock them. They harass them. They don't give them preferential treatment. If a 600 seat theater and a 50 seat theater want the same movie, who do you think is going to win? Unfortunately for us, the distribution industry isn't run on likability. It's run on numbers, and bigger numbers equal bigger money. Simple as that. Every seat we add to our total capacity helps us look that much more legit to the big wigs in LA and NYC.<br/><br/>Don't get me wrong, I'm disappointed that we couldn't have sofas and chairs too, but for right now, for this space, they just won't work. That's something we have to deal with. I hate, hate, HATE corporate mantras and metaphors, but one of them seems quite fitting here, \"you have to learn to choose your battles. You can't win them all.\" I feel dirty just saying that.<br/><br/>On a final note, several of you have voiced your concern over the ability of larger customers being able to fit in our seats. That's a very real problem, but we've had numerous people sit in the chair sample - from tall gangly types like me to shorter more rotund body types (250lbs and up) - and none of them seem to have any difficulty sitting down or getting out of the chairs. I ask them, \"do you think you'd be comfortable in that seat for a two hour movie?\" and they all answer in the affirmative.<br/><br/>Still, if any of our customers have problems with the chairs, we'll have several armless varieties that can be placed in the handicap sections. That may sound callous and embarrassing for the individual who has to request the armless chair, but what other alternatives do we have? None that I could think of.<br/><br/>So that's that. I don't mean to sound condescending or snippy, I'm just telling it like it is. Buffer off.<br/><br/>Oh yeah, I almost forgot the m<br/>ost important part... using theater seats, we'll be able to fit between 73 and 76 people in the auditorium with staggered seating. Nicole and I were thinking the capactiy would be in the low 60's, so when we heard the final chair count, we both passed out. That's it.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-01-08T21:33:22.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "What about the fire code issue?  I remember early on you saying there was an issue using couches and old chairs because they aren't flame retardent.  Is that one of the reasons, too?",
      "created_at": "2005-01-08T22:24:16.000Z"
    },
    {
      "author": "Aaron",
      "body": "Dan, I think you mean \"bugger off.\" I've read enough Harry Potter books to know.",
      "created_at": "2005-01-08T22:41:51.000Z"
    },
    {
      "author": "Ben D",
      "body": "<a href=\"http://2005.bloggies.com/\">The Fifth Annual Bloggies</a> - Everyone should nominate \"The Moxie Blog\" in all applicable categories.",
      "created_at": "2005-01-08T23:00:40.000Z"
    },
    {
      "author": "logan",
      "body": "hey! can't wait for the theater to open.  bout' friggin' time springfield gets a nifty downtown theater. ",
      "created_at": "2005-01-09T00:26:42.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Dan, you guys are making the best choice.  Plus the seats look cool.  I hope my joking comment about my fat butt didn't make you think I didn't like the chairs.  70+ seats is a feat in a building as small as you guys'. <br/><br/>You shouldn't be defensive about it, you are making the best decision for your company.  xox",
      "created_at": "2005-01-09T01:54:32.000Z"
    },
    {
      "author": "whitty",
      "body": "being large of ass myself, I have never really had a problem with tight seats, not that it wouldn't be a problem for some people, it is just not an issue for my (sizable) behind.  <br/><br/>On the other hand, please, Dan, tell me you aren't going to be skimping on leg room!  I once spent two and a half painful hours with my knees jammed into the seat in front of me at a historical theater in NY.  It sucked.  My bottom can stand to be squished into a seat, but please, please give a girl some leg room!",
      "created_at": "2005-01-09T07:09:09.000Z"
    },
    {
      "author": "Al",
      "body": "Any thought to 2-3 sofas, maybe down in the front, or in the back?  Losing a few seats, maybe down to 70 rather than 74, would seem to be not a big deal, as \"artsy\" theaters are rarely full, especially Sunday-Thursday.",
      "created_at": "2005-01-09T07:41:28.000Z"
    },
    {
      "author": "Fyse",
      "body": "Ooh, yeah. Leg room is <i>really</i> important. If taller people spend the whole time uncomfortable, then they wont be coming back again. There's a student run cinema near me that I would go to regularly, but at 6'3\" I just find it too uncomfortable.",
      "created_at": "2005-01-09T15:09:52.000Z"
    },
    {
      "author": "bjork24",
      "body": "There will be 38\" between rows. Older theaters used to have between 34\" and 36\", but we didn't want people to be crammed in, so we went the extra 2 inches. Believe it or not, those two inches will make a world of difference.",
      "created_at": "2005-01-09T22:06:32.000Z"
    },
    {
      "author": "bjork24",
      "body": "Justin: Yes, that was a reason too. I forgot to mention that.<br/><br/>Aaron: I've only read the first one, so I have no idea what you're talking about.<br/><br/>Ben D: Thanks for the support!<br/><br/>Logan: You're right, it is about friggin' time!<br/><br/>Dave Adams: Thanks Dave!<br/><br/>Whitty: See above comment. I bet the NYC theater had 35\" or less. We won't skimp!<br/><br/>Al: We've given it some thought, but we'll have to see how our rows line up. We don't want to cram the sofas so close to the screen that no one can see.<br/><br/>Fyse: I'm exactly six foot tall and I have no problem sitting in 36\" rows, so 38\" should be more than enough even for our tallest of customers. Even the British ones too!",
      "created_at": "2005-01-09T22:11:48.000Z"
    },
    {
      "author": "Fyse",
      "body": "Good stuff. Should have know that The Moxie wouldn't sacrifice customer comfort.",
      "created_at": "2005-01-09T22:37:34.000Z"
    },
    {
      "author": "einahpets",
      "body": "Armless chairs. Are those for people that are armless?",
      "created_at": "2005-01-10T19:09:35.000Z"
    },
    {
      "author": "sandra",
      "body": "hey dan. good choice. i'm curious what brand/style seat you've chosen -- i've just started researching new seats for our cinema.",
      "created_at": "2005-01-11T03:22:17.000Z"
    },
    {
      "author": "sandra",
      "body": "nevermind---just noticed the phlog.",
      "created_at": "2005-01-11T03:22:54.000Z"
    },
    {
      "author": "whittler",
      "body": "Speaking of capacities, I achieved the ultimate cinema-goer experience last year. I was the sole viewer of Garden State one day. Just me in the whole cinema. A private viewing. I moved around to get different perspectives. It was grouse!",
      "created_at": "2005-01-11T04:09:54.000Z"
    },
    {
      "author": "nicole",
      "body": "I had that experience at Shanghai Noon. Well, it was me and one other person, but I was with the other person.",
      "created_at": "2005-01-11T08:09:51.000Z"
    },
    {
      "author": "Nicholas",
      "body": "I had that experience at an adult movie house...and yes, I moved around to \"get different perspectives.\"",
      "created_at": "2005-01-11T22:47:46.000Z"
    },
    {
      "author": "Devin",
      "body": "Have you thought of the type of seats with lift-able arms?? These are far preferable to the regular type. Also, Cup holders, cupholders, cupholders. Sounds like things are going great! Good Luck!",
      "created_at": "2005-01-12T19:48:58.000Z"
    },
    {
      "author": "chris",
      "body": "I had that experience with Whale Rider.  <br/><br/>And at 6'9\", I think I might be having some problems.  ",
      "created_at": "2005-01-28T21:40:35.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
