{
  "id": 131,
  "title": "Like sands through the hourglass",
  "body": "And I thought the corporate world was hectic! This has easily been the busiest, most productive two weeks of my whole entire life... including the time I stayed up for six days straight building a pogo ball out of legos and lincoln logs.<br/><br/>We spoke with an insurance agent today, ordered a banner for the building, compiled a list of equipment that will be covered by the SBA loan, fixed <a href=\"http://www.morawk.com\" target=\"_blank\">MOrawk's</a> <a href=\"http://www.morawk.com/board\" target=\"_blank\">message board</a>, and tackled a small problem with Technicolor (they were trying to deliver a print to our theater today). Tomorrow will be, by far, the busiest day yet. Here's a rundown:<br/><br/>5:45 AM - wake up<br/>7:30 AM - meet with another local TV station for a story on the Moxie<br/>8:30 AM - meet with local wholesale food distributor<br/>9:30 AM - proof artwork for \"coming soon\" banner<br/>10:30 AM - contact Budweiser distributor<br/>12:00 PM - lunch<br/>1:00 PM - second lunch<br/>2:00 PM - meet with SMS professors to discuss showing their movie<br/>3:00 PM - make water<br/><br/>We also have to make time to meet with Andrew, one of the building's owners, so we can show off all the progress we've made. Then, after all the theater fun has been had, we get to head back over to our dismantled home and continue working until the wee hours of the morning. The hot water heater was installed tonight, so we finally have hot water... along with third degree burns over large portions of our shoulders and feet. Don't ask.<br/><br/>Well, I better hit the hay. I have to wake up earlier that 98% of the rest of you tomorrow, and that really sucks. I get a sick stomach whenever I wake up before 7:00 AM, so I'll probably blow chunks all over the reporter's mic tomorrow morning... which reminds me, I shouldn't have ate all the beef jerky tonight.<br/><br/>Ugh.<br/>",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-01-11T08:31:44.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nicole",
      "body": "Are you going to hit the hippie hay to get you through the day? <br/><br/>Please don't throw up. I hate regurgitated beef jerkey. You know that.",
      "created_at": "2005-01-11T08:53:48.000Z"
    },
    {
      "author": "bjork24",
      "body": "\"Hit the hippie hay\"... what's that mean exactly? I know hippies don't like to shave much \"down there,\" but that's surely not what they're referring to. Even still, hippies are HOT!",
      "created_at": "2005-01-11T08:55:51.000Z"
    },
    {
      "author": "nathan springer",
      "body": "the professors wouldnt happen to be biggs and rottman would it?",
      "created_at": "2005-01-11T09:53:27.000Z"
    },
    {
      "author": "justin",
      "body": "You smell like beef.",
      "created_at": "2005-01-11T09:53:46.000Z"
    },
    {
      "author": "Rachel",
      "body": "Nicole, Dan, do you two actually live together or do you just communicate through each others blogs?",
      "created_at": "2005-01-11T11:12:51.000Z"
    },
    {
      "author": "Chuck...",
      "body": "Man, I can't wait to see this place. ",
      "created_at": "2005-01-11T12:32:24.000Z"
    },
    {
      "author": "bjork24",
      "body": "Nathan: nope.<br/><br/>Justin: you too.<br/><br/>Rachel: yes.<br/><br/>Chuck: indeed.",
      "created_at": "2005-01-11T17:32:11.000Z"
    },
    {
      "author": "Aaron",
      "body": "Dan:: <br/><br/>Please don't let them horizontally or vertically scale the logo out of proportion. Tell them to used Clarendon if they have it. Agh, I'm worried!<br/><br/>And thanks again, so much, for helping with the board. You rule.",
      "created_at": "2005-01-11T18:39:48.000Z"
    },
    {
      "author": "einahpets",
      "body": "These are the Days of Our Lives.",
      "created_at": "2005-01-11T18:41:14.000Z"
    },
    {
      "author": "Nicholas",
      "body": "Nicole: Is that a \"Big Smith\" reference? If so, I'm pretty sure it's: \"A little hippie hay will get me through the day...and when the fish bite, who needs s honey...in the firelight, I'm counting money.\" So whatever it is, if it leads to counting money, it's gotta be good.",
      "created_at": "2005-01-11T21:53:12.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "\"All I need is a tin o' tobacco/and a little hippie hay to get me through the day.\"<br/><br/>And it's \"who's counting money\".<br/><br/>{big smith}",
      "created_at": "2005-01-11T23:33:54.000Z"
    },
    {
      "author": "Dave",
      "body": "\"so I'll probably blow chunks all over the reporter's mic tomorrow morning...\"<br/><br/>but then she'd probably let you keep the mic so... win-win",
      "created_at": "2005-01-12T00:08:13.000Z"
    },
    {
      "author": "James",
      "body": "yo, just found your site, good work helping aaron out. Stop by and say hi sometime.",
      "created_at": "2005-01-12T03:53:01.000Z"
    },
    {
      "author": "Laurie",
      "body": "Hey Daniel.  Jake is wanting to get with you about some promo stuff.  He has some ideas that sound pretty good, and being they are doing it up big next month, I think it would be worth your time to listen to them/him, lol. I am just the messenger on this, so STFU, lol.<br/><br/>Gah. ",
      "created_at": "2005-01-12T06:32:22.000Z"
    },
    {
      "author": "Oz",
      "body": "You seem to be quite the media darling.  I guess if I ever want to get into the spotlight, all I have to do is risk everything I have and start an art house theater.  On second thought....",
      "created_at": "2005-01-12T06:33:40.000Z"
    },
    {
      "author": "Mark",
      "body": "Just when I thought you this blog couldn't get anymore interesting ... pictures.<br/><br/>I'm a little confused about your layout though, where is the actual theatre going to be. Any chance of seeing some floor plans?<br/><br/>Chair wise. I prefer theatre seating (provided they have the leg room). The comfy seeting has too much chance of nodding off during the slow bits. Especialy since your serving beer.<br/><br/>Something to consider once you're established, my local art-house cinema has sponsered seating. Patrons pay a set fee and they get a plaque put on one of the chairs, get special invites to events and preferential treatment. Just a thought.<br/><br/>Now get back to work.<br/><br/>M",
      "created_at": "2005-01-12T19:49:38.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
