{
  "id": 132,
  "title": "We still breathe",
  "body": "Just wanted to drop a line and let everyone know that Nicole and I are still alive and well. A lot has happened over the last two days - all of which will be dutifully reported in what will most likely be this blog's longest post EVER! In the meantime, here's a question I'd like to bounce off of you:\r\n\r\nConsidering we get a FIVE head SODA POP fountain, which brands of pop do you think we should serve? Nicole posted this question a few days ago, but I wanted to see what kind of results I'd get from my readership. Here's the ground rules:\r\n\r\n1) All of our products will either be in the Coke family or Dr. Pepper.\r\n2) You must use Dr. Pepper for at least one of your choices.\r\n3) You may not question rule number 2 or 3.\r\n\r\nSo, with that being said, here's your choices:\r\n\r\n&nbsp;&nbsp;&nbsp;&nbsp;• Dr. Pepper (regular/diet/vanilla)\r\n&nbsp;&nbsp;&nbsp;&nbsp;• Coke (regular/diet/vanilla)\r\n&nbsp;&nbsp;&nbsp;&nbsp;• Sprite (regular/diet)\r\n&nbsp;&nbsp;&nbsp;&nbsp;• Tea\r\n&nbsp;&nbsp;&nbsp;&nbsp;• Orange pop\r\n&nbsp;&nbsp;&nbsp;&nbsp;• Hawaiian punch\r\n&nbsp;&nbsp;&nbsp;&nbsp;• Lemonade\r\n\r\nI think that about does it for now. Stay tuned for a new phlog and a grotesquely large post in the very near future.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-01-13T00:17:29.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Justin",
      "body": "Vanilla Dr. Pepper?  Interesting. Here are my choices:\r\n\r\nDr. Pepper.\r\nCoke\r\nDiet Coke\r\nOrange\r\nSprite",
      "created_at": "2005-01-13T00:32:29.000Z"
    },
    {
      "author": "bjork24",
      "body": "Springfield is a test market for Dr. Pepper, so we're one of the only places to have Vanilla Dr. Pepper right now. It's really good. You should drive down to Springfield right now and buy a bottle of it.",
      "created_at": "2005-01-13T00:51:31.000Z"
    },
    {
      "author": "whitty",
      "body": "Dr Pepper taste like prunes. \r\n\r\nThat being said, I vote for Hawaiian Punch.  Nothing else matters.",
      "created_at": "2005-01-13T01:01:42.000Z"
    },
    {
      "author": "Oz",
      "body": "We just had a Cherry Vanilla Diet Dr. Pepper.  Why one would need a Cherry Vanilla Diet Dr. Pepper, I have no idea.  Anyway.  Can't you have six options?  Come on!\r\n\r\nCoke\r\nDiet Coke\r\nDr. Pepper\r\nSprite\r\nand then..... well, Tea AND Diet Sprite.\r\n\r\nNow hear me out on this.  Without Diet Sprite, all of the above options have caffeine and/or sugar.  Some of us would like the option of no caffeine OR sugar.  But if you leave off tea, then you have no options that aren't soda, and some people don't like soda.  So my recommendation is to get six heads.",
      "created_at": "2005-01-13T01:04:10.000Z"
    },
    {
      "author": "Jimmy",
      "body": "The first four choices don't really seem like, um, choices at all.  To cover most preferences (and your rules), it seems to me that you must have 1.) Coke, 2.) Diet Coke, 3.) Dr. Pepper, and 4.) Sprite.  That leaves one miscellaneous choice, and you should probably target that towards people who don't like soda.  I suspect that either tea or lemonade are the most widely appealing of your non-soda options, and I'd probably choose 5.) Lemonade since fountain tea is frequently so disappointing.\r\n\r\nIf, for some reason, you were willing to have five sodas, orange pop would be a good fifth choice.  There are a lot of people who love their orange soda.  Maybe a lot of them are kids, though?\r\n\r\n(Random aside: I love Dr. Pepper, and I miss living somewhere where that would inevitably be a choice.)",
      "created_at": "2005-01-13T01:38:57.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "You northerners and \"pop\". It's so funny :)\r\n\r\nI guess it's worse down in the south, considering everything (and I mean -everything-) carbonated is \"Coke\". Pepsi is coke, a mt. dew is coke, etc.\r\n\r\nAnyway, just run the standards:\r\n\r\n- Coke\r\n- Diet Coke\r\n- Sprite\r\n- Weird Orange Stuff That Kids Love\r\n- Dr. Pepper\r\n\r\nNo one is going to the movies to drink tea, I've never (EVER) in my entire life see someone buy Lemonade at a theater (and I've been to a lot of movies), and Hawaiian Punch will get some kiddie sales, but the Orange Stuff will get more.",
      "created_at": "2005-01-13T02:21:23.000Z"
    },
    {
      "author": "Kevin",
      "body": "I'd suggest getting a small fridge and filling it with Jones Soda.  There's no doubt they will sell well because those alone helped keep my local ice cream shop open.  It's something different than regular old soda...just a suggestion.",
      "created_at": "2005-01-13T02:27:55.000Z"
    },
    {
      "author": "bjork24",
      "body": "Good suggestions thus far. I should also note that we WILL have a fridge filled with all kinds of other bevarges (i.e. bottled water, all the pop I mentioned in bottles, Fitz's root beer and cream soda, etc.). Just a note.",
      "created_at": "2005-01-13T02:53:38.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Eh...if I have to pick, I'd say Coke, Sprite, Dr. Pepper, Diet Coke and Lemonade.  ",
      "created_at": "2005-01-13T03:28:01.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "As mentioned, Coke, Diet Coke, Dr Pepper, and Sprite must be the first four. THIS IS IMPORTANT: don't waste the fifth on a non-carbonated beverage like tea or lemonade!  Fountain \"tea\" sucks anyway.\r\n\r\nI would vote for Diet Mountain Dew if I could, but Orange is probably a better bet.",
      "created_at": "2005-01-13T03:48:25.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Also: Fitz's?! IBC! IBC! IBC!",
      "created_at": "2005-01-13T03:49:29.000Z"
    },
    {
      "author": "Fyse",
      "body": "I agree that using a fountain head for something non-carbonated seems a bit of a waste. Also, I fine the idea of tea in a fountain really bizarre.\r\n\r\nThe first four do seem obvious, and after that I'd probably go for fizzy orange.\r\n\r\nThis blog is like having your very own focus group, isn't it?! Usefully, I should think the demographic of people reading this blog is probably similar to that of your target audience. Well, maybe. You can hope, right?",
      "created_at": "2005-01-13T03:59:19.000Z"
    },
    {
      "author": "Tom G.- Ex Coworker",
      "body": "Hey Dan !!  The dept. misses your slouch and gentle demeanor.  Seeing that i'm an expert on soft drinks, I'm voting for:\r\n\r\nDr. Pepper\r\nCoke\r\nSprite\r\nOrange\r\nLemonade\r\n\r\nFountain Tea is a waste, don't do it !!!\r\n\r\nVanilla Dr. Pepper?  That is just too freaky for me.",
      "created_at": "2005-01-13T04:02:52.000Z"
    },
    {
      "author": "bjork24",
      "body": "My slouch is known throughout the land!",
      "created_at": "2005-01-13T04:52:59.000Z"
    },
    {
      "author": "Dave",
      "body": "Dr. Pepper\r\nCoke\r\nDiet Coke\r\nSprite\r\nHawaiian Punch",
      "created_at": "2005-01-13T05:21:49.000Z"
    },
    {
      "author": "Matt",
      "body": "Dr. Pepper\r\nCoke\r\nDiet Coke\r\nSprite\r\nLemonade - Maybe that Minute Maid stuff - that's by Coke, right?  Either way, it's good instead of pop on a hot, humid Midwest summer day.",
      "created_at": "2005-01-13T07:24:19.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "Half-way off the topic, may I please suggest that you serve hot beverages? I can't tell you how many times I've wanted coffee or tea while watching my movies lately. Yeah, I know, it doesn't go well with popcorn. But when it's cold outside, or when I'm not feeling well, or when I've had a big meal before the movie I want a hot beverage instead of POP.",
      "created_at": "2005-01-13T07:33:21.000Z"
    },
    {
      "author": "Josh",
      "body": "Hey daniel this is josh i hered about your new theatre when i was helping roof your house. Well i was just wanting to see how things are going and also to see if you need any help with the theatre.. I have plenty of free time so if you need any help just get ahold  of me. And about the soda situation, i think dr. pepper, sprite, coke and or orange pop.                                            ",
      "created_at": "2005-01-13T07:43:32.000Z"
    },
    {
      "author": "Joe",
      "body": "I vote that you have the following:\r\n1)Coke\r\n2)Dr. Pepper\r\n3)Sprite\r\n4)Lemonade (I sugggest doing this without a fountain-it generally is weak out of the fountain)\r\n5) Diet Coke for the \"health\" conscious (eventhough Coke isn't that bad for you-read the label)\r\n\r\nFurthermore, I agree that you should have other, shall I say, \"intriguing\" drinks in a fridge somewhere. That will give everyone a good set of options.\r\n\r\nI love the theatre idea-expect me opening night or close.\r\n",
      "created_at": "2005-01-13T08:29:26.000Z"
    },
    {
      "author": "Chuck...",
      "body": "Don't leave out the Orange pop. And thanks for not calling it soda.",
      "created_at": "2005-01-13T10:09:40.000Z"
    },
    {
      "author": "Al",
      "body": "As said, Coke, Diet Coke, Dr. Pepper, and Sprite are no-brainers.  To me, it comes down to Orange or Hawaiian Punch.  I would wonder if Coke does not have a root beer as well.  I guess I would choose HP for one strange reason...it would allow you to give someone a cup of water easily and cheaply.  I'm not sure if HP or Orange sells more, but you can put whatever you want in your fridge.   ",
      "created_at": "2005-01-13T11:59:14.000Z"
    },
    {
      "author": "whittler",
      "body": "I wish Sarsparilla was more popular. It's the closest soft drink to a good hearty ale.",
      "created_at": "2005-01-13T13:57:43.000Z"
    },
    {
      "author": "einahpets",
      "body": "1. coke\r\n2. coke\r\n3. coke\r\n4. coke\r\n5. coke\r\n\r\nWhat can I say, I'm a coke addict.",
      "created_at": "2005-01-13T19:06:12.000Z"
    },
    {
      "author": "Sancho",
      "body": "I'm 21 years old and I love me my orange pop/soda. You can't get it from many fountains and the college soda crowd might not have the extra buck or two for the specialty soda in extravagant bottles. Sad, but true.  I'd go with:\r\n\r\nOrange \r\nCoke\r\nDiet Coke\r\nDr Pepper\r\nSprite",
      "created_at": "2005-01-13T20:08:17.000Z"
    },
    {
      "author": "nicole",
      "body": "I like Hawaiian Punch because it tastes really good mixed with Sprite (I learned that while working at Springfield 8). However, the only people that bought that were kids, and we're not going to have a lot of kiddies, I don't think.\r\n\r\nDoes Coke own Fanta? If so, we have grape and strawberry soda to choose from, too!",
      "created_at": "2005-01-13T21:28:54.000Z"
    },
    {
      "author": "Aaron",
      "body": "1) Dave Adams, you are a fool. Fitz's is the best dessert root beer you can find. IBC is just boring. Do not bother messing with me on this—I know my root beer.\r\n\r\n2) My mom called me last night and told me you guys were on Fox 27, so I guess they re-ran the KOLR10 piece on the 9 o'clock news show.\r\n\r\n3) My choices:\r\n1) Coke\r\n2) Diet Coke\r\n3) CHERRY COKE*\r\n4) Sprite\r\n5) Dr. Pepper\r\n\r\nWHY, for the love of God, hasn't anyone mentioned Cherry Coke thus far? Is this an option? Ooo—maybe you guys could have flavored syrups to add to any of those (thus not needing to carry Cherry or Vanilla Coke/Dr. Pepper). That means it would open my third slot, in which I replace as Orange Slice, or whatever the brand name is.",
      "created_at": "2005-01-13T21:54:48.000Z"
    },
    {
      "author": "Allison",
      "body": "I would suggest not getting Hawaiian Punch (or any red beverage) because whatever dye they use in red beverages is a bitch to clean when spilled (esp. on furniture)",
      "created_at": "2005-01-13T22:12:37.000Z"
    },
    {
      "author": "sandra",
      "body": "coke\r\ndiet coke\r\ndr. pepper\r\nsprite  / seltzer is usually on this tap as well\r\norange\r\n\r\ntea and lemonade are both ick from the fountain. the above also make a for a good 'swamp water' -- a mixture of all five fountain drinks that is favored by the kids in our area.\r\n\r\nif you're going with coke, they will probably give you a small cooler if you stock their bottled drinks like nestea, minute maid oj, cranberry, h2o -- stuff like that. we also stock izze sodas -- all natural -- and they sell great.",
      "created_at": "2005-01-13T22:30:06.000Z"
    },
    {
      "author": "J.R.",
      "body": "I'd have to go with the folks that said,\r\n\r\nCoke\r\nDiet Coke (Raving mad people love the Diet Coke and so does Wilco)\r\nDr. Pepper\r\nSprite\r\nOrange\r\n\r\nOrange soda from the fountain is the best, especially on a hot summer day.",
      "created_at": "2005-01-13T23:34:49.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "I may be a fool about root beer, but I'm not too big of a fool to see the value of Aaron's cherry and vanilla syrup option.  I personally would order the Diet Coke with cherry and vanilla, please.",
      "created_at": "2005-01-14T01:16:53.000Z"
    },
    {
      "author": "Laurie",
      "body": "Well..I will be at the beer/wine bar getting my drinks, so...Make sure you have plenty of TP, thank ya very much!",
      "created_at": "2005-01-17T05:20:33.000Z"
    },
    {
      "author": "Mark",
      "body": "Here's my two-penneth-worth:\r\n\r\n1) Coke (full fat version)\r\n2) Diet Coke (for the ladies)\r\n3) Sprite (why would you want lemonade when you can have lemon and lime?)\r\n4) Hawaiian Punch (don't know what it is but sound nice)\r\n5) Dr Pepper (full fat, diabetes related siezure version).\r\n\r\nNotes: As you may have noticed, I have a dislike of diet drinks. My thinking is, if you don'e want the nasty sugar drink something else.\r\n\r\nNotes 2: Cold tea is WRONG! If it comes out of a fountain or a bottle, doesn't matter. So says the Brit.\r\n\r\nMark ",
      "created_at": "2005-01-17T20:00:14.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
