{
  "id": 133,
  "title": "My big, fat, gleek post",
  "body": "Why gleek? Because I haven't said that word in 14 years.<br/><br/>A lot has happened over the last week or so, and as much as I'd love to write a several day, multiple part post explaining each little detail, I can't. Stuff is happening so quickly right now, that if I don't start posting more often, I'm going to be in a constant state of catch-up... and mustard. Woo hoo! I couldn't resist.<br/><br/>So, in order to get through this, I'm going to just hit all the big points, give a little bit of description, and move on. I hate to do that, but them's the breaks. Let this be a lesson to me to post more frequently. Enough said. Here we go:<br/><br/><b>:::: Last week ::::</b><br/><br/><b><i>Monday</i></b><br/><br/>Met with Chris K., the contractor who works for Andrew and Doug, and discussed the layout for the theater. Chris K. liked the floorplan we'd envisioned, so we shook hands and headed our separate ways. I also received a key to the building. A few hours later, I brought my dad by to check the building out (he'd never seen the inside before). He made a few observations that I could't belive Chris K. and I had missed (i.e. there's a sewer line running along the west side of our auditorium). After discussing several issues with my dad, a new floorplan was devised. We spent the evening laying the floorplan out with masking tape.<br/><br/><b><i>Tuesday</i></b><br/><br/>We met with Jasimine Hude of Springfield 33 for <a href=\"/phlogs/4\">our first TV news interview</a>. It went over pretty well, and I hope to have video soon. At 12:00 PM, demolition began on the building. Our story aired on Springfield 33 at 5:00 PM. Directly afterwards, I received a phone call from a retired seating expert who had just seen our story on the news and wanted to know if we needed seats. As it just so happens, he has a warehouse full of old theater seats on the north side of Springfield. We scheduled an appointment to meet the next day.<br/><br/><b><i>Wednesday</i></b><br/><br/>Met with Chris K. again to go over the new layout and discuss what we're going to do with the flooring of the theater (paint it). We met with the lady responsible for getting us our liquor license next. There's an interesting story that I'd like to tell here, but this post is already going to be too long as is. Remind me to tell you later. Afterwards, we met up with Ken Morris, seating master, who toured us through his warehouse of theater seats. If you ever need theater seats, this is the man to turn to.<br/><br/>Do you remember the last scene of <i>Indiana Jones and the Lost Ark</i> where it pans out to reveal the vast warehouse of boxes? That's what Ken's warehouse looked like, but instead of boxes, he had seats. Millions and millions of seats. Big seats, little seats, old seats, new seats. Seats for mice. Seats for cans of paint. Seats for freshly cut green beans. Hell, he even had seats for seats! It was awesome! You know which seat we ended up choosing, so that's where this story ends.<br/><br/>We met up with <a href=\"http://www.morawk.com\" target=\"_blank\">Aaron</a>, our intrepid logo designer, later in the day to discuss having him build a limited edition poster for opening weekend. SWEET!<br/><br/><b><i>Thursday</i></b><br/><br/>The majority of this day was spent e-mailing vendors, talking with our equipment dealer, and salving the bank's stretched patience. I also built the Moxie Phlog later that evening, and, exactly one week after moving in, Nicole and I spent our first night at the new house... without having hot water, a working shower, or any of our stuff unpacked.<br/><br/><b><i>Friday</i></b><br/><br/>My dad took the day off from his regular job so he could work on our house. We spent the day helping him lay tile, grout, and play plinko. We didn't get much theater-related work done, because we were focused on getting our house up and running.<br/><br/><b><i>Saturday</i></b> and <b><i>Sunday</i></b><br/><br/>Pretty much the same as Friday, except for re<br/>ceiving a phone call from a professor at SMS who had a small part in a new independent film called <i><a href=\"http://www.flyingtigerthemovie.com\" target=\"_blank\" class=\"broken\">Flying Tiger</a></i>. Since the movie was filmed in and around Springfield, he thought it would be a good idea to premiere it at the Moxie during opening weekend. I concurred, but we're still in the midst of negotiations.<br/><br/><b>:::: This week ::::</b><br/><br/><b><i>Monday</i></b><br/><br/>We met with an insurance agent in the morning to discuss the best way to get us some CHEAP insurance (I haven't heard back from him yet). Afterwards, we visited a little sign shop and placed an order for a big-ass \"OPENING SOON\" banner. We also went to the Gap to use a couple gift certificates we received for Christmas to buy some new clothes for our second TV interview on Tuesday morning. We found time to watch the 24 season premiere later that evening.<br/><br/><b><i>Tuesday</i></b><br/><br/>The BUSY day. We met with Rachel Arim (sp?) from KOLR 10 news at 7:30 AM at the theater. As it turns out, Rachel was in speech and debate during the Dan and Doug years, and immediately recognized me when she walked in the door. Now, here's the back story on that last sentence:<br/><br/>1996 - Billings High School (my alma mater) created a speech team to contend at the local speech and debate competitions. My best friend Doug and I immediately signed up for duo interp, which is basically two people acting out a skit or mini-play within a 10 minute time limit. Our school was too poor to have a debate team, so all we did was the acting pieces. During that year, our speech team went from being a total unknown to the most feared high school on the circuit.<br/><br/>Out of the 10 tournaments we competed at, Doug and I won 1st place 9 times and 2nd place once. No one could believe that two gangly, yet rugedly handsome guys from a school that had a total enrollement (K-12) of 500 students could be beating some of the best speech teams from some of the largest schools in the state. The culmination of our season came when we were selected to compete in the National Speech Competition in Minneapolis, Minnesota. Being the arrogant, cocky bastards that we were, and still are, Doug and I refused to practice over the summer months leading up to big competition. All the winning had gone to our heads, and we didn't make it past the first round in nationals. Oh well.<br/><br/>Still, for that one season, Doug and I were gods. Before we performed, people would cram themselves into the room to watch our skit (<i>Good Evening</i> by Peter Cooke and Dudley Moore). They'd faun and faint if we looked their way. Bras and panties were strewn at our feet. The following year, thanks to our success, the Billings speech team expanded from Doug and I to a squad of nearly 20 students. It was great... but I digress.<br/><br/>Rachel, the reporter, had been one of the many to see us perform during the golden era. That put me at ease and made me wonder if hers were one of the many pieces of lacy under-garments I had collected during our heyday. Anyways, the interview went well, and you can expect a coinciding phlog later today.<br/><br/>This post is HUGE! I better wrap things up quick:<br/><br/><ul><li>8:30 - met with Banta foods, a local wholesale grocer, to inquire about concession goods</li><br/><li>9:30 - proofed artwork for \"COMING SOON\" banner</li><br/><li>10:30 - I forget</li><br/><li>12:00 - Met with Andrew, Chris K., and Jana (architect) to discuss building plans. As it turns out, we're going to need a building permit. SHIT!</li><br/><li>1:30 - Met with aforementioned SMS professor, his wife, and the vice president of the Film Alliance of Springfield to further discuss <i>Flying Tiger</i></li><br/><li>3:00 - Applied for temporary work at Penmac, a local temporary work place. By coincidence, I ran into a guy named J.R. Top, who was also at Penmac looking for temporary work. J.R. is the driving force behind <a href=\"http://www.sweetwaterabilene.com\" target=\"_blank\">Sweetwater Abilene</a>, a local band that I had never heard o<br/>f before talking to Mr. Top. He had heard all about the theater and was super excited for it. I told him that the Moxie would be playing music from local bands before each movie, so he gave me a copy of his lastest album. To be totally honest, I wasn't expecting much from a self-made local musician, but after listening to the album from beginning to end, I can definitely say that Sweetwater Abilene will be one of the many bands you'll be hearing at the Moxie. J.R. has a very laidback, folksy feel to his music, and his voice is very Grant Lee Buffalo-ish. I loved the hell of it. Thanks again for the CD, J.R... we'll be in touch.</li></ul><br/><b><i>Wednesday</i></b><br/><br/>We had to be at the theater at 5:30 AM to meet with Rachel Arim so she could get some live shots from within the building. That lasted until about 6:45. We went home, took a quick nap, and then met with a salesman from our local Anheiseur Busch distributor. As it turns out, we can convert an old refrigerator into a stand-up kegerator! SWEET! SWEET! SWEET! I also dropped by my old boss's office to say \"hello\", and, upon arrival, was quickly offered some easy cash if I came back in and fixed all of the office computer problems. SWEET! SWEET! SWEET! The evening was spent working on our house.<br/><br/><b><i>Today</i></b><br/><br/>Nicole already heard back from the temporary work place. They have a job for her doing some data entry or answering phones or something like that. Am I jealous? No. When they were testing my computer skills, I answered so many questions correctly that the kiosk I was working on caught on fire and exploded into a million pieces. I reassembled the computer with chewing gum and a single branch from a birch tree for extra credit. I then proceeded to rewrite the code for their intranet applications and added a new server to their network. FUCK YOU PENMAC! *sobs*<br/><br/>Ok, I'm back. Here's the rest of the good news. Our banner is ready! I picked it up this morning and we're going to go hang it up as soon as I finish this HUMONGOUS post. Our LLC was registered today. We also received our Federal Tax ID and filed for a fictitious name. My new name is Shade Timberland... Nicole's is Squirt McConkey.<br/><br/>Woo hoo! We're all caught up. Drop back by later tonight to see some new phlogs. If you're in the Springfield area, drive by our building and marvel at the awesome \"COMING SOON\" sign. Adios!<br/><br/>PS - I told you this post was going to be HUGH!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-01-14T02:42:39.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Justin",
      "body": "I believe the bit about the exploading computer.  When Dan and I worked together, he was working so hard once that his monitor caught fire, and a male co-worker screamed like a girl, and wet his pants.",
      "created_at": "2005-01-14T03:07:06.000Z"
    },
    {
      "author": "Fyse",
      "body": "Your Dad sounds like a legend!<br/><br/>And 'speech teams'?! America is <i>weird</i>...",
      "created_at": "2005-01-14T03:14:35.000Z"
    },
    {
      "author": "bjork24",
      "body": "Justin: too bad Rex doesn't read this blog, or else he'd have a chance to defend wetting his pants.<br/><br/>Fyse: we Americans also like to wrestle baby cows (known as calves) and drink our tea with ice in it.",
      "created_at": "2005-01-14T04:25:29.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "I like huge posts!  MORE MORE MORE",
      "created_at": "2005-01-14T05:13:57.000Z"
    },
    {
      "author": "Rachel",
      "body": "I read that whole thing.  I can't even believe I did it.  I have to go shave my legs again.  Just kidding.  I don't shave my legs.",
      "created_at": "2005-01-14T05:29:18.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Oh, Dan, I have an idea: you should sell the local artists' CDs at the concession stand, including a featured spot for whatever you are playing at the moment (assuming it's like one CD per night or something).  Good for you and good for the bands.",
      "created_at": "2005-01-14T05:41:34.000Z"
    },
    {
      "author": "Oz",
      "body": "Wow, you have been a busy boy.  Seems like things are racing ahead.  Good thing, too, considering that Valentine's Day is only a month away.  Still hoping to open that weekend?",
      "created_at": "2005-01-14T06:31:09.000Z"
    },
    {
      "author": "nicole",
      "body": "Last year on Valentine's Day, Dan left me to go drinking with his friends. I watched Lost in Translation. Alone. <br/><br/>But I jest. Dan and I don't really \"celebrate\" Valentine's Day, so I told him to go out. But it makes a much better pity story if I don't admit that!",
      "created_at": "2005-01-14T07:32:51.000Z"
    },
    {
      "author": "J.R.",
      "body": "I'm glad you liked the C.D. Dan.  I too got a call from Penmac today to do data entry at the Greene County Assessor's (spelling?) Office, if that's where Nicole is at, I would laugh and then wet my pants in fear that your wife may have osmosively conducted some of your amazing explosive computer skills.  Good Luck!",
      "created_at": "2005-01-14T12:53:35.000Z"
    },
    {
      "author": "justin",
      "body": "OK, so where's the Phlog?  I distinctly remember being told a new phlog would be posted last night!",
      "created_at": "2005-01-14T20:16:39.000Z"
    },
    {
      "author": "einahpets",
      "body": "Uh, that was too long to read. I'll just call you this weekend and get an update. Thanks.",
      "created_at": "2005-01-14T20:17:52.000Z"
    },
    {
      "author": "Fyse",
      "body": "Yeah, right on Justin. We want a good Phlogging!",
      "created_at": "2005-01-14T23:25:21.000Z"
    },
    {
      "author": "Aaron",
      "body": "So, I hear your big new banner is being upstaged by something going on across the street. <br/><br/>Please don't get shot.",
      "created_at": "2005-01-15T00:45:07.000Z"
    },
    {
      "author": "Justin",
      "body": "What's going on across the street?",
      "created_at": "2005-01-15T00:46:37.000Z"
    },
    {
      "author": "nicole",
      "body": "Someone got shot AND hit with a pipe. I thought I moved to Springfield, not East St. Louis!",
      "created_at": "2005-01-15T01:46:16.000Z"
    },
    {
      "author": "bjork24",
      "body": "They must've been pissed about me not making a new Phlog last night.",
      "created_at": "2005-01-15T02:12:35.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "I drove by to see the banner and saw all the cops.  I was thinking the bookstore had gotten robbed, but yeah the guy in the office upstairs got shot and hit.  No one knows why yet, but I guess he's doing okay (in the hospital of course).",
      "created_at": "2005-01-15T02:35:33.000Z"
    },
    {
      "author": "Laurie",
      "body": "Well Good gravy...One honkin' ass post ya got here Dan'l.  I had no clue the shooting was over your way!! Jeez.  <br/><br/>Anyways, I am needing to get in touch with you. If it is at all possible, could you email me?  It is business related and I think you might be interested.  <br/><br/>thanks.<br/>",
      "created_at": "2005-01-15T05:53:34.000Z"
    },
    {
      "author": "bjork24",
      "body": "I just e-mailed you.",
      "created_at": "2005-01-15T06:09:39.000Z"
    },
    {
      "author": "Laurie",
      "body": "I haven't recieved your email, but then again hotmail and MSN messenger has had a cobb up its arse for the last few days.  Did you send it to the noodle account?  <br/><br/><br/><br/>  ",
      "created_at": "2005-01-17T04:44:10.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
