{
  "id": 134,
  "title": "In the ghetto",
  "body": "All of Springfield is abuzz about the shooting of downtown developer, Scott Tillman. Loyal readers might remember him as the guy who's trying to <a href=\"/post/60\">open a multiplex theater one block North of the Moxie</a>. Earlier today, someone walked into his office - located directly across the street from the theater - bonked him over the head with a lead pipe, and shot him in the leg. Scott eventually regained consciousness, stumbled out onto the street, and was taken to a nearby hospital. He's in stable condition and is expected to make a full recovery.\r\n\r\nThat's big news for a town that has very few random acts of violence, especially when the victim is a well-known downtown developer. I wonder what provoked the attack? Did Tillman owe someone money? Early reporters indicate that the attack wasn't intended as a robbery. Who knows. Either way, I'll keep everyone posted, as I'm sure you're dying to find out.\r\n\r\nIn the meantime, I'll be packing heat for my own personal protection.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-01-15T05:59:35.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Aaron",
      "body": "Dude, seriously, that is the saddest, most depressing song ever. It's not often that the oldies station plays songs that make you cry.",
      "created_at": "2005-01-15T06:18:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "Another baby dies in the ghettoooooo",
      "created_at": "2005-01-15T07:43:49.000Z"
    },
    {
      "author": "nicole",
      "body": "I wouldn't mind being a back-up singer for that song.",
      "created_at": "2005-01-15T08:01:16.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "This was your competition?  I wouldn't admit that to too many people.",
      "created_at": "2005-01-15T09:20:14.000Z"
    },
    {
      "author": "Chuck",
      "body": "Never realized theatre entrepeneurs were so cutthroat. Hey... how did you know all the details so well anyway?",
      "created_at": "2005-01-15T17:33:38.000Z"
    },
    {
      "author": "einahpets",
      "body": "Elvis rulz.",
      "created_at": "2005-01-15T21:17:51.000Z"
    },
    {
      "author": "Tyler",
      "body": "I've heard money stories w/ Scott Tillman.  In the upper thousands in non-payment of which he owed them.",
      "created_at": "2005-01-22T19:33:04.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
