{
  "id": 136,
  "title": "Broke as a pin oak",
  "body": "Our bank account is in its final death throes, which means it's time to start bringing home the bacon... and some paychecks too. To that end, Nicole will be starting her temporary job as an adjustment something-or-rather at a local insurance office tomorrow at 8:00 AM (note to self: unpack alarm clock). She's not too thrilled about it, but we have bills to pay and adjusting insurance claims for the next couple months sure beats turning tricks - at least in Nicole's book. I'm going to be picking up some computer work at my old place of employment on the south side of town. It's not much, but it sure beats adjusting insurance claims! Ha ha, Nicole!<br/><br/>By the way, if you're a Springfield reader and know of someone who is in dire need of computer help - be it in the shape of web design and/or programming, network configuration, database cajoling, or general software/hardware configuration/troubleshooting - tell them to drop by the blog and leave a huge comment entailing the position, the pay, the office conditions, and severance package. I'll happily consider all offers for discreet, under-the-table, non-pornagraphic, freelance positions. DAMN YOU PENMAC!<br/><br/>Nicole and I are going to take some of our hard-earned spare change and go buy a piece of cheese at the Wal-Mart Supercenter down the road. That should hold us over until Wednesday or Thursday. Sigh.<br/><br/>Now, I better put my violin away and go make some bank.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-01-17T23:53:43.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Stephanie",
      "body": "I had offered to send cookies...the offer still stands!!",
      "created_at": "2005-01-18T00:40:34.000Z"
    },
    {
      "author": "bjork24",
      "body": "Perhaps we'll have to take you up on that.",
      "created_at": "2005-01-18T01:31:17.000Z"
    },
    {
      "author": "Justin",
      "body": "Redo Como... I'll pay you......something",
      "created_at": "2005-01-18T05:03:44.000Z"
    },
    {
      "author": "Chuck",
      "body": "And if anyone in Southwest Michigan needs to hire a writer, give me a call.<br/><br/>I have a feeling that living up to my full potential is really going to cut into my sitting-around time.",
      "created_at": "2005-01-18T05:13:46.000Z"
    },
    {
      "author": "Tim",
      "body": "Good luck with the soup kitchen/gub'ment cheese.  Over here today we had a local restaurant (\"Pizza Pi\" with accompanying mathematical symbol) offering large pizzas for $3.50 !  Customer Appreciation they call it.  Sweeeeeet.",
      "created_at": "2005-01-18T06:13:56.000Z"
    },
    {
      "author": "nicole",
      "body": "We're not so bad. A brick of cheese goes a long way. And we have our parents here in town to feed us! Thanks Mom & Dad and Mom-in-Law and Pop-in-Law!",
      "created_at": "2005-01-18T07:47:40.000Z"
    },
    {
      "author": "Stephanie",
      "body": "I do take requests...and I got a fabulous new cookie cookbook for Christmas!",
      "created_at": "2005-01-18T11:21:37.000Z"
    },
    {
      "author": "einahpets",
      "body": "Broke as a Quercus palustrus right? <br/><br/>See, my woody plants class comes in handy once again.<br/><br/>",
      "created_at": "2005-01-18T18:23:07.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Mmmmm, block of cheese.",
      "created_at": "2005-01-18T21:13:36.000Z"
    },
    {
      "author": "whitty",
      "body": "Luckily, (and I quote your post #49 here)Springfield has the \"sixth-lowest cost of living of any metropolitan area in the nation.\"  <br/><br/>And that is why it is so damn hard to move away.<br/><br/>Rock on with Ramen and cheese, rock on.",
      "created_at": "2005-01-18T21:50:52.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 13,
      "name": "Other job"
    }
  ]
}
