{
  "id": 137,
  "title": "Another busy day looms",
  "body": "Tomorrow will be another busy day. To get the party started, we have an early meeting with a sales rep from Banta Foods, a local wholesale grocer who promises to fulfill our every need. After that, we're heading over to Generic Springfield Bank to open a business account. We have our Articles of Organization, our LLC papers, our Federal Tax Identification Number, and gosh darn it, people like us. That was my Stuart Smiley impersonation.<br/><br/>Once our business account is set up, we can finally close on our loans... speaking of which, isn't it funny how you have to pay money before you can borrow it? We have to pay roughly $1,000 in \"closing fees\" before the money is distributed to us. I wonder if they'll let me pay them with the money I just borrowed?<br/><br/><b>GSB</b> - (<i>hands Dan a big, lumpy burlap sack with a green dollar sign emblazoned across the side</i>) Here's your money.<br/><b>Dan</b> - (<i>eyes transform into dollar signs</i>) Thanks! Woot woot woot!<br/><b>GSB</b> - Now, to the business at hand... you owe us $150 for the money counting fee, $80 for the \"removing money from cash drawer\" fee, $400 for the \"stuffing money into big burlap sack\" fee, and an additional $450 for the dollar sign painting fee.<br/><b>Dan</b> - I don't see a dollar sign! I'm not paying for something I can't see!<br/><b>GSB</b> - It's right there on the side of the burlap sack.<br/><b>Dan</b> - Oh. Ca-ching! (<i>reaches inside sack and pulls out a shiny $1,000 dollar piece</i>) Here you go... (<i>with a wink and a subtle clicking noise, Dan flips the gold piece onto the conference table</i>)<br/><b>GSB</b> - Thank you.<br/><b>Dan</b> - No, thank you.<br/><br/>(<i>silence</i>)<br/><br/><b>GSB</b> - I bet you thought this dialogue would wind up being funny when you started writing it, didn't you?<br/><b>Dan</b> - Yeah. Sorta.<br/><b>GSB</b> - Didn't quite work out that way, did it?<br/><b>Dan</b> - Not really.<br/><b>GSB</b> - Here. (<i>hands Dan a giant Nerf baseball bat</i>)<br/><b>Dan</b> - What in the world is this for?<br/><b>GSB</b> - I think you know.<br/><b>Dan</b> - Ok. If you insist...<br/><br/>So that's pretty much how I'm envisioning it in my head. If it doesn't turn out that way, I'm going to fairly, if not completely, upset. As usual, I'll keep you updated.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-01-19T09:29:15.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "erin",
      "body": "that was rather entertaining : )",
      "created_at": "2005-01-19T10:36:31.000Z"
    },
    {
      "author": "Dave",
      "body": "grocer? will i be able to walk into the moxie and get cabbage? cause alls i need to enjoy a movie is a lap full of cabbage.",
      "created_at": "2005-01-19T20:20:49.000Z"
    },
    {
      "author": "nicole",
      "body": "Grammatical Error Alert! Second to last sentence. Thank you.",
      "created_at": "2005-01-19T22:45:19.000Z"
    },
    {
      "author": "bjork24",
      "body": "Serious Nerd Alert! Comment immediately prior to mine. Thank you.",
      "created_at": "2005-01-19T23:01:40.000Z"
    },
    {
      "author": "Oz",
      "body": "It is weird how they want you to give them this (relatively) piddling amount of money before they give you a huge chuck of money.  When we bought our house, we gave them a check before they gave us an opportunity to sign a document promising to pay them more and more money over the next 30 years.  I'm not sure how it works if they are actually giving you cash as opposed to a mortgage.  Looking forward to the details.",
      "created_at": "2005-01-20T01:04:21.000Z"
    },
    {
      "author": "J.R.",
      "body": "Good luck with the nerf bat.",
      "created_at": "2005-01-20T05:06:42.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 14,
      "name": "Dialogue"
    }
  ]
}
