{
  "id": 138,
  "title": "This is so draining",
  "body": "Here's the problem: our concession area does not have a drain. If we want to have a pop fountain head, we need a drain AND a water line. If we install a drain in the concession area, we'd have to hire someone to trench through the concrete floor and connect the drain with the closest existing plumbing, which is in the restroom... some 15 feet away. It doesn't take a skilled contractor to realize how costly a procedure that would be. SO we're now faced with the idea of not having pop from a fountain. Is that such a bad thing?<br/><br/>My current thought on beverages at the Moxie is as follows:<br/><br/><b>Three Refrigerators</b><br/><br/>Fridge 1 - Pop, juices, bottled water, root beer, sasparilla, etc.<br/>Fridge 2 - Beer, wine, sissy drinks, etc.<br/>Fridge 3 - Kegs (One 1/4 keg, plus two 1/6 kegs)<br/><br/>If we can strike up an alliance with the Muddhouse, a popular downtown coffee house, then we'll also have fresh brewed coffee and tea.<br/><br/>Is serving only bottled soft drinks really so bad? I think pop tastes just fine out of the bottle, but Nicole disagrees. What do you think? Would you be mad if you went to a theater only to find that the pop was served to you in a bottle?",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-01-20T20:11:53.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "would they actually be in a glass bottle, or in a plastic one?  Glass would be cool, but either way, I don't think it makes too much of a difference.  A nice trade off is less dishes to do.  Of course, you could serve the bottle with a glass and ice.  There's a lot of options.  I don't think a fountain is necessary.",
      "created_at": "2005-01-20T20:34:32.000Z"
    },
    {
      "author": "justin",
      "body": "Off topic, but what about a walk-in fridge?  Will you have one of those dealy-o's?  Just thinking about storing surplus kegs/drinks etc.",
      "created_at": "2005-01-20T20:36:12.000Z"
    },
    {
      "author": "bjork24",
      "body": "No walk-in fridge. The bank vault will be used for storage.",
      "created_at": "2005-01-20T20:38:29.000Z"
    },
    {
      "author": "einahpets",
      "body": "I think as long as there are drinks, it should be ok. Start out with the ice boxes and then if you make a lot of money, you can put in a drain later.<br/><br/>Selling bottles may give you more variety on drinks. However, variety means people standing in line longer trying to decide what they want.<br/><br/>I hate that.",
      "created_at": "2005-01-20T20:43:51.000Z"
    },
    {
      "author": "bjork24",
      "body": "The problem with ice... it requires an ice machine, which requires water, which requires a drain.",
      "created_at": "2005-01-20T20:46:30.000Z"
    },
    {
      "author": "whitty",
      "body": "I don't know how many times I have gotten a gross tasting soda from a fountain, the mix is off somehow, but it always tastes the same out of a bottle/can.<br/><br/>But then I don't drink soda anymore, so my opinion may not mean much.  I am all about that juice option!",
      "created_at": "2005-01-20T21:17:55.000Z"
    },
    {
      "author": "justin",
      "body": "Just put dry ice in cups and hand them out.",
      "created_at": "2005-01-20T21:32:25.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "I would be mad if I went to a theatre and my pop wasn't cold. I don't really care one way or the other whether it's from a bottle or fountain though.<br/><br/>BTW, YAY for hot beverages!",
      "created_at": "2005-01-20T21:32:32.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Are you certain you couldn't do the work yourself?  I actually have no idea what it takes to do that, so nevermind me.<br/><br/>My only concern for you guys re the lack of a fountain is what your customers' expectations will be regarding the amount of liquid they will be able to purchase at one go.  But on the flipside, The Moxie is all about defying expectations, and if you have a stunning variety of drinks and treats available, no one will mind not having the option of getting 64 ounces of orange soda.",
      "created_at": "2005-01-20T21:33:35.000Z"
    },
    {
      "author": "Mark",
      "body": "You could offer free paper/plastic cups, then they could tip the bottle/s in and drink from the cups if prefered.<br/><br/>Mark",
      "created_at": "2005-01-20T22:43:56.000Z"
    },
    {
      "author": "matt",
      "body": "Soda from plastic does taste different than soda from glass or metal or a fountain.  I would always take a can over a bottle, even if the bottle costs the same, but I am in the vast minority.  No fountain drinks shouldn't pose a problem for anyone, and with bottles and cans you can have more variety anyway.  Let's hear it for snapple and other non-carbonated drinks (not fruitopia) at the movies!  Okay, another thing--minute maid fruit punch is awesome out of a cardboard carton but it tastes weird and vile out of a plastic bottle or a can!  What gives?",
      "created_at": "2005-01-20T22:54:46.000Z"
    },
    {
      "author": "Stephanie",
      "body": "I prefer mine from a bottle, anyway...I don't have to worry about ice-overkill.  ",
      "created_at": "2005-01-20T22:56:25.000Z"
    },
    {
      "author": "Fyse",
      "body": "I'd say ice is the all important ingredient. So long as it's cold, no one will care. But you say you'll have trouble getting ice either?",
      "created_at": "2005-01-20T23:13:20.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ice will be difficult, but not impossible, to get.",
      "created_at": "2005-01-20T23:21:48.000Z"
    },
    {
      "author": "Jennifer Neil",
      "body": "When I worked in a movie theatre a decade ago, we'd have at least one complaint every night about our fountain drinks.  Too much ice, not enough ice, too much syrup, not enough syrup, etc. etc.  I say give 'em bottled pop and such.  Sure, no free refills, but not as many complaints, either.",
      "created_at": "2005-01-20T23:43:07.000Z"
    },
    {
      "author": "Dave",
      "body": "the thing with fountain drinks is that it's easier to jack up the prices. if you're selling cans of coke, people are more used to paying a certain amount for a can/bottle",
      "created_at": "2005-01-21T00:13:05.000Z"
    },
    {
      "author": "bjork24",
      "body": "All these points are so valid... I think I'm going to cry.",
      "created_at": "2005-01-21T00:34:04.000Z"
    },
    {
      "author": "Oz",
      "body": "I just want to echo what Dave said.  If you're going to sell bottled beverages, you will probably have a harder time marking them up.  It doesn't make any sense, but it's true.  I'll pay $3.50 for what amounts to 20 oz of soda if it's coming from a fountain.  But one movie theater I know also has vending machines, and they charge $3 per bottle!  I can't do it.  I refuse to pay $3 for a bottle, even though it's probably the same amount of liquid.  But I can see how you would be in a tough spot considering that most of the money you make will come from concession sales, so obviously it's in your best interest to mark 'em up as much as possible.<br/><br/>As an aside, are you going to have recycle bins?  I would think better of you if you did...",
      "created_at": "2005-01-21T00:48:26.000Z"
    },
    {
      "author": "bjork24",
      "body": "Recycling? Yep. Glass, paper, plastic, and aluminum. Nicole insists on it.",
      "created_at": "2005-01-21T01:41:16.000Z"
    },
    {
      "author": "matt",
      "body": "Luckily Dan has already said he's not going to wring the money out of people's wallets for soda pop!  Charging $3.50+ for sugar water ought to be against the law.  It's certainly against nature!!!!",
      "created_at": "2005-01-21T01:59:23.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "I would agree with the jacking-up of prices for the fountain drinks.  On the other hand, you are planning to have a fridge no matter what, and you'll have some drinks in there, and if they are priced a lot less (like say $2 for a Snapple versus $3.50 for a medium fountain drink), I think you'll end up selling a lot more from the fridge than the fountain, and so whatever profit margin you eke out via the fountain may not be worth it in the end.<br/><br/>You still could always dig the trench yourself--with tiny tools, even, if you had to: Tim Robbins did a much bigger digging project with a tiny hammer in Shawshank Redemption.",
      "created_at": "2005-01-21T02:16:45.000Z"
    },
    {
      "author": "J.R.",
      "body": "If you get a liquor licensce, I don't know exactly how much soda you'd be selling.  However, as long as you have the caffeinated stuff that dehydrates water from my veins and causes my pancreas to scream in agony, I'm all for it!",
      "created_at": "2005-01-21T04:01:21.000Z"
    },
    {
      "author": "Al",
      "body": "I have to imagine you can make a decent margin on all pop.  Even if you \"only\" charge $1.50 a bottle, there's good money to be made there.  <br/><br/>That said, the margin on fountain drinks has to be about 90%.  I recall in my piza place days, the joke was always that the cup cost more than the soda...and it did.  Back in those days, we sold a liter for 95 cents, and the pop was 5 cents and the cup was 7.  <br/><br/>I'd see if I could brainstorm a way to drain the soda machine to a drain until it becomes feasible to have it drain directly.  ",
      "created_at": "2005-01-21T05:43:49.000Z"
    },
    {
      "author": "Allison",
      "body": "The neatest places around here (Northampton, MA) all serve the lesser known brands of soda, and I can't think of any that have a fountain.  Although I see the draw of having a fountain, you're an artsy kinda place.  Limiting yourself to \"arty\" beverages will remind people that they can be even neater than the average joe.  They may not be \"new and unique\" or even that \"arty\", but think: Tommy's naked soda, Jones soda, Tazo teas...<br/><br/>As for the ice, I'd say that you should have a mini-freezer in one of the plumbed rooms and make ice every night, then move it to a mini-freezer in the concession area each day.  It may not be the most efficient, but them's the brakes.",
      "created_at": "2005-01-21T11:51:12.000Z"
    },
    {
      "author": "Lor",
      "body": "I'd be fine with getting drinks out of bottles. I always get angry when half way through the movie you go to drink and all you can taste is diluted cola from all the melted ice. grr argh. <br/><br/>Although, opening a fizzy bottle in the middle of a movie does create that \"ssshhh\" sound and I'm always scared it'll bug people. You could give them the option of getting an ice filled cup if they want. Thats what they do at this cafe I know.<br/><br/>Also, I'm Scottish and nobody calls it Pop over here, so just you typing pop makes me forgive you for any injustice you could possibly make.",
      "created_at": "2005-01-21T21:14:36.000Z"
    },
    {
      "author": "justin",
      "body": "If you can't have an ice maker in the bar area, why not just put it where you CAN have it, and transport buckets of ice to the bar.  <br/><br/>The bar I work at does this.  The ice machine is at least 20-30 feet from the actual bar.  We have two large \"sinks\" with plastic covers on them that hold the ice we transport from the ice maker.  It stays frozen all night.",
      "created_at": "2005-01-21T21:51:34.000Z"
    },
    {
      "author": "Tim",
      "body": "I prefer bottles to a fountain.  Fountains have that irritating problem of syrup & gas ratios, so one little change in either one causes cups of tasteless/flat beverages. I used to work at a theater with fountain drinks and we were always running around adjusting syrup & gas levels.  Bah!",
      "created_at": "2005-01-22T06:06:05.000Z"
    },
    {
      "author": "Andrew",
      "body": "Not sure which pigeonhole to place this in so here goes.... There's a movie called Dig that was at the Ragtag. I'd love to see it, seeing as I love the Dandy Warhols and the movie tore it up at Sundance. Is there any way you could screen it once you upen? Please, pretty please. I'm willing to give my left little toe, maybe even my soul. Just kidding about the toe.",
      "created_at": "2005-01-22T16:22:11.000Z"
    },
    {
      "author": "Tyler",
      "body": " I've read most comments, but not all so if this is a re-run on what has already been said i'm sorry.  <br/> The whole bottled/can soda thing is a good idea, however..the cost on your end in the long run would be fountain due to the low cost ratio per drink on your end,..as to where you can mark them up..offer free refills etc.. If customers complain about too much ice, to little ice, or whatever.  You can offer them more ice, or less ice options.  <br/> When I go to a drive through I generally ask for little ice in my fountain drink, and it never poses a problem to anyone.  Yes there are syrup mixture problems now and then, but you can always offer a new drink if they dislike the one they have.  In the end I could see customers being happy over time with the fountain vs. bottle/can.",
      "created_at": "2005-01-22T19:29:38.000Z"
    },
    {
      "author": "nicole",
      "body": "Weird. I must be the only person out there who prefers fountain drinks and loathes sodas in plastic bottles. Glass bottles, now that's a different story. ",
      "created_at": "2005-01-23T00:04:13.000Z"
    },
    {
      "author": "James",
      "body": "I think it would probably cost your guys more to buy the soda in cans and bottles than to get a 5 gallon bag-in-a-box.  Plus, like the others said, it would be hard to jack up the price.  I think in the long run, you'll make your money back from installing a drain.",
      "created_at": "2005-01-23T14:48:43.000Z"
    },
    {
      "author": "Mark",
      "body": "When I had my fictitious moviehaus/oyster bara and grill/ dental office I didn't install a drain and just let whatever might fall on the floor fall on the floor.  Of course everyone involved (including me) contracted the consumption due to the stagnant humid air and died.",
      "created_at": "2005-01-26T04:08:50.000Z"
    },
    {
      "author": "Tawny",
      "body": "I'm with Nicole, I hate soda right out of the can! It's always too fizzy. Having cups to pour it into is a nice idea and would be a good compromise. Honestly, I'm so excited to see movies at the Moxie I don't care how my drink comes! Mudhouse coffee wouldn't hurt the experience though.",
      "created_at": "2005-01-29T00:45:37.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
