{
  "id": 139,
  "title": "A quick one before I go",
  "body": "I'm on my way over to the theater to start tearing up carpet, but before I go, I wanted to relay what happened yesterday.\r\n\r\nWe met with an agent from the health department.\r\n\r\nThat's it. So long!\r\n\r\nHa ha ha. I'm awesome. Seriously though, we met with an agent from the health department to go over our proposed concession area. We figured it would be best to have them approve everything BEFORE we start building so they won't come back in the end and tell us something is wrong... hopefully. The other big point was finding out whether we were going to need a hand sink in the concession area, because if we were, that would mean we'd need a drain. Our findings:\r\n\r\n1. We don't need a hand sink in the concession area as long as we have one in the prep area. (YAY!)\r\n2. As long as the spillage from the pop fountain and beer tap is collected in a drip pan, which is then emptied on a daily basis, there would be no need for a drain in the concession area. (YAY YAY YAY!)\r\n3. Hold on, let me check the statutes and make sure that's right. (UH OH!)\r\n4. Oh, no. I'm sorry, I was way off on that. If you want a pop fountain OR a beer tap, you're going to need a drain to collect spillage. Sorry. (NOOOOOO!)\r\n\r\nSo that's where we stand. Losing the pop fountain is one thing - if it had to go, I was okay with that - but losing the beer tap is a horse of a different color - as in, there's no fucking way we're NOT going to have beer on tap. Losing the pop fountain and the beer tap would mean a huge cut in the concession profits, and that ain't cool, dig?\r\n\r\nSpeaking of digging, that's exactly what we're going to have to do. Chris K., the contractor, is going to have to hire someone to come in with a hydraulic concrete saw and cut through 5 inches of solid, 60 year old concrete (for those of you who didn't know, concrete, unlike other materials, has a tendency to get harder and stronger as the years go by - YIPPEE!). After the concrete has been cut away, I'm going to go in with a pick and shovel and dig out the rest - just like on <i>O' Brother Where Art Thou</i>. Also, as I'm digging, I have to make sure that for every foot of horizontal space, the drain falls 1/8th of an inch towards the center of the earth. Isn't life grand?\r\n\r\nAlso, PENMAC finally offered me a job yesterday, but I declined due to the fact that the hours were 8:00 to 4:30, Monday through Friday, and taking it would mean I'd have no time to meet with people for the theater. While Nicole works during the day, I'm going to be hobnobbing with the rich and famous as we sip mimosas from tall glasses and wipe our brows while watching the lowly hired hands toil on the theater. Actually, I'm going to enter the 4th circle of hell and work as a telemarketer again. Why, you ask?\r\n\r\n1. It pays $9.00 or $10.00 an hour\r\n2. The hours are in the evening\r\n3. I get to talk to lots of interesting people on the phone\r\n\r\nThe only downside to the job is that the evening shift tends to attract all the college students, which means I'll be surrounded by hyper sorority girls who are dying to hear all about the new theater. A fate worse than death, to be sure. And before anyone asks, \"have you done telemarketing before?\" The answer is, \"yes, I have.\" I was a telemarketer way back in 1997-1998 when I was a senior in high school. During my tenure, I set the company record for most sales in one shift and for being the most awesome person in a 5 mile radius. I've heard they're much more strict these days, as in, I have to keep my clothes on at all times....\r\n\r\nI'm just holding off the inevitable. I have to go rip up carpet at the theater and apply an adhesive remover that features the following warning: \"A dust mask does not provide protection against vapors. WARNING: Using this product will expose you to chemicals which are known to the State of California to cause cancer and birth defects or other reproductive harm. Methylene Chloride has been shown t\r\no cause cancer in laboratory animals.\"\r\n\r\nGood think I'm not a laboratory animal living in the State of California! Wish me luck!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-01-22T20:55:00.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "I think you're the most awesome person in the tri-country area.  Now come over here and give me a hug.",
      "created_at": "2005-01-22T21:43:23.000Z"
    },
    {
      "author": "Laurie",
      "body": "Dan'l, you are too funny! Hey, I talked to your dad a bit ago after coming on here and reading your drain problems. ( no pun intended)  Give him a call cause Craig chatted with him about it, and you know his day job is riding dinosaurs, of the track-hoe type.  But anywho, your dad has the scoop on what was said.  Hope it helps out, and give Craig a call if you want him to do it.  He seems to think the shop has all the goodies needed for the concession drain, and for FREE!  Gotta love that word! WOO HOO!  I'm using tech ditch talk!  \r\nThis Just in...Seems we are gonna try and take a ride your way later today, to check it out.  Hope to see you there!\r\n",
      "created_at": "2005-01-22T22:16:56.000Z"
    },
    {
      "author": "bjork24",
      "body": "We'll see you there.",
      "created_at": "2005-01-22T23:52:36.000Z"
    },
    {
      "author": "Laurie",
      "body": "WOO HOO! The place checked out.  Nothing went bump ( outside of the sign) so I declare the premises Ghost-Free!!\r\n\r\nMost memorable part: The pride in Dan'l and Nicole's face when talking about The Moxie.\r\n\r\nWierdest moment:  The vault ( soon to be office? Nice floor, BTW.) That brickwork and the inclosed feeling had Porn/ BDSM written all over it. Anybody else get that feeling? ~shivers~\r\n\r\nMost regretful moment:  When I realized I had completely forgotten Dan'l and Nicole's friends' name, who was there to help them out.  I SOWWY!  I was excited, and I am OLD...By-The-Way...I got a picture of Dan'l getting his ass whipped...I will sell it to the highest bidder! ( course he was about 2 years old, lol. )\r\n\r\nHappiest moment: Fitting in the chair! WOO HOO!\r\n\r\nSaddest moment: No TUNES!  How can anybody work without TUNES?! \r\n\r\nBiggest surprise:  NO ECHO! (echo, echo)\r\n\r\nOk.  I'm done now.  For now.  I think...\r\n\r\nGod Bless Budweiser!\r\n\r\n\r\n\r\n ",
      "created_at": "2005-01-23T05:06:24.000Z"
    },
    {
      "author": "Fyse",
      "body": "I did door-to-door sales when I was in Australia once. I was top salesman for the country one week, and was earning ridiculously good money. It was all on commission, however, and things went downhill when we moved into an area full of elderly people and my conscience got the better of me. Sweet-talking old ladies into switching phone companies just felt wrong, even if it would be saving them money...",
      "created_at": "2005-01-23T05:20:55.000Z"
    },
    {
      "author": "Oz",
      "body": "Good think indeed!",
      "created_at": "2005-01-23T07:06:37.000Z"
    },
    {
      "author": "Laurie",
      "body": "Oh, the lengths one will go to for a cold, refreshing beer.\r\n\r\nGotta drain the main vein, right? I say install that puppy, and earn yourself more cash, and a few extra muscles to boot.  WOO HOO!\r\n\r\nOh, and I didn't think of THAT movie, I was thinking more along the lines of..\" Hi ho, hi ho, it's OFF to work we go...\"\r\n\r\nCheeky thang, ain't I?  ~invisions a ban from the beer tap coming on~\r\n\r\n:|",
      "created_at": "2005-01-23T07:59:43.000Z"
    },
    {
      "author": "Tim",
      "body": "Damn, Dan's going to telemarket and I just signed the DNC list yesterday?!  What was I thinking?",
      "created_at": "2005-01-24T03:42:15.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ha ha. I said \"think\". Good eye, Oz.",
      "created_at": "2005-01-24T05:30:52.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Telemarketing takes balls I currently don't possess. I envy your courage and ability, but not your means :)\r\n\r\nAnyway, lovin the blog, keep it comin and good luck with the demolition!",
      "created_at": "2005-01-24T19:25:00.000Z"
    },
    {
      "author": "Al",
      "body": "I'd just sell bottled beer.  I can't believe there's enough money in beer on tap to justify the trouble, never mind the expense, never mind the problems associated with beer (drunkenness, loud folks, etc).\r\n\r\n",
      "created_at": "2005-01-25T01:31:58.000Z"
    },
    {
      "author": "whittler",
      "body": "I'm always civil when telemarketers call. Poor bastards don't need the agro.",
      "created_at": "2005-01-25T03:03:35.000Z"
    },
    {
      "author": "Aaron",
      "body": "On a sidenote, I gave a 15 minute long plug for the Moxie to a newspaper report earlier today.",
      "created_at": "2005-01-25T06:40:44.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
