{
  "id": 14,
  "title": "Blog features",
  "body": "I've made a lot of changes to this blog over the last couple days, so I thought I'd take a brief moment to point some of them out. <br/><br/>+ On the side, you'll notice a red bar at the top that says \"Cinema 24 | <i>blog</i>\", this is the home button. It follows you everywhere you go and will always take you back to the homepage when clicked.<br/><br/>+ Below the [ about ] box, you'll see a box titled [ links ]... these are links that I have found to be relevant and/or useful when it comes to starting one's own theater.<br/><br/>+ The red bar below the [ links ] box is the new guestbook. So far, I've been the only person to sign it... and that's sad. Really, really sad.<br/><br/>+ Below the guestbook bar is the [ blogs ] box, which contains a small list of blogs that I frequent.<br/><br/>+ Below the [ blogs ] box is the [ quote ] box. The quotes cycle through at random, but if you'd like to see them all, you can click on the...<br/><br/>+ \"Quote | <i>archive</i>\" bar. I'll be adding new quotes from time to time.<br/><br/>+ Below the [ previous ] and [ archive ] boxes is the \"Donate | <i>today</i>\" bar, which is one and the same with the [ shameless ploy ] box. I won't go into detail about these boxes, because they embarass me.<br/><br/>+ Sandwiched between the shameless ploy boxes, you'll find the [ stats ] box. I plan to add more stats one day, so keep your eyes peeled.<br/><br/>That's it. Now I'm off to write the real post for today...<br/><br/>[UPDATE] - All of this is null now, as the layout for this blog has been changed several times.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-06-09T18:11:16.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Marc L.",
      "body": "Do you have to have a certain service to do all of this?",
      "created_at": "2004-06-11T23:39:58.000Z"
    },
    {
      "author": "Julia",
      "body": "Sorry, I know this is annoying, but my browser is MOZILLA Firefox and none of these features appear. Just thought I'd let you know.<br/>Excellent blog by the way and top-class business ideas. <br/>have you also considered fine-art students for your adverts? They have some OTW ideas. ;)",
      "created_at": "2004-06-11T23:40:12.000Z"
    },
    {
      "author": "Julia",
      "body": "SORRY the sidebars worked after about 5 mins on Mozilla. All is not lost. I'll get me coat...",
      "created_at": "2004-06-11T23:40:30.000Z"
    },
    {
      "author": "Xeal",
      "body": "Does the [ stats ] section use Blogger tags? I haven't seen something similar on their help page.<br/><br/>Thank you.",
      "created_at": "2004-06-11T23:40:45.000Z"
    },
    {
      "author": "phil3141592",
      "body": "I like very much this look",
      "created_at": "2004-06-12T22:22:15.000Z"
    },
    {
      "author": "nisha",
      "body": "i likey a lot. well done and great biz plan/ideas. quick ques...the random \\ly posted quotes...hows that work?..id love to get that on my blog. once again, great job. get back to me...",
      "created_at": "2004-06-13T07:30:33.000Z"
    },
    {
      "author": "f",
      "body": "fff",
      "created_at": "2006-11-08T04:26:23.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 7,
      "name": "Lists"
    }
  ]
}
