{
  "id": 140,
  "title": "Again with the intermissions",
  "body": "For long, long, long time readers of this blog, you might remember way back in June of last year when I first started pondering the feasibility of <a href=\"/posts/12\">running intermissions during our films</a>. Since that post was written, we had pretty much come to the conclusion that we were going to use platters - a big piece of machinery that allows you to feed an entire feature film, without interruption, into the projector. Everything we'd planned and budgeted for up to this point was leading us towards platters, but then came yesterday when we received the first draft of our building plans from the architect.\r\n\r\nAs it turns out, the projection booth is going to be a lot smaller than we had perviously imagined. In fact, it's so small that I can't think of anything funny to say about it. I was going to say something about me being hoisted into the projection booth by means of a pointed stick, but then I considered the logistics, not to mention the implications of such a procedure, and thought better of saying it. We must think of the children!\r\n\r\nNow... where was I? Oh yeah. No matter how I pushed and crammed and flipped and flammed the platter around in the projection booth, I couldn't get the damn thing to fit. Seriously, it's friggin' huge! The only alternative is to use a reel-to-reel setup, which means building up the film on 6,000 foot reels (roughly 80 minutes worth of footage) and feeding it through the projector. Due to similar projection booth size constraints, <a href=\"http://www.ragtagfilm.com\" target=\"_blank\">Ragtag</a> has their projector setup in a similar fashion, which is why they're forced to have intermissions.\r\n\r\nSo it looks like there's no way around it... the Moxie will have intermissions. Will it help us boost Cinebar sales? Hopefully. Will some of the intermissions be awkwardly placed? Probably. Will some guy, or girl, stand up during an intermission and say, \"look man, if you don't start that film again, I'm going to cut you!\" and then brandish a large knife and/or a shard of glass, with one end bandaged up so he won't cut his hand, at me? Most definitely.\r\n\r\nFOCUS GROUP UNITE!\r\n\r\nWhat do you guys think about intermissions? The <a href=\"/posts/12\">original post</a> garnered several interesting comments, but that was back when the Moxie Blog was a \"blog of note\" and our audience hadn't been pruned down to the true cinephiles and/or Springfieldians, as it is now. So, have at it. If you think intermissions suck, let your voice be heard. If you think it will add character to our theater - and by character I mean \"money\" - then send a check or money order to:\r\n\r\nMoxie Cinema\r\nP.O. Box 149\r\nSpringfield, MO 65801",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-01-25T20:02:02.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "Intermission's aren't so bad.  For smokers, it gives them a nice break.  For non-smokers, it gives them a reason to kill all smokers.  Ragtag's intermission doesn't bother me at all.",
      "created_at": "2005-01-25T20:28:49.000Z"
    },
    {
      "author": "bjork24",
      "body": "Congratulations Justin, you were the first commenter on this post and the original one. I'm putting out a restraining order on you.",
      "created_at": "2005-01-25T20:31:45.000Z"
    },
    {
      "author": "justin",
      "body": "I only comment because if I don't, you send nasty emails threatening me with violence for not contributing.",
      "created_at": "2005-01-25T20:36:02.000Z"
    },
    {
      "author": "bjork24",
      "body": "You can expect one in the near future.",
      "created_at": "2005-01-25T20:37:00.000Z"
    },
    {
      "author": "matt",
      "body": "I've honestly not been to a theater with intermissions since, like, ever.  The only intermissions I remember are when I've seen double features at historic theaters or drive-ins.  That said, I think the intermissions could be a cool, if sometimes jarring 'personality quirk' of the Moxie.  One thought occurred to me though--what happens during the intermission?  Will you have some sort of intermission signifier or will the film just break at some point and the lights come up if someone's paying attention?  I was thinking, although space is a premium, maybe this would be a good time to bust out an old slide projector and show intermission slides on an automatically advancing slide tray.  The money-interested route would be of course to produce and sell advertising slides for local businesses, but why not also thow in some family photo slides, custom artwork, and just weird stuff?  If you do wind up with something like this, let me know, and I will send you mad slides!",
      "created_at": "2005-01-25T20:58:04.000Z"
    },
    {
      "author": "whitty",
      "body": "All intermissions must involve a picture of a dancing hot dog.",
      "created_at": "2005-01-25T21:22:37.000Z"
    },
    {
      "author": "bjork24",
      "body": "Matt: I don't know if we're going to have any slides during intermission, but if we do, I'll let you know.\r\n\r\nWhitty: I actually know where I might be able to get my hands on the old, \"Let's all go to the lobby\" cartoon. That would be sweet!",
      "created_at": "2005-01-25T21:22:44.000Z"
    },
    {
      "author": "Al",
      "body": "Intermissions cause more labor, make the movie longer (making the late movie later), and I can't think of a single redeeming quality of them.  ",
      "created_at": "2005-01-25T21:27:38.000Z"
    },
    {
      "author": "bjork24",
      "body": "Al: the labor is already self-evident (changing the 6,000 foot reels and turning up the lights), but that's nothing we can't handle. You don't think intermissions would be a good time for people to get up and take a piss and/or grab another beer without missing part of the movie?",
      "created_at": "2005-01-25T21:30:35.000Z"
    },
    {
      "author": "John",
      "body": "I don't think the intermissions would bother me that much if it was totally understood from the beginning. If you're going to have intermissions, I say go with it 100%. Make it a part of the Moxie experience.\r\n\r\nLike maybe you or someone gets up in front of the audience right before every movie. You introduce yourself, give a brief synopsis of the film or any odd or funny facts you an think of, explain that there is going to be an intermission and then calmly threaten them with bodily harm if they don't buy at least ten bucks from the concession stand.",
      "created_at": "2005-01-25T21:46:57.000Z"
    },
    {
      "author": "bjork24",
      "body": "We're on the same brain-wave length, John. That's exactly how we were planning on spinning it.",
      "created_at": "2005-01-25T21:48:44.000Z"
    },
    {
      "author": "Aaron",
      "body": "You could just show 80 minute movies. \r\n\r\nDo you know when that article that we were interviewed yesterday for is running?",
      "created_at": "2005-01-25T21:55:30.000Z"
    },
    {
      "author": "bjork24",
      "body": "It's running tomorrow. I have to go have my picture taken at the theater later today.",
      "created_at": "2005-01-25T22:00:27.000Z"
    },
    {
      "author": "Luke",
      "body": "I agree with John's take.  Intermissions might be a little weird to the average patron who is accustomed to the multi-plex experience, although I personally wouldn't mid it at all.  But if you guys do something interesting during the intermission, and make it a part of a truly unique Moxie experience, I would be inclined to go to more movies just to see what you guys have planned for the next intermission.",
      "created_at": "2005-01-25T22:15:06.000Z"
    },
    {
      "author": "einahpets",
      "body": "I once was in a movie and the film stopped on accident.\r\n\r\nA large, loud girl stood up and said\r\n\r\n\"Hell no. Hell no. I DID NOT pay $7.00 to see the screen go black. Hell no.\"\r\n\r\nThen she proceeded to scream\r\n\r\n\"It smells like pus*y in here!\"\r\n\r\nTalk about a funny night. Hope that helps with your intermission decision.",
      "created_at": "2005-01-25T22:18:11.000Z"
    },
    {
      "author": "bjork24",
      "body": "Luke: what if we held belching contests during intermission?\r\n\r\nEina: Our theater will not smell.",
      "created_at": "2005-01-25T22:21:55.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "I'm with John.  Embrace the moxie of being different.  I mean, you're already different: you're going to be downtown, in a tiny theatre, running cool movies, selling beer.  I think you'd mentioned having someone introduce the movie anyway, so that's the perfect time to remind everyone there's going to be an intermission.  I think it will be good for your concession business, and it will make the Moxie memorable if nothing else.\r\n\r\nOnly caveat is that I think you should be clear about it in all your advertisements.  Something like \"Run time: 2 hours, 20 minutes including intermission\" would be appropriate I think.",
      "created_at": "2005-01-25T22:35:09.000Z"
    },
    {
      "author": "bjork24",
      "body": "Advertising? What's that?",
      "created_at": "2005-01-25T22:36:11.000Z"
    },
    {
      "author": "Oz",
      "body": "When this issue came up before, I thought that you said there were some issues getting permission from the film companies to have intermissions.  Yes?  No?\r\n\r\nIf I'm completely hallucinating that, I agree with what John said.  Clearly divulge this information before each film.\r\n\r\nAnd I have to admit that I'm a little disappointed that the theater won't smell like pussy.",
      "created_at": "2005-01-25T23:27:27.000Z"
    },
    {
      "author": "bjork24",
      "body": "Oz, you're right. There was a percieved problem with wether we'd be able to have intermissions due to contractual obligations, but since our theater is too small to accomodate a platter, we should be able to sidestep that stipulation. However, I'll have to go back through and check to see if there's anything in the master contract agreement about our auditorium smelling like genitals.",
      "created_at": "2005-01-25T23:32:46.000Z"
    },
    {
      "author": "Aaron",
      "body": "Advertising is the bane of my professional career, that's what advertising is.",
      "created_at": "2005-01-26T00:10:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'm sorry to hear that, Aaron.",
      "created_at": "2005-01-26T01:15:12.000Z"
    },
    {
      "author": "J.R.",
      "body": "Go for it... it's not like you have a huge choice in the matter other than to take out more seating to make room.",
      "created_at": "2005-01-26T03:55:25.000Z"
    },
    {
      "author": "Al",
      "body": "My bladder can easily make it a couple hours.  I can imagine using this as a good time to run to get some refreshments, but I imagine everyone will.",
      "created_at": "2005-01-26T05:54:04.000Z"
    },
    {
      "author": "Scott G.",
      "body": "I think the intermission sounds like a good idea.  You could put some form of entertainment in the lobby for that time period, like a local musician or poet or something.",
      "created_at": "2005-01-26T05:57:10.000Z"
    },
    {
      "author": "Fyse",
      "body": "I reckon this'll count in your favour. We all know the effects of alcohol, and if I were going to see a long movie with no interval I'd probably avoid beer in order to avoid a dash for the 'facilities' half way through. An interval will mean more beer sold before the film, as well as in the break.\r\n\r\nThere's a little college film society I was at the other day that has someone introducing each show. I thought it was a great personal touch, and he even ran a raffle, giving a box of chocolates to the person who's ticket number was chosen.",
      "created_at": "2005-01-26T06:01:15.000Z"
    },
    {
      "author": "Rachel",
      "body": "Ragtag has intermissions and since you'll be showing a lot of the same movies you'll get good tips on where to break the movie.  If you alert your viewers before hand, like they always do, and dress up like an emo/artsy boy (like they always do) people will think its neat and or dreamy.",
      "created_at": "2005-01-26T09:56:07.000Z"
    },
    {
      "author": "Chuck",
      "body": "It would only suck to lose your seat. \r\n\r\n(Off topic, I know going into your code is tedious, but would you mind updating your Chuck Guide link to chuckguide.com? I can't figure out where people are coming from.) :)",
      "created_at": "2005-01-26T12:37:27.000Z"
    },
    {
      "author": "James",
      "body": "The only problem with trying to find the right point for the intermission, because you're only going to have as many choices as there are reels, and reel changes sort of occur in random places, but at least it's during a scene change.  You might just have to put them smack-dab in the middle(i.e. inbetween reels 3 and 4 of a six reel movie).  Oh, and out of curiosity, will you be doing all the projection yourself?  Hah, and could I possibly get a booth tour when I drive down there(which I plan on doing!).  I'm a bit of a projection nerd.",
      "created_at": "2005-01-26T15:42:52.000Z"
    },
    {
      "author": "Mark",
      "body": "I can barely remember the days of intermission (did they use to show a cartoon?). I don't think they would bother me greatly as long as I was aware of them before hand. It would give me the opertunity to pee (beer does that), get some fresh air (to stop me nodding off, beer does that too) or get some more snacks.\r\nI think the intro idea is brill, also having something in the intermission (music, slides, acrobats, monkeys, what ever). It gives you a captive audient to taget with advertising and/or your own selection of art/music/performance.\r\nHow long will the intermission be? And any more thoughts on the MST3000 idea?\r\n\r\nMark\r\n",
      "created_at": "2005-01-26T19:50:49.000Z"
    },
    {
      "author": "Nicholas",
      "body": "smsu has a great animation department...hold a yearly contest for the \"announcing the intermission\" cartoon. you can even make a dancing weiner one of the \"must use\" items...",
      "created_at": "2005-01-26T22:25:00.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "I like the idea of having a silly intermission animation.  Locally generated is even better.  I would also love it if you could find a way to acquire some Looney Tunes reels and play those ahead of the film, but I'm guessing that would be pretty tough.",
      "created_at": "2005-01-26T23:09:55.000Z"
    },
    {
      "author": "Rachel",
      "body": "P.S. How do you feel about showing 3D movies.  I've never had an opportunity to see \"Freddy's Dead\" on the big screen and I think that's what 3D is all about.  I might have to fly in specifically for that!",
      "created_at": "2005-01-27T03:56:16.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "I -definitely- wouldn't have any type of Intermission \"animation\". You don't want to take away from the film in question (particularly if its a drama, etc).\r\n\r\nI would suggest a timer, however, just to let the patrons know how long they have.",
      "created_at": "2005-01-27T21:58:31.000Z"
    },
    {
      "author": "Mina",
      "body": "Its a bit late for my two cents, I know, but I love the idea of an intermission. It's like going out to the theatre or broadway. Great time to roll by the concession stand, buy a few Moxie souvenirs, use the little girls room and ask your date about that perplexing scene that just didn't make sense to you. Lots of redeeming qualities! I like it.",
      "created_at": "2005-02-09T14:27:32.000Z"
    },
    {
      "author": "Les McKinney",
      "body": "Anyone out there got a source for 35mm \" Intermission\" and theatre notices such as the ole-time \"Ladies in front please remove your hats for the others behind!\" etc.  OR perhaps cards that can be photograghed to 35mm slides????  Les",
      "created_at": "2006-03-18T11:44:33.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
