{
  "id": 141,
  "title": "Hey look, Part 4",
  "body": "<b>Front freakin' page!</b> That's where <a href=\"http://www.news-leader.com/today/0126-Enoughscre-288101.html\" target=\"_blank\" class=\"broken\">this story </a> ran today. Click the link to see some semi-nude pictures of yours truly... and by semi-nude, I mean fully-clothed. We've been really lucky with the media exposure we've been garnering. I mean, you can't buy publicity like this!<br/><br/><b>Enough screens in town? More are on the way</b><br/>By Karen Culp<br/><a href=\"http://news-leader.com\" target=\"_blank\">Springfield News-Leader</a>, January 26, 2005<br/><br/>If Dan Chilton's downtown Moxie Cinema were open, it would probably be showing \"Sideways\" or another limited-distribution film on Tuesday's list of Oscar contenders.<br/><br/>Chilton hopes to fill a niche in Springfield with his single-screen theater, which likely will be considered an \"art house\" when it opens on Walnut Street in March — a theater showing foreign films, documentaries and other independent movies.<br/><br/>\"We want to have a well-rounded offering,\" Chilton said. \"Most importantly, we want to become part of the community here.\"<br/><br/>It's the first of sign of change in the movie market in the past couple of years, and more change may be on the way.<br/><br/>Now, the city is down to two multi-screen movie theaters showing first-run movies, and another showing older, second-run films. That means smaller independent movies may have short runs or no run at all in Springfield.<br/><br/>Chilton's theater will be a welcome addition to the city, local film fans say. Springfield has fewer movie screens showing first-run movies than in 2001, when it had 30, and has no \"art house\" theater.<br/><br/>The city has 24 screens showing first-run films — the Campbell 16 Cine, owned by Wehrenberg Theatres Inc., and the Springfield 8, owned by Goodrich Quality Theatres. Another theater, the Palace, has eight screens showing second-run films.<br/><br/>Those theaters are working hard to keep the mix of movies broad, said Ron Krueger II, president of Wehrenberg Theatres, and he notes chief Oscar nominees that have played at the Campbell 16 — \"The Aviator,\" \"Sideways\" and \"Ray\" among them.<br/><br/>\"The Springfield market is better served than it ever has been,\" Krueger said.<br/><br/>He pointed out that though the city had several theaters in the past, those were one-, two-and three-screen complexes. Now, the first-run theaters have numerous screens, reflecting a consolidation that's been going on the movie-theater business for some time.<br/><br/>And more first-run screens may be coming.<br/><br/>In the works is a six- to 10-screen movie theater in downtown Springfield. Developer Scott Tillman plans to include this movie theater in his College Station entertainment and retail complex. Work is to begin on that project this year, though a theater operator has not been identified, said Tim Rosenbury, architect for the project. The development is to go on the empty lots between Campbell and Market avenues and McDaniel and Olive streets.<br/><br/>Another addition will be a 3-D IMAX theater to adjoin the Wonders of Wildlife museum at the corner of Sunshine Street and Campbell Avenue. The IMAX should be complete in several months and will show Hollywood films in full-screen IMAX format, when those films are available.<br/><br/>Chilton certainly sees room for more movie screens here.<br/><br/>\"Springfield's grossly underscreened\" based on the regional population that comes here to see movies, Chilton said. \"We want our one screen to bring a lot to Springfield.\"<br/><br/><b>Costs and benefits</b><br/><br/>Hollywood blockbusters and big family films usually will play in Springfield as soon as they are released, but sometimes film fans have to wait for others, including those that may become Oscar contenders.<br/><br/>Ultimately, though, once the Oscar list comes out, those nominated films may crop up on local multiplex marquees.<br/><br/>\"As soon as we get that Oscar list, we're doing everything we can to get prints,\" said Matt Johnson, market<br/>ing and training manager for Goodrich.<br/><br/>\"The problem is the availability of prints for some of those films,\" he said. \"When there are limited prints, the studio or distributor will seek out the art-house clientele.\"<br/><br/>The distributors of these types of films know they have a guaranteed audience at an art house, Krueger said.<br/><br/>\"Art-film distributors have a limited budget, and it's costly to make prints,\" Krueger said. \"They want to put those films where they get the most bang for their buck.\"<br/><br/>Larger movies also make better financial sense for multiplexes.<br/><br/>\"Multiplexes, in order to make money, have to go with the big movies, mainly,\" said Jim Wunderle, a local film fan who also writes film reviews. \"Sometimes they'll get a smaller movie, but if they only sell three or four tickets per showing, then they'll get another big movie to replace it.\"<br/><br/>Wehrenberg works to get prints of films in limited release, Krueger said.<br/><br/>\"Some of these are limited art releases, but the film company decided to release more,\" Krueger said. \"When we get those prints, the Campbell will be right in line to show them.\"<br/><br/>Wunderle said there is less diversity in films shown here than in larger markets, but \"it's not a Springfield problem. It's more the multiplex deal, plus there are less art houses in cities this size.\"<br/><br/>Goodrich makes \"every effort to show the odd little film,\" Johnson said. \"Literally, Hollywood makes these prints available in limited numbers.<br/><br/>\"What we tell people is that whenever we see one of these smaller movies playing, run and go watch it before it leaves,\" Johnson said. \"Tell your friends to go watch it.\"<br/><br/>Companies like Goodrich and Wehrenberg place movies based on anticipated demand, and continue running films for as long as it makes financial sense and those films are still seeing strong attendance.<br/><br/>Lately, though, \"90 percent of movies come and go in the four-to-six-week range,\" Johnson said. \"You'll have a movie occasionally run for a very long time, but that's not the norm.\"<br/><br/><b>Offering a good mix</b><br/><br/>People in the movie business seemed destined for it. Chilton began his love affair with film as a young employee at the Springfield 8, where he also met his wife, Nicole, who is a partner in the Moxie.<br/><br/>Krueger is the fourth generation of the Wehrenberg family to run the company. The St. Louis-based operation now has 15 locations with 201 movie screens. Eleven of those locations are in the St. Louis area, but Springfield's Campbell 16 is a strong location for Wehrenberg, which also ran the now-closed Battlefield Mall 6 Cine here.<br/><br/>\"Springfield's a great market for us,\" Krueger said.<br/><br/>Wehrenberg survived a bankruptcy filed in 2001 and now is on solid financial footing, having built two new theaters in the St. Louis area in recent months.<br/><br/>\"It gets in your blood,\" Krueger said of his family's long tenure in the movie business.<br/><br/>Chilton wasn't born into a family of movie-theater owners, but after his experience at the Springfield 8, and after spending lots of time at the Ragtag, an art-house theater in Columbia, he was determined to get into the film business.<br/><br/>\"My wife and I are both film fans,\" he said. When he started looking around, he determined that \"downtown Springfield could probably support something like this.\"<br/><br/>The Moxie will show smaller or independent films but also documentaries and local movies. \"Flying Tiger\" is a film shot in Stockton and Springfield that Chilton hopes to show.<br/><br/>\"It won't be difficult to find the good films,\" Chilton said. \"Independent films aren't always small or low budget; there's a great diversity. We hope to bring a well-rounded mix.\"<br/><br/>The single-screen theater will likely have three movie showings on weekdays, four on Friday and five on Saturday. The theater will try to show more than one film at a time, perhaps showing one film in the afternoon and another during the evening showings.<br/><br/>The 73-seat theater will have a standar<br/>d-size screen, and Chilton wants to serve more than just popcorn and candy, he said.<br/><br/>\"We'll have wine, yes, but we also want to make the concessions unique, bringing in MudHouse coffee, Supreme Bakery, Andy's Frozen Custard,\" he said.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-01-26T21:32:25.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "einahpets",
      "body": "Bravo!",
      "created_at": "2005-01-26T21:39:14.000Z"
    },
    {
      "author": "justin",
      "body": "There you are again, with your hands in your pockets.",
      "created_at": "2005-01-26T21:41:57.000Z"
    },
    {
      "author": "bjork24",
      "body": "Same shirt too. It's my Gob, from Arrested Development, shirt.",
      "created_at": "2005-01-26T21:42:38.000Z"
    },
    {
      "author": "Fyse",
      "body": "Great publicity. Will it play well with the public that you're a local lad, too?",
      "created_at": "2005-01-26T22:02:12.000Z"
    },
    {
      "author": "bjork24",
      "body": "I hope so. Springfield loves its own.",
      "created_at": "2005-01-26T22:03:11.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Dude, if you're serving Andy's I'll be a permanent fixture.",
      "created_at": "2005-01-26T23:15:13.000Z"
    },
    {
      "author": "Aaron",
      "body": "I'd like to point out that I'm one of the \"Springfield film fans\" quoted in the article.",
      "created_at": "2005-01-27T01:13:16.000Z"
    },
    {
      "author": "Aaron",
      "body": "And (gasp!) is this the first time your last name has been mentioned on the blog?",
      "created_at": "2005-01-27T01:14:42.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yep.",
      "created_at": "2005-01-27T01:23:59.000Z"
    },
    {
      "author": "Rachel",
      "body": "The way the article is set up it makes it sound like you and Nicole are such the underdogs.  Basically they said, \"big movie theaters all over showing diverse films...and then these guys with no experience.\"  You'll definitely get some angsty kids with that article.  As an angsty kid let me say we LOVE underdogs...and Underdog.",
      "created_at": "2005-01-27T03:54:35.000Z"
    },
    {
      "author": "J.R.",
      "body": "No such thing as bad publicity.",
      "created_at": "2005-01-27T05:32:38.000Z"
    },
    {
      "author": "Chuck",
      "body": "You realize how many of us are going to show up for your opening night? You're going to have a theatre full of bloggers. <br/><br/>(p.s. Thanks for the link update.)",
      "created_at": "2005-01-27T09:17:03.000Z"
    },
    {
      "author": "Laurie",
      "body": "I saw, I purchased, I plastered it to the wall.  Congrates!  Although I will say again..DAMN you look like Uncle Larry!  <br/><br/>Great timing for you, bad for here.  Did you see the next days' front page?  Gah.   <br/><br/>",
      "created_at": "2005-01-31T02:36:28.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
