{
  "id": 142,
  "title": "The one about Dan's problem dealing with local food and beverage vendors",
  "body": "<i>\"We'll have wine, yes, but we also want to make the concessions unique, bringing in MudHouse coffee, Supreme Bakery, Andy's Frozen Custard,\" he said.</i>\r\n\r\nThat quote, regarding some of the items we'll be offering at the Cinebar, came from yesterday's article that ran on the front page of the Springfield News-Leader. Funny thing is, I never said that. I told Karen, the reporter, that we'd LIKE TO carry items from the MudHouse, Supreme Bakery, and Andy's Frozen Custard, but I also explained to her that no deals had been made. We weren't planning on contacting any businesses until February, but after yesterday's story, we had to rearrange our schedules a bit.\r\n\r\nLast night I was contacted by the owner of Emack & Bolio's, a downtown ice cream parlor that also carries their own line of fresh baked pastries, sandwiches, soups, etc.. He was concerned that his business wasn't listed among those we were going to be working with. I explained to him that the quote was taken out of context, and that we hadn't yet come to a decision on who we would and wouldn't be working with. He proceeded to sell me on his product...\r\n\r\n<ul><li>Emack and Bolio's ice cream is excellent</li>\r\n<li>E&B strongly opposes using milk from cows injected with the genetically induced hormone bST (Bovine Somatotropin)</li>\r\n<li>Their pastries are made fresh daily and they can supply us with as little or as many treats as we'd need</li>\r\n<li>They also carry their own brand of coffee, specialty pop, and other goodies</li></ul>\r\nSounds pretty good, eh? On top of that, Emack and Bolio's is just a few blocks away from our theater, which makes them an ideal supplier. After speaking with the E&B guy, I called the owner of the MudHouse and one of the top dogs at Andy's Frozen Custard to apologize for the quote that ran in the paper. They were both very understanding and also flattered that we mentioned them in conjunction with the Moxie.\r\n\r\nBefore I continue, I should give a little background on these businesses for the non-Springfieldian readership.\r\n\r\n<b>The MudHouse</b> - The MudHouse is Springfield's number one coffee house. They started their business downtown before starting your business downtown was the cool thing to do. Back when they originally opened for business, downtown was nothing but rundown buildings, bad music venues, social services, a bus station, and a homeless Mexican name Joseph who tried to stab me in the face when I wished him a happy birthday (long story). Since then, the MudHouse has become one of the most successful businesses in the area. In recent years, they've expanded to open the MudLounge, a coffee house/wine bar, and a second MudHouse location on Drury's campus. The MudHouse has worked very hard to create a cool, laid-back, community-oriented atmosphere in all of their locations, which is something we'll be striving towards as well.\r\n\r\n<b>Andy's Frozen Custard</b> - If you're from St. Louis, you might be familiar with Ted Drewe's Frozen Custard, which is kind of what Andy's is based after. I'm not sure if the frozen custard craze has swept the nation, but I can tell you that it's a huge hit here in the Midwest, and because of this, Andy's is a Springfield mainstay. When people are out and about, they'll go out of their way to stop at one of their three locations across town. Unfortunately, Andy's doesn't have a location downtown, which is one of their only disadvantages. Nicole loves their frozen custard so much that she'd slit your throat and watch you die if had the nerve to stand between her and a strawana.\r\n\r\nYou should also remember that one of the goals of the Moxie mission is to support locally owned businesses, especially those that are contributing to the downtown community. The MudHouse and Andy's have already agreed to work with us AND create a specialty flavor/blend that would be unique to the theater. Emack and Bolio\r\n's has also offered to work with us, which is what's causing me so much grief. E&B and Andy's are competitors in the frozen treats market. Likewise with the MudHouse in the coffee / pastries market. I'd like to work with all three businesses, but I don't want to step on any toes.\r\n\r\nAlso, E&B is a franchise of a bigger chain, so would that fit the Moxie's mission of supporting local businesses? Of course, we're also serving Coca-Cola and Anheuser Busch products, so I sound a wee bit hypocritical here. Although, if you think about it, Anheuser Busch IS a local brewery. Ha ha ha! Suckers.\r\n\r\nSeriously though. I don't know what to do. Maybe we can serve coffee and tea from the MudHouse, frozen custard from Andy's, and pastries and other goodies from E&B. Or maybe we can serve E&B ice cream along with Andy's. I don't know, that's why I'm asking you. Oh great focus group, what do you think we should do?\r\n\r\nHonestly, how many other blogs let their readership participate in business decisions? Come on! (That was my G.O.B. impersonation from Arrested Development)",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-01-28T01:28:08.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Justin",
      "body": "Where's the bit about pancakes, your favorite river, and the last time you did laundry?",
      "created_at": "2005-01-28T01:32:17.000Z"
    },
    {
      "author": "bjork24",
      "body": "1. I don't like syrup on my pancakes\r\n2. James river\r\n3. Early December",
      "created_at": "2005-01-28T01:39:26.000Z"
    },
    {
      "author": "Justin",
      "body": "Thanks.",
      "created_at": "2005-01-28T01:40:04.000Z"
    },
    {
      "author": "Aaron",
      "body": "Mmm...artificial-butter-flavored coffee...",
      "created_at": "2005-01-28T01:41:15.000Z"
    },
    {
      "author": "bjork24",
      "body": "Artificial?!! We're going with the real deal, Aaron. A cup of hand-picked Bolivian coffee with a squirt of movie theater butter.",
      "created_at": "2005-01-28T01:46:10.000Z"
    },
    {
      "author": "matt",
      "body": "How much demand do you anticipate for all these goodies, and where are you going to put them?  It sounds overly-ambitious to me to have all that stuff PLUS your regular assortment of popcorn, soda, beer AND wine and candies.  If you've got the room for it all and you think there's a demand, you could easily work with everyone I think.  Otherwise, make it a business decison--which products will give you the best return/profit?  With all else being equal, which is the biggest benefit for Moxie ENTERPRISES!?",
      "created_at": "2005-01-28T02:03:52.000Z"
    },
    {
      "author": "bjork24",
      "body": "Good point, Matt. We're not going to have a HUGE capacity, but I think we can move enough product to justify the inventory. The ice cream / frozen custard would most likely be a seasonal treat. We will have lots of freezer space sitting around, so we might as well use it.",
      "created_at": "2005-01-28T02:06:45.000Z"
    },
    {
      "author": "whitty",
      "body": "I am going to have to go with Nicole on the Andy's.  Is E&B's just ice cream?  Meh for ice cream.  We are talking frozen CUSTARD here, man! Custard!  As for the rest, I don't partake, so can't say. Though the guys who own Mudhouse foster rescue pugs and I adopted one from them so they are awesome.  When I adopted my pug they had 8 pugs at thier house.  Crazy.\r\n\r\nReally, the James river? Yuk.",
      "created_at": "2005-01-28T02:30:12.000Z"
    },
    {
      "author": "bjork24",
      "body": "I was pressured. I couldn't think of any other rivers!",
      "created_at": "2005-01-28T02:43:59.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "So, how are you planning on packaging the Andy's and/or E&B's?  And/or what variety will you have available?  Like just a cup of a flavor or two, or some kind of sundae or concrete or what?\r\n\r\nAs for seasonality, I for one will eat Andy's any time of year.  I've been known to drive through in the dead of winter.  Like, say, last night.\r\n\r\nSpeaking of beer, have you talked to Springfield Brewing Company about their beers?\r\n\r\nI think if you have to choose one, go with Andy's on the frozen-treat department since they are 100% local, like the Mudhouse.  Same with the MudHouse in the non-frozen treat biz.  Better yet you could act like a supermarket and have *them* pay *you* for what percentage of shelf space they get.\r\n\r\nI don't suppose there's any way you could offer The Elvis from MudHouse, eh?\r\n\r\nSeriously I think you should stick to local suppliers when possible, and then if there's room, let E&B (et al) offer some products, as well.",
      "created_at": "2005-01-28T03:08:40.000Z"
    },
    {
      "author": "Aaron",
      "body": "Fitz's + Andy's floats are going to be AMAZING. Sprecher's is pretty good, but Fitz's is top notch. ",
      "created_at": "2005-01-28T03:16:49.000Z"
    },
    {
      "author": "Fyse",
      "body": "Make it a hard-nosed business decision. Which will sell best and earn The Moxie most moolah?",
      "created_at": "2005-01-28T03:18:59.000Z"
    },
    {
      "author": "bjork24",
      "body": "Dave: Andy's and MudHouse want to make us a special Moxie flavor. The Andy's would be served in Mini (6.5 oz.) servings and the MudHouse would be served in mugs.\r\n\r\nAaron: Good, but messy.\r\n\r\nFyse: Personally, I think Andy's would sell better than E&B, but I haven't had E&B yet, so I'll have to go have a tatse test.",
      "created_at": "2005-01-28T03:31:32.000Z"
    },
    {
      "author": "nathan springer",
      "body": "go with andy's emack and bolio's is no good, custard is the wave of the future. plus it taste sooooo good.",
      "created_at": "2005-01-28T04:13:13.000Z"
    },
    {
      "author": "nicole",
      "body": "We have also been told about a new tea house that does desserts and teas, etc. So we'll have to check that out too, you know. \r\n\r\nMmmm, I need some ice cream and custard right about now.",
      "created_at": "2005-01-28T05:05:06.000Z"
    },
    {
      "author": "J.R.",
      "body": "Can I just eat the blog?",
      "created_at": "2005-01-28T05:35:55.000Z"
    },
    {
      "author": "bjork24",
      "body": "J.R.: yes, you may.",
      "created_at": "2005-01-28T06:18:36.000Z"
    },
    {
      "author": "Al",
      "body": "I second the concern about too much stuff.  Popcorn and candy will satisfy 80-90% of your audience.  I'd prefer a hot item or two (hot dogs, burgers?) to ice cream/custard and the like.  ",
      "created_at": "2005-01-28T06:50:17.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Dan, I have to vote for Andy's over E&B by far.  E&B was just kind of run-of-the-mill.  Andy's is glorious.",
      "created_at": "2005-01-28T07:47:41.000Z"
    },
    {
      "author": "J.R.",
      "body": "My roommate is not going to be happy about his flat screen monitor.\r\n\r\nmmm....  blog.",
      "created_at": "2005-01-28T07:57:35.000Z"
    },
    {
      "author": "Kate",
      "body": "i'd pay the extra change for a beer from the Springfield Brewing Company.  their unfiltered honey wheat is to die for!",
      "created_at": "2005-01-28T09:13:36.000Z"
    },
    {
      "author": "bjork24",
      "body": "Kate, you're the first person I've ever heard say they like the beer from SFBC. I'm not a big fan, but we're going to try and serve it.",
      "created_at": "2005-01-28T09:19:34.000Z"
    },
    {
      "author": "Allison",
      "body": "I like Emack and Bolio's -- we go to the Newberry St one in Boston all the time -- but since it's originally a Boston chain, you're not really supporting your local vendors (you're supporting MY local vendors [mwahaha]).  I'd also have to say custard is so yummy that even though I haven't had Andy's, I'd say go with it.\r\n\r\nBut then again, if you want the biz to stay afloat, it's all about who can cut you the best deal.",
      "created_at": "2005-01-28T11:57:33.000Z"
    },
    {
      "author": "Nicholas",
      "body": "Umm...what about Boulevard Beer? It's KC based...lot's of people drink it here...I say go with Andy's and Mudhouse and try work out a coupon with Emack for summer-time treat just down the street.",
      "created_at": "2005-01-28T12:54:43.000Z"
    },
    {
      "author": "einahpets",
      "body": "E&B? The only reason why I would use it is so you can say the word Bolio.\r\n\r\nLike as in Bolo from Amazing Race.\r\n\r\nMy first name will be named Bolo...or my dog.",
      "created_at": "2005-01-28T18:51:07.000Z"
    },
    {
      "author": "einahpets",
      "body": "Uh, I meant first BORN. Not first NAME.",
      "created_at": "2005-01-28T20:26:31.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "I say pick one of the competitors and just apologize to the other. Whichever is cheapest (and/or most profitable). Now, did I get this right that Mudhouse + Andy's are going to give you a unique flavor/blend? I'd go that route. The more unique and interesting, the better.",
      "created_at": "2005-01-28T22:59:15.000Z"
    },
    {
      "author": "Tawny",
      "body": "I vote for Andy's and Mudhouse. \r\nI've run across a soda named Moxie. It's made in Maine, but I didn't know if you'd heard of it. Here is their web site if you would like to check it out. It might be fun to sell something self promoting!\r\nhttp://mainegoodies.com/food/Moxie/index.htm",
      "created_at": "2005-01-29T01:38:35.000Z"
    },
    {
      "author": "Honkey Hero",
      "body": "I think the Springfield Brew Co. beer is a great idea as well, that stuff ain't too shabby, but anything you have on tap will probably go over quite well.  \r\n\r\nAs far as E&B's vs. Andy's; it has to be Andy's, hands down.  Andy's is a part of our culture here and has a huge cult following.  Especially if they make their own Moxie flavor for you...(Custard that tastes like chewed bubble gum found under the  theater chairs with a hint of stale popcorn???)  \r\n\r\nBut for real do not spread yourself too thin, think about waste and profit margins and the like.  Lot's choices for customer's may seem like a good idea, but what has better profit margin: a cup of coke or a small custard, I will bet money on the coke. \r\n\r\nAndy's will go over well anytime.  E&B's may sit for a while.  I am sure you will do the proper research though.  Can't wait till you open!\r\n\r\nMatt",
      "created_at": "2005-01-29T01:50:46.000Z"
    },
    {
      "author": "Karen Culp",
      "body": "Dan,\r\nI want to get this cleared up, and apologize for the misunderstanding about vendors. I did pull that quote from my notes, but obviously some context was missing that would have helped you. I should have asked you, point blank, with whom you had contracts.\r\nPlease call me at work or e-mail me if we can run a correction, and please, please contact me when things like this happen and I will make it right. I'm human like everyone else and am fallible... Sometimes too fallible. \r\nOtherwise I hope the article brought you some good exposure and that people now know a little bit more about what the Moxie is. Let me know when your opening date is solid and we'll get it in, maybe as an article, or maybe in Weekend or something, I don't know.\r\nAgain, my apologies for the misunderstanding, and please let me know what I can do to help. \r\n--Karen Culp",
      "created_at": "2005-01-31T00:38:56.000Z"
    },
    {
      "author": "bjork24",
      "body": "Karen: not to worry. Everything cleared itself up and there were/are no hard feelings what-so-ever. Springfield 33 did the same thing during our news clip. I appreciate your willingness to set things straight though. You're a top-notch journalist!",
      "created_at": "2005-01-31T00:54:38.000Z"
    },
    {
      "author": "Joe",
      "body": "If you are worried about the competing companies, I think you may be seeing something that isn't there. I frequnet all three establishments and choosing between them is like choosing between children, you can't. I would suggest using each for specific things. Use the Mudhouse for Coffees, E&B for pastries, and Andy's for Custard and rotate monthly or semi-yearly or something. That way, everyone is represented and nothing gets old.\r\n\r\nJoe",
      "created_at": "2005-02-02T01:43:41.000Z"
    },
    {
      "author": "Monkey",
      "body": "I say go with mudhouse all the way! Mudhouse has the best coffee AND the best muffins. Any others that can be worked in would be great as well but mudhouse is an absolute must-have!!!",
      "created_at": "2005-09-02T15:50:06.000Z"
    },
    {
      "author": "TheCheshireCatalyst",
      "body": "Go with the E&B, i mean.....from ye old money standpoint, what is easier to get, the custard or the E&B ice cream.......\r\n\r\n\r\nThat and the custard guy is a dick",
      "created_at": "2005-12-10T06:48:34.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
