{
  "id": 143,
  "title": "Simple logistics",
  "body": "Lots of media exposure + community support + excited film-goers + small theater + opening night = trouble(?).",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-01-28T20:41:44.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "whitty",
      "body": "I smell a stampede!  YeeHA!\r\n\r\nReally, maybe you should open on a Tuesday so real go-getters can come in over the week.  Then have a \"Gand Opening\" on the weekend for people who aren't cool.  \r\n\r\nI personally think you should have a special preview night for all us faithful readers.  Or just me.  Whatever.",
      "created_at": "2005-01-28T21:00:15.000Z"
    },
    {
      "author": "einahpets",
      "body": "Just as long as it's not April 15th-16th...\r\n\r\nI called those day first.",
      "created_at": "2005-01-28T21:24:41.000Z"
    },
    {
      "author": "justin",
      "body": "Just sell tickets in advance for opening night!  Or, don't call it \"opening night,\" call it \"opening week, month, year, decade, etc.\"",
      "created_at": "2005-01-28T21:30:14.000Z"
    },
    {
      "author": "Dave",
      "body": "why not just cram in a few more shows, and get some live music so people will hang out while they wait?",
      "created_at": "2005-01-28T21:52:11.000Z"
    },
    {
      "author": "John",
      "body": "I can't think of a better problem to have.",
      "created_at": "2005-01-28T21:54:26.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "You could try a soft opening like some retail stores do where the schedule a grand opening but open like a week ahead without notice to get everything running smoothly.\r\n\r\nAnd as for opening night, I think you will be jammed, but you could do a lottery for the tickets, perhaps. And have some kind of entertainment available for those who can't get tickets: Mark Bilyeu puts on a good crowd-friendly one-man guitar show.  There's an empty building across the street that I've heard of Jonathan Bentley playing at recently if you needed overflow space.\r\n\r\nHave you decided on a date you are aiming for to open?",
      "created_at": "2005-01-28T22:14:58.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "@I should read the other comments before I post.@",
      "created_at": "2005-01-28T22:15:41.000Z"
    },
    {
      "author": "Al",
      "body": "Advance tiks and soft open both seem like fine ideas.  One thing I'd do is not skimp on anything...first impressions.",
      "created_at": "2005-01-28T22:53:21.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Yah, I've lavish it out. Make sure all sales are online (basically meaning RSVP). Dress to the nines and I would have some special decorations in place (obviously).\r\n\r\nSounds like a hella fun party too :)",
      "created_at": "2005-01-28T23:00:27.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "Anyone from out of state should get priorty when deciding who gets tickets. None of this \"first come, first served\" crap. :)",
      "created_at": "2005-01-29T00:08:38.000Z"
    },
    {
      "author": "Tawny",
      "body": "I know you've got a lot of work ahead of you to get this ready to go, but have you given a guestimate on an opening date? Also, any incling on ticket prices? \r\nI'm voting for a dress up party on opening evening with advanced ticket sales! Can't wait!",
      "created_at": "2005-01-29T01:42:26.000Z"
    },
    {
      "author": "Chuck",
      "body": "I agree with Kerrie. We need priority from Michigan here.",
      "created_at": "2005-01-29T03:43:01.000Z"
    },
    {
      "author": "J.R.",
      "body": "The opening will be crazy.\r\n\r\nDan, please contact me, I want to proposition you. 417-926-2237\r\n\r\nHee, hee, hee.",
      "created_at": "2005-01-29T05:02:25.000Z"
    },
    {
      "author": "Fyse",
      "body": "you forgot...\r\n\r\n+ crazy and obsessed bloggers from far and wide\r\n\r\nNot that I'll be there, obviously. Someone flying from the UK would <i>certainly</i> be a little worrying.",
      "created_at": "2005-01-29T05:21:42.000Z"
    },
    {
      "author": "Laurie",
      "body": "Ya know Whitty is onto something here.  Have a practice-run for friends and family.  Lots of businesses do that to catch any potential \"Oh SHIT\" moments.  Family and friends understand.  Joe Blow will wanna sue.\r\n\r\nIn closing, if I told you there was porn in my url, would ya click it?\r\n\r\nChicken...",
      "created_at": "2005-01-31T02:45:47.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
