{
  "id": 144,
  "title": "Big ass media files",
  "body": "Well, you asked for it, and here they are... the TV news clips about the Moxie. A huge, huge, HUGE thanks goes out to Mr. <a href=\"http://www.ncoleman.com/blog/\" target=\"_blank\">Nicholas Coleman</a> who was kind enough to take time out from promoting his new movie, <a href=\"http://www.howellcountyfilms.com/projects/features/suburbanseven/feature002.htm\" target=\"_blank\" class=\"broken\">The Suburban Seven</a>, to encode our clips. Thanks Nick! Not only that, but when Nick's movie premiered last Tuesday night in Springfield, he stood up in front of the audience of nearly 200 film-goers, of which I was one, and gave a lengthy and sincere plug for the Moxie. Thanks Nick! Thanks Nick! Thanks! Your movies will always have a home at the Moxie.\r\n\r\nNow, before you watch these clips, there's a few things you need to know:\r\n\r\n1. The clips are hosted on RapidShare, which is a free file server that only allows you to download 20MB per hour. Since each file is between 10MB to 14MB, you'll only be able to download one per hour... or, if you know how, you can delete all your cookies and it'll let you download all three!\r\n\r\n2. When you click on each download link, you'll notice a little countdown towards the bottom of the page. You won't be able to download the clip until the countdown reaches ZERO. Once that happens, a BIG RED download link will appear for you to click. I know it's a pain in the ass, but it's free and it works, so what can you do?\r\n\r\n3. The first clip from Springfield 33 came from a really bad tape, so there's a persistent buzz throughout the length of the clip. It's annoying, but you can still hear what's going on.\r\n\r\n4. The clips are in order of appearance, but the third one is the most comprehensive of them all. If you only download one, make it that one.\r\n\r\n5. When the reporter sits down in one of theater seats on the second clip, the chair almost flips over on her. That's pretty funny.\r\n\r\n6. I gesticulate like a madman. Check it out:\r\n\r\n<center><img src=\"http://moxie.danchilton.com/pix/grum/10_dan2tc.jpg\"> <img src=\"http://moxie.danchilton.com/pix/grum/11_dan8ff.jpg\">\r\n<img src=\"http://moxie.danchilton.com/pix/grum/12_dan8qv.jpg\"> <img src=\"http://moxie.danchilton.com/pix/grum/13_dan8kx.jpg\">\r\n\r\n<a href=\"http://moxie.danchilton.com/pix/grum/14_gesticulate2xi.gif\" class=\"broken\">Click here to see the SWEET animated .GIF</a></center>\r\n\r\nPretty sweet, eh? That last animated .GIF is a slow motion version of me explaining how our customers will listen to local music. I'm using my hand to demonstrate how notes will float down from the ceiling and penetrate their eager earlobes. I'm AWESOME!\r\n\r\nOk, enough said. ENJOY!\r\n\r\n<b>January 4, 2005</b>\r\nSpringfield 33 (5:00 PM News)\r\n<a href=\"http://rapidshare.de/files-en/465380/MoxieNews003_56k.mov.html?pmode=1\" target=\"_blank\" class=\"broken\">download clip</a>\r\n\r\n<b>January 11, 2005</b>\r\nKOLR 10 (Morning Show - 6:10 AM)\r\n<a href=\"http://rapidshare.de/files-en/465281/MoxieNews001_56k.mov.html?pmode=1\" target=\"_blank\" class=\"broken\">download clip</a>\r\n\r\n<b>January 11, 2005</b>\r\nKOLR 10 (Morning Show - 6:30 AM)\r\n<a href=\"http://rapidshare.de/files-en/465341/MoxieNews002_56k.mov.html?pmode=1\" target=\"_blank\" class=\"broken\">download clip</a>\r\n\r\nThe KOLR 10 clip also appeared on the 9:00 PM News on the Fox affiliate later in the week.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-01-29T07:36:21.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "whitty",
      "body": "cool! While I won't be downloading it because I saw it the first time and have no patience, it is still cool.\r\n\r\nAnd for the record, I once put fake sardines on Nick Coleman's head.  It is a small freakin' town.",
      "created_at": "2005-01-29T09:05:46.000Z"
    },
    {
      "author": "Al",
      "body": "Is the babe in white as hot as she appears in the pic?",
      "created_at": "2005-01-29T10:23:35.000Z"
    },
    {
      "author": "justin",
      "body": "I'll host the movies for you if you want.  Fast speeds, no waiting. Let me know..",
      "created_at": "2005-01-29T12:01:38.000Z"
    },
    {
      "author": "Oz",
      "body": "I watched the third one, per your instructions.  Your voice sounds funny.",
      "created_at": "2005-01-29T18:35:06.000Z"
    },
    {
      "author": "bjork24",
      "body": "Whitty: It's a small world.\r\n\r\nAl: I'm married, so I can't say.\r\n\r\nJustin: Don't worry about it. RapidShare will work for now.\r\n\r\nOz: My voice sounds tinny in the files, but it's actually a very sexy baritone.",
      "created_at": "2005-01-29T21:17:28.000Z"
    },
    {
      "author": "Chuck",
      "body": "Sexy baritone wasn't... exactly what I was going to say. \r\n\r\nThis just explains why there are no video clips of me on MY website.",
      "created_at": "2005-01-29T21:42:36.000Z"
    },
    {
      "author": "bjork24",
      "body": "1. I'm in an empty brick building (echo)\r\n2. The mic is under my collar (muffled)\r\n3. It's 7:00 in the morning (robotic)\r\n\r\nDue to those three factors, I sound like Tinny the Gesticulating Robot. Trust me, I don't sound like that in real life. Seriously. SERIOUSLY!",
      "created_at": "2005-01-29T21:48:42.000Z"
    },
    {
      "author": "Chuck",
      "body": "lol. Okay. Whatever you say, buddy. \r\n\r\nWhat program do you use for your comments? I love how your name is red.",
      "created_at": "2005-01-29T21:52:40.000Z"
    },
    {
      "author": "bjork24",
      "body": "Everything on my blog is handmade. I got tired of dealing with blogger and haloscan and all their disadvantages, so I just built my own.",
      "created_at": "2005-01-29T21:54:14.000Z"
    },
    {
      "author": "Chuck",
      "body": "Damn...",
      "created_at": "2005-01-29T21:58:48.000Z"
    },
    {
      "author": "Fyse",
      "body": "I love the totally unexplained shots of bank vaults and wall safes. The numerous piles of rubble are also a nice touch!\r\n\r\n\r\nAlso very weird hearing the voice of someone you've only read the blog of previously. Not that I'm saying your voice sounds weird. I'm far too polite to point that out...",
      "created_at": "2005-01-30T01:03:02.000Z"
    },
    {
      "author": "bjork24",
      "body": "No, no. That's okay. It does sound weird. Unnatural even.",
      "created_at": "2005-01-30T01:10:29.000Z"
    },
    {
      "author": "Fyse",
      "body": "Ah, I see there is an explanation of the vault in the third movie.\r\n\r\nIs it officially 'Moxie Cinema' now, and not 'The Moxie'?",
      "created_at": "2005-01-30T04:45:29.000Z"
    },
    {
      "author": "whittler",
      "body": "I didn't think your voice was that weird. But the reporter was from Planet Fox! Shame about her voice.",
      "created_at": "2005-01-30T12:16:01.000Z"
    },
    {
      "author": "Oz",
      "body": "Thank god you really have a deep, sexy baritone.  Seriously, that's much closer to what I had imagined.  Now I can go back to thinking about \"old Dan,\" who hummed Barry White tunes while installing drainage lines.  \"New Dan\" was more likely to sing \"Mary Had a Little Lamb.\"",
      "created_at": "2005-01-30T14:50:18.000Z"
    },
    {
      "author": "nicole",
      "body": "His voice gets really high and squeaky when he's drunk, though. ",
      "created_at": "2005-01-30T21:48:44.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
