{
  "id": 145,
  "title": "Totally telemarketable",
  "body": "I begin work as a telemarketer tonight. From 4:00 PM to 11:15 PM, Monday through Friday and one maditory Saturday per month, I'll flip off my consccience and try my darnedest to sell \"mini-vacations\" to people all over the US of A. It's not the greatest job in the world, but it pays the bills and allows me to do theater-related stuff during the day. What theater-related stuff have I done today, you ask? I'm writing this post, aren't I!\r\n\r\nFor those of you keeping track, we still haven't unpacked the majority of our stuff from the move. I've been wearing the same 4 shirts for the last month. Nicole's been wearing a shirt she fashioned out of extra formica and cove trim. As of now, the only thing we have left to do is paint the living room and put up a few pieces of rebel trim. Once that's finished, it's 187% theater-related work, I swear! A big thanks to my parents for all their help with the house. They did 98% of the work while Nicole and I stood around and sipped iced tea. Thanks guys!\r\n\r\nSo much to do... so little time...",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-01-31T20:44:18.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "einahpets",
      "body": "You have my cell-phone number. I might be talked into a vacation.",
      "created_at": "2005-01-31T21:07:31.000Z"
    },
    {
      "author": "bjork24",
      "body": "I wouldn't consider unpacking much of a vacation, but if you think so...",
      "created_at": "2005-01-31T21:11:06.000Z"
    },
    {
      "author": "Chuck",
      "body": "So it was <i>you</i> that interrupted my dinner! Why I oughtta...",
      "created_at": "2005-01-31T21:19:50.000Z"
    },
    {
      "author": "bjork24",
      "body": "It couldn't have been me. Tonight's my first night on the job! I'll interupt your dinner tonight though, rest assured.",
      "created_at": "2005-01-31T21:32:40.000Z"
    },
    {
      "author": "justin",
      "body": "Can anyone say <i>telemarketing blog</i>?  No, seriously... can anyone say it?  I'm having trouble.  Thanks.",
      "created_at": "2005-01-31T21:49:27.000Z"
    },
    {
      "author": "bjork24",
      "body": "I just said it... to myself.",
      "created_at": "2005-01-31T21:51:01.000Z"
    },
    {
      "author": "mike",
      "body": "Hey Dan - I think I'm going crazy - I swear I had your email address somewhere... but I can't find it under any of my accounts, or anywhere on your blog, so... I'm doing what I should have done fifteen minutes ago: can you send an email my way so I can ask you something about the 'moxie shop'...\r\n\r\nps. good-luck at your job tonight! ",
      "created_at": "2005-02-01T00:16:42.000Z"
    },
    {
      "author": "nicole",
      "body": "How sad. Dan and I won't be seeing much of eachother for a while...",
      "created_at": "2005-02-01T02:30:05.000Z"
    },
    {
      "author": "Rachel",
      "body": "Phlog me.  I want more pictures!",
      "created_at": "2005-02-01T03:06:52.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "I would like more pictures as well. Hmm...video. Will have to download that later this evening. Rock on dude, and um, good luck with the vacation selling.\r\n\r\nIf you call and I hang up on you, no hard feelings, okay?",
      "created_at": "2005-02-01T03:14:26.000Z"
    },
    {
      "author": "bjork24",
      "body": "I haven't had a chance to reply to all of these comments today, so I'll answer them all with one word, \"peanut.\"",
      "created_at": "2005-02-01T08:48:11.000Z"
    },
    {
      "author": "J.R.",
      "body": "Remember the large man who will help with your 187%.  Good luck with the telemarketing, 'tis better than the Greene County Assessor's office.",
      "created_at": "2005-02-01T09:49:45.000Z"
    },
    {
      "author": "Chuck",
      "body": "Make sure you use the \"husky\" voice, as mentioned in the RAQ.",
      "created_at": "2005-02-01T16:39:46.000Z"
    },
    {
      "author": "Thethings Idoformoney",
      "body": "Welcome to the industry my friend....we like to say we leave our morals in the car in the morning...sometimes we leave them there on weekends also....looking forward to your insights!",
      "created_at": "2006-09-03T22:23:05.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 13,
      "name": "Other job"
    }
  ]
}
