{
  "id": 146,
  "title": "Q&A session with Dan",
  "body": "I've been looking at our stats lately and I've noticed a steady increase in traffic over the last couple months. I don't know whether to attribute this trend to the current momentum of the project or the fact that the word's been spreading quickly here in Springfield, but either way, the more the merrier. To that end, I realize I've been glossing over a lot of details as my posts have become longer and more broad, and I also realize that many of you may have questions regarding the Moxie that I haven't answered. I try to answer as many questions as I can in the comments of each post, but sometimes I get caught up with other work and by the time I get back I'm too drained to respond to each and every one.<br/><br/>But enough about me and my excuses. This post is about you, my readers - new and old, young and elderly (i.e. 30 years of age or older) alike! If you have a question about the Moxie, or anything else theater-related, please feel free to ask it in the comments section of this post. Then, when tomorrow rolls around, check back here for an entire post dedicated to answering all the questions that were asked. Aren't I a swell guy? I'll go ahead and answer that right now: yes, I am. So don't be shy; if you have a question, I'd love to answer it. Ask away!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-02-01T21:12:38.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "Where's your hat?",
      "created_at": "2005-02-01T21:36:49.000Z"
    },
    {
      "author": "Oz",
      "body": "I'm elderly!  I KNEW it!",
      "created_at": "2005-02-01T22:15:24.000Z"
    },
    {
      "author": "Lor",
      "body": "I've been pondering for the past hour about what question to ask for this my big chance to find out about the inner workings of a movie theatre, but the only question I can think of is \"have you planned this years halloween outfit yet?\" <br/><br/>Right, got one, it's not really that serious - Is there one film that is banned from being shown in The Moxie, purely because you hate it so much? Does Nicole agree with you on this?",
      "created_at": "2005-02-01T23:46:35.000Z"
    },
    {
      "author": "Beavis",
      "body": "Do you like cookies with peanut butter or crisco?",
      "created_at": "2005-02-02T00:23:13.000Z"
    },
    {
      "author": "einahpets",
      "body": "How was your first night back in the telemarketing world? ",
      "created_at": "2005-02-02T00:24:14.000Z"
    },
    {
      "author": "Beavis",
      "body": "Will you be serving salami in the concession area?",
      "created_at": "2005-02-02T00:24:33.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "How did you get introduced to a distributor? Did you just (God help my ignorance) just, uh, call up the receptionist and tell them you're starting a theater? What were the problems you faced with this relationship? It seems that seating was on hurdle (more asses in seats = better/bigger movies..er, independent movies?), and I'm curious of your other run-ins regarding this.<br/><br/>Have you had any second thoughts? Were there any \"close calls\" as to the business about to be dismissed because the complications got too great? I recall clearly the money situation seemed to be bad for awhile...<br/><br/>Hmm. that's two questions. dang.",
      "created_at": "2005-02-02T00:39:17.000Z"
    },
    {
      "author": "Maudy",
      "body": "Who's that red-faced guy on the banner pulling out the pocket to show us it's empty? Why he does that?His face doesn't tell anything. Is he begging for our sympathy or he's just simply being clueless? Oh we will just never know, right Dan, since you're not him..I mean, he's wearing a hat.. yours still being lost doesnt it?!",
      "created_at": "2005-02-02T02:09:20.000Z"
    },
    {
      "author": "whitty",
      "body": "I think is apparent that Dan found his hat a while ago and has been stringing us along to gain our lost hat sympathy.  I mean, he is wearing a hat in the phlog, people.  So, I guess my question is: why the wild goose/hat chase, Dan, why?",
      "created_at": "2005-02-02T03:16:11.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "1. When are you planning to open?<br/><br/>2. Are you going to have any kind of frequent Moxie discounts?<br/><br/>3. You should have a Moxie Street Team.  Can I be on it?",
      "created_at": "2005-02-02T03:16:34.000Z"
    },
    {
      "author": "nathan springer",
      "body": "so on Tarnations website it says it will be playing at the moxie on Jan 14 but i dont think that happened, my question is will this still be played when the moxie opens, because i think it should it looks crazy good.",
      "created_at": "2005-02-02T03:32:51.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "Will the elderly (i.e. 30 years of age or older) receive discounted tickets at the Moxie?",
      "created_at": "2005-02-02T03:58:27.000Z"
    },
    {
      "author": "Rachel",
      "body": "Are you into my 3D idea?  ",
      "created_at": "2005-02-02T04:22:05.000Z"
    },
    {
      "author": "Scott G.",
      "body": "Do you know what will be showing on open night?",
      "created_at": "2005-02-02T09:03:31.000Z"
    },
    {
      "author": "Chuck",
      "body": "I see - I see. Chuck adds an FAQ and now Dan wants a Q & A all of a sudden. I'm onto you, movie man.",
      "created_at": "2005-02-02T11:28:00.000Z"
    },
    {
      "author": "Jennifer Neil",
      "body": "Someone in my city just opened up a new art house cinema last month.  Yay!  One of the things they have done is offer a yearly membership for $10, which gets you a bimonthly newsletter and $2.50 off the regular admission price of your ticket.  This is only available to a card-carrying member.  For example, if I go to the movies with a friend who isn't a member, I get $2.50 off my ticket, but she pays full price.  I thought it was a great incentive to have patrons come back, as after just four visits, the membership pays for itself.<br/><br/>Do you think you guys will be offering incentives like this?<br/>",
      "created_at": "2005-02-02T17:25:28.000Z"
    },
    {
      "author": "Nate",
      "body": "I went by myself last night to get Andy's.  All because of this blog.  I couldn't help myself.  I felt humiliated.  Was this your intention?",
      "created_at": "2005-02-02T19:50:02.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "I'm Ron Burgundy?",
      "created_at": "2005-02-02T20:29:15.000Z"
    },
    {
      "author": "Oz",
      "body": "Okay, I've got a question:  When is the projected opening date now?  I remember before you said around Valentine's Day, but in one of the video clips, the reporter said something about March.  'Fess up!",
      "created_at": "2005-02-02T21:35:48.000Z"
    },
    {
      "author": "geek",
      "body": "My question is-- Have you hired anyone to sell tickets/popcorn, or is it going to be just you and Nicole at first?  If you are going to hire, are there applications available?",
      "created_at": "2005-02-02T22:31:54.000Z"
    },
    {
      "author": "nicole",
      "body": "What's the next phlog-worthy event I can take pictures of?",
      "created_at": "2005-02-02T22:55:20.000Z"
    },
    {
      "author": "James Sheldon",
      "body": "Hey buddy.  Never did get to thank you personally for coming to check us out last Tuesday, and for supporting us throughout!  I just found out last night that some of the music that we were hoping to use has been pulled.  I haven't given up the fight just yet, but it's always somethin', isn't it?<br/><br/>Will you be at the MFAS meeting on Friday?",
      "created_at": "2005-02-03T00:08:12.000Z"
    },
    {
      "author": "nicole",
      "body": "Remember that guy last year on American Idol that looked like you? <br/><br/>That \"Walking in Memphis\" song is on, and that reminded me of it.",
      "created_at": "2005-02-03T00:43:39.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
