{
  "id": 147,
  "title": "The one with all the answers",
  "body": "1. <b>Justin asks:</b> \"<i style=\"color: #B00\">Where's your hat?</i>\"\r\n\r\nI think it's at your house.\r\n\r\n2. <b>Oz admits to being elderly</b>\r\n\r\nI'm glad you're finally coming to terms with your age.\r\n\r\n3. <b>Lor jokingly asks:</b> \"<i style=\"color: #B00\">Have you planned this years halloween outfit yet?</i>\"\r\n\r\nNo, Lor, I haven't. I think for every Halloween I'm going to dress up as a character from one of the films we showed during the preceding year. I'm keeping my fingers crossed that we show a movie starring <a href=\"/posts/90\">Slash</a>.\r\n\r\n4. <b>Lor seriously asks:</b> \"<i style=\"color: #B00\">Is there one film that is banned from being shown in The Moxie, purely because you hate it so much? Does Nicole agree with you on this?</i>\"\r\n\r\nAs of now, the Moxie blacklist is empty. All films are fair fodder for our film finagling fingers. Springfield is a bit more conservative than, say, Boston, so we'll have to build our schedules accordingly. With that being said, we're not going to shy away from stuff that we feel will be too controversial, as long as we have reason to believe it will show well. As for Nicole, she never agrees with anything I say. If it were up to her, we'd only show French films and I'd be forced to walk around naked all day.\r\n\r\n5. <b>Beavis asks:</b> \"<i style=\"color: #B00\">Do you like cookies with peanut butter or crisco?</i>\"\r\n\r\nI don't like cookies.\r\n\r\n6. <b>Einahpets asks:</b> \"<i style=\"color: #B00\">How was your first night back in the telemarketing world?</i>\"\r\n\r\nWe're actually in training for the first week, and let me tell you, it's a BLAST! We get to take turns reading paragraphs from the employee handbook, participate in group ice breakers, and role play in front of the class. Woo hoo! I was half expecting the class to fall at my feet when I revealed the fact that I was starting the independent theater downtown. Instead, everyone starred at me with a blank look on their face. \"You mean for plays and stuff?\" Bastards!\r\n\r\n7. <b>Beavis asks another question:</b> \"<i style=\"color: #B00\">Will you be serving salami in the concession area?</i>\"\r\n\r\nYes. Well... no. I mean, maybe. If Nicole has her way I'll be serving salami all over the place! CA-CHING!!! Get it? Get it? Me walking around naked? Salami means weenus? I'm going to get arrested, aren't I?\r\n\r\n8. <b>Evan Erwin</b> \"<i style=\"color: #B00\">How did you get introduced to a distributor? Did you just (God help my ignorance) just, uh, call up the receptionist and tell them you're starting a theater? What were the problems you faced with this relationship? It seems that seating was on hurdle (more asses in seats = better/bigger movies..er, independent movies?), and I'm curious of your other run-ins regarding this.\r\n\r\nHave you had any second thoughts? Were there any \"close calls\" as to the business about to be dismissed because the complications got too great? I recall clearly the money situation seemed to be bad for awhile... </i>\"\r\n\r\nThat's an incredibly long question. Here are the incredibly short answers (in order):\r\n\r\n<ul><li>Paul Sturtz, of Ragtag fame, is our booking agent. He put us in touch with the distributors we'd need to work with.</li>\r\n<li>Before you work with distributors, you have to call them and request a gigantic form called the \"master licensing agreement.\" It's filled with all kinds of fun stuff like credit applications, questions about your theater's capacity, projection capabilities, etc.. We can't receive movies until we've filled out all the forms and they've OK'd us to show them.</li>\r\n<li>Getting the forms filled out is a problem we're still struggling with.</li>\r\n<li>Seats, seats, seats. The more, the merrier. Trouble is, we don't want to squeeze people in like sardines. We may end up changing seats in the future.</li>\r\n<li>No. I've yet to have a second thought. Even today when I was told we might\r\n need to spend an additional $10K to upgrade the HVAC, I didn't bat an eyelash. I shit my pants, but I didn't have second thoughts.</li>\r\n<li>There have been so many \"close calls\" when the fate of the business has hung in the balance that I stopped discussing them on the blog. Had I continually brought them up, it would've been like the boy who cried wolf... eventually, no one would care when something bad came along. I always knew that things would work themselves out in the end, and lo and behold, here we are.</li></ul>\r\n9. <b>Maudy asks:</b> \"<i style=\"color: #B00\">Who's that red-faced guy on the banner pulling out the pocket to show us it's empty? Why he does that? His face doesn't tell anything. Is he begging for our sympathy or he's just simply being clueless? Oh we will just never know, right Dan, since you're not him..I mean, he's wearing a hat.. yours still being lost doesnt it?!</i>\"\r\n\r\nThat picture is a representation of how poor Nicole and I are right now. We're on a one-meal, $5.00 per day budget. I choose to eat cheese and crackers at home so I can spend my $5.00 on Dr. Pepper. Mmmm, Dr. Pepper. I've been meaning to change that guy to something new, but I always forget. Maybe I'll throw Benzo back up there. He's a real crowd pleaser.\r\n\r\n10. <b>Whitty asks:</b> \"<i style=\"color: #B00\">I think is apparent that Dan found his hat a while ago and has been stringing us along to gain our lost hat sympathy. I mean, he is wearing a hat in the phlog, people. So, I guess my question is: why the wild goose/hat chase, Dan, why?</i>\"\r\n\r\nI used PhotoShop to doctor all the pictures in the Phlog to make it APPEAR as if I were actually wearing my hat. It took me hours and hours to make it look real. I also added boobs to one picture, but I don't have that one online. It's in my wallet.\r\n\r\n11. <b>Dave Adams asks three questions:</b> \"<i style=\"color: #B00\">When are you planning to open?</i>\"\r\n\r\nEarly-to-mid-to-late March... or sometime in April. The date is kind of fuzzy.\r\n\r\n\"<i style=\"color: #B00\">Are you going to have any kind of frequent Moxie discounts?</i>\"\r\n\r\nYes, we'd like to have something along those lines. It may take awhile to impliment, but it's one of our goals.\r\n\r\n\"<i style=\"color: #B00\">You should have a Moxie Street Team. Can I be on it?</i>\"\r\n\r\nIf we start one, you'll be on the top of our list.\r\n\r\n12. <b>Nathan Springer asks:</b> \"<i style=\"color: #B00\">so on Tarnations website it says it will be playing at the moxie on Jan 14 but i dont think that happened, my question is will this still be played when the moxie opens, because i think it should it looks crazy good.</i>\"\r\n\r\nYes, we have every intention of showing <i>Tarnation</i> once we're open. The good people at Wellspring (<i>Tarnation</i>'s distributor) were kind enough to book that for us so we could get our Technicolor account number. I've heard it's an excellent movie.\r\n\r\n13. <b>WhimsyChick asks:</b> \"<i style=\"color: #B00\">Will the elderly (i.e. 30 years of age or older) receive discounted tickets at the Moxie?</i>\"\r\n\r\nUnfortunately, the elderly (i.e. 30 to 64) will have to pay standard fare, but the Civil War era old-timers (i.e. 65+) will receive a nice discount.\r\n\r\n14. <b>Rachel asks</b> \"<i style=\"color: #B00\">Are you into my 3D idea?</i>\"\r\n\r\nYes. I'm totally into your 3D idea, but not just because it's a good idea... I happen to like your face.\r\n\r\n15. <b>Scott G. asks:</b> \"<i style=\"color: #B00\">Do you know what will be showing on open night?</i>\"\r\n\r\nNot yet. We have a few that we're debating on, but I'm hesitant to list them yet. Worry not, I'll announce our line-up as soon as I know it.\r\n\r\n16. <b>Chuck admits to coping everything from Dan</b>\r\n\r\nI'm glad you're finally coming around, Chuck! Do you remember when Peppermint Patty would call Charlie Brown \"Chuck?\" Those were the days, huh. I heard she was gay too. Her and Marcy. That's AWESOME!\r\n\r\n17. <b>Jennifer Neil asks:</b> \"<i style=\"color: #B00\">Someone in my city just opened \r\nup a new art house cinema last month. Yay! One of the things they have done is offer a yearly membership for $10, which gets you a bimonthly newsletter and $2.50 off the regular admission price of your ticket. This is only available to a card-carrying member. For example, if I go to the movies with a friend who isn't a member, I get $2.50 off my ticket, but she pays full price. I thought it was a great incentive to have patrons come back, as after just four visits, the membership pays for itself.\r\n\r\nDo you think you guys will be offering incentives like this? </i>\"\r\n\r\nThis kind of goes along with the frequent movie-goer discounts that Dave Adams asked about (#11b), in the sense that we're planning on doing it, but we haven't ironed out the details quite yet. We really need to sit down and start laying out the groundwork for stuff like this.\r\n\r\n18. <b>Nate asks:</b> \"<i style=\"color: #B00\">I went by myself last night to get Andy's. All because of this blog. I couldn't help myself. I felt humiliated. Was this your intention?</i>\"\r\n\r\nYes, that was my intention all along.\r\n\r\n19. <b>Ben Dillon asks:</b> \"<i style=\"color: #B00\">I'm Ron Burgundy?</i>\"\r\n\r\nDamnit people, how many times have I told you to check the script? You know Ron will read anything that you put on the teleprompter!\r\n\r\n20. <b>Oz asks:</b> \"<i style=\"color: #B00\">When is the projected opening date now? I remember before you said around Valentine's Day, but in one of the video clips, the reporter said something about March. 'Fess up!</i>\"\r\n\r\nAs I said in answer #11a, our opening date is still tentative. The building permit has held us up quite a bit, to tell you the truth. Whenever I give a somewhat concrete date, something pops up and forces us to push it back. What's that old saying? \"It always takes twice as long and costs three times as much.\" That's so true. So true.\r\n\r\n21. <b>Geek asks:</b> \"<i style=\"color: #B00\">Have you hired anyone to sell tickets/popcorn, or is it going to be just you and Nicole at first? If you are going to hire, are there applications available?</i>\"\r\n\r\nNo, we haven't hired anyone yet. Due to the amazingly high cost of worker's compensation insurance, our work force is going to be lean and mean. I'm talking 4 or 5 part-time employees MAX. If you want to work for us you need to be at least 21 years of age (thanks Mr. Beer and Wine), love movies, be personable, gregarious, and very polite. If you meet those criteria, we'd love to have you. I've been to several art-house theaters where the employees think they're a million times better than the customers. They act all high and mighty and pretentious and mope around and never give you eye contact or smile or say \"thank you\". That's not what we're looking for. I imagine we'll be putting out a call for employees in early March.\r\n\r\n22. <b>nicole asks:</b> \"<i style=\"color: #B00\">What's the next phlog-worthy event I can take pictures of?</i>\"\r\n\r\nSalami.\r\n\r\n23. <b>James Sheldon asks:</b> \"<i style=\"color: #B00\">Will you be at the MFAS (Missouri Film Alliance of Springfield) meeting on Friday?</i>\"\r\n\r\nYep, I sure will. For those of you who don't know him, James is one of the stars of <i>The Suburban Seven</i>, which is probably the best movie I've ever seen that was made for $3,000.\r\n\r\n24. <b>Nicole asks:</b> \"<i style=\"color: #B00\">Remember that guy last year on American Idol that looked like you?</i>\"\r\n\r\nYeah. I hated that guy.\r\n\r\n- - - - - - - - - - - - -\r\n\r\nAnd with that, the question office is CLOSED. I'll try to answer any and all questions posed in the comments section from here on in. Thanks guys and gals!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-02-02T13:00:03.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Fyse",
      "body": "Bring back Benzo!",
      "created_at": "2005-02-03T01:10:49.000Z"
    },
    {
      "author": "Fyse",
      "body": "(please)",
      "created_at": "2005-02-03T01:10:59.000Z"
    },
    {
      "author": "nicole",
      "body": "Shoot. Working days puts me out of the loop. MFA meeting AND a new HVAC? ",
      "created_at": "2005-02-03T01:16:13.000Z"
    },
    {
      "author": "Oz",
      "body": "Wow, you're going to have employees at your art house theater that are pretentious?  Are you sure?  If that's your plan, I highly advise against asking what their favorite movies/directors/actors are on the application.  I put down Kevin Costner as a favorite actor on an application for this hoity-toity video store, and I'm sure that's what didn't get me the job.  Elitist snobs!  Costner rocks!  I'm not ashamed!",
      "created_at": "2005-02-03T01:24:48.000Z"
    },
    {
      "author": "Oz",
      "body": "And I like Tom Crusie, too, so suck it!",
      "created_at": "2005-02-03T01:25:16.000Z"
    },
    {
      "author": "bjork24",
      "body": "Fyse: Benzo is back.\r\n\r\nNicole: You're way out of the loop. I want a divorce.\r\n\r\nOz: I like Harrison Ford, so suck on that!",
      "created_at": "2005-02-03T01:26:12.000Z"
    },
    {
      "author": "Oz",
      "body": "BTW, I meant employees who are NOT pretentious.  ",
      "created_at": "2005-02-03T02:12:48.000Z"
    },
    {
      "author": "Beavis",
      "body": "Sweet, sweet salami.  Thin sliced or thick, I like them all.  Hopefully you will have mustard for the salami as well.",
      "created_at": "2005-02-03T02:39:15.000Z"
    },
    {
      "author": "matt",
      "body": "Harrison Ford in the 80s, sure, but Harrison Ford since then?  You can have him.  Please, please do work to find people who aren't just pissed that their band isn't going anywhere or their expressionist paintings aren't selling from the local coffee shop and who are antagonistic to people when they come to see a movie.  There's a theater here that seems to be staffed solely by people with better taste than everyone who would be out making glorious art if they weren't confined to scooping up Popcorn.  The tragedy.  My question: what is the sound system going to be like?",
      "created_at": "2005-02-03T03:34:45.000Z"
    },
    {
      "author": "Fyse",
      "body": "Have you considered an animated gif of Benzo busting a move? Just thought I'd throw that into the ring...",
      "created_at": "2005-02-03T05:22:35.000Z"
    },
    {
      "author": "Oz",
      "body": "I am loving the crossed out \"late 2004\" and \"February\" in the subtitle now.  LOVING IT.\r\n\r\n(Three comments to one post!  I'm outta control!)",
      "created_at": "2005-02-03T07:49:56.000Z"
    },
    {
      "author": "bjork24",
      "body": "Matt: digital stereo, upgradable to digital surround or THX in the future, and/or when we have $25K to blow.\r\n\r\nFyse: Consider it considered.\r\n\r\nOz: I thought you'd like that one.",
      "created_at": "2005-02-03T08:12:45.000Z"
    },
    {
      "author": "Rachel",
      "body": "Yes, but what does Benzo have in his pockets? We don't know. ",
      "created_at": "2005-02-03T09:42:27.000Z"
    },
    {
      "author": "bjork24",
      "body": "Benzo has salami in his pocket.",
      "created_at": "2005-02-03T09:56:27.000Z"
    },
    {
      "author": "nathan springer",
      "body": "yippy for tarnation",
      "created_at": "2005-02-03T10:31:59.000Z"
    },
    {
      "author": "Chuck",
      "body": "He changed what I said! Foul! Foul!",
      "created_at": "2005-02-03T10:33:27.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 5,
      "name": "Interviews"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
