{
  "id": 148,
  "title": "Talk about last minute....",
  "body": "Here's the deal, our SBA loan closes tomorrow and our SFDC loan closes on Monday. Although we've had both of these closings scheduled since lsat Monday, today - roughly 1 hour and 38 minutes ago, to be precise - I received an e-mail from the loan officer responsible for closing our loan. He needs a FEW additional pieces of information before we can close. Mainly:<br/><br/><ol><li>Operating Agreement for Moxie Cinema LLC - we didn't think we would need one of these since we're a married couple operating as an LLC. Luckily my sister has a copy of the form we need to fill out. I have to go pick it up from her in a couple hours.</li><br/><li>Tax ID number for Moxie Cinema LLC - we already have this.</li><br/><li>Lease must have a 7 year option (thru 2012) - our lease is for 5 years and the person responsible for maintaining the lease, and/or attaching an addendum for a 7 year option, is out of town on vacation.</li><br/><li>Real Estate legal description for 408 W. Walnut - I e-mailed Andrew about this... hopefully he can get the legal record we need.</li><br/><li>Contact Information for Nicole's mom (co-signer) - done.</li><br/><li>Contact Information for my mom (co-signer) - done.</li><br/><li>Equipment Listing (include serial numbers on anything worth $500 or more) - this was taken care of in early January.</li><br/><li>Insurance Information (Agent, Company, and phone number) - I sent this along, but we haven't decided on an insurance provider yet. This may end up being the deal-breaker.</li><br/><li>Authority to Conduct Business (licenses, permits and other approvals necessary to lawfully operate the business) - this is a HUGE problem. Explanation forthcoming.</li><br/><li>Evidence that Borrower has received the proceeds of a loan from the City of Springfield in the amount of $25,000.00 - this has been waved since we're not closing with the city until Monday... that's assuming we get the SBA closing out of the way first.</li></ol><br/>Here's the problem with the licenses and permits - they require a bond, and a big one at that. We were planning on using our money from the loan to pay off the bond, but now it doesn't look like that's going to work. It's a catch 22. We need the money from the loan to get our licenses and permits, but we need our licenses and permits before we can get our loan. I'm so stressed right now... I don't even know what.<br/><br/>So, here's what I have to do: drive to the other side of town and pick up the remaining forms for our required licenses and permits. Then I have to turn around and drive to Republic to pick up the Operating Agreement. THIS JUST IN: the loan officer just wrote me and informed me that he needs the Operating Agreement TODAY! Yippee! That means I have to turn back around, drive to his bank, drop off the Operating Agreement, and then speed down the road to the telemarketing place before my shift begins at 4:30. What am I doing writing this post?! I have to go NOW! No meals for me today.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-02-03T23:05:51.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "einahpets",
      "body": "Whew, my heart started racing reading that. Good luck.<br/><br/>Have Nic make you a nice dinner and bring it to work.",
      "created_at": "2005-02-03T23:30:26.000Z"
    },
    {
      "author": "nicole",
      "body": "I'm glad I have the Moxie blog to keep me updated while I'm busy at my new collection agency job...",
      "created_at": "2005-02-04T00:45:11.000Z"
    },
    {
      "author": "Laurie",
      "body": "Shit!! And I thought things were crazy my way.  Calm down and keep your hat on.  It'll work out.  Want me to bring you a slice of cheese up to work?<br/><br/>Nicole..Collection agency? E GADS, you poor thing! I would be in tears if I had to do that. <br/><br/>",
      "created_at": "2005-02-04T01:06:30.000Z"
    },
    {
      "author": "Oz",
      "body": "That sucks.  I guess you just go in there and explain the situation to them.  You need more time, no one told you that you needed all this stuff, etc. etc.  Sometimes people can be reasonable.  Sometimes...",
      "created_at": "2005-02-04T02:10:37.000Z"
    },
    {
      "author": "Beavis",
      "body": "Of course, salami can be a very nutritious dinner.",
      "created_at": "2005-02-04T02:41:48.000Z"
    },
    {
      "author": "J.R.",
      "body": "Good luck and literal Godspeed.",
      "created_at": "2005-02-04T03:45:04.000Z"
    },
    {
      "author": "Dave",
      "body": "jeez. sounds like the ending of 'Goodfellas'. do you have to get home to make the meatballs after all of this?",
      "created_at": "2005-02-04T06:34:11.000Z"
    },
    {
      "author": "Luke",
      "body": "Ok, now I'm tired after just reading that post.  It's late now, and I hope everything went well.",
      "created_at": "2005-02-04T07:16:57.000Z"
    },
    {
      "author": "Chuck",
      "body": "Other times I'm just happy I'm not trying to open a movie theatre.",
      "created_at": "2005-02-04T14:15:25.000Z"
    },
    {
      "author": "Mark",
      "body": ">> positive vibes >><br/><br/>M",
      "created_at": "2005-02-04T16:04:31.000Z"
    },
    {
      "author": "Laurie",
      "body": "Calm down...Deep breath...Now, you and Nicole come to the show tonight, get totally shitfaced and relaxed, ham it up for our camera, hit the mosh pit, and then go to sleepytown. You can hit it fresh Saturday...with the help of water and big-honkin' doses of Advil.<br/><br/>Hang in there! And see you tonight!! <br/><br/>WOO HOO!<br/><br/><br/><br/>",
      "created_at": "2005-02-05T00:33:38.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
