{
  "id": 149,
  "title": "One down, one to go",
  "body": "The SBA closing is done. We still need to get NINE more licenses / permits before the money gets disbursed, but that shouldn't be too tough. The SFDC closing is on Monday. Tonight's my first night on the phones at my telemarketing job. After that, Nicole and I are heading downtown to check out my cousin's band's <a href=\"http://www.playingwithmatchesrock.com\" target=\"_blank\" class=\"broken\">CD release party</a>. I'm looking forward to a relaxing weekend. I have to go put my pants in the dryer to scare the wrinkles out. My shoulder hurts.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-02-05T02:28:23.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "whitty",
      "body": "I hearby resolve never to start my own theater and thereby avoid the risk of my tiny brain exploding. Amen.<br/><br/>Just think, after all this paperchase construction and all the fun that comes with it will be easy-peasy.  And then one day you'll have your very own THEATER!  Won't that be awesome!",
      "created_at": "2005-02-05T02:44:29.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yes, that will be awesome. My head exploded yesterday though, so I don't think I'll be able to appreciate it as much as I would have had my had not exploded.",
      "created_at": "2005-02-05T02:48:16.000Z"
    },
    {
      "author": "Chuck",
      "body": "I'll expect your call during dinner then?",
      "created_at": "2005-02-05T02:55:43.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yep",
      "created_at": "2005-02-05T03:00:34.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "What licenses are they?  What other licenses do you already have?  I'm curious mostly.  A friend of mine who opened a greenhouse had to get all kinds of licenses for selling live plants and seeds and grass and trees and and and.<br/><br/>You've got business, food, liquor, building.  What else?",
      "created_at": "2005-02-05T03:35:01.000Z"
    },
    {
      "author": "nicole",
      "body": "retail",
      "created_at": "2005-02-05T04:04:19.000Z"
    },
    {
      "author": "Nate",
      "body": "Maybe a Kevin Costner license?  <br/><br/>I think so, anyway.",
      "created_at": "2005-02-05T04:20:51.000Z"
    },
    {
      "author": "bjork24",
      "body": "There's literally 839 licenses and permits that we have to file for. I'll make a post about it in the near future.",
      "created_at": "2005-02-05T08:24:22.000Z"
    },
    {
      "author": "Laurie",
      "body": "What did you do to your shoulder Dan'l?  And what the hell? Wrinkles out? I thought wrinkles were in..?<br/><br/> Relaxing weekend my ass.<br/><br/>And don't be calling me selling your shtuff, cause I am willing to bet I owe the company you work for.  SEE? I ain't shy. <br/><br/>Now, on a serious note...<br/><br/>HOLYSHIT!  Thank you Nicole and Dan'l, for coming out.  I'm sorry I didn't hang out longer and party down with you two. I was a TAD overwhelmed and nervous as SHIT!. Uncle Dan, Aunt Sandy, if you are out there in cyberspace, thank you for being there. That meant more to me than anything.<<outside of watching Jake...and Josh..little flirt at merch, shesh>> It was a most excellent night,( WOO HOO Bill & Ted) one I will never forget. <br/><br/>AND....THANK YOU for the lil plug on your blog here!!! Riat and the band will just love it!!!Mind if I \"steal it\" and put it and a link to the Moxie on PWM's website?<br/><br/>PWEASE?????<br/><br/> ",
      "created_at": "2005-02-05T13:26:51.000Z"
    },
    {
      "author": "Oz",
      "body": "So what happened with the SFDC loan.  Talk, man!  Or, er, post!",
      "created_at": "2005-02-08T22:45:55.000Z"
    },
    {
      "author": "nicole",
      "body": "Are you still in bed, Dan?",
      "created_at": "2005-02-08T22:51:09.000Z"
    },
    {
      "author": "bjork24",
      "body": "Sorry... post is on its way.",
      "created_at": "2005-02-08T22:55:23.000Z"
    },
    {
      "author": "nathan springer",
      "body": "so i like the robot much better than the poor man, nice change.",
      "created_at": "2005-02-07T02:25:36.000Z"
    },
    {
      "author": "bjork24",
      "body": "My back is killing me!",
      "created_at": "2005-02-07T10:28:19.000Z"
    },
    {
      "author": "J.R.",
      "body": "My back was killing me, but now, there will be no pain as I am no longer Data Entry Man!  Hope you've been able to accomplish all the head-ache inducing tasks that you had to accomplish by today.",
      "created_at": "2005-02-08T04:35:43.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
