{
  "id": 15,
  "title": "Pre-show advertising",
  "body": "Whether you love 'em or hate 'em, pre-show ads are here to stay. Now, before I begin today's post, I need to clarify myself - whenever I mention \"pre-show ads\", what I'm referring to are the slides that play prior to the projector being turned on, NOT those enjoyable commercials that play before the previews. So as not to confuse terms, I'll refer to the commercials as \"pre-show filth\" or something equally derogatory.\r\n\r\nAs I've said <a href=\"/post/8\">time</a> and <a href=\"/post/9\">time</a> again, theaters cannot rely on box office revenue to pay the bills. Concession sales are the main profit center, which is why you're likely to pay more for a medium popcorn and large pop than you did to buy the tickets for your family of eight. Still, even if your theater has a fairly healthy concession profit, you're still going to need to find additional revenue to cover the gaps caused by seasonal attendance fluctuations, which is why a lot of theaters turn to advertising.\r\n\r\nWhy do multiplexes show so many ads? Two words: operational expenses. Most multiplex theaters incur more operational expenses in a month (payroll, utilities, deceivingly-packaged Twizzlers) than our little theater is likely to make in a year. They have huge budgets that require buckets and buckets full of cash to keep the wheels turning... but does that warrant making an audience sit through 30 minutes of grainy Mountain Dew ads? No.\r\n\r\nNow, let me switch the subject for a quick moment. Art-house theaters are in an industry all their own. They do not show the same mainstream, blockbuster fare that their bigger multiplex cousins do, nor do they enjoy the same amount of proft, but most importantly, people who frequent art-house theaters do not like to buy concessions. Why? Who knows. Maybe a lot of the people who go to art-house theaters have already eaten dinner and don't plan on stuffing themselves with popcorn and moonpies. Maybe they're too involved in the plot of the film to think about anything else. Suffice it to say, it's a mystery... or is it?\r\n\r\nPerhaps Eddie Izzard said it best when he described the difference between British films, which tend to be more intellectual and plot-driven, and American films that tend to be more action-oriented. \"You just can't eat popcorn to [intellectual films].\" Of course, Eddie said a lot more than that, but it's hard to put into words his frantic popcorn-eating-pop-slurping-purse-grabbing mimicry without bursting into laughter right here in my cubicle. If you'd like to see it for yourself, I highly, HIGHLY recommend <a href=\"http://www.netflix.com/MovieDisplay?movieid=60026028&trkid=73\" target=\"_blank\">renting</a> or <a href=\"http://www.amazon.com/exec/obidos/tg/detail/-/B00003CWOU/qid=1086794593/sr=1-1/ref=sr_1_1/102-0131360-1157771?v=glance&s=dvd\" target=\"_blank\">buying</a> Eddie Izzard's \"Dress to Kill\" comedy special. You won't regret it.\r\n\r\nNicole and I are hoping that we can reverse the inexplicable loss of concession appetite at our theater by offering more unique items at our Cinebar, but just in case, we're still planning on having some kind of pre-show advertising. If we can't get by on our concession sales, we'll have to have something to tide us over... enter advertisement revenue and a contradiction of values. You see, to make things even more complex, a lot of art-house theaters refuse to show advertising before, during, or after their films. They're so adamant about distancing themselves as far as possible from the corporate identity of their multiplex brethren that they're willing to sacrifice everything, including their first born child, to achieve this persona.\r\n\r\nI do not believe that advertising, if done correctly, takes anything away from the independent spirit of our theater. As long as we steer clear of national campaigns and cheesy movie trivia, I think we can put a positive spin on our pre-show advertisements. A fellow art-house theater owner up in the Pacific Northwest chose to have his theater's pre-show advertising performed by a troupe of improv actors. Now that's creative, and that's exactly what we're striving for. We have several ideas, but nothing set in stone as of yet.\r\n\r\nFor instance, how funny would it be if I rigged a camera above the screen in each auditorium, and then, in between showing slides for local businesses, I flashed the video from the camera up on the screen. Everyone would be sitting there looking at themselves! Woo hoo, what a hoot that would be! Then, I'd write a program that would randomly zoom in on someone in the audience and superimpose a funny saying like, \"Why did I only get 7 Twizzler swizzles in this bag?\" Well, maybe that's going too far.\r\n\r\nRight now our only plans for pre-show advertisements are non-intrusive slides that play while the audience is coming in and finding their seats. We'd only sell ads to local businesses, especially those with a downtown presence, and try to make our ads a little more appealing than the cheesy ones you see at the multiplexes, which will probably mean that we'll have to retain creative control over the final slide. Nicole suggested that if we ever decide to run commercials before the film (for local businesses only), we could allow a film student from one of the local colleges to storyboard the idea, film it, edit it, and have their work shown at our theater. Again, these \"commercials\" would have to be extremely unique and creative, or else we'd be reverting to pre-show filth, which is something we do NOT want to do.\r\n\r\nI have to stop myself now, or else I'll go on and on about possible ideas. Moderation is key when you're writing a blog that requires new topics on a daily basis... I have to save something for tomorrow.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-06-09T19:47:42.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "The Hey",
      "body": "If you work with a agency like cinema-ads.com or NCN, they are gonna try to put national accounts on your screen, something that you said that you do not want to do.\r\n\r\nI do not know how much work you want to put into your slide program, but I suggest trying to make the slides yourself using digital photography a some photoshopping and sell the advertising yourself to your local downtown businesses. Not only would you not have to deal with an agency (thus cutting out the middleman and being able to lower the ad rates), but it's a good way to start a dialog with your neighbor businesses and show you can help each other to your mutual benefit.",
      "created_at": "2004-06-11T23:41:31.000Z"
    },
    {
      "author": "Marc L.",
      "body": "I've pretty much gotten over the annoyance of ads. They are pretty much everywhere these days but at least the pre-show ads are awesome.",
      "created_at": "2004-06-11T23:41:46.000Z"
    },
    {
      "author": "Sam",
      "body": "Random zooms with subtitles, that kind of sounds like the old SNL.\r\n\r\nI've liked your ideas so far for setting up an art-house theatre, and for what it's worth I'd pay a visit to your venue if I knew where this mystery town was. [All of which have been promised to be disclosed at the proper junction.]",
      "created_at": "2004-06-11T23:42:20.000Z"
    },
    {
      "author": "TSF",
      "body": "G'day\r\n\r\nGood on ya for trying to stay true to your ideals. Well done!!!!!\r\n\r\nBut if you have to sell advertising to stay alive, I wouldn't lose sleep over it. \r\nI'm not much of an Arthouse nor Hollywood movie buff, but what I notice there is alot to do with immage. You seem worried about what your peers and patrons will think of you, thus tarnish your immage.\r\nYou have some great advertising ideas. Stick to original ideas. Art is original thus you can make yourself feel better thats your ADS are ART.\r\nIn the meantime do whatever you can. Artisitic integrity is worthless without art.\r\n\r\nBest of Luck\r\nYour on Fire",
      "created_at": "2004-06-11T23:42:35.000Z"
    },
    {
      "author": "Chuck",
      "body": "I have that on tape. Eddie Izzard is a comedy god.",
      "created_at": "2004-06-11T23:42:50.000Z"
    },
    {
      "author": "Amy",
      "body": "I think that your idea of only advertising local businesses and using local students to make commercials, etc. is a great idea. If you must have advertising to survive, then keep it local and keep the money and creative energy right there in your area. It's only selling out if you are a whore to big corporations or the military industrial complex (isn't it disturbing to see recruitment ads for the Marines before a movie?). \r\n\r\nIn short, whatever energy you put out comes back to you tenfold. This is true of your business as well as the other downtown businesses who will be buying ads at your establishment. It's a win-win situation for you and them and the commerce of Midwestburg. Not to mention your customers who might be trying to decide what restaurant to go to after the movie. If there is an ad that says \"bring in your stub for 10% off dinner\", well then you've saved your customers a few bucks.",
      "created_at": "2004-06-11T23:43:05.000Z"
    },
    {
      "author": "Sarah",
      "body": "Aloha,\r\nFirst off, I'd like to say that I greatly enjoy your blog.\r\nSecond off, I think that tasteful ads for local stores would be a good idea both for your theater and for the local businesses. I remember the days of my youth when the local multiplex never showed commercials or national ads, only ads for local restaurants, clinics, flower shops, etc. They weren't intrusive, and I doubt they would destroy any sort of indie-cred that owning an independent theater brings.",
      "created_at": "2004-06-11T23:43:19.000Z"
    },
    {
      "author": "Jessi and Tom",
      "body": "Yeah, I've grown tired of movie ads myself, but ads are everywhere now, and money is money. I do my best to just ignore them. I porefer to talk loudly to random people in the theater during the ads, or perhaps just play games on my cell phone. Joking. I went to a mix of the artsy and regular type theater, in that it was old-school-style-one-big-screen-not-fifty-tiny-screens-but-it-still-runs-mainstream-movies theater. I think it is my favortie theater of all time. (Cinerama in Seattle) But damn it if i didn't get there early to get a good seat, only to have some kid come sit right in front of me just as the movie started (no ads by the way). I think, if you can't get there in time you have no business getting a good seat, especially directly in from of someone else. The ten minutes of \"excuse me, pardon me, sorry, I was in line getting expensive snacks\" sucks, and then they plop down in front of you... rrr. Just sit on the end and come early next time.\r\n\r\nWow, I feel like a grumpy old man. Back in my day...",
      "created_at": "2004-06-11T23:43:41.000Z"
    },
    {
      "author": "Kevin",
      "body": "Hi Dan and Nicole, I just read your entire blog all the way through for the first time. I don't know if you realize how great some of your ideas are. It actually got me excited about the project, and I have nothing to do with it. I just can't see how it could fail. Some of the stuff you come up with has so much imagination and creativity. \r\n\r\nGood luck. I'm probably close to Midwestburg, so I can't wait to visit your place when this all comes out. Thanks again for the great behind-the-scenes look. I'm excited for you.",
      "created_at": "2004-06-11T23:44:11.000Z"
    },
    {
      "author": "Ozzilyn Bean",
      "body": "Here in Philadelphia, there is a little chain of art house movie theaters (Ritz). They show ads for local stuff on revolving slides. As long as it's silent, it doesn't bother me at all. You might want to consider putting some trivia slides in there. One of the big mega-theater chains does that, and I kind of like it. Again, silence is key, so that if you want to talk to whomever you're at the movie with (before the show) you can do so easily. And having film students make ads for local shops is a stroke of genius--have competitions, get the kids involved and devoted to your theater, get the local shops something for free (the production of the ad) thereby making them love you, it's all good man.",
      "created_at": "2004-06-11T23:44:31.000Z"
    },
    {
      "author": "Sunset SMiles",
      "body": "how do i get favorites, and links on my blong site?",
      "created_at": "2004-06-11T23:44:56.000Z"
    },
    {
      "author": "TTG",
      "body": "Hey, I've also gotten quite excited about your little project, and I'm halfway across the world! Anyway, just wanted to give a possible reason for lack of concession sales..well I haven't seen it mentioned so far, but like you yourself state - you try to distance yourself from corporate identity of your multiplex brethren - wouldn't selling over-priced(my assumption) popcorn et al reassociate you with that corporate identity? Maybe you could try something like <A href=\"http://www.pvrcinemas.com/about_pvr/cinema_europa.asp\">This</a> but on a smaller, less corporate scale...\r\nJust a suggestion from halfway across the world...",
      "created_at": "2004-06-11T23:46:00.000Z"
    },
    {
      "author": "Queen Hobbity",
      "body": "I'm all for advertising - I always show up early to movies to get good seats and chat with my friends before it starts, and the ads are something to look at/talk about. Of course, we're usually mocking them (especially when the question/answer things are played in reverse order!) but if you had some sort of basic design scheme (I'm thinking a set of colors and fonts to choose from), and just let local businesses buy ads, it would be fine. Slides don't really take away anything.\r\n\"Pre-show filth,\" however, does. THANK YOU for NOT showing those awful things - I am so sick of being forced to watch the same awful commercials every time - \"I want your bod\" and \"Wanta fanta?\" I put up with them though, because the other theatre I go to (in a far smaller town) doesn't have them, and it's an awful atmoshpere; the whole thing's tiny and old. I'm willing to put up with a little filth in order to be able to enjoy a spacious, clean theatre.\r\nIf you could convince some businesses to make very artistic posters (jewelry stores or art stores would be good possibilities), you could put poster ads around without detracting from the classy look which I laud you for going for. Perhaps not with the actual art - in the bathrooms, or behind the concession stands, maybe?\r\nJust an idea...\r\nKeep up the good work with your theatre! I envy you :) I think it would be so much fun to run a business! Although I've always wanted to run a coffeeshop/bakery...",
      "created_at": "2004-06-11T23:46:21.000Z"
    },
    {
      "author": "Stefan",
      "body": "\"Pre-show ads\" -- fine. Local chain shows them (in both their arthouse and non-arthouse theatres) with classical music playing. Mix of local and national ads. I have no problem with these. Your ideas for local ads are cool, but I don't have virulent reactions against \"Sierra Mist,\" either.\r\n\r\n\"Pre-show filth\" -- now, those 30-second \"Sierra Mist\" ads when the lights dim just suck. If you can survive without the filth, please do -- those generally, though not always, take away from the moviegoing experience.",
      "created_at": "2004-06-11T23:46:37.000Z"
    },
    {
      "author": "Redtz",
      "body": "I live in a community that recently saw the refurbishing of an old landmark theatre and it's seeing a somewhat successful influx of business. They are actually running current films when they can. But the nice thing is they are partnering with local up-and-coming musicians. They play their music during the \"pre-show\" ads, including an ad that says\" You're listening to local musicians (insert name here). buy their CD in our concession stand.\" and you get a cut of the CD sales, and keep a sort of beatnik community feeling to what you're trying to do. Key is to make sure the music is somewhat mainstream, minus cursing of course, and derragatory content.\r\n\r\nYour energy, passion and dedication is awesome! Best of luck...and Bloomington Illinois isn't too far away to come check out our Castle Theater.",
      "created_at": "2004-06-11T23:48:10.000Z"
    },
    {
      "author": "The Hey",
      "body": "http://www.latimes.com/business/printedition/la-fi-movies14jun14,1,1184638.story?coll=la-headlines-pe-business",
      "created_at": "2004-06-15T18:14:12.000Z"
    },
    {
      "author": "Ben",
      "body": "FWIW,\r\n\r\nI recall moviegoing in SoCal many years agone; at a chain exhibitor that had staff go into the theaters in the 15 minutes before showtime to hand-sell concessions to patrons. They carried tray (a la cigarette girls of the 30s/40s) replete with all concession offerings and they'd hawk the good like vendors at a ball game. Of course, you don't want to send your pimply-faced, low-self-esteem Goth drudges in for such work-- but at a guess I'd say your establishment won't want for high-quality employees who would be capable of a better pitch style. My memories might be a bit colored with age as some of the kids doing the sales were friends of mine and they were funny (to me) and not obnoxious. Again, it's all in the employees' attitude and demeanor.",
      "created_at": "2004-06-18T03:48:11.000Z"
    },
    {
      "author": "Abbi",
      "body": "The arthouse theater in my downtown sells beer, and there are tons of people in line for concessions... just a thought. Also, as something to bring people in, have you thought about showing classic movies one night a week during the summer or every once in a while? Talk about ticket sales... esp w/ Grease, Casablanca....",
      "created_at": "2004-06-18T23:55:02.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
