{
  "id": 150,
  "title": "Pain in my UPPER ass",
  "body": "Long story short: We didn't close on the SFDC loan yeserday because 1) I pinched a nerve in my lower back after being tackled at a Super Bowl party, and 2) one of our co-signers was called out of town on business.\r\n\r\nShort story long: I went to a Super Bowl party on Sunday night (duh!). The Eagles lost, as you already know, and everyone at the party was upset. I'm not a big football fan myself - the Super Bowl is typically the only football game I watch all season - but I was still rooting for the Eagles to win, mainly because I made a solemn oath back in October never to root for another Boston team for as long as I live. Damn you Johnny Damon! Damn you to HELL!\r\n\r\nSo the game ended, the Patriots won, and everyone was bursting with pent up rage. In a playful move, one of my good friends Carl - who happens to outweigh me by roughly 100 pounds - straight-armed me into the sofa. It was nothing visicous or unexpected... more like a slow push into the soft part of the couch. Of course, me being the young virile stud that I am, I squirmed around like a fish out of water and tried to lift Carl off the ground. Bad idea. As I pushed him away, I heard a deep clicking noise and felt my back go limp like a string of Colby Jack cheese. Mmmmm, Colby Jack cheese. I'll be right back.\r\n\r\nSo needless to say, from that point on I was in a lot of pain. I tried to walk it off, but everything below my belt was all hot and tingly (insert penis joke here). Carl felt really bad, but it wasn't his fault. I was the one who tried to show off by lifting him into the air, irregardless of the fact that I've inflicted 10 years worth of damage on my back over the last month from packing, moving, unpacking, working on the house and the theater, etc.. It was just a matter of time before something gave way.\r\n\r\nAfter the party, I came straight home to a hot bath and a double dose of Bayer back and body pills (thanks Nicole). Afterwards, I dragged myself into bed and fell into a mildly intoxicated / overly medicated slumber.\r\n\r\n<b>4:00 AM</b>\r\n\r\nBAM! I woke up to the pleasing sensation of a sword being shoved through my back and plunged in and out like a cello bow. I tried to walk to the bathroom, but I couldn't move my legs. \"Great,\" I thought. \"I'm paralyzed.\" I kept throwing my weight into my feet until they finally tounched the ground. Then, step by agonizing step, I made my way into the bathroom and combed my hair. Why? I don't know. I was delirious! Nicole and I discussed what we should do and lamented on the fact that Springfield doesn't have any 24 hour urgent care centers. If we wanted to see a doctor, we'd have to go to the emergency room. Uh oh.\r\n\r\nThat's brings us to our insurance. We signed up for it about 3 weeks ago, but we still haven't received our policy cards. What if we weren't covered yet? Nicole looked up the website for our provider and found a number for customer service. Unfortunately they wouldn't be open for another three and a half hours. We again considered the emergency room, but came to the same conclusion. Insurance or no, there's no way we could afford a trip to the ER... unless, of course, Maura Tierney would be the one taking care of me. Mmmm, Maura Tierney.\r\n\r\nI'm sure you're all pretty bored by this point, so I'll wrap it up.\r\n\r\nI stayed awake until 7:30 and called our provider. They had no way to tell if we were covered, so they recommended we call our underwriter. Of course, our underwriter's office hours wouldn't begin for another hour, so I sat in pain and watched Katie Couric make cute faces at the camera. Mmmm, Al Roker. When 8:30 rolled around, my underwriter wasn't in his office, so I waited till 9:00... still wasn't there... nor was he at 9:30. I finally broke down and called our provider back. This time I spoke with a kind receptionist who put me in touch with the right people. They gave me my policy number and away we went to the St. John's urgent care center (hours of operat\r\nion, 9:00 AM to 11:00 PM).\r\n\r\nWe sat down in the lobby at 10:00 AM and patiently waited our turn to see the doctor. At 1:00 PM, after 3 excrutiating hours of sitting in an uncomfortable chair next to people hocking their lungs out on my shirt, I walked up to the receptionist and kindly asked for my copay back. Even more infuriating was the fact that we were next on the list to be called when all the nurses and doctors decided it was time to take a LUNCH BREAK IN PLAIN VIEW OF EVERYONE IN THE WAITING ROOM. They didn't call ANYONE for over an hour! Nicole and I were livid, she more so than me. Nicole had taken an entire day off from work (unpaid) to drive me around. The money she would've made that day could've helped pay our bills or buy us some gas or food, or, in the best case scenario, food that gives us gas. So, because of their blantant disregard for the word URGENT, St. John's Urgent Care Center has become the first Springfield-owned company to secure a spot on the Moxie black list. Bastards.\r\n\r\n*EDIT: When I say the St. John's Urgent Care Center is blacklisted, I don't mean employees aren't allowed to come. What I mean is this: don't expect to see us advertising their services. If I don't personally have trust in a certain business or service provider, I'm not going to advertise them at our theater. All St. John's employees are welcome.\r\n\r\nLuckily my mom was able to talk her chiropractor into seeing me on short notice, so off we went. The chiropractor was very nice and SUPER excited about the theater. She was also pleased to tell me that I had dislocated 2 of the vertebrae in my lower back (L4 and L5), and that in so doing, had pinched my sciatic nerve. SWEET! After 45 minutes of bone relocation, ultra sound therapy, and having a belt sander run up and down my spine, I felt 70% better. I'm scheduled to go back tomorrow for some final alignments. I was even able to go straight to work afterwards and make my first telemarketing sale. Not too shabby, eh.\r\n\r\nI'm still in a little bit of pain today, but not nearly as much as I was yesterday. I was actually able to put on my own shoes and socks today! I had to wear Nicole's yesterday. Now I'm going to go reheat some pizza and call some people about theater-related stuff.\r\n\r\nOh yeah, about the SFDC closing... it was rescheduled for this Thursday.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-02-08T12:21:33.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "whitty",
      "body": "I hear the cow yoga position helps sciatic pain.  However, please consult your chiropractor before doing anything involving a cow.",
      "created_at": "2005-02-09T01:22:26.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yeah, the chiropractor gave me a move to help realign my pelvis. It's pretty nice.",
      "created_at": "2005-02-09T01:23:53.000Z"
    },
    {
      "author": "whitty",
      "body": "eek, I posted twice.  And now three times.  How embarrassing.",
      "created_at": "2005-02-09T01:23:57.000Z"
    },
    {
      "author": "bjork24",
      "body": "So you thought!",
      "created_at": "2005-02-09T01:24:23.000Z"
    },
    {
      "author": "whitty",
      "body": "What the....? Tricky.",
      "created_at": "2005-02-09T01:25:36.000Z"
    },
    {
      "author": "J.R.",
      "body": "Mmm... Sciatic nerves are deliciously painful.",
      "created_at": "2005-02-09T02:12:42.000Z"
    },
    {
      "author": "bjork24",
      "body": "Aren't they though?",
      "created_at": "2005-02-09T02:14:29.000Z"
    },
    {
      "author": "Aaron",
      "body": "Dan, I'm sorry to say this, but you can't damn Johnny Damon to Hell, because Johnny Damon is the alter-ego of Jesus (according to my friend Philip's Halloween costume).",
      "created_at": "2005-02-09T03:24:07.000Z"
    },
    {
      "author": "einahpets",
      "body": "Hi Dan.",
      "created_at": "2005-02-09T00:45:24.000Z"
    },
    {
      "author": "Beavis",
      "body": "FART!",
      "created_at": "2005-02-09T00:55:13.000Z"
    },
    {
      "author": "bjork24",
      "body": "No, I didn't mean ALL St. John's employees are blacklisted... just the Urgent Care Center. We won't do any advertising for them.",
      "created_at": "2005-02-09T01:04:06.000Z"
    },
    {
      "author": "Oz",
      "body": "Glad you went to a chiropractor.  I got the same injury in my back about 10 years ago, but I ended up going to my GP, and she was worthless.  She just said, \"Take some Aleve.\"  Thanks.  Now I have permanent back damage.  If I'd gone to a chiropractor (which never occured to me--at the time I didn't know anyone who had ever gone to one), s/he probably could have straightened me out.  Well, my back at least.",
      "created_at": "2005-02-09T01:04:41.000Z"
    },
    {
      "author": "bjork24",
      "body": "\"straighten me out\" - ha ha! That's great!",
      "created_at": "2005-02-09T01:12:45.000Z"
    },
    {
      "author": "Dave",
      "body": "happened to me last winter. most miserable 2 months of my life. next time you want to lift someone bigger than you, think twice, and go for the groin.",
      "created_at": "2005-02-09T00:28:46.000Z"
    },
    {
      "author": "nicole",
      "body": "You know, I'm currently employed by St. John's...right now I'm sending out collection notices...",
      "created_at": "2005-02-09T00:41:12.000Z"
    },
    {
      "author": "nicole",
      "body": "Oh yeah..St. John's employees aren't blacklisted from the Moxie, because some people here are really excited about it.",
      "created_at": "2005-02-09T00:42:26.000Z"
    },
    {
      "author": "whittler",
      "body": "I hate doctors. I never address them as \"Dr.\" It's always a first name basis with me. Back in the day when they were the village doctor, knew their patients intimately (not too intimate) and were available at all hours, they deserved the title. Since becoming businesses like the rest of us, they're right back to Mr/Mrs/Ms/Miss in my books.",
      "created_at": "2005-02-09T07:26:48.000Z"
    },
    {
      "author": "shhhhh",
      "body": "Back-troubles will be detrimental to your doubling as theatre bouncer. How will the Moxie cope with over zealous movie goers demanding a re-run of Glitter? Sounds to me like the cow is the only shot at salvation.\r\n  [hope you're feeling on the up&up]",
      "created_at": "2005-02-09T07:34:49.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks for the well-wishes.",
      "created_at": "2005-02-09T09:04:24.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "I had sciatic pain last year, and it was the worst pain I've ever experienced. I'm talking worse than birthing twins and worse than donating a kidney.",
      "created_at": "2005-02-09T09:48:13.000Z"
    },
    {
      "author": "Fyse",
      "body": "I wrote a whole post about this a while back, but I fractured my spine about 4 years ago. My T6 vertebra is now a wedge shape, and the effect was cheerfully described to me as 'like stamping on a Crunchie bar'. (D'you have them in the States? Honeycomb things.) I didn't go to the hospital till the next day, and wasn't X-rayed until I went back again a month later. Not at all good...",
      "created_at": "2005-02-09T13:05:45.000Z"
    },
    {
      "author": "Fyse",
      "body": "PS Hope your back gets better soon!",
      "created_at": "2005-02-09T13:06:39.000Z"
    },
    {
      "author": "whitty",
      "body": "I was hoping to get an update on your ass today, but I would settle for theater news too. \r\n\r\nSlow day at work.",
      "created_at": "2005-02-10T02:49:36.000Z"
    },
    {
      "author": "bjork24",
      "body": "It's coming... patience!",
      "created_at": "2005-02-10T02:56:12.000Z"
    },
    {
      "author": "Laurie",
      "body": "Ouch.  This would be why I have my PPO through Cox.\r\n\r\nSt. Johns SUCKETH!  Katie Couric? Try M.A.S.H. at 4 in the morning, and they are all just chattering away on \"break\", with peeps dying of pain in the ER.\r\n\r\nLONG LIVE THE BLACK LIST!!! \r\n\r\n \r\n\r\n",
      "created_at": "2005-02-11T06:19:59.000Z"
    },
    {
      "author": "Nicholas",
      "body": "Dan, my girlfriend is a pilates instrutor and she is very concerned about your back. she says you need to build the muscle in that area if you want to avoid future injury (she's working on an exercise regiment for you). thanks for the plugs recently, i've been without internet access for days and days. i'm now connected at a whopping 33kbps and still checking the Moxie...that's how much i love it.",
      "created_at": "2005-02-12T01:41:29.000Z"
    },
    {
      "author": "UCDoc",
      "body": "Any time you receive services that are less than excellent, I encourage you to report this to the administration of the urgent care center.  The only way these issues can be fixed is if the administration is made aware of the problem.  Also, you can share your experiences with urgent care centers on the Urgent Care Association of America Forum at: http://www.ucaoa.org/forum/viewforum.php?f=5\r\n\r\nThis will allow urgent care professionals to get feedback on what the public like and what they don't like about service in urgent care centers.  \r\n\r\nGood luck with the back.",
      "created_at": "2006-01-23T04:13:01.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    }
  ]
}
