{
  "id": 151,
  "title": "Holy crap",
  "body": "I better make this quick. I have to leave for my soul-sucking, stress-inducing, chapped-lip-causing job in a few minutes. Here's a list of the licenses and permits we have to get before we can open the theater:<br/><br/>1. Retail sales tax permit<br/>2. Building permit<br/>3. City liquor license<br/>4. State liquor license<br/>5. Retail 5% Beer license<br/>6. Merchants - Retail license<br/>7. Restaurant license<br/>8. Theatre (!) license<br/>9. Zoning and Development permit<br/><br/>Wow! That's a lot, huh? Yeah, it is. It really is.<br/><br/>My back is feeling better today, but I'm not sure how long it will take before I'm completely back to 100%. I've offered to help scrape carpet glue off the floor of the theater sometime next week, which means I'm either going to have to get liquored up or take an overdose of Aleve. Tough call.<br/><br/>In a desperate bid to earn more money and make my life all the more stressful, I initiated two self-employment programs today.<br/><br/>1. I contacted Ken, the retired seating god, and asked him if he would let me sell his vintage theater seats online. He sounded very interested, so we made plans to contact each other later in the week and go over the rules. Basically, what I'm thinking is that Ken will give me a base price that he would like for each chair. Then I'll try my hardest to sell as many of those chairs at as high a price as the market will allow. If he wants to sell a certain chair for $25.00 a pop, and I find someone who's willing to buy them for $32.00 a chair - and let's say that person wants 500 of those chairs - that's $12,500 for Ken and $3,500 for me. It's a win-win situation. Ken gets rid of the chairs in his warehouse and I get reimbursed for selling them. I'll keep everyone posted as this subplot unfolds.<br/><br/>2. I started called FSBO's (For Sale By Owners) in and around the Springfield area to offer my services. And what might those be, you ask? Well, considering that I was a licensed Missouri Realtor for about a year and a half (back when I was 18), that I worked in advertising for 5 years, and that I was the design lead at a firm that specialized in building websites for Realtors... I'd say I don't have much to offer at all. I mean, that's what the responses led me to believe. I can take pictures of the house, create custom brochures, build a promotional website, procure the correct Missouri real estate paperwork for the eventual closing, etc., etc., etc.. One guy sounded somewhat enthused, but he pulled the old, \"Well, I'll have to talk to my wife about it.\" So I pulled the old, \"Wha-piccchhhh (whip noise)! I guess we know who wears the pants around your house, don't we. When will the head of the household be home?\" I'm awesome.<br/><br/>Well, I've successfully whittled away the last of my free minutes before I'm forced to drive off into telemarketing hell. I swear, all I think about while I'm on the phone is: \"Moxie. Moxie. Moxie. Moxie. Moxie. Moxie. This job is only temporary. Moxie. Moxie. Moxie. Moxie. Moxie. Moxie.\" Here's a nice conversation I had with a coworker last night.<br/><br/><b>Him</b> - \"Yo Dan, what's playing at your theater this Sunday night?\"<br/><b>Me</b> - \"Uh, we're not open yet.\"<br/><b>Him</b> - \"You're not?\"<br/><b>Me</b> - \"Why would I be working here if the theater was open?\"<br/><b>Him</b> - \"Uh, I don't know. Cause you like it?\"<br/><b>Me</b> - (POP - Dan's head explodes. A faint wisp of smoke escapes from his throat hole as a whisper flies fleetingly into the air) \"What the fuck ever!\"",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-02-10T02:58:34.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nicole",
      "body": "Don't forget we need to get insurance finazlied so we can finish our distribution applications! That's a top priority if we plan on being open in March.",
      "created_at": "2005-02-10T03:03:26.000Z"
    },
    {
      "author": "nicole",
      "body": "finalized..not finazlied...although I like the sound of that...",
      "created_at": "2005-02-10T03:03:50.000Z"
    },
    {
      "author": "Stephanie",
      "body": "I suppose that co-worker's a lifer?  ",
      "created_at": "2005-02-10T04:41:11.000Z"
    },
    {
      "author": "Oz",
      "body": "\"What the fuck ever\"?  Did you make your thumbs and index fingers into V's, then touch the thumbs to make the W sign when you said that?  Did you flip your hair back?",
      "created_at": "2005-02-10T07:14:09.000Z"
    },
    {
      "author": "Chuck",
      "body": "Perfect use of that particular swear word.",
      "created_at": "2005-02-10T08:51:16.000Z"
    },
    {
      "author": "bjork24",
      "body": "Nicole: Yes. That's true.<br/><br/>Stephanie: That would be an affirmative.<br/><br/>Oz: Yes. Yes. And Yes.<br/><br/>Chuck: Fuckin' A, dude!",
      "created_at": "2005-02-10T08:53:22.000Z"
    },
    {
      "author": "justin",
      "body": "Everything Dan knows he learned from me.  EVERYTHING. ",
      "created_at": "2005-02-10T09:07:13.000Z"
    },
    {
      "author": "bjork24",
      "body": "Including my CAPITALIZATION fixATION.",
      "created_at": "2005-02-10T09:08:10.000Z"
    },
    {
      "author": "einahpets",
      "body": "Hi Dan.",
      "created_at": "2005-02-10T18:32:01.000Z"
    },
    {
      "author": "Beavis",
      "body": "Hi Nicole.",
      "created_at": "2005-02-10T18:49:09.000Z"
    },
    {
      "author": "bjork24",
      "body": "Hi Stephy.<br/><br/>Beavis, who are you?",
      "created_at": "2005-02-10T19:47:42.000Z"
    },
    {
      "author": "justin",
      "body": "I don't know who Beavis is, but he's got a great website! Very popular!",
      "created_at": "2005-02-11T06:17:17.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
