{
  "id": 152,
  "title": "Make the pain go away",
  "body": "We successfully closed our second loan today, which means the wheels are sufficiently greased and ready to roll. I wanted to take care of our Missouri Retail Tax number tomorrow, but the Department of Revenue is closed for Lincoln's birthday... and my throat hurts.\r\n\r\nThe only nice thing about pinching a nerve in your back is that the pain is so severe and all-encompassing that I haven't noticed any other aches or pains elsewhere in my body. And...\r\n\r\nNot much else to say.\r\n\r\nI met with another insurance agent today. As it turns out, it's very difficult to procure affordable insurance when your retrofitting an old building into a theater and you plan on selling beer and wine. Also, the fact that Nicole and I have no previous business experience doesn't help our cause as much as I had hoped.\r\n\r\nWhen all of this ballyhoo is said and done - the theater opens, we're a huge success, and our lives fall into some sort of semblance of normality - I'm going to sit down and write a book about the entire experience. It shall be called, <b>THE MOXIE, Or How a Young Married Couple Opened An Awesome Independent Movie Theater Without Prior Business Experience and Only $0.38 To Their Names and Became the World's Most Successful Entreprenuers</b>. I even have the opening sentence committed to memory, which is where it will stay until I find the time to meet pen to paper.\r\n\r\nThat's my goal for 2006.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-02-11T02:16:34.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "J.R.",
      "body": "Glad to hear that it's coming together, kind of...",
      "created_at": "2005-02-11T02:46:58.000Z"
    },
    {
      "author": "Chuck",
      "body": "My goal for 2006 is having a job that pays more than $8 an hour. \r\n\r\nThink you'll be hiring?",
      "created_at": "2005-02-11T08:09:41.000Z"
    },
    {
      "author": "Oz",
      "body": "You guys had more than $0.38.  Didn't you come up with 10 thou somewhere along the way?  Or are you just trying to sensationalize this experience in order to propel you to the top of the bestsellers list?",
      "created_at": "2005-02-11T08:24:57.000Z"
    },
    {
      "author": "bjork24",
      "body": "J.R.: Thanks.\r\n\r\nChuck: We'll be hiring, but not for that much!\r\n\r\nOz: We only had $5,000 saved up. We borrowed the rest came from family. Still, $0.38 sounds better than $5,000, doesn't it?",
      "created_at": "2005-02-11T08:28:42.000Z"
    },
    {
      "author": "einahpets",
      "body": "And then you can start one up where I live.\r\n\r\nCheck out the theater photos on my site today. I took them just for you guys.",
      "created_at": "2005-02-11T18:55:45.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Dan, you nutty pimp. I can't wait to read your book! \r\n\r\nGet to writin! *whipcrack*\r\n\r\nOh, and I like the guy pulling out his pockets better than the robot, but that's just because I'm secretly a commie (shh, that's just between us).",
      "created_at": "2005-02-11T20:04:00.000Z"
    },
    {
      "author": "Oz",
      "body": "I agree with Evan.  I'm not nearly as excited about the robot as everyone else seems to be.  If you don't want to use penniless man, spice it up with something new.  Come on, make yourself useful!",
      "created_at": "2005-02-11T21:19:18.000Z"
    },
    {
      "author": "Nicholas",
      "body": "If you really do want to write that book, I happen to know some editors at a very very large publishing company--and they do books like that. Once the theatre is open and working, they would probably be interested in talking to you.",
      "created_at": "2005-02-12T01:47:50.000Z"
    },
    {
      "author": "bjork24",
      "body": "Steph: I checked out the pix. Very nice.\r\n\r\nEvan: You better buy my book, you filthy commie!\r\n\r\nOz: Maybe I will!\r\n\r\nNic: Don't be surprised if I take you up on that! Because I will... I'm just that needy.",
      "created_at": "2005-02-12T10:50:56.000Z"
    },
    {
      "author": "whitty",
      "body": "I don't want to sound too obsessive here, but you post so regularly and you haven't in a while... is everything okay?\r\n\r\nErgh, I am worrier, I am sure everything is well and I hope we get to hear from you soon.",
      "created_at": "2005-02-16T00:03:39.000Z"
    },
    {
      "author": "nicole",
      "body": "In case Dan doesn't reply today, please don't worry...he's been super busy these past couple days AND battling the flu. \r\n\r\nThree cheers for Dan!",
      "created_at": "2005-02-16T00:24:20.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
