{
  "id": 153,
  "title": "The rumors of my death...",
  "body": "... have been greatly exaggerated.<br/><br/>Sorry I haven't posted in a while. Since my last post, I've had my spine and pelvis realigned twice, I successfully filed and received our retail and withholding tax licenses, filed our theatre, restaurant, 5% beer, and retail permits, and registered our business with the the city planning and zone department. On top of that, I've also given interviews for HTV, the Drury Mirror, and now KY3 is knocking at our door. And last but not least, I fell victim to the virulent strain of flu that's been sweeping the nation for the last few weeks. It sucked BIG TIME! I was only out of bed for maybe 2 hours MAX on Sunday. Big thanks to Nicole for looking after me and making me feel better.<br/><br/>As for other news, it's going to cost an additional $15,000 to bring the building up to code! Woo hoo! Isn't that great?! Not only do we have to upgrade the electrical ($5,000), but we also have to upgrade the HVAC ($10,000), which means we're going to have to trim a lot of fat from our already skeletal budget. I've got a new Phlog waiting in the wings, but I've been so busy I haven't had time to post it. When I get home from telemarketing hell tonight (around 11:30), I'll put it up... I promise!<br/><br/>I also have yet another new facet to add to the blog that will allow you, my dear loyal readers, an even deeper look into the crazy process of starting your own theater... or any business, for that matter. What will it be, you ask? Ha ha, wouldn't you like to know!<br/><br/>You don't care, do you?<br/><br/>Damn you.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-02-16T01:21:56.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "whitty",
      "body": "phew.",
      "created_at": "2005-02-16T01:25:41.000Z"
    },
    {
      "author": "J.R.",
      "body": "Heave ho!",
      "created_at": "2005-02-16T01:32:36.000Z"
    },
    {
      "author": "bjork24",
      "body": "small comments!",
      "created_at": "2005-02-16T01:36:55.000Z"
    },
    {
      "author": "Oz",
      "body": "I care!",
      "created_at": "2005-02-16T02:36:19.000Z"
    },
    {
      "author": "Justin",
      "body": "OK",
      "created_at": "2005-02-16T03:21:28.000Z"
    },
    {
      "author": "Justin",
      "body": "I'd like to donate my guest bedroom for the weekend of February 25-27 to the Moxie.  Use it however you like.",
      "created_at": "2005-02-16T03:22:16.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Hmm, I care.<br/><br/>I bet its a webcam ;)",
      "created_at": "2005-02-16T03:25:22.000Z"
    },
    {
      "author": "justin",
      "body": "But I bet there isn't internet access at the Moxie yet... so how could it be a webcam?  Unless it's in Dan's bedroom, of course.  But who'd want to see that?",
      "created_at": "2005-02-16T06:47:08.000Z"
    },
    {
      "author": "bjork24",
      "body": "You guys are WAY off, but a webcam in my bedroom isn't a bad idea....",
      "created_at": "2005-02-16T10:46:44.000Z"
    },
    {
      "author": "John",
      "body": "For a moment there, I thought you said you said you had your spine and pelvis REMOVED twice.<br/><br/>That would have been awesome.",
      "created_at": "2005-02-16T13:07:33.000Z"
    },
    {
      "author": "Chuck",
      "body": "Tease.",
      "created_at": "2005-02-16T18:55:02.000Z"
    },
    {
      "author": "einahpets",
      "body": "Hi Dan. I'll send all my wedding money to you in April. But shhh. Don't tell Joel. We'll just tell him we didn't get any.",
      "created_at": "2005-02-16T21:19:31.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
