{
  "id": 154,
  "title": "A quick list of updates",
  "body": "1. I quit my telemarketing job last night. I guess I don't have the same tolerance for telemarketing as I did when I was a senior in high school. Imagine that.<br/><br/>2. There's a new phlog.<br/><br/>3. See that cheesy looking graphic over in the sidebar? That's your portal to the twisty turvy world of the Moxie budget. Marvel at how quickly $65,000 can vanish into thin air! Will we have enough to pull through? Stay tuned to find out!<br/><br/>4. I'm in the very, very, very early stages of negotiating our first vendor-sponsored advertising trade-off. If it works out, it could end up saving us a couple grand. That's all I can say right now, lest I put my foot in my mouth and ruin everything.<br/><br/>5. My back's feeling better, and snot is issuing forth from my head like nobody's business.<br/><br/>6. Enjoy!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-02-17T07:37:56.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Oz",
      "body": "I'm first!  Not surprised you couldn't stand the telemarketing thing.  We're willing to deal with a lot more when we're in high school than as adults.  Ah, I remember the good ole days of working the drive-thru at McDonald's....",
      "created_at": "2005-02-17T08:03:32.000Z"
    },
    {
      "author": "bjork24",
      "body": "Damn telemarketing and McDonald's... damn them to hell!",
      "created_at": "2005-02-17T09:28:50.000Z"
    },
    {
      "author": "James",
      "body": "So, you're getting a Simplex, eh?  Never worked with one myself, but I've heard good things about it.",
      "created_at": "2005-02-17T15:21:44.000Z"
    },
    {
      "author": "einahpets",
      "body": "Hi Dan.<br/><br/>Darn it. No more waiting by the phone to hear your voice trying to sell me a vacation.",
      "created_at": "2005-02-17T18:38:35.000Z"
    },
    {
      "author": "Beavis",
      "body": "That's good, sit home in the recliner eating salami all day.  Not a bad way to live.",
      "created_at": "2005-02-17T19:06:16.000Z"
    },
    {
      "author": "whitty",
      "body": "I cut through the Moxie parking lot on the way to the bank, I hope that is okay.  <br/><br/>Dang, one-way Campbell St.",
      "created_at": "2005-02-17T19:53:51.000Z"
    },
    {
      "author": "matt",
      "body": "hey dan, have you thought about taking a page out of the non-profit world's book and offering sponsorships of some of those items on your 'equipment we cannot do without' list?  it's a silly concept in general, but for smaller stuff, hell, i'd pay $180 just for the humor value of a little brass plate commemorating the \"Zeroplate Hand Sink\".  just a thought.",
      "created_at": "2005-02-17T20:16:04.000Z"
    },
    {
      "author": "Aaron",
      "body": "Can't Matthew Lesko get you guys a bunch of cash from the guvment or something?<br/><br/>I'd be willing to donate some cash for a case or two of Fitz's, so long as you let me drink about half of it. Deal?",
      "created_at": "2005-02-17T21:13:10.000Z"
    },
    {
      "author": "bjork24",
      "body": "James: Indeed, Simplexes are built like tanks... with 50mm guns and everything.<br/><br/>Eina: Hi Stephy. Sorry I can't sell you a vacation.<br/><br/>Beavis: Dude, pick a new meat... salami's SO nineties!<br/><br/>Whitty: That's not okay. If you do it again, I'll chase you away with a broom!<br/><br/>Matt: That's an idea. Are you saying you want to donate the money for a hand sink?<br/><br/>Aaron: Deal.",
      "created_at": "2005-02-18T04:41:56.000Z"
    },
    {
      "author": "Chuck",
      "body": "Don't feel bad, Dan. I quit working at Disneyland before I even got into the park - and that's the happiest place on Earth.",
      "created_at": "2005-02-18T07:45:58.000Z"
    },
    {
      "author": "Beavis",
      "body": "Bologna is nice too.",
      "created_at": "2005-02-18T09:38:25.000Z"
    },
    {
      "author": "J.R.",
      "body": "We're all for the poorhouse now...",
      "created_at": "2005-02-19T02:52:21.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 13,
      "name": "Other job"
    }
  ]
}
