{
  "id": 155,
  "title": "Advertisers and the like",
  "body": "This will be a short post since I'd like to hear more from you, oh powerful focus group, than me. Here's the deal: February is \"MISSION: Find Advertisers\" month, which means it's time to whip it into high gear and do just that... find some advertisers. We've had a few nibbles here and there, but that's not enough. It's time to start reeling in the big boys. END METAPHORS... NOW!<br/><br/>We have a few ideas in mind when it comes to advertising (i.e. pre-show ads, small ads on our monthly newsletter, ads on our website, student-filmed movie-type ads, sponserships, etc.), but for the moment, pretend like we have no idea whatsoever about anything related to advertising. We're at a loss. We don't know what to do. That's where you come in. If you were in our shoes, what sort of advertising mediums would you offer? What wouldn't you offer? How much would you charge for the various ads? How long would they run? How long should they run? The more creative, the better.<br/><br/>I won't post again until sometime on Monday, so in the interim I'm temporarily promoting all of you to Senior Vice Presidents of Marketing. If you haven't commented before, now's your time to shine. If you're a tenured commenter - you know who you are - jump right in and show those n00bs how it's done.<br/><br/>Alright? Alright. Any questions? No? Right. Meeting adjourned. See you back here on Monday.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-02-18T21:06:35.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "steph v.",
      "body": "I think a commercial sounds good. You should get Mr. Sonner and have him say,<br/><br/>\"When I see movies, I only see it at the art-house.\" <br/><br/>Get it? Instead of the big house?!",
      "created_at": "2005-02-18T22:25:01.000Z"
    },
    {
      "author": "Stephanie",
      "body": "When we saw Sideways a couple of weeks ago, I noticed the bathroom stall doors carried ads.  A billboard-y sort of thing, about the size of an unfolded newspaper, which was broken into four seperate ads. <br/>Ok...it was kind of weird to see advertising at that particular moment, but I also couldn't escape it!",
      "created_at": "2005-02-18T22:33:22.000Z"
    },
    {
      "author": "Dave",
      "body": "you could put advertising on your drink cups. you could probably have them printed on white plastic cups. i've even seen a cdrom attached to the lid of a soft drink cup.",
      "created_at": "2005-02-18T23:28:58.000Z"
    },
    {
      "author": "matt",
      "body": "This is probably obvious to you, but keep the ads relevant to your audience/business.  Sure, everyone needs tire repair and oil changes, but people are bombarded with those ads everywhere else.  If you are going to have advertising, it would be nice to think it would come from film studios, indie cultural sources, and other friends of the Moxie.  Standing at a toilet and facing an ad is obnoxious enough, but facing one that's just as generic as what I see everywhere else is the worst. <br/><br/>I still suggest slides in between films.  These can be relatively cheap and can be rotated in and out of circulation as you get new advertisers.  Again, no one wants to see an ad for a dentist while waiting for a movie to start, but ads for your concession partners, film distributors, locally-owned video rentals, local bands, etc would be cool.<br/><br/>See if you can get some ad swap/banner swap opportunities with film-related websites and your moxie site too.  There's a large online film nerd community that would probably be interested in at least reading this blog and maybe even trekking out to the Moxie in person some day (ahem, cough).<br/><br/>Sponsorships--yeah, I'm serious.  If you do it in a funny way, I'd be in.  I don't know about the whole hand sink, but you know, if you engraved the ice scoop with my name or something... things like that would be fun and funny.  Just figure out the cost of something like an ice bucket and the cost of affixing a little engraved plate on it, and post a price list.  Maybe I'm alone in this, but I'd certainly think it was funny to have my name be a part of the Moxie's bricks and mortar.",
      "created_at": "2005-02-19T00:03:03.000Z"
    },
    {
      "author": "Aaron",
      "body": "Stephanie::<br/><br/>That's why it is called \"captive marketing.\"<br/><br/>After the meeting that my company had this morning, I can tell you that you need to be specific on what the placement is, how often it occurs, and the rates (and what premiums will be defined as). Inevitably, not everyone who would like to advertise with you will be able to afford, say, showing a slide for every viewing. You've gotta find opportunities for advertisers but, on the other hand, not oversaturate your establishment with other people's images. I think putting people's logos on cups and bags and things would be too much. Either save money and leave that space blank, or use the printing costs to promote yourself. Take South Avenue Pizza Co./Bar Next Door. They serve their drinks in plastic cups with their name and phone number on the side (and a Coca Cola imprint if I'm not mistaken). People (actually, poor college kids mostly) take those home, wash them, stick them in their cupboard, and everytime they pull them out, they are reminded of the bar – and if they are hungry for some pizza, the phone number is right there. So if you sold the space on your cups for someone else's business, that's their name that receives repeated attention. <br/><br/>So I guess what I'm saying is delegate a specific amount of space – whether it is slides, ads in bathrooms, deals with concessions – for outside advertising and other space for in-house advertising. Just don't overdo it. I hate going to a movie theater and being overstimulated by all the crap they have in the lobby and hallways and preshow when what I really want to focus on is the film I plan to see. Then again, I'm overstimulated if I go to Wal-Mart or the Mudhouse on a busy night, so that might just be me.",
      "created_at": "2005-02-19T00:12:25.000Z"
    },
    {
      "author": "Aaron",
      "body": "Oh, and if intermissions will be a reality – and something unique to the Moxie – you could sell sponsorship just for the intermission. You'll have something of a captive audience because not everyone is going to get up to go to the bathroom or buy more Fitz's.",
      "created_at": "2005-02-19T00:15:32.000Z"
    },
    {
      "author": "Elizabeth Jones",
      "body": "I do a lot of ad designs and I don't know if it will help or not, but I can just let you know some businesses that advertise a lot in our town that you might want to talk to (although, the market may be different there than in Loganville) - Chiropracters, Real-Estate companies/agents, Mortgage companies, Landscaping services, restaurants, Law firms, Jewelry stores, cell phone companies, and banks.",
      "created_at": "2005-02-19T00:41:51.000Z"
    },
    {
      "author": "Laurie",
      "body": "Hmmm....Will give this some thought and toss any ideas that pop up in my brain your way. ( idea's pop in better when drinking, and I am stone-cold sober right now :|) <br/><br/>And on Aaron's cup idea...I got about 50 steak-out cups in my cupboard, lol, and everytime I open it, I get a craving for a 6 oz. rib-eye and a baked tater with the works.  So, in my eyes, the cup idea is a fantabulous one, and I would definately run with it. As for where to get them printed up, I know PWM uses Express Press for their promotional items, but I am not 100% positive if they do cups.  I would assume they do, being they did cozies for the band ( I call them beer huggers, but, What they hey!!).<br/><br/>About the bathroom fliers...First time I saw a Glamour Shot ad was in a stall at the BattleField Mall, about 2 centuries ago.  I still remember it, so it must work.  In fact, I have found myself reading the damn walls in bathrooms before for lack of anything better to do while waiting for people to clear out; anything is better than staring at your feet, or catching eyes with some freakish stranger that just won't shut the F* up.<br/><br/>A little FYI:  PWM spent under $1000 in promo a week before the show, consisting of radio spots, ads on websites having to do with music, and fliers. The radio spots paid of in two ways.  They got to go in the studio twice.  Once for an interview and a song played from the CD that generated a HUGE response, then the next day when they stopped back in the studio to give a copy of the CD to the station, they wound up meeting Rupert. got their picture with him, and ended up in a permanent Album on Q102. So...Less than a grand brought in almost 600 people at $5-$7 a head, sold $$$$ in merch, and packed the house so bad you had to wait 30 minutes for a beer!<br/><br/>Not bad, in my opinion. <br/>",
      "created_at": "2005-02-19T01:36:04.000Z"
    },
    {
      "author": "whittler",
      "body": "The moon. THE MOON!",
      "created_at": "2005-02-19T03:21:17.000Z"
    },
    {
      "author": "nathan springer",
      "body": "you should shave ads in your hair",
      "created_at": "2005-02-19T05:00:20.000Z"
    },
    {
      "author": "Scott G.",
      "body": "You could have all of the employees dressed like Nascar drivers, wearing jumpsuits with advertisements all over them.<br/><br/>I don't know if this is really related to advertising, but I remember this interesting story I read once.  This company in New York was selling short stories in vending machines in the subway waiting areas.  They were a success. Maybe you could sell something similiar, supporting local writers and selling some advertising in the article or something.<br/><br/>",
      "created_at": "2005-02-19T05:30:21.000Z"
    },
    {
      "author": "Brandon",
      "body": "When you said \"How long would they run? How long should they run? The more creative, the better,\" there was only one thing I thought of.<br/><br/>Subliminal messages.  <br/><br/>Make a subtle reference to them in your pre-show introduction, or on an inconspicuous sign somewhere... a \"warning\" or something...  and charge the business wanting the advertisement just as much (or more?) for the special \"subliminal spot\" ...use only one or two per movie to keep it exclusive... don't know where during the showing or how it'd be done, but it'd be hilarious-- and I sure remember what I laugh at for 2 or 3 minutes.  *flicker*<br/><br/>Also, I took a liking to an idea proposed above-- the \"patron\" thing.  (As long as its an option on the website, maybe as an auction, and word about the ability to do such things is spread about your regular customers)  mmm... Brandon's ice buckets... mmm... Brandon's fake-butter dispensers... mmm Brandon's beer taps...",
      "created_at": "2005-02-19T05:47:15.000Z"
    },
    {
      "author": "Al",
      "body": "I'd look at finding some investors.  You may have to look at paying a very high rate, as you'll be considered a \"junk bond\" (no financial collateral), but with costs this much higher than planned, I'd say it's either quit and wait for another situation, or find some extra cash.",
      "created_at": "2005-02-19T05:48:54.000Z"
    },
    {
      "author": "nicole",
      "body": "Yay Aaron for mentioning cups! I've been fighting for that since day 1. Do you know how many South Ave. Pizza Co and Shakespeare cups I have? I won't use anything else! In fact, 75% of the reason I like going to those restaurants is so I can \"keep the cup.\" I never drink soda at restaurants. But if I can keep the cup? I'll come back any chance I can. <br/><br/>So there, Dan.",
      "created_at": "2005-02-19T06:12:29.000Z"
    },
    {
      "author": "justin",
      "body": "<i>They serve their drinks in plastic cups with their name and phone number on the side (and a Coca Cola imprint if I'm not mistaken). </i><br/><br/>I wouldn't be surprised if Coca-Cola pays all or most of the price of the cups, since their name is on it.  Talk to budweiser about this.  The venue I work for gets tons of stuff for free (posters advertising shows, neon signs, cups, pitchers, etc. all for free from Budweiser (and the other beer companies, for that matter).  Talk to all of your distributers (food, beverage, etc.) about opportunities like this.  You'd be surprised what you can get for free from them.",
      "created_at": "2005-02-20T21:48:38.000Z"
    },
    {
      "author": "Laurie",
      "body": "Justin is right on that aspect. Pimp Juice wanted to do the same but the band shyed from it, instead taking three cases and a boatload of free stuff from them instead.  Big names have the resources to do that kinda stuff.  But as far as free stuff goes..not necesarily.  If you go into that, contracts tend to get involved, and you know how that goes. You might get them to advertise on cups, but in return you have to do something for them.  In Pimp Juice's case, it was wear a T shirt advertising them, and a plug at the merch table.  You dont want a HUGE ASSED Bud Light sign blinking and strutting about at you when you go to get a drink and some Juu Juu Fruits at the snack bar during intermission, taking away from the REAL advertising for the Theatre.. Have mercy on peeps eyeballs, shesh.  Getting in cahoots with big names CAN and DO have their drawbacks as well as benefits.  Get it in writing before you even consider anything, so where you still will be advertising the Moxie, not the product that is \"helping\" advertising ya.<br/><br/>And..CUPS!  I agree with Nicole.  Dan, what WERE you thinking, not having CUPS with your ad on it?!?!?!<br/><br/>Golly, Jeez...I'ma smack you...<br/><br/><br/>:P",
      "created_at": "2005-02-21T02:03:22.000Z"
    },
    {
      "author": "Laurie",
      "body": "P.S.  Remember freebies.  All I need is the word GO and you got free advertising on Drury Radio KDRU....Well, at least when my buddy is DJing.<br/><br/>And naturally my big mouth is advertising it.  I need a damn T shirt!  Just the word \"MOXIE\" on front can and will generate questions, trust me.  I had peeps coming up to me all last night at a couple bars I went to with craig ( BOY was he pissed)with the T shirt of a chick in a martini glass, reclining, with PWM logo below it.  Curiousity breeds patrons.<br/><br/>:O  T Shirts!!  Walking, talking, tesimonials of a business..and the word MOXIE pricks an individuals thoughts all its own.<br/><br/>Something to ponder, yup yup.<br/><br/>Peace out!!( twangs Cruel Intentions)  Awaiting Jake's arrival from a Tsunami relief show with 14 bands in Chicago.  Him's gonna be HUNGRY..they eat Ramen and peanut butter sammiches on the road.  Poor doodes.  ~le sigh~",
      "created_at": "2005-02-21T02:24:37.000Z"
    },
    {
      "author": "Scott G.",
      "body": "Maybe you could sell sponsorships on the seats and put a small plaque on the back of each seat with the name of the sponsor.  I thought of that cuz you can go places where people pay a little money to get their name on a brick.  Maybe customers would pay $50 to have their own name on the back of a seat.",
      "created_at": "2005-02-21T04:28:04.000Z"
    },
    {
      "author": "Liz",
      "body": "Advertising in bathroom stalls is not a far cry from the weekly bulletin in the restrooms around my college. They call it the \"Dear John.\"  A good place for local ads (bands and the like) if you replace it weekly like that.<br/><br/>I'm not going to pat myself on the back, Dan, but I WILL be looking over my shoulder.  Those stat trackers are creepy.",
      "created_at": "2005-02-21T12:22:31.000Z"
    },
    {
      "author": "Beavis",
      "body": "And if you sell advertising rights to ice buckets, etc., make it funny.  So if Bob buys the ice machine, call it 'Grand Pappy Bob's Cool Brew' and maybe a funny story along with it for cutomers to read.  I will be willing to sponsor meat, salami, bolgna, cured ham..  Mmm.",
      "created_at": "2005-02-21T18:22:25.000Z"
    },
    {
      "author": "Elizabeth Jones",
      "body": "One more thing... if you are going to sell advertising, make sure the person selling the ads knows some of the technical aspects of the ad design setup and has some kind of spec sheet to give to the advertisers that they can, and in turn give to their designer or marketing person. I do the ads for my husband's law firm and they advertise everywhere, but the salespeople never know anything except the ad is due yesterday, usually. So I always have to track down the printer or art person to find out the ad size, how to set it up, what kind of file, etc. It is a real pain in the butt.",
      "created_at": "2005-02-21T19:14:22.000Z"
    },
    {
      "author": "Allison",
      "body": "Along the lines of plaques on the backs of seats, you could have sponsors for whatever artwork you're displaying in your lobby.  Even though it's local artwork, and maybe you got it for free, and maybe it's for sale, little plaques always work nicely alongside art.<br/><br/>Similarly, besides advertising revenue, you can allow the local artists to sell their artwork directly off of your walls (buyer collects art at the end of the month after purchase, etc), and then you take a 5% cut off the top of any sales for having \"advertised\" their art in your \"gallery\".<br/><br/>Finally, along the same lines of hanging things on walls, don't forget the value of having \"Gold Sponsors\", \"Silver Sponsors\", etc... so that you would have a plaque of little plaques next to the consession with people who \"donated\" money to your theatre (i.e. decided to advertise on the plaque of plaques).",
      "created_at": "2005-02-23T02:52:29.000Z"
    },
    {
      "author": "Rob Carlson",
      "body": "I hope you all don't get pissed off about me posting this shameless advertisement here, but I couldn't help but notice your discussions about restroom advertising.  I have an indoor advertising company that promotes local businesses in the restrooms of Springfield's most popular bars, nightclubs and restaurants.  If you're interested, I'd be willing to lease space from you to post the billboards in the restrooms of your place.  I can either pay cash, or trade with advertising the Moxie in some other clubs/restaurants.  We also do a lot of promotion for the locations that host our billboards.  Please give me a call if you'd like to make money/free advertising in return for letting us use your restroom wall space.  There's a list of our locations on our website.  Phone number's there too.  Thanks, and take care of yourselves.<br/>-Rob",
      "created_at": "2005-02-24T21:24:12.000Z"
    },
    {
      "author": "Mark",
      "body": "Re Brandon's email:<br/><br/>There was an episode of Columbo were the murderer used a subliminal message of ice water (combined with turning the heating up) to lure the victim out of the theatre during a screening.<br/><br/>Plus Fight Club showed us how easy it is to do.<br/><br/>Mark<br/><br/>p.s. Please don't kill anyone, I don't want to be done for 'conspiracy to comit'.",
      "created_at": "2005-02-28T22:34:03.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
