{
  "id": 156,
  "title": "Hey look, Part 5",
  "body": "<a href=\"http://drurymirror.collegepublisher.com/news/2005/02/18/Features/Springfield.Gets.Moxie-868721.shtml\" target=\"_blank\" class=\"broken\">This story</a> ran in Friday's edition of the Drury Mirror. Very nice write up, if I might say so myself... but you don't have to take my word for it. < cut to a butterfly flying past a rainbow >\r\n\r\n<i>Butterfly in the sky\r\nI can fly twice as high\r\nIt's in a book\r\nSo take a look\r\nA reading rainbow!</i>\r\n\r\n<b>Springfield Gets Moxie</b>\r\nBy Hayley Budd\r\n<a href=\"http://www.drurymirror.com\" target=\"_blank\">Drury Mirror</a>, February 18, 2005\r\n\r\nWhen was the last time you saw a foreign film at a theater here in Springfield? Do you remember that we barely got to see movies like Bowling For Columbine and Sideways? Oscar-nominated films such as Maria Full of Grace and The Motorcycle Diaries don't stand a chance here, and we lose out. Enter The Moxie.\r\n\r\nThe Moxie is Springfield's newest independent movie theater dedicated to showing the great movies that don't make it to our city including documentaries, foreign films, and local films by local filmmakers. Located at 408 W. Walnut with a projected opening date of late March, The Moxie will be similar to Columbia's Ragtag Cinemacafe. \"We're almost like Ragtag's sister theater,\" Dan Chilton, owner, said, because Ragtag was \"the spark that started the Moxie.\"\r\n\r\nDan and Nicole Chilton want their theater to be strongly connected to the community. Originally from Springfield, they decided several years ago that what their hometown needed was an art house theater and that maybe, if they were \"lucky\", they would be the people to open one. Since its beginning, the theater has relied on local businesses to play a role in its completion.\r\n\r\nThe beer and wine served at the theater will be local or at least regional, coming from the Springfield Brewing Company or Boulevard Brew Co. In addition, the Mudhouse is developing a special coffee blend, Fitz's of St. Louis will provide the sodas, and Andy's Custard has a signature \"Moxie\" flavor in the works.\r\n\r\nThe Chilton's commitment to the community does not stop there. Local artists will be able to show their work in the hallways and perhaps the auditorium of the theater, and the canned-in music will be by local bands. Also, The Moxie will play host to film festivals and showings organized in conjunction with local university language and film clubs. \"We want to cater to the community,\" Chilton said, \"and add personality to the experience.\" Dr. Maxim Matusevich, Drury Cinema Club sponsor, is looking forward to collaborating on festivals with The Moxie, \"That would be totally fantabulous. I expect that The Moxie and Drury Cinema Club (as well as the SMS movie series) will end up working closely together. The more the merrier.\"\r\n\r\nLong-term plans for The Moxie include the possibility of a change in location: \"We're always keeping an eye out to upgrade,\" Chilton said. Also, the Moxie might expand into nearby communities. \"There are plenty of towns around here that could use this kind of theater,\" Chilton said.\r\n\r\nThe cost of a single ticket will be $8, $6.50 for students and seniors, $5 for a matinee showing, and $5 for late showings and specials. Schedules for the theater will be posted online, printed on a monthly calendar, and available via moviephone. The Moxie should open in late March after general repairs to the building are finished, licensing and permits are secured, framing is raised, the projection booth is built, seating is installed, and finishing touches are made. Visit the Moxie Blog at www.blog.moxiecinema.com for more information and regular updates on the progress of the theater.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-02-21T19:35:32.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Andrew",
      "body": "You're \"always keeping an eye out to upgrade\"?",
      "created_at": "2005-02-21T20:25:40.000Z"
    },
    {
      "author": "bjork24",
      "body": "She left the rest of the quote off. The question was where do we see the theater several years down the road... long-term plans. I told her we'd like to be successful enough to outgrow our space, so we're always keeping an eye out to upgrade... space-wise.",
      "created_at": "2005-02-21T20:29:58.000Z"
    },
    {
      "author": "justin",
      "body": "I didn't know you were thinking about expanding into nearby communities, either.  What else are you hiding, Dan?",
      "created_at": "2005-02-21T20:38:36.000Z"
    },
    {
      "author": "bjork24",
      "body": "Those were just fantasies... both of them. She asked where I saw the theater down the road, and I asked her, \"how fantastical can I be?\" I just went wild!\r\n\r\nWe're also planning on opening our own chain of Moxie-brand used car lots in and around the Topeka, KS area.",
      "created_at": "2005-02-21T20:48:18.000Z"
    },
    {
      "author": "John",
      "body": "Great article. I can only wish to pay eight bucks for a movie.",
      "created_at": "2005-02-21T22:08:39.000Z"
    },
    {
      "author": "steph v.",
      "body": "I thought you hated Topeka...But you could go to The Little Apple, Kansas. \r\n\r\nsniff. I miss Manhattan.\r\n\r\nBravo on yet another plug in the paper!",
      "created_at": "2005-02-21T23:56:31.000Z"
    },
    {
      "author": "Oz",
      "body": "\"The Moxie should open in late March after general repairs to the building are finished, licensing and permits are secured, framing is raised, the projection booth is built, seating is installed, and finishing touches are made.\"  Hey, sounds like you're almost done from that little list!",
      "created_at": "2005-02-22T01:46:43.000Z"
    },
    {
      "author": "Fyse",
      "body": "\"Also, the Moxie might expand into nearby communities.\"\r\n\r\nSo, how long before the Moxie empire reaches these distand shores? I hear St Albans, Hertfordshire is much in need of an \"independent movie theater dedicated to showing the great movies\"...",
      "created_at": "2005-02-22T02:52:52.000Z"
    },
    {
      "author": "tenajyebba",
      "body": "1. ask for volunteers-we can do things for you and you can trade us a movie(hours for hours)\r\n2.put a paypal logo on your site for donations\r\n3.ask for write-ups for films\r\n4.have retrospectives (Fassbinder!!! Godard!!! etc\r\n5.sell 11 trip tickets for the price of 10 movies so you get money ahead of time\r\n6.have ebay auctions and ask people for a donation with a digital picture and write up to save you time and you can give them free advertising that way\r\n7. have people offer to do a medical study to donate the proceeds to you and you give a year's free movies to them (600-3000 dollars that way\r\nwhen you want more ideas let me know. that's all i have these days,free advice.\r\n8. get me in touch with brad pitt. i am writing a screenplay for him based on a book that will be the role of his career. trust me.\r\n9.i used to be very familiar with TLA(Theatre of the Living Arts)in Philly so I know a lot about what you are doing. They started the same way you are. Their old reviews would be perfect for you.\r\n10.o,and sell subscription tickets for retrospectives.\r\n11.The Bandbox in Germantown Pa used to do double features for 2 nights reversing the times for starting,so people could only come for one if they desired. That was great. And a good waydd to get people started seeing these kinds of films. Once they do,Hollywood will bore them. It's time to educate Springfield. I would love to help you plan films based on different themes. Have them on one night (2xmonth)for x # months. \r\n\r\nAH,AT LAST YOU ARE HERE!WELCOME!",
      "created_at": "2005-02-22T03:21:06.000Z"
    },
    {
      "author": "Beavis",
      "body": "You're \"always keeping an eye out to upgrade\"?  Big ideas!",
      "created_at": "2005-02-22T19:48:59.000Z"
    },
    {
      "author": "Fyse",
      "body": "Whoops!",
      "created_at": "2005-02-23T03:58:41.000Z"
    },
    {
      "author": "Fyse",
      "body": "Hey! Removing the reason for me saying 'whoops' make me seem really stupid!",
      "created_at": "2005-02-23T05:43:55.000Z"
    },
    {
      "author": "Laurie",
      "body": "Yo!  If you can keep hush hush about this..how about swinging a Tshirt this way for April 26th? Finch, the band not the bird, will be in town... Not real sure about the bird, lol.  Guess who opens for them?  WOO HOO!",
      "created_at": "2005-02-23T10:38:41.000Z"
    },
    {
      "author": "J.R.",
      "body": "You're getting more exposure then the former Glendale Student who posed for playboy.",
      "created_at": "2005-02-23T11:20:23.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
