{
  "id": 157,
  "title": "Late February update",
  "body": "It's been awhile since I've given a full update on what's going on with the theater, so today's the day to remedy that. We've been in Springfield for nearly two months, and here's what we've accomplished:\r\n\r\n<b>The Building</b>\r\n\r\nSince we moved down, the building has underwent the following transformations:\r\n\r\n<ol><li>A non-load-bearing wall was torn down.</li>\r\n<li>A pass-through was built.</li>\r\n<li>A door was blocked up and covered.</li>\r\n<li>The second bathroom was extended and refinished.</li>\r\n<li>The carpet was torn up (thanks <a href=\"http://www.sweetwaterabilene.com\" target=\"_blank\" class=\"broken\">J.R.</a>).</li>\r\n<li>The adhesive was removed from the floor (completed today).</li></ol>\r\nWe would have a lot more done had it not been for the electrical service needing to be updated - a little problem that threw a MAJOR wrench in the gears. Thanks to that set-back, we had to apply for a building permit, which has been in the works for well over three weeks. It finally went for review yesterday, which means it <i>should</i> be approved and received by late this week (at the earliest) or sometime in the upcoming week. That's when the big stuff will start happening: the auditorium will be framed in, the projection booth will be built, the concession area will be fitted with a countertop.\r\n\r\nOf course, there's still a lot of work to be done in the meantime. We have to find subcontractors to upgrade the electrical and the HVAC, we have to solve our drain issue, and we have to come in under budget. It's a very tough situation. Nicole is upset that her interior decorating budget is getting cut so heavily, but that's the only place the extra money could come from. If we cut the budget down to only those items that are absolutely necessary, we're looking at projection equipment, chairs, popcorn popper, a couple refrigerators, prep-area sinks, light fixtures, and that's about it. We're going to have to be creative when it comes to making do with very, very little money. If they can redo an entire room for $1,000 on Trading Spaces, then we can make a 2,600 square foot theater look presentable for $3,000 or $4,000.\r\n\r\nAlso, now that the adhesive has finally been removed (we hired a professional to do it), you can expect a new phlog detailing the progress.\r\n\r\n<b>Licenses and permits and bonds, oh my!</b>\r\n\r\nThe majority of our licenses and permits have been filed and received. Our sales tax license cost us nearly $1,400, but the others came in around $50.00 each. The last ones that we have to fill out are the State liquor license (the city liquor license is done) and our standard business license, which can wait till we're closer to opening. Here's a list of items we need to receive our liquor license from the state:\r\n\r\n<ol><li>Liquor license application, signed and notarized.</li>\r\n<li>Completed owner/officer/member information form.</li>\r\n<li>Criminal history report from the Missouri Highway Patrol in Jefferson City no more than 14 days old for all partners and corporate officers.</li>\r\n<li>Money order, certified check or cashiers check made payable to the Missouri Department of Revenue in the amount of $20.82.</li>\r\n<li>Copy of Missouri Retail Sales Tax License.</li>\r\n<li>Statement of No Sales/Use tax due from the Department of Revenue dated within the preceding 90 days.</li>\r\n<li>Two recent photographs of all partners or corporate/LLC managing officers (I've got <a href=\"/post/90\">plenty of those</a>!)</li>\r\n<li>Two recent photographs of front of premises to be licensed.</li>\r\n<li>Copy of all partner's or corporate/LLC managing officer's personal property or real estate tax receipt for the year immediately preceding the date of application.</li>\r\n<li>Copy of all partner's or corporate/LLC managing officer's voter registration card.</li>\r\n<li>Copy of Certificate of Incorporation (Organization) and Certificate of Corporate Good Standing.</li>\r\n\r\n<li>Copy of Articles of Incorporation (LLC Articles of Organization and Operating Agreement).</li>\r\n<li>Copy of letter appointing the managing officer and naming his specific duties.</li>\r\n<li>Copy of lease, signed by all parties and notarized, or copy of warranty deed for premises to be licensed.</li>\r\n<li>Copy of Bill of Sale or Contract for Sale of business fixtures, signed by all parties and notarized.</li>\r\n<li>Copy of Federal Tax Stamp or receipt of payment.</li>\r\n<li>Copy of city letter of approval.</li></ol>\r\nWhen I type it all out, it doesn't seem so bad. You think they'd make it a little easier to sell hooch, but NOOOOO! They HAVE to HAVE this and they HAVE to HAVE that. I thought all it required was a well-stocked bar and the nerve to point a shotgun in someone's face and say, \"I think you've had about enough, buddy.\"\r\n\r\n<b>Insurance and his evil minions</b>\r\n\r\nFirst off, let me say this: insurance is a big pile of crap. It's outrageously expensive, and if you don't estimate your numbers correctly, they'll audit you and make you pay even more. It's ridiculous! On top of that, you can't pay commercial insurance and worker's compensation insurance in nice monthly installments, like you can with your health or auto insurance. You either pay it all up front, or finance it through them and pay it in 3, 6, or 8 monthly installments. Of course, if you choose to finance it through an installment plan, they're going to tack on an additional $100 per year in finance charges AND straddle you with a hefty interest rate to boot.\r\n\r\nStill, I shouldn't be complaining... our insurance agent did a great job finding a reasonable premium for a start-up business that will be serving alcohol and is being run by owners with very little experience. Our commercial insurance is going to run us roughly $4,500 per year, while worker's comp will float around $1,500 for the same period of time. We're only paying $3.20 per $100 for worker's compensation, which means our job is considered to be pretty safe. The only work-related hazards would be slipping on spilled pop, burning yourself on the popper, or losing a finger in the projector. If we were in the roofing industry, we could expect paying upwards to $35 per $100 for worker's comp! Can you believe that? That just floors me! I'm literally typing this from the floor right now.\r\n\r\nAnd since I'm already down here on the floor, let me go on about this whole yearly \"audit\" thing. Let's say we have a gangbuster first year, we end up making $300,000 in gross profits, but our insurance only covered up to $225,000. Uh oh! That means when they audit our books we're going to owe them an additional premium on the money we made. On the converse, if we do a lot worse than we had anticipated, they'll audit our books and we'll be eligible for a refund on our premium. It's one of those rare situations where they punish you for doing good, and reward you for not meeting your goals. Kind of like...\r\n\r\n<b>Income taxes and our eternal state of poorness</b>\r\n\r\nFor the first time in my professional life, I owe money on my taxes. I don't know how it happened, but it did. As I had done with every job before it, I consulted with my sister, the CPA, to make sure I filled out my W2 correctly. Unfortunately, that wasn't enough. Nicole fell prey to the income tax monster too, as did her friend and ex-coworker, Allison. I wonder if any of my other Elsevier ex-comrades fell victim as well... Dave... Tom? Either way, Nicole and I are frantically filing through our 2004 receipts in hopes of lowering our tax payment to somewhere in the mid-to-low triple digits. I bet it's because Nicole and I got married. Damn marriage!\r\n\r\nAs for the state of our banking account, I'd say we're hovering somewhere between North Dakota and Alabama. Nicole's still bringing home the bacon, but I have an interview with the <a href=\"http://www.springfieldadsheet.com\" target=\"_blank\" class=\"broken\">Springfield Ad Sheet</a> on Thursday for a freelance (as in, work from home) advertising coordinator position. You see, before I worked for Elsevier, I worked for two years at the <a href=\"http://www.addsheet.com\" target=\"_blank\">ADD SHEET</a> in Columbia doing the exact same thing, which was building little ads for various locally-owned business. Before the Columbia Add Sheet, I was an advertising coordinator for a real estate team here in Springfield... so the point is, I'm highly qualified for this position AND we need the money. Bad.\r\n\r\nThe only thing I'm worried about is that the Springfield Ad Sheet requires I have a Mac computer, which might be a big problem if this were 1987 and a PC couldn't do everything a Mac could. Beyond looking cooler, Macs and PCs are pretty much the same. Yes, Macs make everything a <i>little</i> easier and the new ones have that nice trendy thing going for them, but when it comes to graphic design and page layout, I'll take a PC over a Mac any day. This will be something I'll need to express to the Ad Sheet owner when I meet with him on Thursday. I should wear a Windows shirt when I meet with him... how funny would that be? Huh? Huh?! Oh. Not funny at all, you say? Damn you and your Linux ways.\r\n\r\n<b>On the horizon</b>\r\n\r\nOn the immediate horizon - as in, right there in front of us - Nicole and I will be traveling up to Columbia this weekend to attend the <a href=\"http://www.truefalse.org\" target=\"_blank\">True/False Documentary Film Festival</a>. There are <a href=\"http://www.truefalse.org/films.htm\" target=\"_blank\">so many films</a> playing that we're really going to have to pick and choose which ones we'll be able to see. Last year's big movie was <u>Touching the Void</u>; this year it looks like it's going to be <u>Murderball</u>. Nicole and I are super pumped, because 1) we're going to a super cool documentary film festival, 2) we're staying with our good friends <a href=\"http://jglow.blogspot.com\" target=\"_blank\" class=\"broken\">Justin</a> and <a href=\"http://www.comomusic.com/images/photo.jpg\" target=\"_blank\" class=\"broken\">Kelley</a>, which means lots of drunken Cranium playing, and 3) Bangkok Gardens. You can expect a somewhat full update on Monday.\r\n\r\nA little further down the road, the SMSU (soon to be Missouri State University... hopefully) Film Board has contacted me to discuss doing a joint showing / reception of <u>Mean Creek</u> in early May, complete with Jacob Estes, the writer/director; Susan Johnson, the Producer, and possibly one of the cast members (Trevor Morgan or Ryan Kelley). Although the movie is several months old, it never played in Springfield (duh!) and I think it would be a great event to host before the college students clear out for the summer. We're still in the early stages of discussion, but I was too excited to keep it all bottled up inside.\r\n\r\n<b>Conclusion</b>\r\n\r\nIn conclusion, I hope this post has proven that we are not sitting idle, watching the clouds roll by, but are in fact working very diligently to get the Moxie open as soon as possible. To wrap things up I'd like to point you to <a href=\"http://www.film-tech.com/cgi-bin/ubb/ultimatebb.cgi?ubb=get_topic;f=5;t=001344\" target=\"_blank\">a story</a> I read on <a href=\"http://www.film-tech.com\" target=\"_blank\">film-tech</a> that scared the bejesus out of me. It's about a little independent, single-screen theater - complete with couches and chairs - that is being unduly harassed by the city, which is trying to shut them down. It may not effect you the same way it does me, but it's a sad story all the same.\r\n\r\nALSO, I'm selling <a href=\"http://cgi.ebay.com/ws/eBayISAPI.dll?ViewItem&rd=1&item=6371201998&ssPageName=STRK:MESE:IT\" target=\"_blank\" class=\"broken\">my old VHS movie collection</a> on eBay, so if you know anyone who'd be interested in buying them... hint, hint. Send me money!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-02-23T21:34:34.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "How do you even begin to comment on such a monster of a post?  I laughed at the link to the pictures required for the permits.  I'll see you this weekend.",
      "created_at": "2005-02-23T21:46:33.000Z"
    },
    {
      "author": "bjork24",
      "body": "You could start with, \"Best. Post. Ever.\" Then go from there.",
      "created_at": "2005-02-23T21:48:12.000Z"
    },
    {
      "author": "justin",
      "body": "Oh, and Kelley and I discussed what films we'd like to see.  You and Nicole should do the same, then we can battle it out when you arrive.  Here's what we'd like to see:\r\n\r\nI Like Killing Flies\r\nMardi Gras: Made In China\r\nMurderball\r\nRock School\r\nRhythm Is It!\r\nReel Paradise\r\n\r\nI might be missing some...",
      "created_at": "2005-02-23T21:51:42.000Z"
    },
    {
      "author": "bjork24",
      "body": "We shall discuss via e-mail.",
      "created_at": "2005-02-23T21:53:20.000Z"
    },
    {
      "author": "justin",
      "body": "And another thing:  Why do you want SMSU to switch names?",
      "created_at": "2005-02-23T21:56:00.000Z"
    },
    {
      "author": "bjork24",
      "body": "Because they've outgrown their distinction as a regional college and they need to be recognized as a larger state institution. MU is afraid of SMS because they're the second largest school in the state, but that doesn't mean they can keep bullying them around and force them to keep an outdated name. I hope once SMS becomes MSU it kicks MU right in the balls for being such a jerk!",
      "created_at": "2005-02-23T21:58:29.000Z"
    },
    {
      "author": "justin",
      "body": "But when you think of a state university in Missouri, what do you think of?  MU.  It will always be MU, mostly because of its history and its central location.  SMSU changing their name won't change that.",
      "created_at": "2005-02-23T22:01:39.000Z"
    },
    {
      "author": "steph v.",
      "body": "That's my answer to everything...If trading spaces can do it for $1000, then so can we.\r\n\r\nI don't know how many times it is the correct answer...",
      "created_at": "2005-02-23T22:01:59.000Z"
    },
    {
      "author": "bjork24",
      "body": "Justin: You're an MU pawn! SMS isn't trying to change that, they're just trying to get a name that better reflects their stature and position in Missouri. Lots of states have two main state university (K State / KU, Iowa State / University of Iowa, etc.). Neither distinction hurts the other. You've been brainwashed by the Columbia media coverage!\r\n\r\nSteph: It's always the right answer. Always.",
      "created_at": "2005-02-23T22:06:46.000Z"
    },
    {
      "author": "justin",
      "body": "Actually I haven't seen any of it in the news.  Not that it's not in the news, I just don't watch it, mostly because Columbia has the worst local news I've ever seen.",
      "created_at": "2005-02-23T22:12:27.000Z"
    },
    {
      "author": "bjork24",
      "body": "That's true. Let's leave it at that... Columbia does have the worst local news.",
      "created_at": "2005-02-23T22:13:48.000Z"
    },
    {
      "author": "Oz",
      "body": "Speaking of colleges changing their names, there was a local college in the Philadelphia area called Beaver College.  For obvious reasons, Beaver College students (especially the girls) underwent a lot of, uh, comments.  They changed their name to Arcadia University.  ",
      "created_at": "2005-02-24T00:06:30.000Z"
    },
    {
      "author": "bjork24",
      "body": "Oz: Along those same lines, there's a place somewhere in the Midwest that celebrates \"Cooter Days.\" I don't know what it's about, but the name intrigues me.",
      "created_at": "2005-02-24T00:52:52.000Z"
    },
    {
      "author": "Dave",
      "body": "i don't get that Mac requirement. if they're using standard graphic design software, it'll be available on a pc and you should be able to move between platforms pretty easily. ",
      "created_at": "2005-02-24T01:10:54.000Z"
    },
    {
      "author": "bjork24",
      "body": "Exactly. That's what I'm going to tell him... as I'm jamming away on my iPod.",
      "created_at": "2005-02-24T01:12:06.000Z"
    },
    {
      "author": "Chuck",
      "body": "Touching the Void was awesome. Best documentary I've seen in a while. Hell of a post, Dan. I don't know when you find the time to open your own theatre. ",
      "created_at": "2005-02-24T02:03:44.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Chuck!",
      "created_at": "2005-02-24T03:49:20.000Z"
    },
    {
      "author": "nathan springer",
      "body": "AD SHEETS, OH NO... when i went mizzou i hated those things, they would chase me down and make me take it or else they would cut me... ok maybe not but that is they way it felt. ",
      "created_at": "2005-02-24T04:10:17.000Z"
    },
    {
      "author": "bjork24",
      "body": "No, no. You were right... they will cut you if you turn your back to them. I made sure never to make eye contact with the Add Sheet \"distributors.\"",
      "created_at": "2005-02-24T04:16:20.000Z"
    },
    {
      "author": "Rachel",
      "body": "I can't believe all the pictures you need for a liquor license.  Like they're going to look at the picture and say, \"Has all his teeth, doesn't seem drunk at time of picture...AOK!\"  Also, two things about your movie collection:\r\n1-Ducktales (woo woo) I can't BELIEVE you have that movie\r\n2- You're selling Wild Things?!  Is Nicole making you?",
      "created_at": "2005-02-24T06:55:48.000Z"
    },
    {
      "author": "brian of moore",
      "body": "have you looked into making sure everything is up to firecode? that article worried me.... not about burning alive... but about watching a movie and having some fire marshall come in and tell us we have to go home as he gives you some $fine..... oh... and i do all my graphic design on a PC :-)",
      "created_at": "2005-02-24T07:02:07.000Z"
    },
    {
      "author": "Liz",
      "body": "Um...are you sure don't you mean \"SADDLE you with a hefty interest rate\"?",
      "created_at": "2005-02-24T08:58:03.000Z"
    },
    {
      "author": "Ben D.",
      "body": "I was in Columbia over the weekend visiting Mizzou and an incredibly pierced and tattooed man gave me a flier for the True/False film festival. It was wicked cool. Anyway, it looks like I'll be going to Mizzou this fall. I'll have to make a trip to Springfield sometime to see a movie at the Moxie and test some of the specialty Moxie custard.",
      "created_at": "2005-02-24T09:58:32.000Z"
    },
    {
      "author": "Beavis",
      "body": "http://www.amazon.com/exec/obidos/tg/detail/-/B00005JM9N/qid=1109253362/sr=1-1/ref=sr_1_1/102-0381520-3080925?v=glance&s=dvd\r\n\"Ah, Kelly Clarkson's fresh-faced, small-town-girl charm--the charisma that led her to win the first season of American Idol--is on full display in From Justin to Kelly, a contemporary beach-party movie co-starring her former competition, Justin Guarini. The flimsy plot--Kelly and two gal pals go to the beach for spring break, where one of her friends gets jealous of Kelly and tries to ruin her budding romance with Justin--is just an excuse for glossy pop musical numbers, in which Kelly, Justin, and the rest of the cast exercise their glossy throats with lots of white soul vocal stylings. The best musical numbers suggest a new kind of disco-fueled pop operetta, with everyone singing the story along; you may wish that Kelly and Justin sang their way through the entire movie, never speaking at all. Plenty of skin--from girls and boys--is on display, but the overall tone is squeaky clean. --Bret Fetzer --This text refers to the Theatrical Release edition.\"\r\nLooks like you'll have a lot with your made up friends in Columbia!  Bring your salami.\r\n",
      "created_at": "2005-02-24T18:57:13.000Z"
    },
    {
      "author": "justin",
      "body": "Yes, I know - I have a girlfriend named Kelley, and my name is Justin.  That's pretty original, you know.. bringing up American Idol's Kelly and Justin.  We've never heard that before, honestly!",
      "created_at": "2005-02-24T20:18:00.000Z"
    },
    {
      "author": "Nicholas",
      "body": "Umm...Dan, have you considered renting your VHS collection from the Moxie? I mean...you do have about the coolest damn drop-box in Springfield (if you can find a way to open it--who knows, there may be some old deposits in there). Also, check out Film Movement's DVD series...they allow showings FROM THE DVD, and this might add to your existing showings. www.filmmovement.com",
      "created_at": "2005-02-24T23:28:53.000Z"
    },
    {
      "author": "Nicholas",
      "body": "Regarding the the unfortunate theatre owner--sounds like he didn't do as much research as you. By the way, do you have a lawyer advising you on what you need to go about doing? Or is this all through personal research?",
      "created_at": "2005-02-24T23:29:50.000Z"
    },
    {
      "author": "bjork24",
      "body": "Rachel: Nicole is making me sell Wild Things.\r\n\r\nBrian of Moore: Everything is up to code... I dropped nearly $5,000 to make sure everything is compliant. From our seats to our new duct work. What a pain in the ass!\r\n\r\nLiz: No, I meant straddle. That interest rate threw its long legs around me and rode me like a horse... for a good 2 or 3 hours. It was okay.\r\n\r\nBen: Columbia is a cool place, you'll like it... just don't look the Add Sheet guys directly in the eyes.\r\n\r\nBeavis: That's good one! Who writes your jokes?\r\n\r\nJustin: I've told you that 1,004 times!\r\n\r\nNicholas: I just got off the phone with Film Movement... awesome group of people! We'll definitely be showing their films. Thanks for the heads up!\r\n\r\nAs for the research, we're doing most of it, but we're also paying (quite handsomely I might add) a group of architects and engineers to make sure all our shit is up to code. We're also working closely with very helpful and knowledgable contractors and developers. I think we're going to be okay.",
      "created_at": "2005-02-25T01:45:39.000Z"
    },
    {
      "author": "Beavis",
      "body": "Question, why don't you incoporate in Delaware, perhaps you can get some benefits?:\r\nDifferent kinds of business can be transacted under one corporate roof. \r\nShareholders can act in writing instead of holding meetings. \r\nYou can add people to the board who are not shareholders. \r\nCorporate records need not be kept in Delaware. \r\nOne person can act as the only officer, director and shareholder of a corporation. \r\nNo Delaware income tax is charged to companies that do not do business in Delaware. \r\nDelaware has no sales or personal property tax. \r\nLow franchise tax, $60.00 in many cases. $200.00 for L.L.C.’s\"\r\nhttp://www.delawareintercorp.com/why.htm",
      "created_at": "2005-02-25T02:36:15.000Z"
    },
    {
      "author": "Brandon",
      "body": "aww, deleware's just a bunch of credit card company towers.\r\nyes, maybe for Beavis' reason, but still.",
      "created_at": "2005-02-25T10:01:16.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
