{
  "id": 158,
  "title": "True/False here we come...",
  "body": "I have to make this quick since I still have a million errands to run before we hit the road for Columbia. I just got back from dropping Bogey off at a nice kennel down the road. I insisted on taking a tour of the place last Tuesday to make sure it was up to par for our special little guy. It was. They even let us bring all of his bedding, comforters, toys, bones, socks, doggy underwear, sunglasses, food, gravy, and his entourage of masseuses, stylists, and requisite bitches. He whimpered as I walked away, so I turned around, grabbed his furry little face and said, \"I know it was you Bogey. You broke my heart. You broke my heart!\" Then we starred together in <i>Dog Day Afternoon</i>. It was awesome.\r\n\r\nI think we have our advertising campaign figured out, as well as a Moxie membership program. The membership program will go a little something like this:\r\n\r\n<b>Level 1 - $75 per year</b>\r\n\r\n<ul><li>$4 anytime admission (excludes special events)</li>\r\n<li>$1 Cinebar credit per visit</li>\r\n<li>One Moxie T-shirt</li></ul>\r\n<b>Level 2 - $125 per year</b>\r\n\r\n<ul><li>$4 anytime admission on up to two tickets per show (excludes special events)</li>\r\n<li>$2 Cinebar credit per visit</li>\r\n<li>One Moxie T-shirt</li></ul>\r\n<b>Level 3 - $500 per year</b>\r\n\r\n<ul><li>$4 anytime admission on up to four tickets per show (excludes special events)</li>\r\n<li>$5 Cinebar credit per visit</li>\r\n<li>Two Moxie T-shirt</li>\r\n<li>Access to movie company advertising materials; for example, posters and postcards (first come, first served)</li>\r\n<li>Two free private shows per year for member plus three guests during non-show times only, by appointment (choose from films currently showing, or bring in a movie of your choose on DVD)</li></ul>\r\n<b>Level 4 - $2500+ per year</b>\r\n\r\n<ul><li>$4 anytime admission on up to four tickets per show (excludes special events)</li>\r\n<li>$10 Cinebar credit per visit</li>\r\n<li>Four Moxie T-shirt</li>\r\n<li>Access to movie company advertising materials; for example, posters and postcards (first come, first served)</li>\r\n<li>Eight free private shows per year for member plus three guests during non-show times only, by appointment (choose from films currently showing, or bring in a movie of your choose on DVD)</li>\r\n<li>Free pre-show ad for your business, or personal greeting, that will run for six months</li>\r\n<li>Invitations to all of the Moxie's invite only and special engagements</li></ul>\r\nPretty cool, eh? The structure is based on Paul's membership plan at the Avalon Cinema in Oregon, but we switched a few items to tailor it to the Moxie. I'll save the advertising structure for next week. I better get going... I've dilly dallied long enough.\r\n\r\nIf you have a moment, hop on over to <a href=\"http://fresh.retroflux.com\" target=\"_blank\" class=\"broken\">Nicole's photo blog</a> and check out all of the cool pictures she's posted lately. I'm not just saying that because she's my wife... I think they're really good. Think of her photo blog as a non-Moxie-related Phlog.\r\n\r\nHave a great weekend!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-02-25T21:53:47.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Oz",
      "body": "I think you should make the $4 passes also exclude opening weekends.  I know that kind of sucks for movie goers, but it increases your revenue for both opening weekend and the probably the subsequent weekend.  I know big chains that do discount passes that way.  Just a thought.",
      "created_at": "2005-02-25T23:55:26.000Z"
    },
    {
      "author": "whitty",
      "body": "Time to save my pennies.  I hope you won't think less of me if I only invest in the el cheapo membership.  Viva el Cheapo!",
      "created_at": "2005-02-26T00:51:45.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Oh wow, I love the private show idea.  YOU TEMPT ME GREATLY!",
      "created_at": "2005-02-26T03:12:46.000Z"
    },
    {
      "author": "Al",
      "body": "If they pay $2500, I think I'd include special events.",
      "created_at": "2005-02-26T10:13:58.000Z"
    },
    {
      "author": "Allison",
      "body": "I was gonna say something along the exact opposite lines... for only $2500 they get six months of your valuable advertising space?  That's WAY too cheap.  Don't sell yourself out.",
      "created_at": "2005-02-26T21:28:17.000Z"
    },
    {
      "author": "J.R.",
      "body": "Sounds like a wonderiffic idea.  The private showings are definitely a draw for memberships, unless say, 700 people sign up for level 4's then the screenings, not so private anymore.",
      "created_at": "2005-02-26T21:41:45.000Z"
    },
    {
      "author": "Newell",
      "body": "As long as there's free stuff, I don't see what the problem is. Although I guess technically it isn't free if I have to purchase a \"membership\". Oh well... it's still for a good cause. Or a reasonable facsimilie of a good cause.",
      "created_at": "2005-02-27T07:28:32.000Z"
    },
    {
      "author": "Mark",
      "body": "Sounds cool. Let me know when it's up and running and I'll chip in for a standard membership (even though I'll never use it).\r\n\r\nWill there be some sort of newsletter/mailing list with the membership?\r\n\r\nWill you also be renting the theatre out for private screenings/corporate events?\r\n\r\nMark",
      "created_at": "2005-02-28T21:43:53.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "So, how soon can we sign up?  My tax refund is burning a hole in my pocket!",
      "created_at": "2005-02-28T23:53:22.000Z"
    },
    {
      "author": "Fyse",
      "body": "They sound good to me. I particularly like the idea of a private screening.\r\n\r\nD'you mind me asking a technical question? I notice that if I type enough in this box to get a scroll bar up, I can use the scroll wheel on my mouse to move up and down. On my site, the scroll bar has never worked in Firefox, but works fine in IE. How come yours works, and mine doesn't? Is it just your natural flair and talent, or am I doing something specific wrong?",
      "created_at": "2005-03-01T03:32:26.000Z"
    },
    {
      "author": "bjork24",
      "body": "iFrames, like the one on your site, act differently than textboxes, like this one. That's the only explanation I can offer.",
      "created_at": "2005-03-01T03:36:30.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Wow, cool plan Dan. I dig the Level 4, though I could never afford it (no matter how much I would like to).\r\n\r\nA free screening...*drool*\r\n\r\nOh, and the lack of proper pluralization bugs me to death (I can't help it, I make some of my living writing).\r\n\r\n\"Four Moxie T-Shirt\" #^%@$%@#4\r\n\r\n;)",
      "created_at": "2005-03-01T22:23:33.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yeah, this post was written too hastily. I'm an abonimation to the integrity of English majors the world over.",
      "created_at": "2005-03-01T22:41:45.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
