{
  "id": 159,
  "title": "Memberships and advertisers",
  "body": "Okay, I've been going over the membership benefits and I really think they need some tweaking. I don't want to cut into the Cinebar too heavily, since, after all is said and done, that's our only profit center... but I also want to entice members to buy something. Also, I have questions concerning heavy use of discounted admissions. The majority of our master license agreements (MLAs) have policies safeguarding the distributor against widespread use of discounted admissions - I think it's something ridiculous like only 1% of total admissions can be discounted... so for our 70 seat theater, we can only allow 0.70 patron(s) to use a discounted ticket.<br/><br/>\"Yes, the majority of your body can get in for $4.00, but I'm afraid everything from your knees down is going to have to pay full price. Sorry!\"<br/><br/>Either way, I've sent an e-mail to Paul from Darkside Cinema, of whose membership program ours is based on, so I should be hearing back from him shortly. Other than that, I've decided to add another nice benefit to the fray: ADVANCED TICKET SALES. For standard customers, tickets can only be purchased \"day of,\" but members will be able to purchase their tickets up to three days in advance. I'm hoping this perk will entice even more people to become Moxie members, since tickets will be at premium for at least the first several months of operation.<br/><br/>With that being said, are we offering too much? Should we jack the prices up a bit? Will anybody ever buy the $2,500 level membership? I mean, honestly... that's a lot of money!<br/><br/>Here's the new membership plan, with a few added tweaks:<br/><br/><b>Level 1 - $75/$100 per year</b><br/><br/><ul><li>$4 anytime admission (excludes special events)</li><br/><li>$1 Cinebar credit per visit</li><br/><li>One Moxie T-shirt</li><br/><li>Ability to purchase tickets in advance</li></ul><br/><b>Level 2 - $125/$175 per year</b><br/><br/><ul><li>$4 anytime admission on up to two tickets per show (excludes special events)</li><br/><li>$1 Cinebar credit per visit</li><br/><li>One Moxie T-shirt</li><br/><li>Ability to purchase tickets in advance</li></ul><br/><b>Level 3 - $500 per year</b><br/><br/><ul><li>$4 anytime admission on up to four tickets per show (excludes special events)</li><br/><li>$3 Cinebar credit per visit</li><br/><li>Two Moxie T-shirts</li><br/><li>Access to movie company advertising materials; for example, posters and postcards (first come, first served)</li><br/><li>Two free private shows per year for member plus three guests during non-show times only, by appointment (choose from films currently showing, or bring in a movie of your choice on DVD)</li><br/><li>Invitations to all of the Moxie's invite only and special engagements</li><br/><li>Ability to purchase tickets in advance</li></ul><br/><b>Level 4 - $2500+ per year</b><br/><br/><ul><li>$4 anytime admission on up to four tickets per show (excludes special events)</li><br/><li>$5 Cinebar credit per visit</li><br/><li>Four Moxie T-shirts</li><br/><li>Access to movie company advertising materials; for example, posters and postcards (first come, first served)</li><br/><li>Eight free private shows per year for member plus three guests during non-show times only, by appointment (choose from films currently showing, or bring in a movie of your choice on DVD)</li><br/><li>Free pre-show ad for your business, or personal greeting, that will run for two months</li><br/><li>Invitations to all of the Moxie's invite only and special engagements</li><br/><li>Ability to purchase tickets in advance</li></ul><br/>So what should I change, if anything? I know it's hard for some of you to suggest changes since you're considering buying a membership for yourself, but if we don't price this correctly, or if we offer too much for too little, the entire campaign will fail, the Moxie will close its doors, and it will be all your fault! The split prices for levels one and two are the prices I'm debating. Which should it be?<br/><br/>While we're on the is<br/>sue of pricing structures, here's the tentative rate sheet for pre-show ads:<br/><br/>REQUIREMENTS:<br/>1. Business must be locally owned<br/>2. Ad will be designed in-house by Dan (that's me!)<br/>3. You must buy Dan a bottle of Dr. Pepper... at least once<br/><br/>STATIC AD<br/>1 Month - $200<br/>3 Months - $550 ($184 monthly)<br/>6 Months - $950 ($159 monthly)<br/>9 Months - $1,275 ($142 monthly)<br/>12 Months - $1,500 ($125 monthly)<br/><br/>ANIMATED AD<br/>1 Month - $250<br/>3 Months - $700 ($233 monthly)<br/>6 Months - $1,300 ($217 monthly)<br/>9 Months - $1,700 ($188 monthly)<br/>12 Months - $2,100 ($175 monthly)<br/><br/>Compared to the other theaters in town, these are very competitive rates. What do you think? Too low? Too high?<br/><br/>Also, to help win advertisers to the idea of working with our theater, I'm going to offer a 50% discount for early adopters (any business that signs up for advertising within the month of March). I have to finish our advertising packet / website today so I can start spreading the word. In fact, I better go do that right now. As for the rest of you, please speak up. This is a very important part of the business, and I'm interested to hear what you - our potential customers and/or advertising affiliates - think.<br/><br/>Until next time!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-03-01T21:44:58.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "I think you should lay out how much screen time potential advertisers can expect for 1 month, 3 months, etc.  But we already talked about this.  I'll shut up.",
      "created_at": "2005-03-01T22:23:19.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yes, that will all be outlined on the advertising website.",
      "created_at": "2005-03-01T22:42:18.000Z"
    },
    {
      "author": "Allison",
      "body": "I like your membership plan -- I think it works for the most part.  I'd be a member if I lived closer.  On the price of Level 1: $4 is ridiculously cheap for movies nowadays, almost universally.  Going by your estimated ticket prices [The cost of a single ticket will be $8, $6.50 for students and seniors, $5 for a matinee showing, and $5 for late showings and specials.] if an average joe buys the Level 1 membership, and, say, goes to the Moxie twice a month (which is Totally reasonable since $4 is so cheap), say 25 times total in a fiscal year, you're losing $4/visit on them (because they're taking up a seat that now you can't sell at full price in your relatively small theatre).    You're really losing $5/visit assuming all patrons purchase cinebar goodies -- that's $125 loss on the average joe.  Plus the cost of a tshirt -- $135.  <br/><br/>However, you've drawn them into your theatre, which is good (Realistically they never would have gone 25 times at full price).  So, say they would have only come 12 times to the theatre without the membership.  You would have made approximately the same amount of money off of them (ticketwise) as with the discount _and_ been able to sell the other 13 seats (on those days he didn't go) and cine-snacks at full price (also ~$135).  The biggest benefit you have is that you've got this frequent-visitor going out to talk up the movies to their pals -- Advertising.  So it really comes down to how much you want to pay for advertising.  If you believe my estimates (which could be somewhat questionable), giving someone a membership costs you ~$135.  If you sell it for $100, then you're paying $35 for word-of-mouth advertising.  If you sell it for $75, you're paying $60 for advertising.<br/><br/>I also love that advertisers will have to buy you a bottle of Dr. Pepper.  Exxxxcellent.  If those advertising prices work with your budget, yay.  But, you might consider offering a 25% or 10% discount after March until you open, just to continue to spark advertisers' interest, and because they're putting their absolute faith in you actually having patrons (not that I doubt you will, but certainly you don't have the books to show them yet).<br/><br/>You're doing a super job with all of this!  I wish I could be one of your regular theater-goers.",
      "created_at": "2005-03-01T23:02:07.000Z"
    },
    {
      "author": "Oz",
      "body": "RE: \"So what should I change, if anything?\"  See my comment to your previous post.",
      "created_at": "2005-03-01T23:36:00.000Z"
    },
    {
      "author": "matt",
      "body": "The discount price for members is too low.  I'd cut $2 off the regular admission, but half off is kinda crazy.  Or make it \"matinee any time with a membership\" or something, but no rate should be lower than your matinee rate.  I'd use up the value of that discount in 2 months, easy. (uh, if i lived anywhere near you)   The cinebar credit is smart though, but maybe it could be distributed in the form of concession vouchers issued monthly through the mail/email with your newsletter to members?  This way, you don't get taken to town by really frequent customers, and you always remind people and give them a reason to stop in.  The $1 credit is cool though cause what the hell can you buy for a dollar?  It's definitely going to encourage spending.",
      "created_at": "2005-03-02T01:29:00.000Z"
    },
    {
      "author": "Al",
      "body": "I have a common sense problem with someone trying to give you money (buy an advance tik) and you not being able to take it.",
      "created_at": "2005-03-02T01:29:23.000Z"
    },
    {
      "author": "Beavis",
      "body": "Question:  What if you do become hugely popular?  What if certain people can never get into a movie because of advanced ticket sales?  Will you begin new shows?  How will that work.  70 seats for a popular movie showing only once on Friday and again on Saturday, seems to go quickly.  I would buy a cheap ad to offer up my salami to the ladies.  And a sweet t-shirt in size small, have any tighty-whities?  My ** is 0.70 inches...does that count?",
      "created_at": "2005-03-02T01:35:11.000Z"
    },
    {
      "author": "bjork24",
      "body": "Allison: Wow! Thanks for the advice. Very thorough and helpful.<br/><br/>Oz: Yes, I agree with you... your last comment too.<br/><br/>Matt: Indeed. Perhaps $5.00 would make more sense. I thought about the monthly vouchers when we first started considering the memberships, but I'm torn... I just don't know what would work best.<br/><br/>Al: Selling advance tickets is harder than it might seem... logistically. If we had a fancy computer system tracking everything, it would be much easier, but starting off it will be a bit of a logistical stretch. Still, if you'd like to give me money, I'll have no qualms over taking it from you.<br/><br/>Beavis: You make a valid point (finally!), but we'll be showing movies for longer than just a weekend. Perhaps the \"advanced tickets\" benefit will not qualify for opening weekend or special engagements.",
      "created_at": "2005-03-02T01:35:26.000Z"
    },
    {
      "author": "nicole",
      "body": "I have a slight problem with the $1 off per visit at the Cinebar only because we're leaning towards no fountain drinks. That would mean giving away some of our concessions, and I don't know if we can afford that starting off. The monthly voucher is a good idea, I think. ",
      "created_at": "2005-03-02T01:42:22.000Z"
    },
    {
      "author": "bjork24",
      "body": "I thought you couldn't use the internet at work!",
      "created_at": "2005-03-02T01:43:55.000Z"
    },
    {
      "author": "nicole",
      "body": "It's fixed!",
      "created_at": "2005-03-02T02:02:46.000Z"
    },
    {
      "author": "bjork24",
      "body": "Cool",
      "created_at": "2005-03-02T02:06:35.000Z"
    },
    {
      "author": "Nate",
      "body": "It seems like you are adamant about limiting the advertising to only local businesses, and while I think that is REALLY cool and even noble, I wonder if it's a principle you can afford to have with such a young business.  This may already be decided but I worry whether you can get all the advertising you need this way.  It can be a bitch of a market, getting those spaces filled.  Do you really want to turn away money from Starbucks or Clear Channel?  They are both the devil, but still, you're making your profit from candy bars man, and I want to see you stick around for years to come.",
      "created_at": "2005-03-02T02:48:44.000Z"
    },
    {
      "author": "nicole",
      "body": "My views on more corporate advertising (like Starbucks) is that if they put local establishments out of business, then we shouldn't take their money. ",
      "created_at": "2005-03-02T02:52:29.000Z"
    },
    {
      "author": "Nate",
      "body": "Fair enough.  More power to you.  <br/><br/>I for one would much rather see ads for the Mudhouse than for Starbucks; I just want you to eat, too.  And it's possible that the majority of your crowd wouldn't be influenced by ads from these chains.  So you'd be taking their money with no real benefit to them!  At least, that's one way of rationalizing it.",
      "created_at": "2005-03-02T03:04:06.000Z"
    },
    {
      "author": "nicole",
      "body": "Thanks for the concern of making sure we make it, Nate! We love our supporters!",
      "created_at": "2005-03-02T04:21:47.000Z"
    },
    {
      "author": "Luke",
      "body": "To address the question that you asked in you post, \"Will anybody ever buy the 2,500 level membership? I mean, honestly... that's a lot of money!\"<br/><br/>Never underestimate the audacity of people who have money.  There may be just one guy out there in Springfield that is willing to pay that much money so that he can brag to his friends that he's a $2,500 Moxie member, but that's still $2,500 in your pocket.<br/><br/>It can't hurt to offer it right?  The worst thing that could happen would be to not have any $2,500 members.",
      "created_at": "2005-03-02T06:31:25.000Z"
    },
    {
      "author": "Luke",
      "body": "Also, I thought I'd mention that the Film Society here in New Orleans offers memberships with different names for the different tiers of membership.  I think that would be a cool addition to the Moxie's membership program.<br/><br/>As an example of the different names, see: http://www.neworleansfilmfest.com/membership.html<br/><br/>You may get guys like me who just can't bear the thought of having a simple \"Movie-goer\" membership level, and therefore sign up for the next one up, almost entirely because of the title.",
      "created_at": "2005-03-02T06:35:19.000Z"
    },
    {
      "author": "bjork24",
      "body": "Nate: Thanks for keeping an eye out for us!<br/><br/>Good idea Luke!",
      "created_at": "2005-03-02T06:38:48.000Z"
    },
    {
      "author": "Beavis",
      "body": "What about the tighty-whities?",
      "created_at": "2005-03-02T19:02:34.000Z"
    },
    {
      "author": "J.R.",
      "body": "It all sounds very good and affordable to me, but then again, I substitute teach for a living at the moment.  I think you'll do splendidly with the local businesses, because they can afford to advertise at The Moxie.  Not only that, since you are designing them in-house, they get advertising and design, how many people pay at least $250 for getting an ad designed?  I don't know, I'm not a graphic artist.",
      "created_at": "2005-03-02T19:44:35.000Z"
    },
    {
      "author": "nicole",
      "body": "JR - are you still with Penmac? And how's the need for substitute teaching? My job is over this week.",
      "created_at": "2005-03-02T20:39:03.000Z"
    },
    {
      "author": "Trinity",
      "body": "I agree with the above regarding $4 - I'd match the matinee price here.  It's still a great offer off regular price.  I'd definitely go with the monthly Cinebar vouchers as well.  And the private showings are a huge perk -- I think I'd be tempted to buy the $500 membership because that's included.  I don't know about the math (I don't do math...at all...ever...I swear), but the \"stuff\" you get sounds great.",
      "created_at": "2005-03-02T23:08:17.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "I dunno, the $4 ticket kind of tips the balance for me as far as being willing to buy a membership.  I think cheaper-than-matinee tickets are a fantastic selling point for the membership.  You could always compromise and go for five bucks, which is a nice round number.",
      "created_at": "2005-03-03T00:42:11.000Z"
    },
    {
      "author": "J.R.",
      "body": "Nicole, check yer e-mail.",
      "created_at": "2005-03-03T01:22:02.000Z"
    },
    {
      "author": "Nicholas",
      "body": "I agree...you're offering the price too low @ $4. If someone is willing to think about being a member, they're prolly the type to see an indie film multiple times. You need to protect your profit a bit more. Matinee price at all times sounds like a winner to me.",
      "created_at": "2005-03-03T04:27:44.000Z"
    },
    {
      "author": "kezza",
      "body": "Hi<br/> I work at an independant cinema in Australia. We have a movie club which costs people AU$22 per person per year to join. For that they can see as many films as they like for $8 (normal adult is $12) They also get a free ticket and discounted goodies for their birthday month. Every month we have a \"club special\" which is usually a free pepsi or small popcorn. This month its a free bag of sweets. We sometimes put them into a draw to win a gold pass for the next month to see as many movies as they like for free, but they only get entry to that when they see a movie, so the more they see the more entries they get. theres also a cash jackpot that goes up one dollar per day and each day we change the club number, if you show up the night your number is drawn, you win the cash. I also email and send a newsletter when i get time. Our club has well over 350 members in a small population (14,000). I think the price to join your clubn is wayy too high. People don't like forking out money for soemthing like a club (in my experience) last february we had a special where it was only $12 to join for that month only and we got well over 100 new members then! You can take any of those ideas if you want rhem. Remember people will join if they perceive they are getting a good deal!",
      "created_at": "2005-11-01T17:03:21.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
