{
  "id": 16,
  "title": "Educating the masses",
  "body": "Educating your target audience about current and upcoming films is as big an obstacle as any for art-house theaters, and even more so for those that don't have a large marketing budget; ourselves included. Now, before I begin, I need to clarify the differences between scheduling techniques and illustrate how each one offers its own unique advantages and disadvantages when it comes to film promotion.<br/><br/><b>Calendar House Scheduling</b><br/>This form of scheduling is also known as block scheduling, wherein a theater owner, or booking agent, schedules all the films for a particular theater up to one month in advance. The theater would then advertise their films through means of a film calendar, with each day showing what film is playing and at what time. <a href=\"http://www.ragtagfilm.com\" target=\"_blank\">Ragtag Cinemacafe</a> is a great example of a calendar house theater.<br/><br/>The biggest and most obvious advantage to this type of scheduling would be the distribution of printed calendars to your target market. At the beginning of each month, calendars could be printed with an entire month's worth of films, synopses, reviews, and any other pertinant information that your audience might need. Patrons could pick up calendars at the theater, or you could distribute them to areas  frequented by your target market (i.e. college campuses, nearby restaurants, etc..). Either way, the main goal is to get your calendar to as many people as possible, thus educating them to the films you'll be showing throughout the upcoming month.<br/><br/>The biggest disadvantage to being a calendar house theater is the inability to switch movies at a moment's notice. Once your calendar is printed, it leaves little to no room for divergence. If you're screening a film that ends up being a complete failure, you're stuck with it until your calendar says it's time to go. Conversely, if a film does unexpectedly well and you'd like to hold it over for a few extra days... sorry, you're out of luck. You have to stick with your calendar, through thick and thin, in weakness and in health, for richer or for poorer, till next month do you part.<br/><br/><b>On-the-fly Scheduling</b><br/>This type of scheduling is the one you're probably most familar with. When a new film comes on the market, you book it, then you advertise it, then you show it, then you ditch it after a couple weeks and the process starts all over again. The key advantage here is flexibility, but at a cost. You have to keep your audience abreast of what you're showing at all times, and that means you'll either have to shell out the money for expensive newspaper ads and a multi-line telephone \"movie line\" machine, or else think of some other clever ways to educate the masses.<br/><br/><b>Hybrid Scheduling</b><br/>This one is a mix of calendar house and on-the-fly scheduling, so if you happen to have more than one screen, you can get the best of both worlds. I, for one, don't buy into this brand of scheduling, because I think it will lead to the same disadvantages that befall other calendar house AND on-the-fly theaters. Sure, you might be able to hold over unexpected hits for a few days or so by moving the print from the calendar house into the on-the-fly auditorium, but you still can't ditch the stink bombs in a timely manner... AND you still have to deal with the cost of advertising for the on-the-fly side. Although it combines the advantages of the aforementioned scheduling types, it also componds the disadvantages, and that's something I'm wary of. Compounding.<br/><br/>Now, I bet you're wondering what type of scheduling we plan to use, aren't you? Well, let me tell you, my curious friend, we plan on using on-the-fly scheduling... 100%, both auditoriums, all day, all night, wham, bam, thank you Dan. But what about the advertising costs! You'll be ruined! Au contraire, my thoughtful hypothetical question asker, we have a few ideas up our sleeves.<br/><br/>Nicole just happens to hold a degree in Journalism<br/> from the oldest and most prestigous school of Journalism in the WORLD... the University of Missouri (if you're a Northwestern alum and you disagree with this comment, please take it up with Nicole)! She, and she alone, will be our in-house PR department, crafting press release after press release until all of Midwestburg's media outlets sing out in unison, \"We love Cinema 24, and we encourage all our fellow Midwestburgians to go see the 8:15 showing of <i>Garden State</i>! Yipee!\" Seriously though, press releases are the guerilla marketer's best friend. If timed correctly, we'll be able to garner free space in the weekend section of the local newspaper by spinning our movies as events, which, in all actuality, they are.<br/><br/>I, on the otherhand, hold a degree in English with a minor in Linguistics, which means I will be in charge of building our website! I bet you didn't see that one coming, did you? I've been working in web development for the last 4 years, so I know a thing or two about how to build a website... in fact, you're looking at one of my many web creations right now. I have plans for our website to be as much an intergral part of our business as anything else. We're going to plaster our web address on everything from tickets, to promotional items, to our monthly newsletters, and even the occasional newspaper ad. <br/><br/>Beyond the standard movie listings, the website will have lots of pretty pictures, synopses, links to external reviews, an online discussion board where visitors can review current movies or just gab about issues pertaining to the theater, and an art section where all the local and regional art that's currently being exhibited on our walls will be viewable and made available for purchase. I have lots and lots of ideas for the website, which means I'll probably end up overbuilding it and then have to cut out some of the useless features at a later date. Either way, the point still remains that our website will be just another effective weapon in our arsenal of cheap advertising.<br/><br/>Borrowing from the calendar house method, we also plan on printing monthly newsletters that outline potential upcoming films (synopses, reviews, etc..). We'll make sure to state that all the films are subject to availability, just in case one of them falls through and we're unable to book it, but in most cases it shouldn't be difficult to forecast the majority of the films we'll be showing over the next 4 or 5 weeks. These newsletters will be sent to people on our mailing list and distributed to key locations. We'll also send out a bi-weekly e-mail flyer that will briefly showcase the films that are currently playing, upcoming films, and any other events that need to be advertised.<br/><br/>Phew, I need to take a breather. I'm getting all worked up thinking about other ways to spread the word, so until tomorrow...<br/><br/>By the way, I'd love to hear any and all ideas regarding how we can better our guerilla marketing / advertising campaign. I really appreciate all the comments. Thanks.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-06-10T20:54:48.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Funnybunny",
      "body": "Hello!<br/><br/>Just wanted to let you know that I saw this site on \"Blogger\" in my dashboard.<br/><br/>Being fairly new to the Blogger Community, I thought I would take the time to tell you that I really like your website.<br/><br/>Although I have no interesting in ever owning, renting, selling, or having anything to do with a movie theatre (Except to go to one and spend MY money there), I give you kudos to this website.<br/><br/>And by the way, can I mention that I AM a Web Developer? Well, study-ing to be one in college. Just read my blog.<br/>Blog Title: A Day in the Life of a College Student",
      "created_at": "2004-06-11T23:48:48.000Z"
    },
    {
      "author": "d3pth",
      "body": "Very nice blog. I will come back. d3pth.blogspot.com",
      "created_at": "2004-06-11T23:49:06.000Z"
    },
    {
      "author": "Chuck",
      "body": "I really hope we'll be able to show one of our films at your theatre someday. I'll be working on it.",
      "created_at": "2004-06-11T23:49:19.000Z"
    },
    {
      "author": "iceland",
      "body": "write some LESS YOU FUCK .. :grade 0.1",
      "created_at": "2004-06-11T23:49:35.000Z"
    },
    {
      "author": "Vadergrrrl",
      "body": "Geez, Iceland is mean. <br/>I like your site. I love film myself, took some classes at Berkeley in the Film Dept, did my thesis in film (1915-1925). My degree is in History however. <br/>Hey I like your site. Thanks for the lesson.",
      "created_at": "2004-06-11T23:49:50.000Z"
    },
    {
      "author": "Amy",
      "body": "Gathering email addresses of your customers and sending them weekly updates with films now showing or coming soon is useful. The arty theatre here does that and that's my main source of info on the films that are showing. FYI.",
      "created_at": "2004-06-17T01:21:47.000Z"
    },
    {
      "author": "Crystal Riley",
      "body": "I think creatively done ads for local businesses would be much more enjoyable, and in no way, whatsoever, obtrusive to the experience of your theatre. In fact, I think I would rather enjoy a few well done ads, comedic or dramatic, as long as they didn't include the Fantanas.",
      "created_at": "2004-06-13T22:46:40.000Z"
    },
    {
      "author": "rose",
      "body": "One of our local cinemas (big old place, one screen, struggling to survive, but has a small solid audience) has a simple A4 printout in a display box behind glass at street level. It has, I think, a week's worth of screenings listed. I see lots of people stopping to have a quick look at what is on. I guess the thinking behind it is that people are busy and the time that they think - hmm, what is on at the movies - is when they walk past the cinema. I think it's a great idea - cheap and simple (like most good ideas!). They also use these box/windows to display posters of upcoming films. They run small \"festivals\" every now and then in conjunction with festival organisers - say and Italian festival or a Middle Eastern festival, and are one of the venues for the yearly (and well patronised) Gay and Lesbian Film Festival. Good luck with your venture. I'm enjoying your site and hope it all goes well.",
      "created_at": "2004-06-14T23:14:14.000Z"
    },
    {
      "author": "rose",
      "body": "Oh, by the way, have you checked out this site - www.cinemaminima.com. Probably you know of it already, but just in case...<br/>Also, one thing that the cinema I mentioned does wrong - they skimp on their heating. I know this is a cost cutting exercise, but everyone always comes out complaining of the cold. Those in the know go along dressed warmly, but it must put some patrons off, for sure.",
      "created_at": "2004-06-14T23:18:09.000Z"
    },
    {
      "author": "Greg",
      "body": "Hello there.  Just read through the blog so far, and wanted to say thanks.  It's cool to put yourself on the line and chronicle all the going-ons of a business as it happens.<br/><br/>Also, being a big press release guy myself, I know that newspapers tire quite quickly of constant press releases for non-news related info.  They are not in business to promote your business, they are in the business of promoting news that local readers want to know (and therefore selling ad space to a dedicated market).  I know that most major papers in a city of 400,000 won't be too excited about the re-release of Donnie Darko as a news story.  But they might send over a reviewer which is even better press.  So my advice is to have personal contact with local movie reviewers - have private screenings or whatever.  They can be a constant source of press, and likely good press (as most indie movies are actually good).  You may want to look into pricing for ads for movie times in the local paper as well - they may not be as overwhelming as you think.  <br/><br/>And of course, then there are the community rags - the arts & music types.  I'd maybe think about writing a weekly article in a community rag about films.  It could be a quick column - say Super Size me is coming in to town, you could have a column that promotes other indie films that are similar.  So if you liked Super-Size me, you might like \"Roger & Me\", \"Pulp Fiction\" and \"Manhattan\" and then have a brief desciption of them.  I know the \"Reccomended If You Like\" is somewhat base, but your goal should be to educate as many people about indie flicks as possible.  And also it's a sly way of advertising without coming out and saying \"I'm writing this column so that you will come to my theatre and purchase a grocery bag full of popcorn and an extra large coke.\"<br/><br/>I've probably written too much, but I think it's really cool that you've created this blog and wish you lots of success.",
      "created_at": "2004-06-15T18:52:57.000Z"
    },
    {
      "author": "Sandra",
      "body": "We are a single-screen non-profit and switched from the monthly format to \"on the fly\" a year ago. We send out weekly cinEmail, have info on our website, on our screen, produce a monthly newsletter with what's \"coming soon\", run ads once a week in four papers, poster, flyer, we have a movie line and it still seems like it's not enough.  One thing I've found is that our older (60+) audience doesn't use the technology as much and they miss the old monthly calendar. So we try to accomodate them because they tend to be more of the film risk takers than our younger audience. So...we're setting a up a system to actually call people to let them know what's here and a bi-weekly postcard system where they pay the postage and we'll drop the info in the mail every other Monday.<br/><br/>I started this job with no knowledge of the film business and I'm still learning, making mistakes and finding my way.  Your blog is a great resource!",
      "created_at": "2004-06-15T19:44:44.000Z"
    },
    {
      "author": "Sandra",
      "body": "I just read through the comments and saw the one about the theater being cold. We are a 200 seat theater and our heat and A/C are on timers. We set both at comfortable levels but heat rises -- and we have high ceilings. We also can't change the thermostat depending on the number of people who show up for a film. So after listening to the same people complain consistently, I purchased about 10 fleece lap blankets that customers can pick up on their way in. I haven't heard anyone complain about the heat or A/C since!",
      "created_at": "2004-06-15T19:54:59.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
