{
  "id": 160,
  "title": "Hey look, Part 6",
  "body": "[EDIT] - Dan's dumbung intro has been deleted. Read and enjoy!<br/><br/><b>Big Dream of a Big Screen: The Moxie Cinema Experience</b><br/>By Peggy Wells and Kenny Knauer<br/><a href=\"http://www.cfpmidweek.com\" target=\"_blank\">Community Free Press</a>, March 2, 2005<br/><br/>A lot of Oscar-nominated films never make it to the big screens in Springfield. Until now there's been nowhere to go to watch foreign films, documentaries, or local films.<br/><br/>Dan Chilton's downtown Moxie Cinema is about to change the area movie scene. The Moxie is Springfield's newest independent movie single-screen theater, located at 408 W. Walnut.<br/><br/>Chilton and his wife, Nicole, plan on becoming a part of the First Friday Art Walk. The theater will feature a new artist displayed on the walls every month and will premiere a new film the night of the art walk as well. \"When everyone is done walking around they can end up at the theater and watch a new film and enjoy themselves,\" Chilton said.<br/><br/>The theater will also support regional arts by showing regionally made films and piping in music made by local bands. Chilton's commitment to the community includes collaborating with SMS and Drury on student film festivals. \"We hope that if we cater ourselves to the community enough then they will show their support and keep us around,\" commented Chilton.<br/><br/><b><i>Making the Scene</i></b><br/><br/>The Chiltons want to differentiate the experience of going to the Moxie as opposed to going to one of the first-run movie theaters. They want to bring back some of the liveliness, the interaction, the fun of going to a movie. \"When you go to the Moxie you'll experience a totally different atmosphere. It's smaller and cozy, more laid back; there's art on the walls, you've got beer and wine; we're going to have unique concessions; goodies from downtown bakeries, coffee and all kinds of treats,\" Chilton said. Most of the concessions will be local as well - including the Mudhouse, which is creating a special blend of coffee, and Andy's Custard, now cooking up a signature 'Moxie' flavor.<br/><br/>\"When you go in, each film is going to have a personal introduction from either myself, my wife Nicole, or one of the employees,\" Chilton said. \"We will talk a little bit about the film, talk to the audience, if they have any questions, symposiums, receptions; we're going to try to get in directors from different films, just really put a face on the theater and make it fun and more of an experience when you go see a film. We can't promise that you'll like the film, but we can promise that you'll like the Moxie.\"<br/><br/>Columbia, Missouri's Ragtag Cinemacafe was the inspiration for the Moxie. \"When I was in Columbia and saw how well the Ragtag did there in a community half the size - I was sure Springfield could support a similar business. I've always been very pro-Springfield and thought this was a niche that needed to be filled,\" Chilton said.<br/><br/><b><i>Making the Scene</i></b><br/><br/>The 73-seat theater should be open in late March or early April after general building repairs are finished, licensing and permits are secured, and numerous finishing touches are made. Schedules for the theater will be posted online, printed on a monthly calendar, and available via moviephone. The cost of a single ticket will be $8.00, $6.50 for students and seniors, $5.00 for a matinee showing, and $5.00 for late showings and specials. For more information and updates on the progress of the theater visit blog.moxiecinema.com.<br/><br/>---- SIDE BLURB ----<br/><br/>Dan and Nicole Chilton are developing the Moxie Cinema with funds from a $25,000 loan from the Springfield Finance and Development Corporation, a consortium of approximately 13 local banks that have pooled their funds to provide capital for development in the Center City area. They also secured funding through a federal Small Business Administration loan for $25,000. The remainder of the funding was independently arranged by Dan and Nicol<br/>e Chilton.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-03-03T03:06:36.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "whitty",
      "body": "If it makes Nicole feel any better, my whole job revolves around periodicals and I have never even heard of the Community Free Press.  Which either demonstrates it isn't widely read or I am inept at my job. I am not sure which is more likely, let's hope for the first.",
      "created_at": "2005-03-03T03:36:03.000Z"
    },
    {
      "author": "Nicholas",
      "body": "How did they find out about your funding? That seems weird...",
      "created_at": "2005-03-03T04:30:18.000Z"
    },
    {
      "author": "Fyse",
      "body": "I can't believe you said that, Dan. It's almost as bad as \"I don't know much about art, but I know what I like.\"",
      "created_at": "2005-03-03T06:32:07.000Z"
    },
    {
      "author": "bjork24",
      "body": "Which part are you referring to Fyse?",
      "created_at": "2005-03-03T06:34:33.000Z"
    },
    {
      "author": "Oz",
      "body": "I can't believe that they revealed your funding that way.  For what reason?  That just seems bizarre...and really, really rude.  But at least it confirms that you and Nicole are both owners.",
      "created_at": "2005-03-03T06:43:23.000Z"
    },
    {
      "author": "bjork24",
      "body": "Well, I think they was going for business-angle. I'm not sure. It also confirms that Nicole and I are very, very poor.",
      "created_at": "2005-03-03T06:46:42.000Z"
    },
    {
      "author": "Aaron",
      "body": "Well, despite this, Kenny Knauer is still one of my favorite people in Springfield (not far behind Ralph \"I'm excited!\" Manley). <br/><br/>Oh, and the part about watching a new film and enjoying themselves, (insert Pee Wee Herman joke here).",
      "created_at": "2005-03-03T08:27:34.000Z"
    },
    {
      "author": "bjork24",
      "body": "I thought the article was good. I better explain myself better tomorrow... sans-stupidness.",
      "created_at": "2005-03-03T08:28:41.000Z"
    },
    {
      "author": "nicole",
      "body": "Silly Mudhouse reference. ",
      "created_at": "2005-03-03T08:48:51.000Z"
    },
    {
      "author": "justin",
      "body": "\"We hope that if we cater ourselves to the community enough then they will show their support and keep us around,\" commented Chilton. <br/><br/>Chilton comments, film at 11.  Good article.",
      "created_at": "2005-03-03T10:38:53.000Z"
    },
    {
      "author": "Fyse",
      "body": "I was referring to<br/><br/>\"We can't promise that you'll like the film, but we can promise that you'll like the Moxie.\"<br/><br/>Talk about a cheesy line! Still, I agree the article is good publicity. Mentions a lot of things that will make The Moxie so unique.",
      "created_at": "2005-03-03T15:46:33.000Z"
    },
    {
      "author": "steph v.",
      "body": "So when's the big day?",
      "created_at": "2005-03-03T23:11:16.000Z"
    },
    {
      "author": "Ben",
      "body": "I thought the comment about not being able to promise that you'll like the film was reassuring, like the Moxie won't just be playing \"independent\" studio crap like Chocolat.<br/><br/>-also, cheese is delicious.  So what?  Ham sammiches are terrible without cheese.",
      "created_at": "2005-03-03T23:34:25.000Z"
    },
    {
      "author": "Peg",
      "body": "In response to \"Whitty\" - Community Free Press has a current distribution of 12,000 weekly and is direct mailed to 500 businesses. Distributed in Spfd., Nixa, Ozark, Willard & Republic at over 350 locations. Readership growth is steadily increasing distribution locations & circulation. (People use CFP as a tool to decide what to on weekends.) CFP is a media sponsor for Artsfest, First Night, Cider Days & features First Friday Art Walk each month. CFP is a locally owned hometown paper ABOUT YOU, FOR YOU. The info I'm passing along to you is accurate - I work there. The CFP staff can't wait till the Moxie opens!",
      "created_at": "2005-03-04T01:43:53.000Z"
    },
    {
      "author": "Beavis",
      "body": "Dan said you'll have goodies.  Normally, baked goods are referred to as goodies.  But you are saying goodies from the bakery.  What sort of goodies?  I've got some goodies.  I can't wait till you open, find any tighty-whities yet?  ",
      "created_at": "2005-03-04T02:23:16.000Z"
    },
    {
      "author": "whitty",
      "body": "RE: Peg<br/>I was just joshin', I am sure your paper is dandy.  Now that Dan has removed his commentary, my comment is a bit out of context.  I certainly didn't mean to slight your paper.",
      "created_at": "2005-03-04T02:39:36.000Z"
    },
    {
      "author": "Peg",
      "body": "RE: Whitty<br/>Okay now I'm curious what Dan's commentary was. No offense taken, was just a \"FYI\" - the more people that know about us, the better. Be sure & let CFP know of anything that you think the public will find interesting, we're always looking for \"good stuff\" to print.",
      "created_at": "2005-03-04T03:14:44.000Z"
    },
    {
      "author": "Amy",
      "body": "Funny how they start out with \"Dan Chilton's Moxie Cinema \" as if Nicole has nothing to do with it. Sexist pigs!!!!",
      "created_at": "2005-03-07T22:47:15.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
