{
  "id": 161,
  "title": "Things fall apart, but can usually be glued back together",
  "body": "Not much to report today, so I'll make this a short post:\r\n\r\n<ul><li>We're going to First Friday tonight. Perhaps I'll see some of you there!</li>\r\n<li>My internet was down yesterday... network outage. SBC credited me $1.00 for my trouble.</li>\r\n<li>Thanks to yesterday's delay, I'm WAY behind on all of my projects. If I'm working on something for you (you know who you are), please be patient.</li>\r\n<li>Did I mention we're running out of money faster than a lubed up yak on tin foil?</li>\r\n<li>I was in a pretty sour mood yesterday, so I apologize to the people I met during the day. I'm usually not so glum.</li>\r\n<li>Sometimes it feels like the city is trying to crush this project. Sometimes.</li>\r\n<li>Meeting with the owner of Springfield's most successful, locally owned, downtown business really helped put things in perspective and rekindled my inspiration.</li>\r\n<li>Look! There's two new PHLOGS!</li>\r\n<li>There's two more press pieces that I haven't posted yet, mainly because I don't want the blog turning into the Moxie press showcase. They'll make it up here... eventually.</li>\r\n<li>Members get in for $5.00 (except on opening weekend and special engagements), receive new Cinebar coupons every month, get a cool Moxie T-Shirt, and have the opportunity to order their tickets in advance. The bigger levels will still receive personal screenings, additional shirts, and lots of other cool goodies. Thanks for your input!</li></ul>\r\nHave a great weekend!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-03-04T20:24:44.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Ole",
      "body": "Hey, feel free to use my office as a backup internet site downtown in the future Dan.  There's always one system available around here.  I wonder if your house is going to be in range of the WiFi setup SpringNet is supposed to unveil this month?",
      "created_at": "2005-03-04T21:41:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "I doubt it. I did spot the fancy new WiFi banners yesterday though. Quite nice.",
      "created_at": "2005-03-04T21:42:35.000Z"
    },
    {
      "author": "J.R.",
      "body": "See you this Saturday?",
      "created_at": "2005-03-04T22:27:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "Most definitely. I'm not sure when we'll get there, so swing by first to make sure we're there.",
      "created_at": "2005-03-04T22:28:21.000Z"
    },
    {
      "author": "nicole",
      "body": "Ooh, what's going on this Saturday?",
      "created_at": "2005-03-04T22:38:56.000Z"
    },
    {
      "author": "bjork24",
      "body": "Work at the theater.",
      "created_at": "2005-03-04T22:40:41.000Z"
    },
    {
      "author": "Allison",
      "body": "I love it!  Cinebar coupons!  Because once they're burning holes in people's pockets, they'll have to go to the theatre!  Brilliant!",
      "created_at": "2005-03-04T22:57:33.000Z"
    },
    {
      "author": "J.R.",
      "body": "I guess if I didn't swing by, then I would never know if you were there, and the mystery would eat me alive.  You can count on me.",
      "created_at": "2005-03-05T00:43:43.000Z"
    },
    {
      "author": "Oz",
      "body": "Good call on the member ticket price and restriction.  Are you going to date the Cinebar coupons?  Make them expire each month?  Otherwise, people could save up!",
      "created_at": "2005-03-05T02:44:23.000Z"
    },
    {
      "author": "Nate",
      "body": "I know whatever I date ends up expiring within the month.\r\n\r\nBa-dum Bom.",
      "created_at": "2005-03-05T04:51:15.000Z"
    },
    {
      "author": "Chuck",
      "body": "I wish I lived close enough to visit more than once a year...",
      "created_at": "2005-03-05T12:46:40.000Z"
    },
    {
      "author": "bjork24",
      "body": "The coupons will have expiration dates.",
      "created_at": "2005-03-05T23:29:43.000Z"
    },
    {
      "author": "Aaron",
      "body": "No one was there when I stopped by yesterday. What gives? Where's my Moxie?",
      "created_at": "2005-03-07T00:45:52.000Z"
    },
    {
      "author": "bjork24",
      "body": "What time did you stop by? We were there for quite awhile... in fact, I'm getting ready to head back over there in about an hour.",
      "created_at": "2005-03-07T01:05:01.000Z"
    },
    {
      "author": "Caleb",
      "body": "Can't wait for Moxie to open up. I wish you the best of luck. By the way, I'm the current webmaster for SMSU's Film Society and was wondering if I could use one of your logo's to put a link on the website (filmsociety.smsu.edu). Thanks!",
      "created_at": "2005-03-07T03:22:34.000Z"
    },
    {
      "author": "steph v.",
      "body": "You were in my dream last night. I had to grade a construction proposal letter and you didn't do it but I couldn't give you an F because you were my brother-in-law so I gave you a D+ and I got in BIG trouble. Way to go. Next time just do your construction homework.",
      "created_at": "2005-03-07T19:05:41.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
