{
  "id": 163,
  "title": "I love Bjork",
  "body": "There's simply not enough hours in the day, I tells ya. As we get closer and closer to opening day, I find that I have fewer and fewer free hours to surf internet porn and play Tetris. It's ridiculous! Today is particularly busy, so this post is going to be comprised of several little blurbs... each one better and/or worse than the last.\r\n\r\n<b>CAFFEINE!</b>\r\n\r\nI'm so busy that I don't even have time to drive down the road to buy my daily dose of Dr. Pepper. Instead, I'm drinking a half-empty bottle of Diet Pepsi that one of my parents left in the back of our refrigerator in early January. Now that's what I call BUSY!\r\n\r\n<b>Gettin' plastered</b>\r\n\r\nMy dad and I finished plastering the West wall (not to be confused with the West Wing) yesterday. I never knew slinging mortar could be so fun! Also, a big thanks to <a href=\"http://www.sweetwaterabilene.com\" target=\"_blank\" class=\"broken\">J.R.</a> for dropping by to lend a hand on Saturday. THANK YOU!\r\n\r\n<b>Where are we on the building permit?</b>\r\n\r\nGood question. I was instructed to go <a href=\"http://www.ci.springfield.mo.us/webapps/permitstat/detail.jsp?caseno=BLD2005-00275\" target=\"_blank\" class=\"broken\">here</a> to find out. Don't let the Health Department's comments scare you... that's all being remedied with an addendum that should be submitted today. I hope.\r\n\r\n<b>Check out the budget sheet</b>\r\n\r\nWhy? Because 1) I added some new CLICKABLE buttons, 2) it will soon have many, many more little items added to it, and 3) one of my readers was kind enough to purchase the 65mm Cinemascope lens for us (Thanks Shannon!). Isn't that a great?! The answer is yes. It's very, very, VERY great.\r\n\r\n<b>Our first marketing campaign</b>\r\n\r\nPrinter cartridges - $40\r\nNice thick paper and lickless envelopes - $18\r\n200 John Wayne stamps - $74\r\nHaving Triscuits and a half-empty Diet Pepsi for lunch - Pathetic\r\n\r\nSeriously though, our first big marketing campaign is about to hit the streets. Instead of sending out letters urging people to buy advertising space from us, we're just going to send out a brief introductory letter that tells locally owned, downtown businesses a little about the Moxie and gives them a channel to contact us with questions regarding cross-promotions, advertising, sponsorships, or anything else they'd like to discuss. At this point in the game, I think well-forged relationships with our downtown neighbors are worth more than a few monthly pre-show contracts.\r\n\r\n<a href=\"http://www.wellfedhead.com\" target=\"_blank\" class=\"broken\">Mike</a>: We saw you at the post office yesterday... thanks for the nice quote in Nathan's upcoming article! For those of you who have no idea what I'm talking about... you soon will.\r\n\r\n<b>F---ing server</b>\r\n\r\nIt looks like my server's back up. They did some stuff to one of the deals where my junk was stored, and now the thing is working pretty good... er, well. Pretty well. I almost had to jump ship and take my hosting business somewhere else. Is somewhere one word? It should be.\r\n\r\nOk, my pre-alloted 15 minutes of blog writing time is up. I'm going to go buy a Dr. Pepper now.\r\n\r\nPS - Keep your eyes out for a new phlog or two in the near future.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-03-08T22:26:54.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "J.R.",
      "body": "Somewhere is one word, come in my son to the vocabulary master's lair.",
      "created_at": "2005-03-08T22:54:37.000Z"
    },
    {
      "author": "bjork24",
      "body": "You'd never guess I have my degree in English and Linguistics.",
      "created_at": "2005-03-08T23:16:39.000Z"
    },
    {
      "author": "Chuck",
      "body": "Sounds like you're keeping busy, Dan. Make sure to leave a time capsule plastered up in the walls for when you expand into a Googoloplex. : )",
      "created_at": "2005-03-09T01:10:26.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Just how close to 'Open' are you?",
      "created_at": "2005-03-09T01:18:23.000Z"
    },
    {
      "author": "Fyse",
      "body": "I like the optimistic 'donate' button next to &dollar;22,734.70. That'd certainly be sweet, wouldn't it?! Unfortunately, I'll be lucky if I can even eat by the end of this term, let alone throw money at other people...",
      "created_at": "2005-03-09T05:06:01.000Z"
    },
    {
      "author": "Fyse",
      "body": "Ok, so that's not the html code for the dollar sign. Should have looked it up.",
      "created_at": "2005-03-09T05:06:44.000Z"
    },
    {
      "author": "steph v.",
      "body": "Hi Dan. ",
      "created_at": "2005-03-09T19:07:23.000Z"
    },
    {
      "author": "justin",
      "body": "Hi Dan.",
      "created_at": "2005-03-09T19:18:49.000Z"
    },
    {
      "author": "nicole",
      "body": "After 8 miserable hours of stuffing envelopes yesterday for a temp job, I'm ready for our first marketing mail piece. I learned a great technique on how to stack envelopes. \r\n\r\nI'm awesome.",
      "created_at": "2005-03-09T20:08:27.000Z"
    },
    {
      "author": "bjork24",
      "body": "Chuck: I was planning on leaving a time ziploc, as opposed to a time capsule.\r\n\r\nStephanie: Close.\r\n\r\nFyse: When we come to England, you can show us around the town. That will be your donation.\r\n\r\nHi Stephy.\r\n\r\nHi Justin.\r\n\r\nNicole: You're awesome.",
      "created_at": "2005-03-09T20:17:38.000Z"
    },
    {
      "author": "Beavis",
      "body": "I love you.",
      "created_at": "2005-03-09T23:48:09.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
