{
  "id": 165,
  "title": "Moxie Marketing Missive, Part I",
  "body": "This post will remain hidden until AFTER the letter has been sent. Please take a moment to look it over and leave a comment. Ask yourself, \"what would I think if I was a downtown business and received this in the mail?\" Does the letter come off as too unprofessional, cocky, and/or awesome? I was going for a jovial, friendly tone that reflects the personality of the Moxie, and of Nicole and I. Tell me, honestly, what do you think...<br/><br/>- - - - - - - - - - - - - - - - - - - - - - -<br/><br/><b>Business name</b><br/>Business address<br/>Springfield, MO 65807<br/><br/><br/>Dear downtown business owner,<br/><br/>How many times have you found yourself thinking, “I really wish there was a cozy little theater down on Walnut called Moxie Cinema.” Once a day? Twice? All the time, you say?! Well, my friend, your wish is about to come true.<br/><br/>Moxie Cinema, or simply The Moxie, will be opening its doors at 408 West Walnut in the very near future (we're keeping the real opening date a surprise). Perhaps we'll be opening right next to your business, or several blocks away, but before we do, we'd like to take a moment to introduce ourselves and express our interest in collaborating with your business.<br/><br/>One of our main goals as an independent, community-oriented movie theater will be to affiliate ourselves with as many downtown businesses as possible. Whether that be through offering a unique advertising medium for locally owned businesses; working side-by-side on a cross-promotional venture; or simply stopping by for a quick hello, we'd love to hear from you.<br/><br/>Being locally owned and operated ourselves, The Moxie will be able to offer much more than a typical corporate-run movie theater, for both our customers and our business affiliates. If you'd like to learn more about our theater, or see some of the ways we'd like to collaborate with your business, you can visit us online at MoxieCinema.com. Or, if you'd rather speak in person, please feel free to contact Dan directly at 555.867.5309 or via e-mail at Dan@MoxieCinema.com.<br/><br/>With the help of unique businesses like your own, we hope to become an integral part of the downtown experience. Thank you.<br/><br/>Sincerely,<br/><br/>Dan and Nicole Chilton<br/>Moxie Cinema, owners",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-03-09T21:49:35.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Stephanie",
      "body": "I think it's good.  I wouldn't change anything.  It does have a light and friendly tone...and with all the crap I get in the mail these days, a letter like this would be the proverbial breath of fresh air.  <br/>For the first time ever, I find myself wishing I'd taken my ex-boss's offer to work in sales (in addition to everything else I was doing) at the station, so I could be of more help to you guys!",
      "created_at": "2005-03-09T22:18:44.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Stephanie!",
      "created_at": "2005-03-09T22:33:02.000Z"
    },
    {
      "author": "steph v.",
      "body": "It reads well. When you say you're keeping the opening date a suprise, do you think the business owners will take that literally?<br/><br/>But I think it will get local owned businesses excited to collaborate specials/food/advertisments. <br/><br/>Good luck!",
      "created_at": "2005-03-09T23:11:21.000Z"
    },
    {
      "author": "bjork24",
      "body": "That part was used to build suspense and excitement!",
      "created_at": "2005-03-09T23:15:32.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Dan, I think this is a great missive, and I think most of the downtown businesses--especially the newer ones--will be eager to work with you.  The tone is just right, and conveys the Moxie moxie perfectly and appropriately.<br/><br/>One thing: I think you need more about \"leveraging intraneighborhoodal synergies\" in the third paragraph.  Just kidding.<br/><br/>No but seriously, I (apparently) have a lot of comments:  I did have to read that third paragraph (\"One of our main goals\") over twice before I got it.  Maybe it's just me, but it feels a little unclear.<br/><br/>I don't have any concrete suggestions on how to fix it, but my overall impression of the letter is that I wish there were some more explicit examples of what kind of cross-promotion or affiliations you are looking for.  Something to peak my interest as I'm reading your letter looking for the benefit to my downtown business.  And including something more concrete might help clear up that paragraph.<br/><br/>Relatedly, when you point me to MoxieCinema.com to \"learn more\" or \"see some of the ways\" to collaborate, well, there's nothing except the teaser at MoxieCinema.com.  Should you point to some page that lists your ideas for collaborations and advertising, instead?<br/><br/>Oh, and one last picky thing.  In the opening paragraph, you say \"I really wish there was a cozy little theater down on Walnut\".  I'm a downtown business owner who hasn't heard about the Moxie yet.  When I read \"theater\" I think the Landers.  I think you should change it to \"movie theater\" unless that rubs you the wrong way.<br/><br/>But seriously, great letter.  I think you've set the tone and spelled things out very well.  You're going to get a great response!",
      "created_at": "2005-03-09T23:41:10.000Z"
    },
    {
      "author": "Fyse",
      "body": "Personally, I love the opening paragraph, but who knows what a grumpy git might make of it? Then again, I don't think you should be worrying about the grumpy gits off this world. The Moxie is way too cool for them.<br/><br/>I reckon it's a great way to introduce yourself. Courteous and friendly, it'll also set people thinking. I bet people will be clammering to collaborate.<br/><br/>All in all, another resounding success for Mr Moxie's 'jovial, friendly tone'...",
      "created_at": "2005-03-09T23:44:12.000Z"
    },
    {
      "author": "bjork24",
      "body": "Dave: to answer your questions...<br/><br/>1. There will be a little link on MoxieCinema.com that will say, \"Are you a downtown business? Click here to learn more about collaborating with the Moxie.\"<br/><br/>2. I agree with changing \"theater\" to \"movie theater\" in the opeing paragraph.<br/><br/>Thanks for the suggestions!",
      "created_at": "2005-03-09T23:45:07.000Z"
    },
    {
      "author": "bjork24",
      "body": "Fyse: Thanks man!",
      "created_at": "2005-03-09T23:46:33.000Z"
    },
    {
      "author": "Justin",
      "body": "I wrote up a couple long paragraphs about what I didn't like about it, but after reviewing my comments, I found that I actually <i>did</i> like it, for the most part.<br/><br/>It gets the point across while coming across fairly laid back.  Similar business owners will probably notice.  I like it.",
      "created_at": "2005-03-10T00:05:31.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Justin.",
      "created_at": "2005-03-10T00:07:26.000Z"
    },
    {
      "author": "Tawny",
      "body": "   I love this as an introductory letter! It shows your personality and style people can expect to see at the Moxie. If someone doesn't like your letter, odds are they aren't the kind of people you want to do business with anyway.<br/>   My only suggestion would be to drop the word business from the last sentence of the second paragraph and then again in the second sentence (before the comma) in the fourth paragraph. I think it will make it more personal. You want to start a relationship with these people, not just their businesses.<br/>Good luck!",
      "created_at": "2005-03-10T02:23:05.000Z"
    },
    {
      "author": "bjork24",
      "body": "Good suggestions Tawny, thanks!",
      "created_at": "2005-03-10T02:48:49.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Having been a moxie blog reader for months, I like the opening paragraph.<br/><br/>As a potential business venture, I -hate- the opening paragraph.<br/><br/>While it features your personality, it also features a tone that is almost too casual. I think that cutting that paragraph out completely would only strengthen your letter and your message.<br/><br/>Remember the rule: 2nd draft = 1st draft - 10%. That looks like 10% to me.<br/><br/>Also, this sentence bugs me: \"Whether that be through offering a unique advertising medium for locally owned businesses; working side-by-side on a cross-promotional venture; or simply stopping by for a quick hello, we'd love to hear from you.\"<br/><br/>The phrase \"Whether that be through\" is just awkward and should be revised. Also, semicolons aren't really necessary (they rarely are). Here's a suggestion:<br/><br/>\"Whether that's through offering a unique advertising medium for your business, working side-by-side on a cross-promotional venture or simply stopping by for a quick hello, we'd love to hear from you.\"<br/><br/>Note I dropped the semicolons (they were unnecessary), dropped \"locally owned\" and rather for \"your business\" as it conveys a more business-like yet casual tone, and I took out the pause before \"or simply stopping by for a quick hello.\" This takes care of the semicolon problem.<br/><br/>Again, you're trying to set a casual tone here, but I think that paragraphs #2+ do that very well while keeping it business-oriented. The first paragraph makes it appear to be written by a \"fratboy whippersnapper\", as the Old Codge may say.<br/><br/>Good luck :)",
      "created_at": "2005-03-10T03:36:09.000Z"
    },
    {
      "author": "bjork24",
      "body": "Evan: great suggestions! Thanks for the help on the semi-coloned sentence... it's been beating me up all day. I know I should drop the first paragraph, but by golly... I... love... it. We're doomed, aren't we?! I'll consider it... heavily. One more ellipsis...",
      "created_at": "2005-03-10T03:41:00.000Z"
    },
    {
      "author": "Trint",
      "body": "I agree with the tips above, but want to especially nod to what Dave said about more concrete examples of marketing opportunities. Paint these people a (small) picture.<br/><br/>Other than that, spot on.",
      "created_at": "2005-03-10T09:45:10.000Z"
    },
    {
      "author": "Aaron",
      "body": "What Evan said about the semicolons. As for the tone, I'm afraid that it might seem a tad fake-friendly. It is supposed to be an introduction but all it seems to say is that you're looking for their business. I would figure that most of the downtown business owners have probably heard the basic story so far, so maybe use this opportunity as a chance to allow them to become more familiar with you, maybe personally? Like, say, \"gettin' fresh?\" I would figure a lot of the independent business owners down here had that entrepreneurial spirit in their earlier days – maybe tell them what gave you the dream to open your own downtown business. <br/><br/>Oh, and I've never dealt with it directly, but I've been told there is a lot of politics involved in downtown business. Hopefully this won't affect you much – or if it does, that you are on the advantageous side.<br/><br/>Anyway, I know you want it to be short and casual, but I think saying a little bit more would have a greater impact.",
      "created_at": "2005-03-10T10:12:15.000Z"
    },
    {
      "author": "Chuck",
      "body": "Light-hearted and friendly. I think it'll do well.",
      "created_at": "2005-03-10T21:28:55.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
