{
  "id": 166,
  "title": "The name dropper",
  "body": "I just got off the phone with Wes Wilson. \"Wes who?\", you ask. <a href=\"http://www.classicposters.com/eposter/showArtist.do?id=23932\" target=\"_blank\" class=\"broken\">Wes Wilson, the father of the '60s rock concert poster</a>. The man who single-handedly sparked a psychedelic art movement in San Francisco during the late 60s. Perhaps you'd recognize <a href=\"http://www.collectable-records.ru/images/post/wilson/\" target=\"_blank\">some of his work</a>. He also designed the poster for <a href=\"http://www.rogallery.com/wilson_wes/wilson-here-comes.htm\" target=\"_blank\">the Beatles last US concert</a>. Long story short, the guy is awesome... more awesome than ME even!\r\n\r\nSo, here's the chain of events that put me in touch with Wes:\r\n\r\n<ol><li>I had an interview with Kenny K., the editor of the <a href=\"http://www.cfpmidweek.com\" target=\"_blank\">CFP</a>.</li>\r\n<li>Kenny shows me one of his favorite CFP covers and tells me it was designed by Wes Wilson.</li>\r\n<li>Turns out Wes lives just outside Springfield, immediately making him the most famous regional artist around.</li>\r\n<li>I kindly ask for Wes's contact info.</li>\r\n<li>Kenny K. graciously complies.</li>\r\n<li>I call Wes.</li>\r\n<li>Wes answers the phone.</li>\r\n<li>I blubber about how cool his posters are and tell him all about the Moxie.</li>\r\n<li>Wes is very excited about the Moxie and tentatively agrees to be our opening artist with an exhibit of his famous posters (of course, due to security concerns, the posters won't be originals).</li>\r\n<li>I jump up and down and daydream about having a Wes Wilson original Moxie poster... perhaps for the Moxie t-shirts.</li></ol>\r\nSo that's that. Wes and I are going to discuss the terms and hopefully come to an agreement that will be beneficial for both of us. Woo hoo! I'm gushing with excitement!\r\n\r\nI better go clean up.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-03-10T22:57:15.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Stephanie",
      "body": "Oh, my god.  First, I *knew* who Wes Wilson was.  Second...Oh, my god!  His work is amazing, and such a huge part of music history.  Having prints of his posters up will give the Moxie a very cool vibe...congrats!",
      "created_at": "2005-03-10T23:18:01.000Z"
    },
    {
      "author": "whitty",
      "body": "That is f'in awesome!  I don't think I can express in a tiny comment box how awesome that is!  I am thrilled for the Moxie!  So many exclamations!!!",
      "created_at": "2005-03-10T23:28:41.000Z"
    },
    {
      "author": "Nate",
      "body": "Wow.  That is unbelievably cool.  News just keeps getting better, but this kind of tops everything.  Could the Moxie motif now get that sort of typical Dead poster look?  Advance order for a T-shirt right here.  Ballcap too.",
      "created_at": "2005-03-10T23:34:59.000Z"
    },
    {
      "author": "whitty",
      "body": "I called my dad to tell him about the Wes Wilson posters.  You are so down with the over-fifty set.",
      "created_at": "2005-03-11T00:02:58.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Oh, so that's the guy who created the \"flowy words\" as it were. Very cool stuff. Talk about Moxie going retro, nothing would solidify its hipster status more than that.",
      "created_at": "2005-03-11T01:04:11.000Z"
    },
    {
      "author": "Beavis",
      "body": "Can he tattoo my ass?",
      "created_at": "2005-03-11T01:21:50.000Z"
    },
    {
      "author": "bjork24",
      "body": "Now that everyone is so excited, watch Wes back out... that would suck.",
      "created_at": "2005-03-11T01:40:13.000Z"
    },
    {
      "author": "Aaron",
      "body": "So I've been usurped?",
      "created_at": "2005-03-11T01:42:25.000Z"
    },
    {
      "author": "bjork24",
      "body": "No, Aaron, you haven't been usurped. You're still in charge of making the super secret Moxie opening poster. All I want is one Moxie poster out of Wes... sometime in the future. You're still our poster go-to guy.",
      "created_at": "2005-03-11T01:44:00.000Z"
    },
    {
      "author": "Justin",
      "body": "Did you talk in a really high-pitched voice when you were on the phone with him?",
      "created_at": "2005-03-11T02:11:32.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yes.",
      "created_at": "2005-03-11T02:26:18.000Z"
    },
    {
      "author": "nicole",
      "body": "So when do we talk about t-shirt slogans?",
      "created_at": "2005-03-11T02:33:32.000Z"
    },
    {
      "author": "Dave",
      "body": "very very cool. you realize this probably puts you, like, two degrees of separation from some of the most influential gods of rock? which would make you a demidemigod of rock.",
      "created_at": "2005-03-11T11:28:08.000Z"
    },
    {
      "author": "Aaron",
      "body": "So this guy, you can just call him up? Cuz I read the CFP article about him and thought it was awesome. I'm sure he could teach me a few things.",
      "created_at": "2005-03-11T12:50:48.000Z"
    },
    {
      "author": "Aleah Marie",
      "body": "As the webmaster for Wes Wilson's website, may I direct you to: http://wes-wilson.com?\r\n\r\nAnd, yes, Wes is very cool.  Very down-to-earth and completely unassuming.  Drop by his site and say hi.  ;)",
      "created_at": "2005-09-30T00:49:52.000Z"
    },
    {
      "author": "buy online",
      "body": "about buy pharmacy online",
      "created_at": "2006-03-14T14:25:58.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 7,
      "name": "Lists"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
