{
  "id": 167,
  "title": "The wheels on the bus go pop, shhhhhh, blam, scratch, scratch, scratch, EEEEEEEE, chchchchccccc, crunch!",
  "body": "There used to be a time when I thought securing our loans was the most difficult part of this project. Ha ha ha! Ah, to be that naive again. \"Obtaining the building permit\" has taken \"securing our loans\" and broken it over it's knee. I can't believe what a convoluted, bogged down, life-draining process this has become. I hear stories that the city used to be a lot easier to work with... that they actually cooperated with new businesses to help them get their applications through in a timely manner. Those days are gone, man. Long freakin' gone.<br/><br/>Some of the hang-ups we've encountered have been completely understandable and acceptable (like the electrical and HVAC upgrades), but the newest set of clarifications that were sent by the city... I mean, COME ON!<br/><br/><i>BUILDING CODE: 1. Fire dampers are needed in ducts penetrating rated walls (716.5). 2. Additional exit lights are needed at auditorium and front door (1011). 3. Provide means of egress and auditorium lighting control in the projection room (409). PLUMBING CODE: 1. Provide detail plan and riser diagrams for water supply, drain and vent. ELECTRICAL CODE: 1. Provide a description of the equipment to be installed in the projection room and confirm compliance with NEC Article 540 (see 540.11, and 540.13 through 540.21 in particular).</i><br/><br/>First of all, the lighting control is clearly marked as being in the auditorium - look again, buddy! Do the building code issues seem trivial to anyone else? YES, we need all those things, and YES we will make sure the building meets those requirements, but why, why, WHY do we have to hold up the building permit until we write on a piece of paper, \"one exit sign in auditorium, and one at front door!\" I can't help buy wonder, would we be having these puny little problems if we knew the right people... or greased the right wheels?<br/><br/>I don't know, maybe it's just my raised-on-movies experience that has taught me to be mistrustful of corrupt city officials... or maybe it's the fact that I'm so eager to get this project up and on its feet that I'd kick a pigeon (Walker Texas Ranger style) to see it through. AAAAGGGGGHHHHHHHHH! That's me yelling like a cartoon to express my frustration. Didn't Charlie Brown used to yell like that? I think he had an \"R\" somewhere in his yell.<br/><br/>Phew. I feel a little better now.<br/><br/>I have an appointment at 9:30 to go look at some high-end digital projectors at a local AV dealer showroom on the South side of town, so I better go get ready. With the electrical and HVAC upgrades aside, the digital projector may very well end up being our biggest single purchase (~$5,000)... but at least we budgeted for it.<br/><br/>Nicole is busy folding our marketing letters and stuffing them into envelopes. We're planning on mailing them tomorrow so all the downtown businesses will receive them on Monday. Thanks again to all the readers who helped us edit and tweak our letter - I think it sounds much better now.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-03-11T20:06:27.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "Wow, so Nicole ahs to stuf envelopes at her temp job AND at home??  I'm sorry, Nicole. :(",
      "created_at": "2005-03-11T20:49:50.000Z"
    },
    {
      "author": "justin",
      "body": "Upon further review of my earlier comment, yes, I am indeed an idiot.  ahs = has, and stuf = stuff.",
      "created_at": "2005-03-11T20:50:24.000Z"
    },
    {
      "author": "nicole",
      "body": "It's ok. I just finished. It only took 2 hours and 19 minutes (as opposed to the 8 hours I did the other day). So now I can make zucchini bread! Does anyone want some? Dan won't eat it.<br/><br/>",
      "created_at": "2005-03-11T21:50:09.000Z"
    },
    {
      "author": "justin",
      "body": "mmmm... I do! and I'm sure Kelley does.  Last night I attempted to make some home-made Bangkok fried rice and it actually turned out OK!",
      "created_at": "2005-03-11T22:48:46.000Z"
    },
    {
      "author": "nicole",
      "body": "Ooh, yum. The zucchini bread didn't turn out so well. I'm blaming the oven. Not all the substitutions I had to make.",
      "created_at": "2005-03-11T23:18:31.000Z"
    },
    {
      "author": "Aaron",
      "body": "Justin:: I owe you some money (this is the only place I ever \"run into\" you). I'll get it on its way.",
      "created_at": "2005-03-12T01:15:32.000Z"
    },
    {
      "author": "Aaron",
      "body": "Oh, and I'd love some bread! And I will be at the SSLYBY show tonight and the TTAT release party tomorrow. You should come to the show I'm running on Sunday! My friend Nathaniel is playing, and I know he'd be great for some preshow music.<br/><br/>Speaking of which, when do you want me to actively be doing things in my role as Moxie Music Manager or whatevs? I've been mentioning it to people as a possibility but that's it.",
      "created_at": "2005-03-12T01:17:54.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "For some reason the word \"whatevs\" gives me the creeps. Let's move on.<br/><br/>Dan, can you post the letter going out? Or are you waiting for Monday after they're sent?",
      "created_at": "2005-03-12T03:13:18.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'm actually waiting until later in the week, after everyone's received them in the mail.",
      "created_at": "2005-03-12T03:15:28.000Z"
    },
    {
      "author": "Oz",
      "body": "Sorry you're having such a sucky time, but it's hardly surprising considering that you have to work with THE MAN.  I hate trying to get anything done through government agencies!  Good luck, my friend.",
      "created_at": "2005-03-12T17:39:21.000Z"
    },
    {
      "author": "J.R.",
      "body": "Here's hoping.",
      "created_at": "2005-03-13T01:30:47.000Z"
    },
    {
      "author": "Jo",
      "body": "Just stumbled across this epic blog and am now sickeningly in need of a Moxie t-shirt even though I live in England. Building code schmuilding code. You'll get there! I'm in awe of your incredible tenacity and general dream-following. That sounds sucky but I mean it. Maybe one day my own dear neighbourhood will have an arthouse cinema with a cool name. That does t-shirts. Mmm t-shirts.",
      "created_at": "2005-03-14T02:49:39.000Z"
    },
    {
      "author": "steph v.",
      "body": "Deep breaths...",
      "created_at": "2005-03-14T20:51:37.000Z"
    },
    {
      "author": "Robin",
      "body": "I think \"AUGH\" is the canonical Charlie Brown spelling, not counting any optional repetitions.",
      "created_at": "2005-03-15T00:09:17.000Z"
    },
    {
      "author": "Fyse",
      "body": "Just took a look at the info page for downtown businesses. Very impressive, and I love the little link picture on the main page.",
      "created_at": "2005-03-15T04:15:37.000Z"
    },
    {
      "author": "bjork24",
      "body": "Fyse... shhhhh! You're won't supposed to reveal that yet!",
      "created_at": "2005-03-15T04:20:08.000Z"
    },
    {
      "author": "Fyse",
      "body": "Whoops. I assumed you'd sent out the letters!",
      "created_at": "2005-03-16T02:42:36.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
