{
  "id": 168,
  "title": "Sweet and Sour",
  "body": "It's been an eventful weekend + Monday. Here's the things that made it sweet:<br/><br/><b>Moxie jingle revealed!</b><br/><br/>Mr. J.R. Top of <a href=\"http://www.sweetwaterabilene.com\" target=\"_blank\" class=\"broken\">Sweetwater Abilene</a> has written, composed, and recorded the Moxie Jingle. The jingle features drums, a guitar, a cow bell, multiple instances of J.R.'s voice, and a hilarious ending that's reminiscent of Wehrenberg Theatre's jingle. If you've never heard Wehrenberg's pre-show jingle, you're missing out. BIG TIME! If you'd like to hear the MOXIE jingle, you can download the MP3 in either a .ZIP or a .RAR format. Where, you ask? Right HERE:<br/><br/><a href=\"/pix/mp3/Moxie Theme Song.zip\">ZIP format</a><br/><a href=\"/pix/mp3/Moxie Theme Song.rar\">RAR format</a><br/><br/>Please NO direct or hotlinking!<br/><br/><b>Moxie cookies eaten!</b><br/><br/>Big thanks goes out to <a href=\"http://macfan77.blogspot.com/\" target=\"_blank\" class=\"broken\">Stephanie B.</a> of Tennessee for the delicious Moxie cookies she sent to us. Here's a couple shots of the tasty branded treats:<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/8_cookie14ey.jpg\" width=\"425\" /><br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/9_cookie23zl.jpg\" width=\"425\" /><br/><br/>I think there's only 2 left. They were mmmmm, mmmmm, mmmmm marvelous!<br/><br/><b>Hello Make Magazine blog readers</b><br/><br/>For those of you who don't know what <a href=\"http://make.oreilly.com/\" target=\"_blank\">Make Magazine</a> is, allow me to explain: it's the coolest magazine in the whole entire world! Seriously. It's like <a href=\"http://www.readymademag.com/\" target=\"_blank\">ReadyMade</a> for tech nerds, which I will proudly admit to being. The magazine is published by the O'Reilly Publishing Group, whose computer books are most recognizable for their covers featuring drawings of various animals, among other things.<br/><br/>ANYWHO, long story short, a <a href=\"http://www.makezine.com/blog/archive/2005/03/making_a_movie.html\" target=\"_blank\">link to this blog</a> has miracuously appeared on the <a href=\"http://make.oreilly.com/blog/\" target=\"_blank\">Make Magazine Weblog</a>! AMAZING! I couldn't be more stunned and flattered... unless, of course, you were to shoot me with a stun gun while telling me how beautiful my eyes are.<br/><br/>Welcome Make Weblog readers! Please feel free to look around, leave comments, and visit the <a href=\"/posts/budget.php\" class=\"broken\">BUDGET SHEET</a> where you can unburden yourself of all those useless dollars you have lying around the house. Wee Haa!<br/><br/><b>Speaking of the budget sheet</b><br/><br/>We've had a surge of donations over the last week... as in FOUR equipment donations - SIX if you count the cookies and the theme song. I'd like to express my most sincere thanks to each and everyone of our donors. I'm going to return the favor... whether it be in this life or the next, your generosity will be repaid. If you'd like to see who donated what, check out our <a href=\"/posts/budget.php\" class=\"broken\">BUDGET SHEET</a>. Thank you, thank you, thank you!<br/><br/><b>Moxie T-Shirts</b><br/><br/>There's seems to be a genuine demand for some non-Cafe Press Moxie T-Shirts. This trend has been noted and a Moxie T-Shirt Slogan Submission Contest, also known as a MT-SSSC, will be occurring in the near future. Stay tuned for more details.<br/><br/><b>That good ole marketing letter</b><br/><br/>As promised, the marketing letter will be revealed on Wednesday... maybe sooner... maybe later. If you'd like to see the informational website we created to introduce ourselves to the other downtown businesses, go to <a href=\"http://www.moxiecinema.com\" target=\"_blank\">our main page</a> and click the cool new button.<br/><br/><b>We went to St. Louis</b><br/><br/>We met with our equipment dealer, fondled the projectionary goods, and visited with our ex-comrades back in the corporate work camp. Stay strong my friends... stay strong!<br/><br/><b>A big teller window<br/> with an awesome old microphone that looks like something out of a boxing ring</b><br/><br/>That's what we found behind the mysterious door at the back of the prep room. More pictures to follow.<br/><br/><b>And here's the sour</b><br/><br/>I wish I could end the post here, with only good news and cheerful thoughts, but unfortunately, I can't. We lost a family member this weekend. His death was sudden and tragic, and the only reason I'm mentioning it here is because I know his wife and kids read this blog. If you guys need anything, Nicole and I are here for you.<br/><br/>The last time I saw him was at the theater about a month ago. He had stopped by to give us advice on installing the concession drain and offered his help in digging the trench. I told him we'd call once the main construction work started up. As he was leaving, he told Nicole and I how proud he was of us for going out on a limb and trying something like this. I think you guys will do great, he said.<br/><br/>He will be missed.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-03-15T06:30:04.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "erin",
      "body": "a++ on the theme song.",
      "created_at": "2005-03-15T07:25:16.000Z"
    },
    {
      "author": "erin",
      "body": "jingle! i mean jingle!!!",
      "created_at": "2005-03-15T07:26:03.000Z"
    },
    {
      "author": "bjork24",
      "body": "Jingle = theme song.",
      "created_at": "2005-03-15T07:38:06.000Z"
    },
    {
      "author": "justin",
      "body": "I'm going to make some Moxie-branded Thai chicken fried rice and send it to you.",
      "created_at": "2005-03-15T07:46:01.000Z"
    },
    {
      "author": "bjork24",
      "body": "Sounds good to me.",
      "created_at": "2005-03-15T08:10:20.000Z"
    },
    {
      "author": "Ole",
      "body": "Now that you've been Made, when is Nicole going to try some Location based Dog video?   For the opener possibly?",
      "created_at": "2005-03-15T08:18:06.000Z"
    },
    {
      "author": "bjork24",
      "body": "We've got the dog... just waiting for a location.",
      "created_at": "2005-03-15T08:19:46.000Z"
    },
    {
      "author": "Aaron",
      "body": "Well...I've designed logos that went on tshirts and tank tops and stickers and patches and visors and boats and gigantic red vinyl banners, but never cookies! <br/><br/>And the jingle is reeeeeediculous. I like it. Still, c'mon, some horns!",
      "created_at": "2005-03-15T08:52:50.000Z"
    },
    {
      "author": "whittler",
      "body": "Theme song reminds me of that scene in Broadcast News where two guys are pitching an intro tune to the new show with just a keyboard. \"Big finiissshhhh - ba ba baaaarm!\"",
      "created_at": "2005-03-15T10:50:22.000Z"
    },
    {
      "author": "whittler",
      "body": "PS really sorry to hear about the dude who passed away. Sounded like a great guy.",
      "created_at": "2005-03-15T10:51:35.000Z"
    },
    {
      "author": "J.R.",
      "body": "You want horns, you come play 'em out of tune, you rogue you!",
      "created_at": "2005-03-15T19:10:34.000Z"
    },
    {
      "author": "steph v.",
      "body": "Sniff. Sniff sniff. Sniff.",
      "created_at": "2005-03-15T19:32:14.000Z"
    },
    {
      "author": "Nicki J",
      "body": "I had this thought today:<br/><br/>Rocky Horror Midnight Prop Showings.<br/><br/>Need I say more??<br/><br/>Come on! Springfield NEEDS this!! I know *I* need this!!",
      "created_at": "2005-03-16T00:24:50.000Z"
    },
    {
      "author": "bjork24",
      "body": "I've been warned by numerous theater owners... Do. Not. Show. Rocky Horror.",
      "created_at": "2005-03-16T00:32:52.000Z"
    },
    {
      "author": "Nicki J",
      "body": "Haha. Where's your sense of adventure? ;)",
      "created_at": "2005-03-16T00:45:54.000Z"
    },
    {
      "author": "Nate",
      "body": "How about a Michael Bay retrospective?  Bay's movies would go well with the Moxie \"vibe\" I think.",
      "created_at": "2005-03-16T01:02:38.000Z"
    },
    {
      "author": "Beavis",
      "body": "I am so in love with David Hasselhoff.  Please show some of his work and also the \"From Justin To Kelly\" movie.  I would then invite my two friends, Justin and Kelly from Columbia, to watch the movie with me.  Ooh, I can't wait!",
      "created_at": "2005-03-16T01:11:54.000Z"
    },
    {
      "author": "Oz",
      "body": "Cool theme song.  Are you going to create some animated popcorn and beer people to dance across the screen while you play the theme song?",
      "created_at": "2005-03-16T01:31:49.000Z"
    },
    {
      "author": "bjork24",
      "body": "Oz: You better believe it!",
      "created_at": "2005-03-16T01:32:26.000Z"
    },
    {
      "author": "Nate",
      "body": "Paul Verhoeven? Robocop and Basic Instinct?  <br/>Anybody?  <br/>No? Okay.",
      "created_at": "2005-03-16T01:47:20.000Z"
    },
    {
      "author": "Fyse",
      "body": "There's a society in Cambridge dedicated to screening Rocky Horror every year, the entire audience in full costume, and with a cast of people in front of the screen acting out the entire film, word for word with perfect timing. I have not witnessed this, and I'm pretty sure I don't want to...",
      "created_at": "2005-03-16T02:54:41.000Z"
    },
    {
      "author": "Jamie",
      "body": "I want a cookie!  Can you tell that Adam and I are doing South Beach diet again and there is no sugar allowed!  <br/><br/>We will be in Springfield this weekend.  Maybe just maybe we can see you guys, and Louise can see Bogart again!",
      "created_at": "2005-03-16T06:06:22.000Z"
    },
    {
      "author": "Beavis",
      "body": "Dan, please remove the cookie pictures!  I am getting so hungry and jealous!  Please!",
      "created_at": "2005-03-17T23:27:20.000Z"
    },
    {
      "author": "Jamie",
      "body": "Beavis, who are you?  Don't you realize no one likes you!  Maybe butthead, but who cares about him!",
      "created_at": "2005-03-18T01:12:56.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
