{
  "id": 169,
  "title": "The one with all the submissions",
  "body": "First, if you haven't already noticed, there are two new phlogs waiting patiently in the sidebar. Go to them. GO!<br/><br/><b>Trivia Slides</b><br/><br/>I think it would be fun to pepper the pre-show ads with some Moxie flavored trivia slides. What do you think? Here's the kind of stuff I have in mind:<br/><br/><i>Click to enlarge</i><br/><br/><a href=\"http://moxie.danchilton.com/pix/grum/0_slide12eh.gif\"><img src=\"http://moxie.danchilton.com/pix/grum/1_slide1small7zz.gif\" width=\"425\" border=\"0\"/></a><br/><br/><a href=\"http://moxie.danchilton.com/pix/grum/2_slide26rs.jpg\"><img src=\"http://moxie.danchilton.com/pix/grum/3_slide2small2ew.jpg\" width=\"425\" border=\"0\"/></a><br/><br/><a href=\"http://moxie.danchilton.com/pix/grum/4_slide43ms.gif\"><img src=\"http://moxie.danchilton.com/pix/grum/5_slide4small2ui.gif\" width=\"425\" border=\"0\"/></a><br/><br/><a href=\"http://moxie.danchilton.com/pix/grum/6_slide36lj.jpg\"><img src=\"http://moxie.danchilton.com/pix/grum/7_slide3small0pc.jpg\" width=\"425\" border=\"0\"/></a><br/><br/>If you'd like to submit your ideas for Moxie slides, do so in the comments of this post. If it's good enough, and not overly offensive, it might just find it's way into the pre-show rotation.<br/><br/><b>T-Shirts</b><br/><br/>As I had mentioned in yesterday's post, it's high time for a Moxie T-Shirt. I'm thinking something along the lines of a small run, limited edition, only-for-blog-readers, totally awesome Moxie shirt! Logo on the front, blog address on the back... the trouble is, we need a catchy saying to accompany the logo. Nicole and I have argued back and forth over what the shirt should say, but we couldn't come to an agreement.<br/><br/>She wants: <i>Your mom goes to The Moxie.</i><br/>I want: <i>I'll Moxie your butthole!</i><br/><br/>Her slogan is an allusion to <i>Napoleon Dynamite</i>. Mine is just something I like to say.<br/><br/>SO, what should the 1st run of Moxie shirts say? Drop your submission into the comments section - along with any Moxie slide ideas - and we'll record them all on a piece of paper and then accidentally lose it somewhere in the backyard. The winning slogan will receive a <b>free Moxie T-Shirt</b> and a <b>printed picture of me packing the winning shirt into a box</b>!<br/><br/>Unfortunately, the person who submitted the slogan will receive nothing. Only the slogan is eligible to receive cool prizes. Perhaps you can talk the slogan into sharing the prizes with you... maybe. Maybe not.<br/><br/>That's all. Start submitting... NOW!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-03-16T02:35:25.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Justin",
      "body": "HAH.  Till and Bed's Journey Bogus.",
      "created_at": "2005-03-16T02:38:54.000Z"
    },
    {
      "author": "Justin",
      "body": "I also think you should pepper the pre-show with photos of people drinking and eating at the Cinebar, but make them overly cheesy.",
      "created_at": "2005-03-16T02:43:58.000Z"
    },
    {
      "author": "bjork24",
      "body": "That's a good idea.",
      "created_at": "2005-03-16T02:44:46.000Z"
    },
    {
      "author": "Allison",
      "body": "Here are some off-the-cuff ideas:<br/><br/>Tshirt ideas:<br/>-The Moxie: The New Black<br/>-The Moxie, where the amps turn up to 11<br/>-Everything's coming up Moxie!<br/><br/>Another fun theatre slide might be called Screen Shots where you ask how many cans of coke (or other object) the audience can find in some picture.  But then make the picture something totally obscure and without any hint of the object they're trying to find, like a random picture of a mountain lion or something.",
      "created_at": "2005-03-16T05:03:53.000Z"
    },
    {
      "author": "Jamie",
      "body": "I don't have any super great ideas, but seeing as I just celebrated pi day yesterday, maybe the shirt could say something about pie, or cake.  We all love cake.  Fat kids like cake, we love the moxie!",
      "created_at": "2005-03-16T05:45:35.000Z"
    },
    {
      "author": "Ben D.",
      "body": "The Moxie: Like a fat kid on an M&M!<br/>The Moxie: How much fried chicken can you eat?<br/>The Moxie: You know how I roll.",
      "created_at": "2005-03-16T06:20:39.000Z"
    },
    {
      "author": "Ben D.",
      "body": "(This one's lame, but obvious.) \"Show me The Moxie!\"<br/>\"It took Moxie to get this shirt.\"<br/>\"I have more Moxie in my shirt than you have in your entire body.\"<br/>\"The Moxie gots mad skills.\"<br/>\"Fact: Chicks dig The Moxie.\"",
      "created_at": "2005-03-16T06:36:10.000Z"
    },
    {
      "author": "Ben D.",
      "body": "I'm just posting them as they come to me... Although most of these submissions are awful.<br/><br/>\"There's no place like The Moxie.\"<br/>\"Do you know what they call a Quarter Pounder with Cheese at The Moxie? ... <br/>A Quarter Pounder with Cheese.\"",
      "created_at": "2005-03-16T06:52:29.000Z"
    },
    {
      "author": "justin",
      "body": "For the shirt, you could use the example sentance listed in the dictionary for <i>moxie</i>.  I kind of like it: <i>“His prose has moxie, though it rushes and stumbles from a pent-up surge.”</i>",
      "created_at": "2005-03-16T08:57:56.000Z"
    },
    {
      "author": "justin",
      "body": "And yes, I spelled <i>sentence</i> wrong.",
      "created_at": "2005-03-16T08:58:32.000Z"
    },
    {
      "author": "justin",
      "body": "And I f'd up my italic tags. FIX PLZ KTHX",
      "created_at": "2005-03-16T08:59:06.000Z"
    },
    {
      "author": "erin",
      "body": "i just thought i would say... drove by the moxie today. and saw the pretty red walls. looking very good. as good as something can look at 20/30 some odd mph.<br/><br/>i also thought i would say... my drawing teacher informed us that she might be showing some of her work there after you open... (duh. a not quite finished moxie might be a strange place for an exhibition.) and i think that is way neat. because jennifer is way neat. <br/><br/>so. yay!<br/>: )",
      "created_at": "2005-03-16T08:59:51.000Z"
    },
    {
      "author": "nicole",
      "body": "Great. Now we're ALL in italics. Thanks Justin.",
      "created_at": "2005-03-16T09:07:18.000Z"
    },
    {
      "author": "mat",
      "body": "</i>Are we all still leaning to the right?<br/><br/>I always liked: { Opening in late 2004, February, March SOON }, but you know, with all the lines through it.",
      "created_at": "2005-03-16T09:41:40.000Z"
    },
    {
      "author": "matt",
      "body": "I can't spell my own name!  It's the italics.  You should post a blank version of the Moxie slide as a template and let folks download it and make their own silly Moxie slides.  Sometimes an idea is just visual!",
      "created_at": "2005-03-16T09:43:02.000Z"
    },
    {
      "author": "Monica and Friends",
      "body": "To keep with the idea of incorporating quotes from films into the slogan for the t-shirt, my friends and I thought of a few ideas:  <br/>\"Go back to MOXIE, bitch.\" (Donnie Darko)<br/>\"The first rule of MOXIE is: You do not talk about MOXIE.\" <br/>\"You're not your f@!**ing MOXIE\"<br/>\"Jokers to the left of me, clowns to the right, here I am stuck in the MOXIE with you.\" (from Reservoir Dogs)<br/>\"Le MOXIE with cheese.\" (Pulp Fiction)<br/>\"Fat, drunk, and MOXIE is no way to go through life, son.\" (Animal House)<br/>\"Tina, you fat lard, come get some MOXIE!\" (Napoleon Dynamite)<br/>\"Vote for Moxie\" (take-off of Napoleon's 'Vote for Pedro' tee)<br/><br/>More to come...stay tuned...<br/>",
      "created_at": "2005-03-16T10:42:07.000Z"
    },
    {
      "author": "Doofus",
      "body": "FRONT: \"I want the MOXIE!!\"<br/>BACK: \"You can't handle the MOXIE!\"",
      "created_at": "2005-03-16T17:03:24.000Z"
    },
    {
      "author": "steph v.",
      "body": "Uh, anything with Napoleon will do it for me. I'd enter a submission, but I wouldn't win since I'm related to the owners and in a real world business, that's illegal.",
      "created_at": "2005-03-16T19:00:06.000Z"
    },
    {
      "author": "Nate",
      "body": "Y Tu Moxie Tambien.",
      "created_at": "2005-03-16T19:15:22.000Z"
    },
    {
      "author": "Andy",
      "body": "Poor people showing movies to rich people who pay them.",
      "created_at": "2005-03-16T19:21:30.000Z"
    },
    {
      "author": "justin",
      "body": "Moxie and Moxie's Moxie Moxie<br/><br/>Dan's favorite movie.",
      "created_at": "2005-03-16T19:28:16.000Z"
    },
    {
      "author": "jeff",
      "body": "\"I've sold The Moxie to Springfield, Shelbyville, and North Haverbrook, and it put them on the map.\"",
      "created_at": "2005-03-16T19:46:44.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Moxie: Changing Movies One Flick At A Time<br/><br/>I Saw A Great Movie At The Moxie And All I Got Was This Lousy T-Shirt.<br/><br/>In Soviet Russia, The Moxie Goes To You!<br/><br/>All Your Moxie Belong To Us (sorry, heavy geek references here, let's move on)<br/><br/>The Moxie: Theater Is As Theater Does<br/><br/>Crouching Movie, Hidden Moxie<br/><br/>The Only Real Currency In This Bankrupt World Is What We Share With Each Other At The Moxie<br/><br/>Full Metal Moxie<br/><br/>The Moxie: When Independent Gets Dependent<br/><br/>What Wilco Is To Music, The Moxie Is To Independent Cinema<br/><br/>The Moxie: A Dare To Be Great Situation<br/><br/>Okay, I'll quit now :)",
      "created_at": "2005-03-16T20:19:33.000Z"
    },
    {
      "author": "J.R.",
      "body": "Moxie Chops.<br/><br/>That's all.",
      "created_at": "2005-03-16T20:31:34.000Z"
    },
    {
      "author": "Nate",
      "body": "Miracle on Walnut Street.",
      "created_at": "2005-03-16T21:36:43.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ha ha! These are great. Keep them coming!",
      "created_at": "2005-03-16T21:37:39.000Z"
    },
    {
      "author": "Nate",
      "body": "Bad Boys II:  Now playing somewhere that is not The Moxie.",
      "created_at": "2005-03-16T21:39:28.000Z"
    },
    {
      "author": "justin",
      "body": "He asked me to forcibly insert the Moxie into my anus!",
      "created_at": "2005-03-16T21:55:49.000Z"
    },
    {
      "author": "Caleb",
      "body": "I really like Monica (and friends) idea for \"The first rule of Moxie is: You do not talk about Moxie!\"<br/><br/>I think using Napoleon Dynamite on anything would be good marketing since it's so damn popular right now and more people would recognize where it's from as opposed to less popular indies. <br/><br/>A few of my suggestions:<br/>\"We'll always have Moxie.\" [Casablanca]<br/>\"Meet me in Moxie.\" [Eternal Sunshine]<br/>\"Oh for pete's sake, he's fleeing the Moxie! He's feeling the Moxie!\" [Fargo]<br/>\"For relaxing times, make it Moxie times.\" [Lost in Translation]<br/>\"Gee, I wish I had one of them Moxie machines.\" [Dr. Strangelove]<br/>\"Sometimes I doubt your commitment to Moxie.\" [Donnie Darko]",
      "created_at": "2005-03-16T22:41:33.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "I just want to say one word to you - just one word.... Moxie.<br/><br/>Moxie, for lack of a better word, is good.<br/><br/>Can I have 10,000 Moxies please? (Yeah, stupid, I know.)<br/><br/>Of all the picture shows in all the towns in all the world, she walks into mine. (my personal fave)<br/><br/>Forget it, Jake, it's Moxietown.<br/><br/>All work and no Moxie makes Jack a dull boy (repeat across front and back)<br/><br/>And a few of my own...<br/><br/>The Moxie: Now Keanu Free!<br/><br/>Go to The Moxie! Because Beer Makes Every Movie Better<br/><br/>The Moxie: It's a soda! It's an independent theater! It's BOTH!<br/><br/>Uh, that's all I've got right now...",
      "created_at": "2005-03-16T22:49:00.000Z"
    },
    {
      "author": "Anemone",
      "body": "The Moxie:  Working to make southwest Missouri less desolate one film at a time.",
      "created_at": "2005-03-16T23:11:47.000Z"
    },
    {
      "author": "Oz",
      "body": "Since this a blog related t-shirt:<br/><br/>\"The Moxie:  I knew you when you were Cinema24\"<br/><br/>Of course, how many of your readers would be worthy of such a t-shirt?<br/><br/>Me!  Me!",
      "created_at": "2005-03-16T23:32:08.000Z"
    },
    {
      "author": "nicole",
      "body": "Ooh, we could use a lot of these on teaser posters around town prior to opening. ",
      "created_at": "2005-03-16T23:34:03.000Z"
    },
    {
      "author": "Oz",
      "body": "By the way, I found your \"Movie Word:  3. Rech\" to be exceedingly difficult.<br/><br/>And what do you mean that the munchkins were not played by the denizens of Oz?!  I beg to differ!  Each one of those actors was my denizen!  (You have no idea how long I've waited to use that sentence in context.)",
      "created_at": "2005-03-16T23:35:00.000Z"
    },
    {
      "author": "brian of moore",
      "body": "out of all the ones so far.. i enjoy jeff's simpsons version the best<br/><br/>for a slide.. you should show pictures of that beautiful sunshine coming in through the windows.. since it wont exist anymore <br/><br/>tshirt ideas:<br/><br/>front: <br/>Moxie Cinema<br/>small print: best viewed in firefox<br/>back: <br/>independent Cinema<br/>independent browser<br/><br/>.. yeah alot of words.. eh well<br/><br/>M0x13 ç1n3m4: ƒ0r £33+ v13w3r$<br/><br/>eh.. i got nothin",
      "created_at": "2005-03-17T00:24:45.000Z"
    },
    {
      "author": "Beavis",
      "body": "Heh, heh, heh, uh, Butthead, this Moxie sucks.<br/><br/>Looking for a good time, call the Moxie @ ? (then have it on a graphic of bathroom stall).<br/><br/>Can you pick out which of these don't belong (have a graphic of beautiful women and the moxie).",
      "created_at": "2005-03-17T00:31:10.000Z"
    },
    {
      "author": "nathan springer",
      "body": "The Moxie: dang dong<br/>The Moxie teaches the under privileged<br/>The Moxie wiped my butt when i was a child<br/>The Moxie: safe to bring home to the family<br/>The Moxie and Springfield, friends 4 life<br/>The Moxie is my cocaine <br/>i have to take a big hairy Moxie<br/>The Moxie loves bunnies",
      "created_at": "2005-03-17T00:48:50.000Z"
    },
    {
      "author": "brian of moore",
      "body": "slide suggestion:<br/><br/>http://www.uselessvoid.com/bored/robotsaftey.jpg",
      "created_at": "2005-03-17T01:59:24.000Z"
    },
    {
      "author": "Liz",
      "body": "There's a moxie-related line in \"Lost in Yonkers,\" but it probably wouldn't work on a t-shirt without a picture:<br/><br/>Jay: What's moxie?<br/>Louie: Tell him, Arty.<br/>(Arty rolls up his sleeves and motions for an invisible opponent to bring it on.)<br/>Arty (to Jay): <i>That's</i> moxie.<br/><br/>(I like Oz's idea, and substituting \"Moxie\" into film quotes.)",
      "created_at": "2005-03-17T02:06:16.000Z"
    },
    {
      "author": "Chuck",
      "body": "Front of t-shirt: The Moxie<br/>Back of t-shirt: \"We do it with an audience.\"<br/><br/>eh? eh?",
      "created_at": "2005-03-17T02:09:25.000Z"
    },
    {
      "author": "Justin",
      "body": "I think involving Benzo in the slide/shirt is pretty important to this whole endeavor.<br/>",
      "created_at": "2005-03-17T02:34:50.000Z"
    },
    {
      "author": "Slim",
      "body": "I think the munchkin slide would work better by cutting the \"... NOT by the denizens of Oz!\"<br/><br/>I started to laugh really hard the first time i read the whole slide, but that last bit stopped me with a groan.<br/><br/>Also, brian of moore's Johnny Five slide IS GOING UP ON SCREEN!  (and you gotta promise not to tell anybody, but \"Rehc\" took me about ten seconds)",
      "created_at": "2005-03-17T02:40:52.000Z"
    },
    {
      "author": "Justin",
      "body": "How about this for a slide?<br/><br/><a href=\"http://img38.exs.cx/img38/6298/moxie4mj.jpg\" target=_new\">http://img38.exs.cx/img38/6298/moxie4mj.jpg</a><br/>",
      "created_at": "2005-03-17T02:48:33.000Z"
    },
    {
      "author": "Nate",
      "body": "For slides:<br/>How 'bout photo-shopping The Moxie logo into famous scenes from movies? Onto articles of clothing, on the marquee above peoples heads, etc.<br/>I don't have the software...anyone else want to give it a shot?<br/>This very second I'm thinking of Maverick's helmet...<br/><br/>No, no! LUKE's helmet!",
      "created_at": "2005-03-17T03:00:54.000Z"
    },
    {
      "author": "Justin",
      "body": "Here's another one:<br/><br/><a href=\"http://i160.exs.cx/img160/1595/benzo3oc.jpg\" target=\"_new\">http://i160.exs.cx/img160/1595/benzo3oc.jpg</a>",
      "created_at": "2005-03-17T03:04:42.000Z"
    },
    {
      "author": "Justin",
      "body": "Here's a quick photoshop job based on Nate's idea:<br/><br/><a href=\"http://img162.exs.cx/img162/4597/fight2lj.jpg/\" target=\"_new\">http://img162.exs.cx/img162/4597/fight2lj.jpg</a>",
      "created_at": "2005-03-17T03:13:32.000Z"
    },
    {
      "author": "Ben D.",
      "body": "\"The Moxie was born a poor black child.\"<br/><br/>\"Lord loves The Moxie; don't trust whitey; see a doctor and get rid of it.\"<br/><br/>\"In Springfield, The Moxie is more dangerous than shotguns.\"<br/><br/>\"Let me tell you something my friend: The Moxie is a dangerous thing. The Moxie can drive a man insane.\"",
      "created_at": "2005-03-17T03:14:18.000Z"
    },
    {
      "author": "Justin",
      "body": "Ooops, try this one:<br/><br/><a href=\"http://img162.exs.cx/img162/4597/fight2lj.jpg\" target=\"_new\">http://img162.exs.cx/img162/4597/fight2lj.jpg</a>",
      "created_at": "2005-03-17T03:14:20.000Z"
    },
    {
      "author": "Nate",
      "body": "Sweet.<br/>As long as you're screwin' around with Ed Norton, how about replacing that big fat swastika tattoo in American History X with a big fat Moxie tattoo.  Eh?  EH?!!?",
      "created_at": "2005-03-17T03:24:05.000Z"
    },
    {
      "author": "Justin",
      "body": "Another quick 'n dirty photoshop job:<br/><br/><a href=\"http://img88.exs.cx/img88/3857/dead5kx.jpg\" target=\"_new\">http://img88.exs.cx/img88/3857/dead5kx.jpg</a>",
      "created_at": "2005-03-17T03:24:10.000Z"
    },
    {
      "author": "Nate",
      "body": "Shaun of the Dead.  Now you've done it.",
      "created_at": "2005-03-17T03:25:29.000Z"
    },
    {
      "author": "Nate",
      "body": "Dan, this has to be the fastest mixed media marketing campaign ever created for any business, like, ever.",
      "created_at": "2005-03-17T03:26:29.000Z"
    },
    {
      "author": "SSB",
      "body": "SSB says:<br/>\"Get your moxie<br/> at the MOXIE\"<br/>downtown Springfield, Missouri<br/>...Moxie tickets<br/>...Moxie T-Shirt<br/>...Moxie cookies<br/>...<br/>...<br/><br/>P.BB says:<br/>\"Moxie Moxs the spot\"<br/><br/>",
      "created_at": "2005-03-17T03:52:29.000Z"
    },
    {
      "author": "SSB",
      "body": "SSB pre-show ads says:<br/>\"The MOXIE supports local and regional talent -<br/>and their \"Big Break\"<br/>(i.e. film makers, artists)<br/>for more info inquire",
      "created_at": "2005-03-17T04:08:01.000Z"
    },
    {
      "author": "Jeremy",
      "body": "You can have the employees wear shirts that have the Moxie logo on the front and \"I've quit better jobs than this\" on the back.  I'm in a Ghostbusters mood, sue me.",
      "created_at": "2005-03-17T04:25:58.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Aww yeah, Cinema24 blog patrons representin'!<br/><br/>Oh, and I want the wifebeater Moxie shirt Mr. Norton is sporting in that photoshopped fight club pic.<br/><br/>Damn that thing is sweet.",
      "created_at": "2005-03-17T06:56:39.000Z"
    },
    {
      "author": "Rachel",
      "body": "How about (for the tweens):<br/><br/>I got to second in the back of The Moxie.",
      "created_at": "2005-03-17T07:01:45.000Z"
    },
    {
      "author": "Ole",
      "body": "How do you like The Moxie<br/>Neat or on the rocks?",
      "created_at": "2005-03-17T07:32:29.000Z"
    },
    {
      "author": "Monica and Friends",
      "body": "If you build the MOXIE, they will come.",
      "created_at": "2005-03-17T08:13:54.000Z"
    },
    {
      "author": "Dave",
      "body": "(apologies in advance, here's mine)<br/><br/>$moxie = \"SELECT * FROM `theaters` WHERE `coolness` = 'through_the_friggin_roof';\"",
      "created_at": "2005-03-17T19:50:41.000Z"
    },
    {
      "author": "Jamie",
      "body": "My favorite is the independent, dependent one.  But I am the math teacher!  I'd buy it, so would the other math dorks I know and love.",
      "created_at": "2005-03-17T21:02:56.000Z"
    },
    {
      "author": "Oz",
      "body": "My favorite is Mar (#14) who suggested<br/><br/>The Moxie:  Opening in late 2004, February, March SOON (with the crossed out parts).",
      "created_at": "2005-03-17T22:11:57.000Z"
    },
    {
      "author": "Beavis",
      "body": "Let me be the first to let everyone know that this is the most popular post yet!  I couldn't have done it without you.  Thanks to everyone, and keep 'em coming!",
      "created_at": "2005-03-17T23:26:10.000Z"
    },
    {
      "author": "Oz",
      "body": "I meant \"Mat\"",
      "created_at": "2005-03-18T00:36:19.000Z"
    },
    {
      "author": "Nate",
      "body": "One screen to rule them all<br/>One screen to find them.<br/>One screen to bring them all<br/>And in the darkness show various flicks that we would not normally get in a small to mid-sized, conservative market such as this.<br/>",
      "created_at": "2005-03-18T00:48:44.000Z"
    },
    {
      "author": "Nate",
      "body": "What?  You don’t WANT to sound like a douche?  Well then, SPECIFY.",
      "created_at": "2005-03-18T00:49:12.000Z"
    },
    {
      "author": "Brandon",
      "body": "Shirts:<br/><br/>(OOOH... Nate, LOTR substitution was sweet.)<br/><br/>Couple #16's \"The first rule of MOXIE is: You do not talk about MOXIE.\" on the front of the shirt with the photoshopped Ed Norton on the back... delicious.<br/><br/>Napolean references work magic.  In \"Vote for Pedro,\" cross out the \"Pedro\" and put Moxie somewhere near it.  On the shirt back, you could do the { Opening in late 2004, February, March SOON } with the crossed-out lines.<br/><br/>\"All your Moxie are belong to us.\"<br/>\"What Happen?\"<br/>-a tribute to nerds everywhere and the old urlblue.com-",
      "created_at": "2005-03-18T22:18:36.000Z"
    },
    {
      "author": "Lor",
      "body": "\"Your hat is at The Moxie.\"<br/><br/>",
      "created_at": "2005-03-18T23:40:19.000Z"
    },
    {
      "author": "Emily the Marketing Dork",
      "body": "Shy about posting, so will make this long and a one-time-only performance...<br/><br/>I don't have any original ideas, but here's some input from someone who HASN'T been reading this site from the beginning (which, if you want to get technical, is important from an all-inclusive, wide-reaching marketing perspective).  I love Allison's screenshot idea of the obscure mountain lion-type photos, as well as the following T-shirt ideas: Nate's \"Y Tu Moxie Tambien\", \"Miracle On Walnut Street\", and LOTR; all of Caleb's suggestions; and Anemone's \"Working...\".  These are all popular indie, cult, or offbeat ideas which would play well to the kind of patrons you want.  Hell, I'm thinking of making my way to Springfield just to get Anemone's shirt.<br/><br/>Also, one hugely popular thing that an independent theater did in my college town was this: they determined in the first few months which was their slowest night each week, then regularly showed whatever they wanted on that night.  Sometimes they got 8 or 9 people in there watching something dumb like Major Payne; other times they SOLD OUT for an old Doris Day flick.  As college students, we actually all paid more attention to what the weird movie was that week, and half the time ended up going.<br/><br/>I've been enjoying the site for a few months now, and I wish you the best of luck!  Hope I haven't taken up too much of your time without meritorious contribution.  :-)",
      "created_at": "2005-03-21T14:32:59.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
