{
  "id": 17,
  "title": "The time has come",
  "body": "Today's post will be a short one. Nicole and I will be leaving for Midwestburg tomorrow morning and staying there until Monday night. As you may or may not recall, Nicole and I have been invited to <a href=\"/posts/7\">attend a Film Forum</a> on Monday where we'll have the opportunity to speak at great lengths about our project. We're also meeting with two banks on Monday - one before the forum, and one after. We sent our business plan to both banks so they could peruse it over the weekend. Wish us luck!\r\n\r\nOn another note, I decided to rewrite the comment section of this blog. I didn't like how blogger required commenters to become members before they could leave a message, nor did I particularly care for how HaloScan's commenting program required a donation before you were allowed to tweak the HTML/CSS and get rid of the ads, so I decided to bite the bullet and build my own. I even took the time to move all the old comments into the new version. What a guy, right?\r\n\r\nNicole is getting her hair cut after work so she'll look extra hip for Monday's meetings. She wants to look, dress, and act like Julie Andrews from <i>Thoroughly Modern Mille</i>, so she's getting her hair bobbed off. We'll see how that turns out. Well, it's about time for me to be heading off from work, so keep your fingers crossed for us, and I'll be back on Monday evening with a full report of the weekend's events. Until then...",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-06-12T00:41:57.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Bob McGrath",
      "body": "I am learning at your expense. \r\n\r\nsorry",
      "created_at": "2004-06-12T01:32:26.000Z"
    },
    {
      "author": "Cho",
      "body": "ummm........ good luck?",
      "created_at": "2004-06-12T02:15:56.000Z"
    },
    {
      "author": "Christina Martin",
      "body": "I prefer haloscan's commenting system to blogger's, by far.",
      "created_at": "2004-06-12T04:31:18.000Z"
    },
    {
      "author": "eb",
      "body": "Good luck, may all good things come to you. And I hope the bob works out well.\r\neb",
      "created_at": "2004-06-12T11:38:19.000Z"
    },
    {
      "author": "redpolkachaddi",
      "body": "hey, i just started a blog of my own and i want to know how u can post comments wihout having to become members of blogger. my friends and family refuse to become members inorder to make my blog look popular. sigh... pls help.",
      "created_at": "2004-06-13T10:33:29.000Z"
    },
    {
      "author": "Nigel",
      "body": "Good luck with the project. I like the design of your website, nice and clean. Very sharp.",
      "created_at": "2004-06-13T11:21:53.000Z"
    },
    {
      "author": "Bill",
      "body": "Blogger has three permission settings for commenting:  Only members of the blog itself can comment, only blogger members can comment, and anyone can comment.  You can change your blog settings to allow people to comment without registering.  See http://help.blogger.com/bin/answer.py?answer=741&topic=23#who  for help.",
      "created_at": "2004-06-13T13:25:43.000Z"
    },
    {
      "author": "Greg",
      "body": "Best of Luck with the Banks!  Maybe you won't get a Mr.Drysdale.\r\n\r\nGreg\r\nhttp://gregster.blogspot.com",
      "created_at": "2004-06-13T19:52:56.000Z"
    },
    {
      "author": "Jesse Cooper",
      "body": "This is one of those blogs that people need to read. Especially if one is to start one's own business. Great job.",
      "created_at": "2004-06-13T22:10:59.000Z"
    },
    {
      "author": "grave digger",
      "body": "We will be waiting for you. Good luck.",
      "created_at": "2004-06-13T23:59:33.000Z"
    },
    {
      "author": "sara",
      "body": "hope you don't mind me linking to you--i found your site because of blogs of note & am very interested in the independent film industry/art-house theaters. if you were in so cal, you'd definitely have my patronage! bonne chance!",
      "created_at": "2004-06-14T09:49:38.000Z"
    },
    {
      "author": "monologue",
      "body": "very good.your blog is realy useful",
      "created_at": "2004-06-14T21:49:19.000Z"
    },
    {
      "author": "Kodo_lover",
      "body": "I really like your blog . splended novel\r\nand plots . I hope you see my story .\r\ngood luck with the story of yours",
      "created_at": "2004-06-17T08:50:10.000Z"
    },
    {
      "author": "Kodo_lover",
      "body": "Sorry that was my wrong website . heres my real one .",
      "created_at": "2004-06-17T08:54:04.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
