{
  "id": 170,
  "title": "Hey look, Part 7",
  "body": "This piece was written by long-time blog reader Nathan Remington for OTC's newspaper. Nathan has the distinction of being both editor and head reporter for the paper, which would explain the excessive, yet wonderful length of the article and frequent mentioning of my bulging biceps - both excessive and wonderful. Ha ha. No, seriously. My biceps bulge all the time. I can't help it.<br/><br/><b>Independent Theatre 'The Moxie' Opens Downtown</b><br/>By Nathan Remington<br/>OTC Newspaper, March 9, 2005<br/><br/>Add one more new element of excitement to the burgeoning downtown scene. Springfield has never had a venue dedicated to showing independent and foreign films. Dan and Nicole Chilton, married, hope to change that with their hotly anticipated independent theatre, The Moxie, opening within a few months.<br/><br/>Theirs will be the first \"art-house\" theatre in town, located in the heart of the downtown resurgence at 408 W. Walnut. Recent passersby may have noticed the large \"opening soon\" banner hanging outside the window of the now vacant bank.<br/><br/>In a downtown bar, with Dan drinking porter and Nicole sipping hot tea, the two appear as a complementary team. Dan seems the more animated, while his wife occasionally chimes in with facts that Dan neglects to mention, or chides him for jotting a to do list on his arm with a sharpie.<br/><br/>The story begins appropriately. The Chiltons first met in a movie theatre. Dan was 19 when he started working at the Springfield 8 where he met fellow movie lover Nicole, \"who showed me the fineries of concessions.\" Nicole adds with a grin that Dan lied about his age, saying he was 21 in order to impress her.<br/><br/>Now at 23 and 24, several years after their \"summer courtship,\" as Dan jokes, the two are going into the movie business together, and are busy impressing the local media instead. With the Ragtag Cinema in Columbia, Mo. as their inspiration, they came to realize that \"something like this would go over great in Springfield,\" and for the past year the two have been working to make the idea a reality. Dan, from Billings, and Nicole, a graduate of Glendale high school, moved back to their home area specifically because they saw a need that they could fill. \"I think we hit on a perfect time [to do this],\" says Nicole.<br/><br/>\"I have always been adamantly pro-Springfield,\" asserts Dan, and to that end the Chiltons are designing their theatre to be an integral part of the downtown experience. Like many independent theatres, they will serve beer and wine, but plan on stocking local microbrews and many concessions such as coffees and ice cream that will be provided from local vendors. Intermissions will be included during all films, which the owners hope will bring a social element to the theatre. \"It's just something that's quaint,\" notes Dan. There are also tentative plans to showcase local artwork along the interior walls, to play music from area bands, and to involve The Moxie as a regular part of the monthly First Friday Artwalk. Said Dan, \"We really want to tailor it to the community. When people think of downtown, we want them to think of The Moxie.”<br/><br/>The Chiltons, who list everything from French favorite Amelie to Bill and Ted's Excellent Adventure as some of their favorite flicks, plan to bring a more varied selection of films to Springfield than is currently being offered. \"We can do so much more than Campbell 16 or Springfield 8 can,\" insists Dan, emphasizing The Moxie's plans to show foreign movies along with American independents. He and Nicole have brainstormed a slew of ideas, including working with local film festivals. In the end, says Dan, \"we want to show films that are small but with good quality. We want to connect with the audience.\"<br/><br/>Right now, though, The Moxie is just a large space with a glass entrance facing Walnut, but much of the work has already been done. Debris has been cleared, projection equipment acquired, and the chairs for the 73 person seating capacity have been ordered. Dan and Nicole give a tour of the facility, he making expansive gestures to assist visualization, she demonstrating the use of their vintage movie seating. \"It will be small, but we think of it as 'cozy.' That's what happens when you are retrofitting a bank,\" says Dan, who ticks off all the hats that he and Nicole have had to wear: Construction, electrical work, duct work, carpentry, sound proofing, and \"painting and more painting.\" He wearily describes the laundry lists of headaches that arise, from permits and licenses they had to obtain such as a liquor license, a retail sales license and building permits, to countless other nightmares such as movie distribution rights to drawing up contracts with vendors. \"My back is aching just thinking about it.”<br/><br/>The Chiltons, with just $2,000 in savings and some tenuous financing, set out to overcome the gauntlet of obstacles. \"It will always cost twice as much and take four times as long,\" admits Dan, \"...but we're not doing this to get rich...obviously.\" He and his wife laugh about how they feel guilty now when they eat Taco Bell. Nicole works in marketing to support the couple while Dan works full time on the theatre. \"I measure days now by how much goes out and how much goes in.\" One day it is architectural plans that cost three times what was expected; the next it is something simple, like a popcorn popper that runs $1,400.<br/><br/>In typical proactive fashion, the two sought out family counseling before work on the theatre even started, simply to ensure the health of their marriage during what they expected to be an arduous process. \"We make sure not to bring the movie theatre into every conversation,\" says Dan, though both lament that vacations are a thing of the past. Although under continual stress to get the movie house opened, the two seem confident and calm in regards to the future. \"I think the guy who started The Bar Next Door was 24 when he started,\" says Dan, \"so there's precedence. It doesn't matter how young you are. If you have enough passion and drive, you can convince enough people to help get you started.\"<br/><br/>Springfield seems ready to prove them right. The Chiltons are excited, even apprehensive, about the level of anticipation spreading for their tentative April opening, judging by the flurry of press the theatre has received in recent weeks. Nicole concedes that Dan has largely taken on the role of the theatre's public face, and he admits to enjoying getting the word out, listing off those local media outlets for whom he's given interviews, (which is almost everyone, from television to print to websites.) Local filmmaker Nick Coleman even gave the pending theatre a plug at a recent Springfield 8 screening of his locally made film The Suburban Seven.<br/><br/>\"We should all support businesses like this,\" said Coleman to a receptive audience. \"This is really exciting to have here in Springfield.\"<br/><br/>\"Anticipation for this is definitely building,\" said Dan, with Nicole adding, \"We're actually a little worried how we're going to handle opening night.\"<br/><br/>Much of this anticipation has built solely through word of mouth, centered around Dan Chilton's \"Moxie Blog,\" (www.blog.moxiecinema.com) an internet diary of sorts that he began on a whim to keep a record of the travails involved in starting The Moxie, but over the months has taken on a life of its own. Chilton claims that he started with half a dozen readers but now receives over 200 hits a day. \"Mostly movie lovers,\" says Dan, claiming that many Springfieldians read it but most are from all over the world. The site, stuffed with lighthearted anecdotes, photos and figures, (including an expense spreadsheet so anyone interested can see where all the money goes) has become an immensely helpful tool to Dan, who says he uses it as a focus group for business decisions instead of spending money for market analysis. \"I'm getting a kick out of reading people's ideas.\"<br/><br/>Mike Sowers, co-owner of Well Fed Head Books and an avid reader of Chilton's blog, says, \"It's fantasti<br/>c. He's built this community with this blog and it's a really unique way of bringing people into the process with you. Now they're invested into his business.\"<br/><br/>The Chiltons' plans are expansive and include involving themselves with Cinemerge and the Springfield Film Festival, as well as film departments at both SMSU and Drury. Their dedication to keeping all things local extends to their screen advertising, which they plan to sell to only local businesses, especially those with a downtown presence. Dan and Nicole even speak of bringing in downtown's Skinny Improv to help encourage audience participation-style nights where moviegoers lambast derided films such as Ben Affleck's Gigli.<br/><br/>Now, taking a break over drinks, they merely want to come in under budget. Dan says he plans to one day turn this all into a book, maybe called <i>The Moxie, or How a Young Couple With No Money Started An Independent Theatre on Nothing But Passion and Drive</i>. As Dan puts it, with a bit of tongue-in-cheek, \"We have to have moxie to get this thing open, you know?\"",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-03-18T02:54:26.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Jamie",
      "body": "that is so strange to hear, or read to be exact.  \"The Chiltons.\"  How proper, how fun!",
      "created_at": "2005-03-18T03:29:32.000Z"
    },
    {
      "author": "bjork24",
      "body": "Hey Jaime! You suddenly turned into a commenting fiend! Glad to see it. Looking forward to seeing you and Adam this weekend.",
      "created_at": "2005-03-18T03:33:54.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Brilliant!  I love it.  Well written, and completely captures what makes you guys...you.<br/>Matt and I are still trying to think of (another) good reason to vacation in Missouri...as tempting as it sounds, we can't spend the whole time in the theater. Plus, there's the Alex-issue.  I'm not sure how many foreign films the little guy can take.",
      "created_at": "2005-03-18T03:55:36.000Z"
    },
    {
      "author": "Nate",
      "body": "You got tired of seeing how frequently I was checking the blog, didn’t ya?<br/>Can’t…help it…office drone work frequently drags…many websites merely a click away.<br/><br/>God that is one hell of a dreary read.  Don’t I edit?<br/>",
      "created_at": "2005-03-18T04:06:33.000Z"
    },
    {
      "author": "Nate",
      "body": "Actually, I believe I described your biceps as ‘bulbous,’ not bulging.<br/>The difference is slight, but key.<br/>",
      "created_at": "2005-03-18T04:06:55.000Z"
    },
    {
      "author": "brian of moore",
      "body": "just randomly thought of something while reading that... ie: apart of the artwalk<br/>im an animation student at smsu.. <br/>it would be incredibly sweet... if senior animation projects could be shown there<br/>that will be a while for me... but id love to go see some senior's projects on the big screen",
      "created_at": "2005-03-18T04:56:47.000Z"
    },
    {
      "author": "bjork24",
      "body": "Stephanie: We'd love to see you and Matt at the Moxie. Popcorn would be on the house!<br/><br/>Nate: I just wrote Mr. Lowther to tell him what a stand-out individual you were... and to show him my biceps.<br/><br/>Brian: We're planning on doing a yearly student film festival in conjunction with SMS (MSU!) and Drury... probably around May when all the senior projects are due. We also are going to be doing a special Moxie Movie Internship with students from all over... more to come.",
      "created_at": "2005-03-18T05:15:03.000Z"
    },
    {
      "author": "brian of moore",
      "body": "yay!",
      "created_at": "2005-03-18T05:41:55.000Z"
    },
    {
      "author": "Rachel",
      "body": "\"I measure days now by how much goes out and how much goes in.\"<br/><br/>Ew.  Is this a poop reference?",
      "created_at": "2005-03-18T06:35:20.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ha ha! Yes, it is. Good eye, Rach!",
      "created_at": "2005-03-18T06:37:14.000Z"
    },
    {
      "author": "erin",
      "body": "brain is right. it would be really cool to have the animation students senior projects at the moxie.<br/>i saw a poster today for their senior show and i cant be sure.. but i THINK it is taking place somewhere in the student union. it would be SO awsome for them to have it done someplace special. because it seems they are totally getting jipped having to do it in psu.<br/>pus-borring<br/>moxie-frickin awsome!",
      "created_at": "2005-03-18T10:49:29.000Z"
    },
    {
      "author": "erin",
      "body": "crap. i often call brian 'brain' because im dyslexic (?). and because i have happy wild child fingers when i type.<br/>typing... so much fun! wooh!",
      "created_at": "2005-03-18T11:01:39.000Z"
    },
    {
      "author": "Ole",
      "body": "How about some links to the events at MSU?  I'd love to see the senior projects as well but us local's aren't aware of the events unless it gets posted at MudHouse.  I'm coming here every day, be my movie maker Dan.",
      "created_at": "2005-03-18T17:53:47.000Z"
    },
    {
      "author": "steph v.",
      "body": "Whew. That was a long article. But, bravo, yet one more time.",
      "created_at": "2005-03-18T18:53:06.000Z"
    },
    {
      "author": "Chuck",
      "body": "\"We have to have moxie\" Come on now... cornball. lol",
      "created_at": "2005-03-18T23:04:31.000Z"
    },
    {
      "author": "nicholas",
      "body": "alright Nate, now you're a published writer. so when i introduce you to cute girls (as a writer), you can stop being all self-depricating. by the way, Manda was in town (might still be)--i'm shooting a tv spot but will be back next week. drinks? CALL ME.<br/><br/>dan, i'm now using the moxie blog as my personal message service. ;)",
      "created_at": "2005-03-21T08:09:39.000Z"
    },
    {
      "author": "honam",
      "body": "Yo,<br/><br/>This article is really inspiring and has just motivated me even more to open my own cinema<br/><br/>does anyone know of any other links of where i can get information in regards to opening my own cinema?<br/><br/>Thanks",
      "created_at": "2005-04-03T14:20:33.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
