{
  "id": 171,
  "title": "Moxie Marketing Missive, Part II",
  "body": "Well, here it is in its entirety:<br/><br/>- - - - - - - - - - - - - - - - - - - - - - - - - - - <br/><br/>Dear downtown business owner,<br/><br/>When was the last time you were able to sit back and enjoy a great movie in a cozy downtown theater while you sipped a glass of wine or a hot mug of coffee? It's been awhile, right? Maybe never? Well that's all about to change.<br/><br/>Moxie Cinema, or simply The Moxie, will be opening its doors at 408 West Walnut in the very near future (we're keeping the real opening date a surprise). Perhaps we'll be opening right next to your business, or several blocks away, but before we do, we'd like to take a moment to introduce ourselves and express our interest in collaborating with you.<br/><br/>One of our main goals as an independent, community-oriented movie theater will be to affiliate ourselves with as many downtown businesses as possible. Whether that's through offering a unique advertising medium for your business, working side-by-side on a cross-promotional venture (i.e. dinner and a movie promotions, ticket stub discounts, sponsored film series, etc.) or simply stopping by for a quick hello, we'd love to hear from you.<br/><br/>Being locally owned and operated ourselves, The Moxie will be able to offer much more than a typical corporate-run movie theater, for both our customers and our business affiliates. If you'd like to learn more about our theater, or see some of the ways we'd like to collaborate with you, please visit us online at www.MoxieCinema.com. Or, if you'd rather speak in person, feel free to contact Dan directly at 417.555.1234 or via e-mail at DanSPAM@MoxieCinema.com.<br/><br/>With the help of unique businesses like your own, we hope to become an integral part of the downtown experience. Thank you.<br/><br/>Sincerely,<br/><br/>Dan and Nicole Chilton<br/>Moxie Cinema, owners<br/><br/>- - - - - - - - - - - - - - - - - - - - - - - - - - - <br/><br/>For those of you who helped edit <a href=\"/posts/165&check\">the original version</a>, thank you. As you can see, we made quite a few chances from the first draft - most notably, the first paragraph. We've received a lot of good feedback from the letter... perhaps not as much as I had hoped, but enough to justify the $100 we spent on the campaign.<br/><br/>That's about it from Moxieland. Have a great weekend!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-03-19T01:59:10.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Justin",
      "body": "You should scan the document that you sent out.  Is  it pretty?",
      "created_at": "2005-03-19T02:33:25.000Z"
    },
    {
      "author": "bjork24",
      "body": "Not really. Just some text, a big logo, and blood.",
      "created_at": "2005-03-19T02:35:11.000Z"
    },
    {
      "author": "Justin",
      "body": "You just don't have a scanner, do you?",
      "created_at": "2005-03-19T02:39:29.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "I'm honored to have had a hand in this. The letter looks great Dan.<br/><br/>How's the response been?",
      "created_at": "2005-03-19T03:16:52.000Z"
    },
    {
      "author": "bjork24",
      "body": "Evan: the response has been good. We've had several couples and e-mails. At the very least, we increased the already building buzz about the theater. Who could ask for more? Thanks again for your help!",
      "created_at": "2005-03-19T03:20:32.000Z"
    },
    {
      "author": "Oz",
      "body": "It's a nice letter.  YOU should follow it up by calling each of them.  A hassle, I know, but you're more likely to get responses from personal contact.<br/><br/>As an aside (I guess I should have spoken earlier, although maybe someone else said something) but people are more likely to open/read hand-written addressed envelopes.  Also, a hand-written PS is also very effective.  All of this is a pain, I know, but sometimes worth it.",
      "created_at": "2005-03-19T03:56:06.000Z"
    },
    {
      "author": "bjork24",
      "body": "We put handwritten notes in several of the letters to express our sincere interest in working with particular businesses.",
      "created_at": "2005-03-19T04:42:30.000Z"
    },
    {
      "author": "Pat",
      "body": "I second Oz's comment. It's a very small community. Plus when you talk with people you never know what connection you are going to find.<br/><br/>You may also find the people that are going to be most helpful aren't necessarily the people who are going to do business with you.<br/><br/>As an example, do you know the little bakery on McDaniel just west of South? It is a tiny little one room shop. You will hardly notice it. The owner, Phil Dreshfield is the nicest guy you ever want to meet. He started the business last summer after working in the restaurant business for a long time. Out of that little shop he makes rolls for a number of restaurants in town. But what is most important is that he knows the managers, chefs, and owners of a hundred other restaurants. He is a great guy and I would bet that you could be very helpful in connecting with restaurants. Maybe you could offer to help him prepare his rolls one morning in exchange for a 1/2 hour of his time.<br/><br/>Just a thought.",
      "created_at": "2005-03-19T04:46:59.000Z"
    },
    {
      "author": "bjork24",
      "body": "Pat: Are you talking about Artisan Bread? I think we sent a letter to him. Either way, we have plans to recanvas the businesses that are most important to our promotions after we get open.",
      "created_at": "2005-03-19T04:49:48.000Z"
    },
    {
      "author": "Pat",
      "body": "I am not exactly sure what his company name is. He is right by St. Michaels. I highly recommend dropping in and introducing yourself. You can drop my name, his son and my son go to school together.",
      "created_at": "2005-03-19T05:14:36.000Z"
    },
    {
      "author": "bjork24",
      "body": "Cool. We may just have to do that.",
      "created_at": "2005-03-19T05:17:03.000Z"
    },
    {
      "author": "Ole",
      "body": "It's called \"Waves of Grain\", next to O'Connell's Market, and he also likes local connections.  Get him started talking about his local wheat!",
      "created_at": "2005-03-19T05:46:36.000Z"
    },
    {
      "author": "Pat",
      "body": "If you don't know them yet, go meet Shannon and Randy Bacon, too. ",
      "created_at": "2005-03-19T06:48:01.000Z"
    },
    {
      "author": "Chuck",
      "body": "Sounds good - though essentially I contributed nothing, I was still happy to read over it. : )",
      "created_at": "2005-03-20T00:53:43.000Z"
    },
    {
      "author": "Brandon",
      "body": "As soon as I saw the search feature, I typed in \"hat.\"  Interesting search results.  Sadly, though, even Google couldn't find the thing.",
      "created_at": "2005-03-21T01:33:10.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
