{
  "id": 173,
  "title": "Rock the vote, phase 2",
  "body": "Out of all the votes, the two most popular were:<br/><br/><i>Opening <strike>late 2004</strike>, <strike>February</strike>, <strike>March</strike>, SOON!</i><br/><br/>AND<br/><br/><i>I got to second in the back of The Moxie</i><br/><br/>So, if you saw both of these shirts sitting on the rack at your local thrift store, which would you be more likely to purchase?<br/><br/><b>DESIGN #1</b><br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/simple_shirt_front.jpg\" width=\"425\" /><br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/simple_shirt_back.jpg\" width=\"425\" /><br/><br/><b>DESIGN #2</b><br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/second_shirt_front.jpg\" width=\"425\" /><br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/second_shirt_back.jpg\" width=\"425\" /><br/><br/>Although I like design number #2 (the quote originator is a good friend of ours), I don't know if it has cross-over potential for the older marketing segment. What do you guys think?",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-03-23T02:08:37.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Lor",
      "body": "I heart tshirt number two. Its just so funny. Older people might not buy it, but the studenty market will, and they love slogan tees!<br/><br/>Hate to be complicated, but cant you just make both?",
      "created_at": "2005-03-23T02:26:59.000Z"
    },
    {
      "author": "whitty",
      "body": "I have nothing useful to add, but only a question:  who's that man in the speedo?",
      "created_at": "2005-03-23T02:44:13.000Z"
    },
    {
      "author": "Oz",
      "body": "Personally, I like #1.  However, it has a limited usefulness.  One day, the Moxie WILL OPEN!  Then the t-shirt will lose some of its...umph.  The second slogan is good forever.",
      "created_at": "2005-03-23T02:45:03.000Z"
    },
    {
      "author": "Dave",
      "body": "#1 is way better. more balanced. i don't think it will lose it's umph after the theater opens... it'll be more like a piece of history.",
      "created_at": "2005-03-23T03:09:01.000Z"
    },
    {
      "author": "Dave",
      "body": "oh... and the man in the speedo in the background... i find him very disturbing.",
      "created_at": "2005-03-23T03:10:39.000Z"
    },
    {
      "author": "Justin",
      "body": "#1 all the way",
      "created_at": "2005-03-23T03:13:31.000Z"
    },
    {
      "author": "Allison",
      "body": "I like them both, so I'm of no help there... However, I don't know how many people feel the way I do, but I like the front of my tshirt to be toned down and the back to have all the action.  Like, the Moxie symbol/blog url as a  logo on the left breast, and the shizzam on the back.  Maybe it's just that I don't like people reading my chest.",
      "created_at": "2005-03-23T03:37:25.000Z"
    },
    {
      "author": "Luke",
      "body": "Number 2, definitely. <br/>I'm not sure the 1st will translate to the audience, unless they read the blog or kept up to date on the Moxie's progress. <br/>And number 2 has implied sex!",
      "created_at": "2005-03-23T03:54:57.000Z"
    },
    {
      "author": "Darren",
      "body": "Former technical writer here, so I'm a big pedant. I definitely prefer design #2, but think it should read \"I got to second base in the back of The Moxie\". As it currently reads, it's a bit ambiguous. Trust me, you'll get questions from stupid people.",
      "created_at": "2005-03-23T04:12:54.000Z"
    },
    {
      "author": "brian of moore",
      "body": "honesty: <br/>i dont really like my options... but id have to go for number one i suppose.... 2 makes me feel like i should be in 5th grade.. and even if i was.. i still wouldnt find it funny",
      "created_at": "2005-03-23T04:18:23.000Z"
    },
    {
      "author": "Liz",
      "body": "I vote #1 and second Dave's comment (both, actually).  I'd also say try to make both if you can.",
      "created_at": "2005-03-23T04:22:14.000Z"
    },
    {
      "author": "Liz",
      "body": "*smacks forehead*  If that didn't make sense, I mean that I second both <i>comments</i> and you should try to make both <i>shirts.</i>",
      "created_at": "2005-03-23T04:26:29.000Z"
    },
    {
      "author": "jamie",
      "body": "I would wear any of them because I believe in supporting you guys, but I would only be able to wear the first one in public.  Unless you put a baseball diamond on it, just to confuse the blondes",
      "created_at": "2005-03-23T04:29:47.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "I have to vote for #1.  I would not buy or wear #2.  And I'm not even (that) old!",
      "created_at": "2005-03-23T05:03:31.000Z"
    },
    {
      "author": "Caleb",
      "body": "My vote is for #1, although I'm not crazy about it. Once the theatre opens though, it will seem like an inside joke. #2 is kind of immature and I agree, I think it would turn away older audiences.",
      "created_at": "2005-03-23T06:36:32.000Z"
    },
    {
      "author": "Fyse",
      "body": "I vote for #1 too. Obviously the 2nd base thing doesn't have so much impact in the UK, but I wouldn't wear it anywhere. And I'm REALLY not old.<br/><br/>If you're worried the first will date, then you could bring out a new one at opening that has NOW! added at the bottom. Then people will have to buy another!!",
      "created_at": "2005-03-23T07:05:57.000Z"
    },
    {
      "author": "erin",
      "body": "i vote number one.<br/><br/>what i want to know is why the model of these lovely shirts has hairy detailed arms and hands. and a such flawless colorless neck?<br/>is it just me?..yes? okay.<br/>: )",
      "created_at": "2005-03-23T07:57:53.000Z"
    },
    {
      "author": "nathan",
      "body": "#2 is way better. My dad is like a gillion years old and is a pastor, and he would even think that was funny",
      "created_at": "2005-03-23T09:59:58.000Z"
    },
    {
      "author": "Allison",
      "body": "I was thinking about it this evening, and I like the idea of having \"The Moxie\" on the front (in big or small letters) and then some slogan on the back that people can remember it by, like a phrase without the word \"Moxie\" in it.  Like the previously suggested \"Changing Movies One Flick At A Time\" or \"We're Ready For Our Close-up\".",
      "created_at": "2005-03-23T10:06:28.000Z"
    },
    {
      "author": "Emily the Marketing Dork",
      "body": "#2, if you must.  Neither were my top 5 choices...but I always have to be difficult.",
      "created_at": "2005-03-23T10:17:43.000Z"
    },
    {
      "author": "matt",
      "body": "#1, not just because I suggested it, but because the front with just the logo is nice and iconic and the joke is on the back, so it's just like a bonus.  You'd get more mileage out of a shirt with a front that's simple.",
      "created_at": "2005-03-23T11:25:31.000Z"
    },
    {
      "author": "Rachel",
      "body": "Dan, don't worry about me being hurt.  I definitely understand your concern.  Maybe make the \"I got to second...\" into keychains or bumper stickers?",
      "created_at": "2005-03-23T11:35:02.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "It's gotta be ONE. It fits in with the blog more and, since it's a limited run going out to the blog audience (the blaudience?), it makes it more of a collectable item.<br/>For a large marketing run, I say number two.",
      "created_at": "2005-03-23T18:25:49.000Z"
    },
    {
      "author": "Jeff",
      "body": "I like both, but I would have to agree that the first would generally appeal to more people, and I also agree that the kicker should be on the back of the shirt.",
      "created_at": "2005-03-23T18:28:39.000Z"
    },
    {
      "author": "steph v.",
      "body": "But, I did get to second in the back of the Moxie.",
      "created_at": "2005-03-23T19:04:04.000Z"
    },
    {
      "author": "Luke",
      "body": "I definitely have to go with shirt 2.",
      "created_at": "2005-03-23T19:44:22.000Z"
    },
    {
      "author": "Luke",
      "body": "Though whatever you guys go with, I agree with Allison's comment above.  I also like my sirts to have most of their action on the back.",
      "created_at": "2005-03-23T19:48:14.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "I would be more apt to buy a shirt that had the Moxie logo on the front (half for the cause, half cuz I made it) and then the \"I got to second...\" phrase on the back. I don't know about the web address. Seems very late-90s. <br/><br/>Oh, and I know I didn't chime in, but I loved the LOTR entry (the number 79 with a smile?); however, is the quote \"one ____ to find them\" or \"one ____ to bind them\"? Because I always thought it was \"find\" but then read it written out as \"bind\" the other day. Hmm.",
      "created_at": "2005-03-23T20:08:15.000Z"
    },
    {
      "author": "Brian",
      "body": "screw old people, #2!!",
      "created_at": "2005-03-23T20:09:02.000Z"
    },
    {
      "author": "Nate",
      "body": "The actual verse is<br/>One ring to rule them all<br/>One ring to find them<br/>One ring to bring them all<br/>And in the darkness bind them<br/><br/>Thank heavens I rescued myself from complete nerdishness by changing the last line to something snarky.<br/><br/>Last thing I want is to be seen as a nerd.<br/><br/>Well, I'm off to argue the importance of midi-chloridians to the Force.",
      "created_at": "2005-03-23T20:39:41.000Z"
    },
    {
      "author": "Nate",
      "body": "Snarky would make a good name for a dog.<br/><br/>So would Moxie, come to think.",
      "created_at": "2005-03-23T20:40:28.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Number two, I guess. <br/><br/>The first won't make sense once you open (and if anything may drive sales -away- from the business...that's bad). The second I see as having a hard time selling to teens because 1) It implies slut-like activities (ie, the parents will be pissed) and two you may just get those ridiculously dumb questions about \"What does getting to second mean?\" from the Stupid Peeps.",
      "created_at": "2005-03-23T21:15:24.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "A hard time selling to teens because their parents would be pissed? Isn't that half the reason to do just about anything when you're a teenager?",
      "created_at": "2005-03-23T23:07:14.000Z"
    },
    {
      "author": "Oz",
      "body": "I just wanted to add, who are all these prudish people who would be too ashamed to wear design #2?  What is the big deal?  You're implying that you felt someone up in a movie theater.  OH MY GOD!  HOW COULD I SHOW MY FACE IN PUBLIC IF PEOPLE KNEW I'D DONE THAT?!  ",
      "created_at": "2005-03-23T23:44:11.000Z"
    },
    {
      "author": "Nate",
      "body": "I would be ashamed that I ONLY got to second.",
      "created_at": "2005-03-23T23:46:47.000Z"
    },
    {
      "author": "Nate",
      "body": "Or ashamed that I'm someone who thinks getting to second is worthy of T-shirt broadcast.<br/><br/>Unless it's meant to be ironic.  But I can't trust all those people out there.  The red states scare me.  <br/>...And yet, I'm desperate for them to like my T-shirt, apparently.",
      "created_at": "2005-03-23T23:49:11.000Z"
    },
    {
      "author": "Nate",
      "body": "Wait.<br/>Second is boobies, right?<br/>Right?",
      "created_at": "2005-03-23T23:49:29.000Z"
    },
    {
      "author": "J.R.",
      "body": "Either one gets my goat.  However, I would buy shirt number two before shirt number one.  Mainly because the Moxie will hopefully be open by the time the t-shirts are available.  ",
      "created_at": "2005-03-24T00:16:35.000Z"
    },
    {
      "author": "Nicki J",
      "body": "If I'm not mistaken, the whole idea behind these shirts at this moment are to be released only to blog readers, therefore making #1 a good choice. Screw those that will buy a shirt later, they don't deserve the first slogan anyway. Dan can make something more \"marketable\" and \"appealing\" for the general public later. If I am mistaken, I appologize.<br/><br/>I would wear #2 if the phrase was on the back. So I guess I vote for #1.",
      "created_at": "2005-03-24T02:02:00.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Whoa, wait a minute. These are for blog readers only?",
      "created_at": "2005-03-24T03:05:27.000Z"
    },
    {
      "author": "matt",
      "body": "yeah, the 'blog readers only' thing was what made #1 funny to me.  if there are some left over and people want to buy them at the theater, who would complain?  but yeah, dan initially said a shirt for the blog heads.",
      "created_at": "2005-03-24T03:35:49.000Z"
    },
    {
      "author": "Fyse",
      "body": "just out of interest, how many sales did you get on the Cafepress store?",
      "created_at": "2005-03-24T04:11:08.000Z"
    },
    {
      "author": "Karen",
      "body": "As the apparent audience of an independent film house is intelligent with artistic inclinations, I don’t think they’d be blown away with #2.  Sexual innuendos are a blatant cop-out for when you can’t think of anything else funny to say.  <br/><br/>Number 1 is original, has meaning, and the fact that it is a time-sensitive message will quickly make it vintage, and then it will be just that much more appealing.<br/><br/>Speaking as an elder (25) person in the professional world I wouldn’t be seen in number 2.  It’s make the wearer come across as crass with a sprinkling of pathetic.<br/><br/>Well there is my scathing review hopefully with no offence to your friend the #2 sloganeer.<br/>",
      "created_at": "2005-03-24T04:27:54.000Z"
    },
    {
      "author": "nathan springer",
      "body": "my vote is for #1. the second one doesnt feel balanced at all and the font isnt doing for me.",
      "created_at": "2005-03-24T04:44:43.000Z"
    },
    {
      "author": "Brandon",
      "body": "Wow.  #43, Karen, said my side of the story exactly.  I'd buy both if both were made (and I had the cash), but would much rather wear nummer eins out on the town and everywhere else.  I wouldn't wear a shirt that says \"Irish guys do it better,\" (Have any of you seen these?  They're produced with different country names in the appropriate slot...  Maybe we should fight wars over who has better sex-- things would be less complicated) and my choice with these shirts is not a TOTALLY different situation, no matter how much some commenters may protest. The second shirt slogan is awesome just for me, but I wouldn't feel as utterly comfortable about myself and utterly enthused about the Moxie if I had to explain (then explain why I'm wearing) such things to friends who are more reserved than I.",
      "created_at": "2005-03-24T05:58:30.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
