{
  "id": 174,
  "title": "The readers doth protest too much, methinks",
  "body": "As I read through the comments of yesterday's post, it became painfully obvious that a little clarification was needed. As it turns out, the pain was coming from a paper clip that I accidentally sat on last Thursday. Still, it was obvious that the post needed some explaining. First, the shirts in question are for blog readers only. They will only be offered once, and once they're gone... they're gone. Another Moxie shirt will be available to the general public, but it won't be the one you voted on. I hope that makes things a bit more clear.\r\n\r\nNow, seeing as the battle lines have already been drawn between the design #1 camp and the design #2 camp, it's time to put your money where your mouth is. Literally. The base cost for a shirt is $10.00, and it breaks down like this:\r\n\r\n<i>A hip / hop / a hippa to the hippa to the hip hip hop and you don't stop!</i>\r\n\r\nShirt = $5.00\r\nShipping = $3.00\r\nPayPal Fees = $0.59\r\nPacking = $1.50\r\n\r\nThe shirt will be available in four price ranges, each one with it's own level of Moxie involvement:\r\n\r\n<b>Acquaintances of The Moxie</b>: $12.00\r\n(Shirt + $2.00 donation)\r\n<i>You get</i>: The shirt and 1 limited edition Moxie button\r\n\r\n<b>Friends of The Moxie</b>: $15.00\r\n(Shirt + $5.00 donation)\r\n<i>You get</i>: The shirt and 2 limited edition Moxie buttons\r\n\r\n<b>REALLY Good Friends of The Moxie</b>: $20.00\r\n(Shirt + $10.00 donation)\r\n<i>You get</i>: The shirt, 2 limited edition Moxie buttons, and a very special Moxie bumper sticker\r\n\r\n<b>Married to The Moxie</b>: $25.00\r\n(Shirt + $20.00 donation)\r\n<i>You get</i>: The shirt, all 3 limited edition Moxie buttons, a very special Moxie bumper sticker, and a little something extra\r\n\r\n*NOTE: When I say BUTTON(S) I'm refering to the cool kind that you pin on your jacket, bag, or pants - not the ones you sew on your shirt.\r\n\r\nOf course, if you'd rather have a regular GENERAL PUBLIC Moxie shirt, those will be available shortly.\r\n\r\nNow, so I can get an idea of what the TRUE demand for the limited edition blog shirt will be, please tell me which design you would buy. You don't have to say at which level you'd buy, but for those of you who are seriously considering buying one (thanks!), I need to know how many to order... and at what size. Don't be ashamed if you need an x-large or a small size. If it makes you feel any better, I still wear small... underwear. Oh (said in a sad tone).\r\n\r\nBetter yet, if you want a limited edition blog shirt, e-mail me at:\r\n\r\n<< the.moxie AT gmail DOT com >>\r\n\r\nwith the following:\r\n\r\n1. The design you want (#1 or #2)\r\n2. The size you need (S/M/L/XL)\r\n3. A haiku and/or limerick\r\n\r\nThe design that gets the most pre-orders wins. Simple as that.\r\n\r\nThe limited edition buttons and sticker(s) will be showing up sometime tonight or tomorrow. The \"Shop Moxie\" link will be replaced with something like... \"Moxie Store\" or \"Moxie Crap\" or \"Fuckin' Moxie!\" or something like that. Click it and you will see the OFFICIAL Moxie shirt (for the general public), the limited edition pins, and the sticker(s).\r\n\r\nPre-orders will begin now and stop around noonish CST on Friday. Tomorrow's post will be a REAL Moxie-related post about all the stuff that's been happening while you were diverted by this crazy T-Shirt business. Friday's post will announce the winner of the limited edition blog shirt, and then THAT'S IT! No more shirt talk. All Moxie, all the time! Seriously.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-03-24T05:26:38.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "whitty",
      "body": "Now by pin do you mean \"lapel pin\" that I can wear to my National Forensic League mixers or pin as in \"button/badge\" that I can wear while rockin' out at rock shows with rockers?",
      "created_at": "2005-03-24T05:52:51.000Z"
    },
    {
      "author": "bjork24",
      "body": "I meant button/badge... I better go change that. \"Button\" sounds much cooler than pin.",
      "created_at": "2005-03-24T05:55:51.000Z"
    },
    {
      "author": "Carl",
      "body": "Married to the Moxie; now are you including yourself or Nicole as that something extra or maybe one of these aprons.",
      "created_at": "2005-03-24T08:59:57.000Z"
    },
    {
      "author": "Aaron",
      "body": "Dan::\r\n\r\nDid I tell you that I have a button maker? I've cranked out thousands of those things.",
      "created_at": "2005-03-24T12:53:03.000Z"
    },
    {
      "author": "Luke",
      "body": "What about shipping to the UK...",
      "created_at": "2005-03-24T14:41:04.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "Ooh, count me in for the haiku!",
      "created_at": "2005-03-24T18:32:18.000Z"
    },
    {
      "author": "Oz",
      "body": "What does the bumper sticker look like?",
      "created_at": "2005-03-24T18:48:36.000Z"
    },
    {
      "author": "steph v.",
      "body": "I want to be \"Family of the Moxie\". How much is that? Priceless?",
      "created_at": "2005-03-24T18:57:50.000Z"
    },
    {
      "author": "bjork24",
      "body": "Carl: You'll just have to wait and see.\r\n\r\nAaron: I did not know this. I might have to borrow that button maker.\r\n\r\nLuke: Hmm, good question. I'm sure we can come up with something.\r\n\r\nSam Spade: You're counted.\r\n\r\nOz: Preview... coming soon.\r\n\r\nSteph V.: Yes, family is priceless.",
      "created_at": "2005-03-24T19:32:19.000Z"
    },
    {
      "author": "whitty",
      "body": "Dan, I have a button maker too, if you need it.  ...And mine is way cooler than Aaron's... way cooler. Yeah.",
      "created_at": "2005-03-24T19:59:31.000Z"
    },
    {
      "author": "bjork24",
      "body": "Two button makers in the same town?! It's not big enough, I tells ya... IT'S NOT BIG ENOUGH FOR THE TWO OF YOUS!",
      "created_at": "2005-03-24T20:02:23.000Z"
    },
    {
      "author": "Nate",
      "body": "Dan the street corner button pusher.",
      "created_at": "2005-03-24T20:03:44.000Z"
    },
    {
      "author": "whitty",
      "body": "actually, all kidding aside, you might want to borrow both of them and have a whole crew of people cranking out buttons like mofos.  MoFos, I tells ya!",
      "created_at": "2005-03-24T20:05:05.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'm the king of the BUTTON world!",
      "created_at": "2005-03-24T20:05:31.000Z"
    },
    {
      "author": "justin",
      "body": "This is true.  Dan <i>is</i> the king of the button world.  He used to work there.  It's right next to Spatula City.",
      "created_at": "2005-03-24T20:21:13.000Z"
    },
    {
      "author": "Nate",
      "body": "A button sweatshop right in downtown Springfield?  Man, it IS turning around.  I'm sure you can find a riding crop at Priscilla's or something and just THREATEN the eight year olds with it.  You know, stay within labor laws, as I understand them.\r\nWhat?  Not legal?  There goes my snowcone business plan.",
      "created_at": "2005-03-24T20:31:01.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "My Moxie Haiku is complete! \r\n\r\nI hope Dan loves it so much he spray paints it on the wall(s):\r\n\r\nThe Moxie Is Great\r\nBut Sometimes It Feels Empty\r\nIf No One Is There",
      "created_at": "2005-03-24T21:03:35.000Z"
    },
    {
      "author": "bjork24",
      "body": "That's a good one, Evan. I'm going to sharpie it on my arm.",
      "created_at": "2005-03-24T21:05:31.000Z"
    },
    {
      "author": "Luke",
      "body": "If you could knock me up some kind of quote for UK shipping, I'll certainly consider it :p",
      "created_at": "2005-03-24T21:36:20.000Z"
    },
    {
      "author": "bjork24",
      "body": "How does $8.00 sound?",
      "created_at": "2005-03-24T21:37:21.000Z"
    },
    {
      "author": "Rachel",
      "body": "Ack!  By Friday?!  Does that mean I won't get a shirt if I don't email you today?",
      "created_at": "2005-03-24T22:07:27.000Z"
    },
    {
      "author": "Luke",
      "body": "So does that make the whole package sans donation $15.00 or $18.00?",
      "created_at": "2005-03-24T22:16:00.000Z"
    },
    {
      "author": "brian of moore",
      "body": "pssst... rachel.. todays not friday\r\noh boy!.. i get buttons and a bumper sticker!\r\nthank god... i didnt like those designs.. but i do like buttons and bumper stickers... im also intrigued by 'whats in the box'  .. a little something extra.. just five bucks more... hmmm... i wonder what it could be...pez candy?  a white russian?  steve buscemi?  the options are unending",
      "created_at": "2005-03-24T22:39:46.000Z"
    },
    {
      "author": "erin",
      "body": "has anyone bought one of the dog shirts in the shop moxie?\r\nand why dont they make cat shirts? not that i like cats. or cats with shirts. just thinking its a bit discriminatory. i guess cats dont need shirts to show off because they never really \"leave\" a house. or go on walks and stuff...\r\nanyway. has anyone purchased one of those bad boys?",
      "created_at": "2005-03-24T22:58:38.000Z"
    },
    {
      "author": "bjork24",
      "body": "Rachel: I'm taking pre-orders to determine which design will be printed. You don't have to send an e-mail by Friday. I think I'm only going to have 10 of each size printed up... if that.\r\n\r\nLuke: I think $15.00 would cover it, but I've never sent something to the UK before. Can you send me something Beatles/Shakespeare related?\r\n\r\nBrian: How can the surprise live up to that kind of hype?\r\n\r\nErin: I don't think anyone has purchased the dog shirts. To date, only two items have sold... to the same person... thanks Stephanie!",
      "created_at": "2005-03-25T00:26:36.000Z"
    },
    {
      "author": "jamie",
      "body": "Adam and I each will want one.  A small and a large.  If we are talking regular guy sizes.  Like SMS or MU t-shirts at the bookstore.  Oh damn, I forgot, you guys don't wear those!  Te he\r\n",
      "created_at": "2005-03-25T03:29:33.000Z"
    },
    {
      "author": "louise",
      "body": "I sure am upset that someone donated the toilet plunger.  I was going to!",
      "created_at": "2005-03-25T03:37:40.000Z"
    },
    {
      "author": "bjork24",
      "body": "I wear my SMS shirt all the time!",
      "created_at": "2005-03-25T04:16:47.000Z"
    },
    {
      "author": "Luke",
      "body": "Um, what did you have in mind? How about I send you $20 worth of real chocolate and we call it quits :p",
      "created_at": "2005-03-25T04:59:32.000Z"
    },
    {
      "author": "Jamie",
      "body": "Well then, I spoke too soon!  Wait... does Nicole?",
      "created_at": "2005-03-25T18:11:24.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
