{
  "id": 175,
  "title": "While you were sleeping",
  "body": "Many of my long time readers may have noticed a lack of substantial posts over the last week or twelve. As of late, many of my posts have been engineered more to entertain than to enlighten. Of course, there's usually nothing wrong with that, but in this case I was doing it to draw attention away from the fact that the Moxie has been on the skids for the last month. Not much has happened in the way of visible, tangible progress, but come Monday that's all about to change... hopefully.\r\n\r\nSo, to bring you back up to speed, here's a list of items that have helped and/or hindered the Moxie over the last 20 days or so.\r\n\r\n<b>Building Permit</b>\r\n\r\nWe finally, finally, FINALLY received our building permit today. I'm happy to report that our architects and engineers worked incredibly hard over this last week to get the final stages approved. I even called the Building and Development Services Department to speak with the city engineer who was in charge of approving our permit, which apparently is a big \"no no\" in the development world. Why? I have no idea, but I must've called the guy at least six times over the course of two days. My persistence/annoyance obviously paid off, because our permit is ready to go. The only bad thing is anticipating the additional engineering fees. Hard work by engineers is rarely, if ever, free.\r\n\r\n<b>Splicers, Poppers, and Digital Projectors</b>\r\n\r\nI bought our film splicer, popcorn popper, and digital projector for well under what we had budgeted. High five!\r\n\r\n<b>Wes the Poster Guy</b>\r\n\r\nI knew I spoke too soon. Wes Wilson, the 60's poster guy, has reneged on his initial agreement to be The Moxie's inaugural artist. He said he was just too busy with his upcoming show and \"modest farming.\" If you ask me, I think he's a little apprehensive about being associated with an unestablished business... and I can't say I blame him. He's playing it safe, and that's okay by me. I'll send him a couple free passes once we open, and then blow him away with all the awesomeness that is THE MOXIE! He'll have no choice but to renege on his initial reneging, which sounds a lot dirtier than it actually is.\r\n\r\n<b>All your licenses are belong to us</b>\r\n\r\nWe filed our state liquor license yesterday, which means all of our licenses and permits have been filed and (mostly) approved. We won't have to deal with any more licensing and permit headaches until the week before we open, when we have to file for an occupancy permit and have the Health Department sign off on the Cinebar. Yay for that!\r\n\r\nStill, it wasn't as easy as it sounds. To get our liquor license, Nicole and I both needed a recent criminal background check. We had originally thought we could get them through the mail, but when we hadn't heard anything back from them after two weeks, we started to get a wee bit suspicious...\r\n\r\n<b>Mr. Liquor</b> - Hello and thank you for calling the Missouri anytime criminal background line. How may I help you?\r\n<b>Dan</b> - My wife and I sent in our applications over two weeks ago and you still haven't cashed our checks. What gives?\r\n<b>Mr. Liquor</b> - Philanthropists.\r\n<b>Dan</b> - No! That answer would've only made sense had I asked, \"Who gives?\" not \"What gives!\"\r\n<b>Mr. Liquor</b> - Philanthropic robots.\r\n<b>Dan</b> - Seriously, how long will it take for you to process our application?\r\n<b>Mr. Liquor</b> - Eight to ten weeks, at the very least.\r\n<b>Dan</b> - Well I'll be a suck-egg mule! That's ridiculous!\r\n<b>Mr. Liquor</b> - Feh, what can you do?\r\n<b>Dan</b> - I don't know, what <i>can</i> I do? We'll be open in less than eight to ten weeks. (whines like a dog)\r\n<b>Mr. Liquor</b> - You can drive up to our headquarters in Jefferson City and apply for your background check in person.\r\n<b>Dan</b> - Will I have to wait in line for eight to ten weeks?\r\n<b>Mr. Liquor</b> - No.\r\n<b>Dan</b> - Otay!\r\n\r\nSo Nicole and I drove all the way up to Jefferson City on Tuesday morning, stood in line for 1 minute and 32 seconds, requested our background checks, received them in 3 minutes and 29 seconds, and then jumped back in the car and drove back to Springfield. Five freakin' hours on the road so we could stand in line for five mintues! I couldn't believe it. How is it they can process it immediately if we drive up there, but it takes them over TWO MONTHS to do it otherwise? And to top it all off, Tuesday was the first day that a gallon of gas breached the $2.00 mark in Springfield. We had to fill up twice! Bastards.\r\n\r\n<b>It costs how much?!</b>\r\n\r\nIf it weren't for us having to upgrade the building's electrical and HVAC systems, it would be easy sailing from here to opening day. Unfortunately it's not a perfect world, and we have to bring the building up to code. If you remember correctly, we were initially told by our architect that the cost for both upgrades would run us somewhere around $17,000 - $6K for the electrical, $11K for the HVAC. Obviously, that's a lot of money that we hadn't planned on spending, but we managed to rearrange our budget to accommodate it. Then came the real world subcontracting bids.\r\n\r\n<i>Electrical upgrade - $32,000</i>\r\n\r\nOh. My. Fucking. G.O.B.!\r\n\r\nHad I been sitting in a chair, I would've fell out of it, but being as I was laying in a hammock, all I could do was spin around really, really fast until the hammock engulfed me and all you could see were my two cartoon eyes poking through the mesh. It was terrible. I'm meeting with Andrew (building owner) and Chris (general contractor) on Monday to go over our options and discuss the other subcontracting bids. It looks grim, but we've seen grimmer situations and out-grimmed them like nobody's busine- WE'RE NOT GOING TO MAKE IT! SAVE US! SAVE US! SAV--\r\n\r\nKeep your fingers crossed, fair reader. Keep them crossed with a vengeance!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-03-25T04:15:25.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Pat",
      "body": "Dan,\r\n\r\nGet as many bids as you can and from different types of subcontractors and make sure that each place knows that you are getting lots of bids. I am sure there is a guy out there that will do it for a whole lot less. Get names from other businesses nearby. Plus let the contractor know how much money you have budgeted. It is amazing how often bids come in for right around the amount you told them you had available.",
      "created_at": "2005-03-25T05:03:18.000Z"
    },
    {
      "author": "bjork24",
      "body": "Unfortunately, the GC is a little reluctant to let me bid the jobs out myself.",
      "created_at": "2005-03-25T05:05:11.000Z"
    },
    {
      "author": "Andrew",
      "body": "Dude, I think you're going to get to bid to your heart's content before this is over...",
      "created_at": "2005-03-25T05:46:53.000Z"
    },
    {
      "author": "Pat",
      "body": "I understand the general contractor's perspective. He only wants to use a sub that he trusts. He doesn't want you to call him in 6 months bitching that the lights don't work. But it is your money after all. It might require you to sign away the GC's warranty on the electrical. I will say that commercial electrical projects are expensive but I would still try and get other bids even if you just get bids on your own as a counter to the one(s) that the GC approves.",
      "created_at": "2005-03-25T06:36:48.000Z"
    },
    {
      "author": "Oz",
      "body": "Wow, that really sucks.  I had my bathroom bid on once and it came in at around 20k.  I was stunned.  I'd ask the architect who told you 6k who he thinks would do it for 6k.  And as Pat says, you're the boss of the GC, not the other way around.  If he won't let you bid it out, find another GC along with another electrician.",
      "created_at": "2005-03-25T07:41:41.000Z"
    },
    {
      "author": "bjork24",
      "body": "Andrew: That's what I'm afraid of.\r\n\r\nPat: The GC works directly for the building owner, so getting a new one is out of the question. Even still, we've been very happy with our GC - he's a great guy - and I think he'll come around after our meeting on Monday.\r\n\r\nOz: Subcontractors are the spawn of the devil, I swear.",
      "created_at": "2005-03-25T08:36:58.000Z"
    },
    {
      "author": "brian of moore",
      "body": "32 what!?  you could buy a small house for that (okay small crappy house in a crappy area)   or two new neons.... yeah! get two new neons! .. wait no... i want the moxie to open... that sucks",
      "created_at": "2005-03-25T09:34:04.000Z"
    },
    {
      "author": "erin",
      "body": "my fingers are so tightly spun around eachother......",
      "created_at": "2005-03-25T09:35:03.000Z"
    },
    {
      "author": "John",
      "body": "I'm crossing my prehensile tail for you. Seriously, good luck.",
      "created_at": "2005-03-25T11:39:00.000Z"
    },
    {
      "author": "Emily the Marketing Dork",
      "body": "ISBN 0471381349 might help, or the latest version of that title.  It's pretty damned comprehensive, regarding building codes of all sorts--kind of a construction/accessibility/fire code/HVAC primer for those who want to know what's required and why, as well as why it costs so DAMNED much to retrofit, etc.  Yeah, the whole situation sucks...but being who I am, in the industry I'm in, I understand what's going on and why, simply because of this book.  Please take this as a HEAVY recommendation to you and Nicole.",
      "created_at": "2005-03-25T14:18:42.000Z"
    },
    {
      "author": "Chuck",
      "body": "Ouch. Good luck, Dan.",
      "created_at": "2005-03-25T15:53:01.000Z"
    },
    {
      "author": "Grey Hodge",
      "body": "Hello from Pennsylvania! Anyway. You say \"building owner\". You don't _own_ the building you're pouring untold thousands of dollars into, or is he a partner in the venture? Maybe I'm asking questions I have no business, but that part startled me... Good luck!",
      "created_at": "2005-03-25T17:39:00.000Z"
    },
    {
      "author": "steph v",
      "body": "I paid $2.18 yesterday for gas. Well over $30 spent...\r\n\r\nGood luck!",
      "created_at": "2005-03-25T18:38:17.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "$32,000?! Waitaminit, did you check off that you want *platinum* wire instead of coppper? That could be it.\r\n\r\nJudging from the size of the building (in photos), you could probably upgrade most of the street for $32 large. I used to do electrical work and we revamped an entire bank for less than that.",
      "created_at": "2005-03-25T18:49:52.000Z"
    },
    {
      "author": "Mark",
      "body": "Damn, I wish I had more time to comment on your blog. I keep missing all the votes and polls.\r\n\r\n$32,000! Few! That's a whole lotta mulla. You've come so far and accomlished so much I'm sure this is just another bump on the road to Moxie.\r\n\r\nBut just in case:\r\n\r\nPOSITIVE VIBES >> Dan & Nicole (Mr & Mrs Moxie)\r\n\r\nM",
      "created_at": "2005-03-25T20:37:23.000Z"
    },
    {
      "author": "mike",
      "body": "Dan,\r\n\r\nIf for some strange unexplainable reason I was rich - not even filthy rich, just a little rich - I would so swoop in and \"save\" the Moxie in a heartbeat - but in reality I'm very poor. [Sigh] But it's the thought that counts right? No? Not in this case? Damn.",
      "created_at": "2005-03-26T00:04:54.000Z"
    },
    {
      "author": "Allison",
      "body": "Totally off the topic, but I was watching \"Lost in Yonkers\" earlier, and about an hour in Richard Dreyfuss says \"that took Moxie\" and the kid says \"What's Moxie?\" and Dreyfuss says (incredulously) \"What's Moxie!?!\" and then he gives this awesome look and gestures and says \"That's moxie\".  I just thought you could use it as an intro clip (if the Movie-People let you do such things) or as part of a montage if you were thinking about doing something like that.  Something like Cinemark's Joe-Cool-Cat...",
      "created_at": "2005-03-26T00:09:34.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks for all the wishes of good luck. My meeting with Andrew has been moved up to today... I'll report back with details later in the day.",
      "created_at": "2005-03-26T00:25:11.000Z"
    },
    {
      "author": "Nicki J",
      "body": "I hope eveything works out for you, Dan. I know how horrid the city of springfield can be when it comes to opening a business. My family used to own The Lighthouse (where the Rasta Grill is, basically cady-cornered from you) and we had SOOO many problems just getting the damned thing open, and then 9-11 hit, so business pretty much sucked. \r\n\r\nBut I have faith in all things Moxie!",
      "created_at": "2005-03-26T02:20:00.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 14,
      "name": "Dialogue"
    }
  ]
}
