{
  "id": 177,
  "title": "And on the third day...",
  "body": "As you might have noticed, my server went down on Friday and is now back up on Sunday. Coincidence? Perhaps. Obvious sign of Dan's divinity? More than likely. Here's the story:<br/><br/>I <i>used</i> to lease server space from a company called <a href=\"http://www.dinix.com\" target=\"_blank\" class=\"broken\">Dinix</a>. When I first signed up with them, nearly one a half years ago, they were on top of their game. Their servers were benefiting from amazing uptime, lightning fast transfer rates, and the accolades of web developers everywhere... or at least on the forums at <a href=\"http://www.webhostingtalk.com\" target=\"_blank\">Web Hosting Talk</a>.<br/><br/>Everything was going great for Dinix, and the majority of their clients, until one of the cofounders came down with a nasty case of cancer. In what can only be described as a seriously ill-informed move, the owners decided to sell <a href=\"http://www.dinix.com\" target=\"_blank\" class=\"broken\">Dinix</a> to a second-rate value hosting farm known as <a href=\"http://www.webhostplus.com\" target=\"_blank\" class=\"broken\">Web Host Plus</a>. That's when the servers started to blink, sputter, and fade. Perhaps you've noticed this blog's sporadic patches of downtime. You can thank <a href=\"http://www.webhostplus.com\" target=\"_blank\" class=\"broken\">Web Host MINUS</a> for that.<br/><br/>To complete the corporate takeover, <a href=\"http://www.webhostplus.com\" target=\"_blank\" class=\"broken\">Web Host DICKWEED</a> decided it would be best to move all of Dinix's servers - located in Atlanta - to their datacenter in Seacaucus, New Jersey. When this decision was made, <a href=\"http://www.dinix.com\" target=\"_blank\" class=\"broken\">Dinix</a> - now acting under the control of <a href=\"http://www.webhostplus.com\" target=\"_blank\" class=\"broken\">Web Host BUTT-MUNCH</a> - issued an e-mail stating that a move would be happening in the near future, but FEAR NOT! We would all be given AT LEAST TWO WEEKS NOTICE before the move occurred so we could back-up all our files and make plans for the anticipated downtime, if any. SUPPOSEDLY, all the data was going to be squirted through a fat network pipe from Atlanta to Seacaucus prior to the move, thus keeping downtime to a minimum. That e-mail was sent out about a week ago.<br/><br/>Then, last Wednesday night, another e-mail was sent out stating that the move would commence on Friday evening and everyone should expect downtime of AT LEAST 11 hours! Wha, wha, WHAT?! I quickly made a couple dozen full system back-ups and copied over all the data from the priceless MOXIE BLOG database to my personal server. Friday came, the plug was pulled, and the <a href=\"http://www.webhostingtalk.com/showthread.php?s=&threadid=387709\" target=\"_blank\">shit hit the fan</a>! As it turns out, <a href=\"http://www.webhostplus.com\" target=\"_blank\" class=\"broken\">Web Host FUCKASS</a> decided that they wanted <a href=\"http://www.dinix.com\" target=\"_blank\" class=\"broken\">Dinix's</a> servers RIGHT NOW, so they were all loaded onto a truck and driven from Georgia to New Jersey... without moving any data through the network. To top it all off, they even took down <a href=\"http://www.dinix.com\" target=\"_blank\" class=\"broken\">Dinix's</a> website, which, up until that point, had been the central point for reading updates about the move.<br/><br/>From that point on, every <a href=\"http://www.dinix.com\" target=\"_blank\" class=\"broken\">Dinix</a> client was keeping their fingers crossed that a crappy little U-Haul truck, filled with terabyte upon terabyte of our data, would make it up the Eastern seaboard without getting in a wreck. Apparently we didn't cross our fingers hard enough, because the truck was involved in an accident... (dramatic pause)... but it was only a fender bender and, from what I've read, none of the servers were harmed. Phew.<br/><br/>Long story short, the 11 hours of downtime quickly turned into 15, then 20, then 24, then 30, and so on and so forth. My server popped back online around the 32 hour mark, but I didn't care. I had already bought a new server through <a href=\"http://www.servint.com\" target=\"_blank\">ServInt</a>, who are currently up to their ears in new customer sales, thanks to <a href=\"http://www.webhostplus.com\" target=\"_blank\" class=\"broken\">Web Host HEAD-UP-OUR-ASS</a>'s unbelievable stupidity and intolerable lack of competency (<i>intolerable incompetency</i> didn't sound right to me).<br/><br/>So there may be a few more moments (hopefully small ones) of downtime while my <a href=\"http://www.dinix.com\" target=\"_blank\" class=\"broken\">Dinix</a> server is closed down and the new <a href=\"http://www.servint.com\" target=\"_blank\">ServInt</a> server picks up the slack, but after that, it should be smooth sailing... (<i>knocks on the only wooden object within reach - my left leg</i>). Thanks for your patience!<br/><br/>P.S. - The cofounder of <a href=\"http://www.dinix.com\" target=\"_blank\" class=\"broken\">Dinix</a> who was diagnosed with cancer is now 100% okay. I bet watching the company he helped build go up in flames is doing wonders for his recovery.<br/><br/>P.P.S. - ALL comments have been shut off until the new server takes over. Sorry for any commenting inconvenience.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-03-27T21:33:08.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "bjork24",
      "body": "Hello everyone!",
      "created_at": "2005-03-28T20:29:38.000Z"
    },
    {
      "author": "whitty",
      "body": "hello!",
      "created_at": "2005-03-28T20:49:36.000Z"
    },
    {
      "author": "E.Komateas",
      "body": "My server is down for 6 days. I don't think that the story ends until now...",
      "created_at": "2005-03-30T16:43:26.000Z"
    },
    {
      "author": "Carl Joseph",
      "body": "Mine still isn't up either. Loved the blod entry by the way. Excellent!",
      "created_at": "2005-04-01T08:10:29.000Z"
    },
    {
      "author": "Carl Joseph",
      "body": "Ooops - blod = blog!",
      "created_at": "2005-04-01T08:10:44.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    }
  ]
}
