{
  "id": 180,
  "title": "Clever title about shirts",
  "body": "Ok, all the shirts, buttons, and stickers have been ordered. You can lust after them at the newly remodeled <a href=\"store.php\" class=\"broken\">Moxie Store</a>. The shirts ended up costing me $6.00 a piece, as opposed to $5.00, since I chose to throw in a nice splash of Moxie red on the front and back. Extra ink means extra dough. Either way, they look damn good. It will take roughly 2 to 3 weeks for the shirts to be finished, so don't buy one thinking you'll get it by the end of this week. As soon as I get the shirts, I'll pack them up and send them off. That's my promise to YOU!\r\n\r\n<b>What if I sent you an e-mail during the pre-order phase?</b>\r\n\r\nFor all of those who sent e-mails requesting a particular size and design, your shirts are being held in reserve, but you'll still need to buy one through the <a href=\"store.php\" class=\"broken\">Moxie Store</a>. I will hold them for you until next Monday, after which time, any reserved shirts that were not claimed and purchased will be released for anyone to buy. Make sense? No? Okay, it goes like this:\r\n\r\n10 small shirts were ordered. Reader A, Reader B, Reader C, Reader D, Reader E, and Reader F all sent me e-mails requesting a small shirt. Therefore, their shirts will be held for them until next Monday. The remaining 4 shirts are immediately up for sale. If Monday rolls around and Reader B and Reader D didn't end up buying a small shirt, those additional two shirts will be released for anyone to buy.\r\n\r\nRemember, there shirts are incredibly rare, so don't be surprised if you get shirt-jacked while wearing one. Use caution.\r\n\r\nPS - You don't see it in the picture, but \"blog.moxiecinema.com\" appears in small print on the sleeve of the shirt.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-03-29T19:48:40.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Ben Dillon",
      "body": "I'll be sure to pack heat every time I wear the shirt.",
      "created_at": "2005-03-29T21:16:33.000Z"
    },
    {
      "author": "bjork24",
      "body": "Careful there Ben... the shirt's pretty darn hot itself.",
      "created_at": "2005-03-29T21:19:18.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "I don't know if I believe you about that whole \"extra ink charge\" thing. \r\n\r\nI think you'll just use the extra money to buy meth.\r\n\r\n(Just so we're clear, that's a joke)",
      "created_at": "2005-03-29T23:33:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "Evan: we're clear.",
      "created_at": "2005-03-30T00:12:05.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Phew, I was worried there for a second.",
      "created_at": "2005-03-30T00:35:40.000Z"
    },
    {
      "author": "aj",
      "body": "This is sooo not on topic, but I was looking in the IKEA catalog today, which easily is delivered to your door, and saw some great inexpensive space savers today.  Metal bars to hang stuff above the sinks and such.  And ikea is only like 7 or 8 dollars usually.  Just a thought!\r\n\r\n",
      "created_at": "2005-03-30T02:56:29.000Z"
    },
    {
      "author": "Liz",
      "body": "This ordering business all makes sense now! ...Except for that cup in the left-bottom corner of the t-shirt pictures.  Has that always been there?",
      "created_at": "2005-03-30T04:30:30.000Z"
    },
    {
      "author": "bjork24",
      "body": "Good eye, Liz! That's none other than TEENY LITTLE SUPER GUY!",
      "created_at": "2005-03-30T04:32:30.000Z"
    },
    {
      "author": "Liz",
      "body": "I can't believe I didn't recognize him!  I must have been deprived of adequate amounts of Sesame Street as a child.",
      "created_at": "2005-03-30T07:36:02.000Z"
    },
    {
      "author": "Oz",
      "body": "The robot is looking hot!",
      "created_at": "2005-03-30T08:25:49.000Z"
    },
    {
      "author": "bjork24",
      "body": "The robot has a name, Oz. Don't act like you don't know it either.",
      "created_at": "2005-03-30T08:27:37.000Z"
    },
    {
      "author": "Caleb",
      "body": "I just ordered something off the store, but my browser messed up (damn me for opening Internet Explorer) and so it may have sent the order twice. I only want to marry the Moxie once, I am a one-theatre kinda guy. Sorry.",
      "created_at": "2005-03-30T12:36:56.000Z"
    },
    {
      "author": "Oz",
      "body": "You're not the boss of me!!!!",
      "created_at": "2005-03-30T20:17:37.000Z"
    },
    {
      "author": "Mark",
      "body": "I've placed my order, if there are any extra charges for posting to the UK just let me know.\r\n\r\nWhen received it can be added to my collection of obscure  LTD ED Ts:\r\n\r\n* Arcane magazine (a short lived Brit RP mag)\r\n* Resident Evil 2 (promo)\r\n* Firefox (probably not that rare)\r\n* Virgin Staff (which I stole)\r\n\r\nM",
      "created_at": "2005-03-30T21:23:30.000Z"
    },
    {
      "author": "bjork24",
      "body": "Mark: they may be a bit of an extra charge, but I'll let you know.",
      "created_at": "2005-03-30T21:25:29.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
