{
  "id": 181,
  "title": "What's the difference",
  "body": "Q: What's the difference between drive and delusion?<br/>A: About $10,000<br/><br/>Our bid for HVAC came in... $21,000. To make matters worse, 80% of that cost is tied up in a little piece of equipment called a heat exchanger, thus eliminating any chance of value engineering the bid to a lower price. So, that's a solid $21K that has to come out of the budget.<br/><br/>On the electrical front, our bid is still high. Of the approximate $31K bid, here's how it breaks down:<br/><br/>$11K - Upgrade service, panels, etc.<br/>$9K - Light fixtures (!)<br/>$11K - Labor<br/><br/>The subcontractor based his quote on the electrical plans, which specified that we use ultra-expensive light fixtures. In reality, we should be able to use plane jane light fixtures that cost $10 a pop, as opposed to the $50+ per fixture that was quoted. Also, since the building only had a 200 amp service when we moved in, and it needed to be upgraded anyway, Andrew has agreed to cover the cost of the service upgrade. Thanks Andrew!<br/><br/>Chris, the GC (General Contractor), also gave us a bid for his work - $12,000. That would cover about half of the infill work (framing the walls, sheetrocking, building the projection booth, etc.), with the rest being left for us to finish (painting, building the counter for the concession, laying carpet, etc.). Now, let's look at what we have:<br/><br/>Electrical - $20K ($31K minus the cost of upgrade)<br/>HVAC - $21K<br/>GC - $12K<br/><br/>TOTAL: $53K<br/><br/>Now, factor in how much money we have to use:<br/><br/>Loans - $50K<br/>Infill allowance - $20K<br/><br/>TOTAL $70K<br/><br/>Looking good, eh? Wrong. You forgot about equipment costs.<br/><br/>Projection equipment: $20K<br/><br/>That leaves us with -$3,000 to buy inventory, paint the walls, build the concession area, buy sinks, build a drain, etc.. To cover those additional costs, we're going to need at least another $7K to $10K.<br/><br/>So, as we stand right now, we need to figure out a way to either:<br/><br/>1. Shave $10K to $15K off our expenses, OR<br/>2. Come up with an additional $10K to $15K to cover expenses<br/><br/>I've been on the phone with our equipment dealer for the last two days trying to revise and reduce our equipment costs, but we're already at the bare ass minimum. I might be able to get it down to $16K or $17K, which could save us about $3K... maximum. Then we have to consider the light fixture costs. I think we can get all of our lights for at or below $2K, which would save us another $7K. I'm also meeting with another electrician today to get another bid, which could save us even more money on labor.<br/><br/>So, that's a potential of $10K in savings. Even still, we're just barely under the wire. In the end, $10,000 might not be enough. We have to scrape the bottom of the bucket and then melt the bucket down, turn it into coins, and use those too.<br/><br/>Any suggestions on how we can come up with $10,000 in the next few weeks? Nicole and I have already sold off many of our belongings to cover living expenses, but we still have some big ticket items left... car, TV, kidney, etc..<br/><br/>Where's Brad Pitt when you need him?",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-03-30T21:08:27.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "John",
      "body": "That's a tough one. <br/><br/>Although, if I win the California State Lottery tonight, I'll spot you the 10 grand.",
      "created_at": "2005-03-30T22:28:09.000Z"
    },
    {
      "author": "Rachel",
      "body": "All I can think of in situations of money are tv show personalities: Oprah, Extreme Makeover: Home Addition, Trading Spaces, etc.  You could get the book with the guy that wheres the question mark suit and assures you that theres money everywhere.",
      "created_at": "2005-03-30T22:38:08.000Z"
    },
    {
      "author": "Tawny",
      "body": "Are there any options for obtaining a government grant? It seems that there are those things out there for small businesses, I hope!<br/><br/>Isn't this always the part of the movie where you get your friends together and miraculously win $10,000 or exactly what ever dollar amount you need in a zany competition? Hopefully you can find a Slash look-a-like contest! You can win that - no problem!",
      "created_at": "2005-03-30T23:57:25.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Yeah, and just before he goes onstage to wow the crowd with his very Slash-like presence, Dan gets a call from home.<br/><br/>\"I love you son.\"<br/><br/>\"Even if I look weird?\"<br/><br/>\"Well, no, but if you cut your hair, I'll love you.\"<br/><br/>\"I love you too, dad.\" Tears well up. The crowd is hushed.<br/><br/>He breaks into air guitar. The crowd explodes in praise and applause.<br/><br/>Insert cheesy music-laden montage of the theater coming together and superstars who \"just so happen\" to live nearby show up for opening night.<br/><br/>Yeah, that sounds about right. Now where to insert the coke and whores in the story...",
      "created_at": "2005-03-31T00:39:08.000Z"
    },
    {
      "author": "steph v.",
      "body": "Well working with grants personally, I'd have to say they take a long time to get.<br/><br/>I'd write Brad a letter. You're good like that. Or have a silent auction or fundraiser for The Moxie. If that's allowed...",
      "created_at": "2005-03-31T00:50:05.000Z"
    },
    {
      "author": "Pat",
      "body": "To get through to Brad you need to go through his brother Doug. Doug handles all the Springfield based requests. But it takes time to filter all the way up. You are better off holding a fundraiser and selling off naming rights to seats and things. Imaging getting your popped corn from the John Q.Hammons Concession stand. There are a lot of people in Springfield who want to see you succeed. I could imagine some kind of open house even at the theatre (in current condition to add to the charm and desperation.) I still think you can advance sell season tickets (I am not beyond raising money in a similar way.)",
      "created_at": "2005-03-31T01:09:49.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Ooooh, that's a good idea. Rich people have huge egos. Give them the concession stand! The theater name! Your first born!<br/><br/>C'mon, what's a kid when you need 10 grand?",
      "created_at": "2005-03-31T01:24:47.000Z"
    },
    {
      "author": "Karen",
      "body": "Have you considered appealing to the Springfield Arts Council or the Downtown Springfield Community Improvement District.  I don’t know that they have funds just sitting around but they may have contacts or be interested in supporting the project in some fashion.  Also I work for an accounting firm (but I do PR so I have no clue how this really works) and I know that there are a lot of historic rehabilitation tax credits available for renovating the old downtown buildings.  Just some brainstorming.",
      "created_at": "2005-03-31T01:25:30.000Z"
    },
    {
      "author": "Allison",
      "body": "Auction naming rights for your concession stand on ebay.  or something else equally strange... Say you saw the Pope's image in some plaster you yanked from your walls during construction... Sell it.  I bet goldenpalacecasino.com would buy something for over 10K.  They've been buying All the weird stuff lately as an advertising ploy.",
      "created_at": "2005-03-31T01:52:09.000Z"
    },
    {
      "author": "Karen",
      "body": "I know the grant/loan thing isn't quick but check this out:<br/>http://www.springfieldmogov.org/egov/planning_development/grants/smallbus/index.html",
      "created_at": "2005-03-31T02:00:54.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "\"Auction naming rights for your concession stand on ebay\"<br/><br/>Brilliant! :) I would consider this.",
      "created_at": "2005-03-31T04:34:28.000Z"
    },
    {
      "author": "Luke",
      "body": "Selling the rights on Ebay would kind of violate the Moxie principle about keeping everything local.<br/><br/>I do think that selling naming rights to a wealthy Springfield resident would be awesome if you guys could pull it off.  You could even let the little guys without much money get in on it by selling naming rights for things like seats (mentioned above,) ceiling tiles, urinals, popcorn poppers, the sky is the limit there.<br/><br/>I'd pay a few bucks for people to use the official Luke Sonnier Hand Towel Dispenser.<br/><br/>It would certainly make for an interesting interactive public relations move to build local interest and support for The Moxie.",
      "created_at": "2005-03-31T05:47:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "These are all good suggestions. I will sit and ponder each... right... now.",
      "created_at": "2005-03-31T05:56:07.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "I really like the ebay-everything theme. It is original, and it will attract publicity. I originally thought that only auctioning off \"Name This Cinema\" would work, but the inverse is also true: If you name the little things it allows the little guy and the rich guy to get in on the act.<br/><br/>I mean, what Channel 6 news crew wouldn't eat this up? Or even national?<br/>",
      "created_at": "2005-03-31T06:21:40.000Z"
    },
    {
      "author": "nicole",
      "body": "Dan - you forgot we could sell Bogart. ",
      "created_at": "2005-03-31T06:22:07.000Z"
    },
    {
      "author": "Stephanie",
      "body": "No!! You can't sell the doggie!  <br/><br/>Er...if you do, we'll buy him.  Cute pup.  We have a big yard...!",
      "created_at": "2005-03-31T09:21:21.000Z"
    },
    {
      "author": "Nicki J",
      "body": "I like the idea of selling naming rights of the little things :) My friends and I might go in on that!",
      "created_at": "2005-03-31T12:06:20.000Z"
    },
    {
      "author": "Carl",
      "body": "Couple of ideas: sell off some chairs, place little plaques with their names on them and they could find them each time they come.  Offer levels of support with some give aways, ie free tickets.  Print program for the movie with a list of sponsor's on this, could also be used for advertiments.  A wall of names for the \"Moxie\" where so much would get you a plaque with your name on it. State that plaque would be there for a set time peroid so that if you did not like the way it looked in a year or two you could take them all down and start all over with fresh pain or new fund raiser.  Lastly if you and Nicole get busy you could auction off you first born child and save the dog from the unknow fate that seems to be awaiting him.<br/>Carl",
      "created_at": "2005-03-31T13:01:22.000Z"
    },
    {
      "author": "Aaron",
      "body": "I would exhaust some other resources before I started asking people to pay for naming rights on anything in the theater. It might just be me, but the last thing I want to do when I go to the Moxie is sit down and find that I'm sitting in the other Aaron the Bachelor's seat.<br/><br/>Did you guys put down the most expensive fixtures on the plan to push up the needed amount on the loans? Because I can see why you'd do that and then turn around and buy the cheapest ones. ",
      "created_at": "2005-03-31T18:38:31.000Z"
    },
    {
      "author": "bjork24",
      "body": "We had no say in what fixtures were put in the plan. Typically, the architects put in whatever they want to make the building as expensive as possible since they get a percentage of the overall cost.",
      "created_at": "2005-03-31T19:06:50.000Z"
    },
    {
      "author": "Ole",
      "body": "Are there any covenants in your current SBA loans about taking on additional debt?  If not, $500 apiece from 25 loyal readers limits their risk and nets you $12.5K.  <br/><br/>The other possibility is increasing revenues - you haven't mentioned Membership or Ad revenues.  25 loyal readers purchasing a Level 3 membership nets you the same $12.5K although it would require 50 new 3 month advertisers at your special pre-opening rates.  If 25 loyal readers in SGF finds one 6 month advertiser, you've achieved the same.<br/><br/>A challenge anyone?",
      "created_at": "2005-03-31T22:30:06.000Z"
    },
    {
      "author": "J.R.",
      "body": "Did you manage to get a hold of that company I told you about in Mtn. Grove?",
      "created_at": "2005-04-01T03:30:16.000Z"
    },
    {
      "author": "bjork24",
      "body": "Actually, no. I need to call you.",
      "created_at": "2005-04-01T03:31:00.000Z"
    },
    {
      "author": "J.R.",
      "body": "I'll get the number, and call you immediately.",
      "created_at": "2005-04-01T03:34:59.000Z"
    },
    {
      "author": "J.R.",
      "body": "I'll get the number, and call you immediately.",
      "created_at": "2005-04-01T03:35:17.000Z"
    },
    {
      "author": "J.R.",
      "body": "AHH, Condemned library internet.",
      "created_at": "2005-04-01T03:37:35.000Z"
    },
    {
      "author": "Trinity",
      "body": "Sponsors that are arts based - you could promise to run some promotional events or something.  Maybe just free ads for donations.  Save the Arts, that kind of thing.  There's got to be some that are interested.  Maybe something Project Greenlight-esque.<br/><br/>Or you could resort to selling off bodily fluids and/or reproductive ... uhm ... stuff.  Hey! don't think that the \"broke-r\" among us hasn't thought of that ... or done it.",
      "created_at": "2005-04-01T22:57:24.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
