{
  "id": 182,
  "title": "eBay the Cinebar",
  "body": "Should I auction off the naming rights to the Cinebar? Ever since I read Allison's comment about doing this, I've been intrigued... to say the least. Here's why:\r\n\r\n1. It's quirky\r\n2. It shows that we'll do anything for money\r\n3. It's novel\r\n4. It's unconventional, and if we're anything...\r\n5. It has MOXIE written all over it\r\n\r\nBut would it work? Nicole doesn't like the idea, but if it went for an ungodly amount of money, I don't think she'd mind all that much.\r\n\r\nHere's how I imagine it:\r\n\r\nOn the side wall of the Cinebar a large sign reads, \"THE MOXIE PRESENTS THE OFFICIAL JOHN Q. HAMMONS CINEBAR!\" Then, underneath the sign at eye level, there'd be a little framed piece of paper that reads something like this:\r\n\r\n- - - - - - - - - - - - - - - - - - - - - -\r\n\r\n<b>Why is the Cinebar named after John Q. Hammons?</b>\r\n\r\nThat's a great question. Why IS the Cinebar named After John Q? Let me tell you why, my friend. Once upon a time, The Moxie was nothing more than a dream and a 5 gallon bucket of spit and vinegar. In the early days of 2005, when the theater was ready to open, the evil city bots set upon it and demanded numerous COSTLY upgrades to the building. Fearing the worst, The Moxie obliged the demands and spent every last penny on making the building safe and sound. Unfortunately, funds were short, and the city's demands devoured all that was left of the Moxie's paltry pittance.\r\n\r\nIn a desperate attempt to save The Moxie from financial ruin, Dan and Nicole auctioned away the naming rights to The Moxie Cinebar. Why would they do such a thing, you ask? Were you not listening to me? Didn't you read the first paragraph? They were broke! They had to do something, or else you wouldn't be standing here reading this little sign as you eagerly wait for your movie to begin. Gotta love that MOXIE!\r\n\r\nSincerely,\r\nDan and Nicole\r\n\r\nPS - This explanation sign is available for sponsorship. Please request more info at the Cinebar.\r\n\r\n- - - - - - - - - - - - - - - - - - - - - -\r\n\r\nSo... should I, or shouldn't I? If we do it, how long should the naming rights be valid? A year? Two years? The life of the theater? What else should we offer with the naming rights? Shirts? Bananas? Clumps of hair? How much do you think the naming rights are worth? Point counterpoint... GO!\r\n\r\nPS - <b>eBay the Cinebar</b> kind of sounds like <b>Eli, the Barrow Boy</b>, which is a really good song by The Decemberists. Funny how things work out sometimes.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-04-01T02:03:23.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Justin",
      "body": "I don't know... I vote no.  But as a last resort (like Aaron said), maybe.  If you do, definetly not forever.. maybe a few months at most.  I still am a little iffy on the whole idea.",
      "created_at": "2005-04-01T03:13:00.000Z"
    },
    {
      "author": "bjork24",
      "body": "But WHY are you iffy?",
      "created_at": "2005-04-01T03:14:13.000Z"
    },
    {
      "author": "Justin",
      "body": "I just think it could possibly go against the image you're trying to create.  But, it could also help \"the quirkiness of the Moxie\".  I just think some people might be turned off by it.",
      "created_at": "2005-04-01T03:16:57.000Z"
    },
    {
      "author": "bjork24",
      "body": "Maybe I could turn them back on by wearing a thong.",
      "created_at": "2005-04-01T03:19:14.000Z"
    },
    {
      "author": "J.R.",
      "body": "Go for the thong thing, and if it were to be named the John Q. Hammons Cinebar, my roommate has an autographed poster of him that would go swimmingly with it.\r\n\r\nI like the idea of naming rights for stuff, I think it'd be funny to use a Horace Watley Memorial Urinal.",
      "created_at": "2005-04-01T03:32:39.000Z"
    },
    {
      "author": "bjork24",
      "body": "Who's Horace Watley?",
      "created_at": "2005-04-01T03:38:37.000Z"
    },
    {
      "author": "Luke",
      "body": "I think it will be a quirky, and altogether different way to raise money and set the Moxie apart.\r\n\r\nI like the idea of a time restriction, but if someone actually pays a large amount of money for the naming rights (that is the whole purpose here) how do you tell them that their money only buys them X # of months/years or whatever.  It seems like it should be over the life of the theater, but then you have an obligation to that person over the life of the theater.",
      "created_at": "2005-04-01T03:50:15.000Z"
    },
    {
      "author": "Luke",
      "body": "And what if that person goes on to later commit some horrible crime?  Then you have a Cinebar named for a rapist.\r\n\r\nThere might need to be some small print in the agreement about that.",
      "created_at": "2005-04-01T03:51:15.000Z"
    },
    {
      "author": "Luke",
      "body": "Finally, I think selling naming rights to an individual is better than say, corporate sponsorship of some kind.  At least this way you're doing something a little different, with a personal touch.",
      "created_at": "2005-04-01T03:53:33.000Z"
    },
    {
      "author": "whitty",
      "body": "You should do it.\r\n\r\nBut you it should be explained to the non-Spfld readers that John Q. is a local bajillonaire who like fountains, statues of himself, buildings named after him, and touching my knee at a Lady Bears games (it's true! it happened!).  It would be excellent if he wanted to donate to the Moxie.\r\n\r\nAnd he probably has $10,000 in his couch cushions.",
      "created_at": "2005-04-01T03:53:45.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "Go for it! Give it the Moxie on eBay!\r\n\r\nAt worst, someone donates a few Benjamins toward the theatre and you have the Alistair Crumwater Cinebar (by the by, where did you find the name Cinebar? It sounds like some pricey cafe for cinnamon connoiseurs).\r\n\r\nAt best, it gets mentioned on Jay Leno or even Dave Barry's blog, you get some national attention and some rich old coot who got passed over for a part by Howard Hawks gladly puts up the coin.",
      "created_at": "2005-04-01T04:01:26.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "Jeez, I'm spending an awful lot of time fretting over a movie theatre I will probably never go to...",
      "created_at": "2005-04-01T04:05:59.000Z"
    },
    {
      "author": "nicole",
      "body": "Mr. John Q is my mom's employer. I won't say anything else.\r\n\r\nCinnabar is a red that I like, which we'll most likey use as our signature color. It only makes sense to call our concession stand The Cinebar. Get it? Cine as in movies, bar as in we serve wine? I was proud of it...",
      "created_at": "2005-04-01T04:09:41.000Z"
    },
    {
      "author": "bjork24",
      "body": "Luke: There will definitely have to be some fine print. I don't want the winning bidder to demand a name like, \"The Ball Sweat Nut Licker Cinebar\" and me not be able to give him a high five.\r\n\r\nWhitty: You explained John Q. quite nicely.\r\n\r\nSam: Never say never.\r\n\r\nNicole: Cinebar is a great name for the concession bar.",
      "created_at": "2005-04-01T04:17:23.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "I still don't like the idea. Underlying the whole idea of the Moxie is \"independence,\" and relying on big names for funding seems to go against that ideal. I know you already have big fat loans and that might not make it completely \"independent,\" but half of Springfield is already named after Q Ball. Are you really already desperate enough to whore out parts of your theater?",
      "created_at": "2005-04-01T04:19:56.000Z"
    },
    {
      "author": "bjork24",
      "body": "Aaron: If it means the difference between us opening and NOT opening, I'd be willing to whore a lot more than parts of the theater.",
      "created_at": "2005-04-01T04:22:24.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "And plus I guess I don't want to see you guys placed underneath someone else's thumb, and that's what I figure would wind up happening if you resorted to asking for money in exchange for naming rights.",
      "created_at": "2005-04-01T04:22:35.000Z"
    },
    {
      "author": "bjork24",
      "body": "Not necessarily. Think of the fine print.",
      "created_at": "2005-04-01T04:23:31.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Yeah, but politics, dude. You're in prime real estate to deal with people swayed by money and politics.",
      "created_at": "2005-04-01T04:27:52.000Z"
    },
    {
      "author": "Nate",
      "body": "Hey, you know what's REALLY quirky?  A theatre that can't open due to a shortfall in funds.\r\nDo it, and don't worry about the \"image\" thing.  The lengths you had to go to get the damn thing open is quirk enough for several block-sies of Moxies.\r\n\r\nPlus, I've been thinking that Moxie is a FANTASTIC name for a dog, a yet to be determined dog that I will rescue soon.  I was worried that it will seem weird and raise questions.  Will ten bucks by me the de-weirded right to name my dog 'Moxie'?\r\n\r\nIf not, I've been thinking \"The Chad.\"\r\n\r\nYes, with the most definite article.",
      "created_at": "2005-04-01T04:28:51.000Z"
    },
    {
      "author": "Nate",
      "body": "You may think I meant \"buy me,\" but no, I did mean \"by me,\" as in this ten bucks by me on the table right here.",
      "created_at": "2005-04-01T04:32:35.000Z"
    },
    {
      "author": "Allison",
      "body": "So, I have to admit that the whole selling yourself on ebay thing isn't exactly novel.  Two guys recently sold the rights to advertise on their car for their cross country journey.  I think it went for ~$2000.  But then if you REALLY get the buzz out, like some of the weird auctions (e.g. having forehead tattooed, naming rights for your child, etc), you're likely to get a Lot more.  \r\n\r\nYour best bet is to make sure that there's a lot of buzz surrounding the auction.  If you can get that, you're likely to get a lot of small-time bidders, a ton of \"watchers\", and, from that, one or two big-time bidders.  Unfortunately, you do have to be ready to accept \"corporate sponsorship\", as few individuals are going to be willing to front thousands of dollars.  But you can Definitely state in your auction that it is for the naming rights of the Cinebar/Bathroom Facilities only, and they get no business-oriented perks (besides a tshirt).  \r\n\r\nYou can then make all the necessary restrictions to keep pinheads from bidding (e.g. no profanities, no hateful phrases, etc).  I most certainly recommend putting a timeframe of 1 year on it.  Anything less and the bidder is like \"why?\".  Much more than that, and you're going to get annoyed with it.  Then I would make it an option at the buyer's request to have it say that's it's sponsored rather than named (e.g. \"The Moxie Cinebar // Sponsored by GoldenPalaceCasino.com\").  And I would put a reserve on it, maybe half of what you're hoping for... that way you don't get totally screwed, just in case.\r\n\r\nAnyway, I've learned a few things about these insane auctions and am \"running\" one myself that has turned out to be far less-than-insane.  The buzz is definitely what's going to get bidders.  You have to make sure to notify (via press release, maybe) the local papers/tv stations so that you get a two minute blurb on one of their slow days.  Then you want to ebay-message the big bidders on similar, closed auctions to tell them to take a look.  Maybe even ebay the smaller bidders... the more people, the better!  Your main goal, I think, is to reach the top 10 at pulse.ebay.com, and certainly blog-readers can help you do that.\r\n\r\nLast, I don't think you're selling yourself out.  While I totally understand the idea of \"keeping it local\", it's a lot easier said than done.  It's also a lot easier once you're established as a success story.  And what's a bigger success story than a theatre that gets national recognition (via ebay, for example).  Even if the buzz doesn't last, it'll make your opening that much bigger, and maybe make you an attraction to a select few out-of-towners.",
      "created_at": "2005-04-01T04:42:03.000Z"
    },
    {
      "author": "Allison",
      "body": "Long comment, that comment! :)",
      "created_at": "2005-04-01T04:42:23.000Z"
    },
    {
      "author": "bjork24",
      "body": "Nate: Your comment made me laugh.\r\n\r\nAllison: Your comment made me more excited than a rabbit on herion.",
      "created_at": "2005-04-01T04:54:39.000Z"
    },
    {
      "author": "Allison",
      "body": "a rabbit on heroin?  hot!\r\n\r\nI'm glad you're excited.  :)  If you're gonna do it, perhaps write the \"ad\" and run it by the blog readers.  They can help be the voice-of-reason... to make sure you have all the \"seller reserves the right to blahblahblah\" bits in there and everything, and enough catchy graphics.  Then you can decide if you want to do it, and alert the presses, and post the ad (in that order) ;)",
      "created_at": "2005-04-01T05:04:58.000Z"
    },
    {
      "author": "Andrew",
      "body": "I don't know why I read this stuff, but that being said, I find it odd that a virtual ream of commentary has been devoted to the played-out eBay idea, while the one sensible idea (get some investors) generates barely a murmur. Dan and Nicole are undercapitalized because they don't have much money, but also because they don't want investors. I haven't figured out if this is primarily an issue of maintaining the integrity of their vision (keeping control), or if they think that getting investors would be too banal of a plot twist for the eventual retrospective narration of the Moxie's rise.",
      "created_at": "2005-04-01T05:11:29.000Z"
    },
    {
      "author": "bjork24",
      "body": "Andrew: A valid point... one that I'll have to flesh out tomorrow.",
      "created_at": "2005-04-01T05:47:47.000Z"
    },
    {
      "author": "Allison",
      "body": "I think investors are a fabulous idea.  But I also think getting investors is difficult for two reasons:  finding the right people is a Mega-challenge (people with money, who like your idea, but won't be heavy handed) and getting them to invest is even harder.  I've never been to Springfield, MO, but I imagine it's not a Megatropolis, which to me says that finding investors is all the more difficult.  That's not to say that it shouldn't be done (given that, again, they aren't heavy-handed), but it *is* more fun (imo) to talk about Cra-zazy stuff like ebay than finding actual long-term investors, ergo it generates more conversation.  Maybe you should have a post on the pros and cons of investors as you see them, Dan?  Or what kind of help we could give in that area?",
      "created_at": "2005-04-01T05:53:24.000Z"
    },
    {
      "author": "bjork24",
      "body": "That's exactly what I'm going to do.",
      "created_at": "2005-04-01T05:57:56.000Z"
    },
    {
      "author": "Luke",
      "body": "I have to agree with Allison here.  If I were you guys I would not be thrilled about the Ebay idea, BUT I think it may be the best alternative you have.  It's certainly better than never opening at all.\r\n\r\nAlso, any buzz you can generate will likely be good buzz.  That certainly won't hurt come opening weekend.",
      "created_at": "2005-04-01T06:07:37.000Z"
    },
    {
      "author": "aj",
      "body": "We think its a good idea, it doesn't hurt to try.  It's a pretty new idea and I think it would generate some interest because you did it.  Granted some people think that its wrong, but they still talk about it!  ",
      "created_at": "2005-04-01T06:55:56.000Z"
    },
    {
      "author": "Laura",
      "body": "What about using the local media to petition for funds?  I'm sure the tv stations would love to do follow-ups to their earlier stories.  Really tug at the heart strings as well as the purse strings of sympathetic Springfieldians.",
      "created_at": "2005-04-01T07:07:02.000Z"
    },
    {
      "author": "bjork24",
      "body": "A follow up post is needed...",
      "created_at": "2005-04-01T09:10:04.000Z"
    },
    {
      "author": "brian of moore",
      "body": "I for one.. like the idea of bidding on the cinebar.. i think aaron is worrying too much... you can do it right.. so that people dont think they have some right to tell you that you only serve white russians.. or anything..... which by the way.. isnt such a bad idea.. okay fine.. how about just drinks with kahlua?",
      "created_at": "2005-04-01T09:38:31.000Z"
    },
    {
      "author": "Stephanie",
      "body": "The important thing is:  you need to get the Moxie open, simple as that.  Without selling your dog or your firstborn, do whatever it takes to get the dream you both have worked so hard at up and running.  That's why we buy shirts.\r\n\r\nOh, and Nicole?  I *love* Cinebar. I've always thought it a very clever name.",
      "created_at": "2005-04-01T09:55:58.000Z"
    },
    {
      "author": "Caleb",
      "body": "think of the press you could get on such an event! of course, would that turn off investors such as John Q. or people like that who would pay big bucks? i dunno, but you might look elsewhere before turning to eBay. but either way, i think that to build a dream you gotta do what you gotta do, and who cares if it means sticking someone's name above your concession stand. it's still got Moxie, right?!",
      "created_at": "2005-04-01T09:58:02.000Z"
    },
    {
      "author": "Pat",
      "body": "Wacky ebay auctions are bordering on cliche. You could still generate some buzz but it would be harder than it was a year ago. The one thing you have going is that your story is better. The forehead tattoo guy just had an idea no one cared about him. People will care about you because your story is much better. You need to package the ebay naming rights story with the \"hey kids let's put on a show\" story with the \"this dream is about to go down in flames\" story. \r\n\r\nThe ebay story can easily get you local coverage but that won't help the auction much (but it will be great publicity for the Moxie when it opens.) But you need to figure out how to get it beyond local. \r\n\r\nBoing boing and Fark are good places to shoot for. Journalists like to cherry pick from bloggers and bloggers like to cherry pick from boing boing. If bloggers are talking the media will pick it up (but a press release wouldn't hurt either.) Wait on the press release until there is already traffic caused by some prime blog mentions. Do a 7 day auction to give yourself time for this to go down.\r\n\r\nI would be careful about being too heavy handed with the limitations. Do it in fine print (maybe even literally.) Do not lose your sense of humor. We all come here because you are funny. Keep being funny, even in the fine print (think Willy Wonka.)\r\n\r\nI'm sorry if this is long. The idea is solid but it will only work with good execution.And I don't think it diminishing the local aspect of it at all. This is still a small town. Getting national coverage will make you a hero locally. And as long as you serve Andy's the local will still love you. Hhhmmmmm...Andy's... gotta go.",
      "created_at": "2005-04-01T10:20:26.000Z"
    },
    {
      "author": "Pat",
      "body": "Screw ebay. What about a blog-a-thon? You need $100 each from 100 people. It is still quirky but doesn't run the risk of having to name your cinebar after an indian casino. It doesn't have to have a time limit.It seems more in tune with the power to the people meme. It will still require a lot of buzz to be generated but it might get more traction because it isn't just another wacky ebay auction.\r\n\r\n",
      "created_at": "2005-04-01T10:54:38.000Z"
    },
    {
      "author": "Matt L",
      "body": "I'd vote yes and have it last a year.",
      "created_at": "2005-04-01T11:01:43.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Um. Blogathon. Oooook.\r\n\r\nAnyway, ebay idea is brilliant. I think that \"THE MOXIE PRESENTS THE OFFICIAL JOHN Q. HAMMONS CINEBAR!\" is awesome and should be used and not the \"(e.g. \"The Moxie Cinebar // Sponsored by GoldenPalaceCasino.com\")\" (no offense Allison)\r\n\r\nSponsored by doesn't make it personal enough. Doesn't bring it to the ego like your original idea did. My lord, and the letter? If you got this in the right ear the sums! The raw <i>sums</i>!\r\n\r\nWell, anyway, I think bloggers will take it to task (I have a few contacts with well-read blogs), and of course you can send emails to whomever you wish to make it noteworthy. \r\n\r\nMetafilter, et al, the super-linkers, one mention from them and at the very least the buzz should reach a point where someone with enough money could seriously consider it.\r\n\r\nI say starting the auction off at $10,000 sounds about right. It gives them exactly what you want. You are not coy, you tell them \"This is how much I need to open my movie theater. Please help.\" And for their kindness and generosity they get the same in return.\r\n\r\nBe sure to check the fine print, I don't just come here because you're funny (that sounded a bit..odd. Like, \"If you stop being so silly, I'll never come here again, jerkoff!\"), and I'm sure this will work like gangbusters.",
      "created_at": "2005-04-01T11:08:52.000Z"
    },
    {
      "author": "Pat",
      "body": "Why not sell naming rights to a bunch of stuff but do it from your blog? Similar to what you already do with the donate. Seats $100, Urinal $50, popcorn popper $75, electrical outlet $5, cinebar $10,0000, etc. On the front page put up a money-ometer thingy like the United Ways does. Make it a popcorn box that fills up with each donation. Things like the urinal will make it buzzworthy. When you open and you have little name tags on every damn thing it will be a conversation piece. Maybe you can get custom urinal cakes made with the name on it. Your naming rights last until the urinal cake disappears.",
      "created_at": "2005-04-01T17:12:11.000Z"
    },
    {
      "author": "Oz",
      "body": "Oh my god, so many comments.  I didn't read them all, so if I'm repeating what someone else said, so be it.  For your ebay auction, be sure to include the back story in your usual funny style of writing.  Something similar to your explanation sign.  Remember that guy last summer who put his ex-wife's wedding gown up on ebay and included this funny/sad story about the end of the marriage?  That thing sold for $5,000 or $10,000.  Your auction has to be quirky and interesting enough that people will come across it and then email their friends the link so that they'll read it too.\r\n\r\nSecondly, someone had suggest selling naming rights to the seats in the theater.  I totally think you should do that.  Have a fund-raising party, and sell the seat naming rights for $50 a pop or something.  70 seats, $50 each, that's $3500.  Well, a little less.  You'll have to take out the price of the little sign/plaque on each seat designating its namesake.",
      "created_at": "2005-04-01T18:34:32.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Whatever you decide to do, I also know some well-connected blogs.  You know I'd be more than happy to spread the word!",
      "created_at": "2005-04-01T20:25:08.000Z"
    },
    {
      "author": "Lincoln",
      "body": "I have to admit I didnt read many of the comments, so If I duplicate what you wrote get over it. \r\nA: its not about image  - highschool is over.\r\nB: it is your image to be.. well.. moxie.\r\nC: anything that helps keep you alive in business  one more day is one more day you are in business.\r\n\r\nCan I sponsor the official moxie gum under the 4th seat in the third row. Ill chew a fresh one for ya.\r\n\r\nFinding new an interesting ways to make a living, market your business and still have booze at the of the day is what its all about.\r\n\r\nIt wont turn anyone away that you dont mind turning away anyway. \r\n\r\nLike a previous comment states, build a story around it, purchase a special domain name for the cinebar and glorify the person who names it with a special area on the website just for the cinebar with wine tasting and beer reviews, cinebar popcorn machine cam! sweet!",
      "created_at": "2005-11-09T04:47:04.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
