{
  "id": 183,
  "title": "Investors and the like",
  "body": "In the early days of The Moxie - as in pre-blog early - I considered setting up a tiered investment program that would allow local, film loving investors the opportunity to \"buy into\" our theater. Of course, in those days, we really didn't have much of an idea on how much the entire venture would cost. All we knew was that it would take a lot more money than what we had in our pockets, which was roughly $5.87, two sticks of gum, a dry cleaning receipt, and nine gum wrappers. As the project progressed and our research began to yield more accurate cost estimates, I started to question whether we really needed to seek investors. Did we really want to go through the headache of investor relations? The answer was, and still is, a resounding NO (but I'm willing to change). Let me explain:<br/><br/><b>The problem with investors</b><br/><br/>1. The first and most obvious problem with investors is that they have to be paid back. Every dollar used to pay investors is a dollar out of the return on our own investment of both time and money. Think of it like this, despite the amount of money that goes into the theater, only so much is going to come out. If we have $85K to open the theater or if we have $125K, the positive cash flow is still going to remain virtually unchanged (given that the extra money isn't used to increase capacity). I want to maximize my return on the theater, and rightly so, but every investor we take on equates to a loss in our net profit.<br/><br/>2. The only thing I'd hate more than losing money on the theater would be losing content control. That's a HUGE issue when dealing with investors, and advertisers too. Granted, not every investor will want to control what movies fill our screen, but it only takes one rotten apple to ruin a barrel. Ideally, an \"involved\" investor would drop me an e-mail or catch me at the theater and say, \"You know, I've always enjoyed classic Kung Fu movies. That would be great if you could play some of those.\"<br/><br/>\"Sure,\" I'd say. \"I'll see what I can do.\"<br/><br/>From that point on I'd keep my eyes open for a good Kung Fu movie to play, but I'm not going to go out of my way to make sure we get one - especially at the cost of alienating our audience. That's a BEST CASE SCENARIO. On the other side of the spectrum, we might get someone who says, \"That Italian movie you showed last week was absolute filth. I can't believe you'd show a movie where half of a woman's breast was visible. Porn! That's what that is... you're nothing but a porn peddler, and I demand you show <i>The Passion of the Christ</i> for the next two weeks or else I'm pulling my investment.\"<br/><br/>Obviously, that's an EXTREME scenario, but you get the picture. Too many cooks in the kitchen leads to someone getting a shiv in the eye.<br/><br/><b>Solutions</b><br/><br/>As you can see, it all boils down to cost and control. Are there ways of overcoming these investor relation problems? In short, yes... in long, yyyyyyeeeeeeesssssss. But how? In my mind, there's really no way of getting around the cost issue. That's the price we pay to get the money we need. Seeing as most, if not all, of our potential investors will be film lovers, I think it would sweeten the deal if we threw in special perks for various levels of investment (i.e. t-shirts, free Moxie memberships, private screenings, etc.). But how much is TOO much, and at what interest should we offer repayment?<br/><br/>Let's say someone wanted to invest $3,000 in our theater. If we offered them a 7.50% return on their investment over 3 years, we'd be paying out $281.51 per quarter with a combined total of $378.07 in interest over the life of the investment. Now, if we were to give this investor free movies for the life of his or her investment, we'd be losing quite a bit of money, so maybe we could offer free membership privileges instead.<br/><br/>I'm tempted to make the investment packages low, so more people can afford them, but that would also mean having MORE investors, which is not a desirable outcome. The more investors we have, the more chances we have for content conflicts. I think the lowest package should be $2,500... maybe lower. I'd like to keep the number of investors as low as possible, and stop once it reaches $25,000.<br/><br/>As far as content control goes, our only recourse will be to state in the investment papers that...<br/><br/>\"The purpose of The Moxie is to bring an ever-changing array of smaller films to the Springfield market. We cannot guarantee that you will enjoy ever film we exhibit, nor can we promise that all of our films will cater to your sensibilities, but those are small prices to pay when it comes to broadening the film exposure of an entire community. We will gladly entertain any and all suggestions or recommendations, but will not make drastic changes to our fundamental mission of bringing quality film, despite its nature, to Springfield. We won't show porn either... unless it's really classy... or directed by Vincent Gallo.\"<br/><br/>That ought to do the trick. Hopefully.<br/><br/>As for the eBay saga - it still continues. I'm this far (imagine me holding my fingers a hair's breadth apart) from doing it. Perhaps I'll draft the description this weekend, post it on Monday, field comments and suggestions, and then put it up for auction. Only two things can happen: it'll work, or it won't. Either way, it will be fun.<br/><br/>One last thing: I think the best way to woo prospective investors will be to have a pseudo fundraiser / showcase sometime in the upcoming weeks. The walls should be taking shape in the very near future, so hosting something in the theater won't be completely out of the question. Perhaps we could have the event catered by one of the downtown restaurants and show a movie (in digital form, of course) on the wall... *cough* Suburban *cough* Seven *cough*... maybe have an acoustic band... *cough* Sweetwater *cough* Abilene *cough*... pseudo art showing... the list is endless! What do you think?<br/><br/>Of course, the city would have to agree to this... hmm...",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-04-01T22:21:10.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Justin",
      "body": "I don't think you'd need to worry about losing control.  In fact, you could raise a little more than necessary and keep that extra cash as \"insurance\" to pay an investor out who think he/she should have more control than what you think.  I don't see it getting that dirty, but the option is there.",
      "created_at": "2005-04-01T23:31:07.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "I would definitely be interested in seeing where a fundraising event would go. I'd be willing to donate the MOrawk PA for it if you don't have a sound system by then. On that note, I think it will take a good amount of planning and structuring so you can maximize both turnout and funds raised.",
      "created_at": "2005-04-01T23:31:53.000Z"
    },
    {
      "author": "bjork24",
      "body": "Indeed. It's still in the very preliminary stages, but there's a definite rumbling. Wait. No, that's my stomach. I better go get a bite to eat before I head down to work on the theater. I've been told I have kitten breath.",
      "created_at": "2005-04-01T23:33:36.000Z"
    },
    {
      "author": "Justin",
      "body": "I think the fundraising idea is good, too.  Invite all the blog readers down to the building, show them around, give them something to watch and/or listen to, give them food, and most importantly, charge them to get in. 100 people at $5 a piece is $500; not a lot, but it's a start.  Have a romaing \"collections jar\" as well.  Get the community involved and I'm sure you'll start to gain more interest.",
      "created_at": "2005-04-01T23:40:17.000Z"
    },
    {
      "author": "bjork24",
      "body": "Will the romaing jar need to be filled with roma tomatoes?",
      "created_at": "2005-04-01T23:41:54.000Z"
    },
    {
      "author": "Justin",
      "body": "Yes. roMANG.",
      "created_at": "2005-04-01T23:43:21.000Z"
    },
    {
      "author": "Kirsten",
      "body": "The fundraiser is a good idea.  I am willing to donate any MOVIES that you want to show that evening for FREE, your choice, honestly. <br/><br/>Invite the blog readers to bring a nice little catered dish and drink, you won't be out $$ for food. Donation jars definitely a good idea!  Do it during Art Walk weekend, when people are out, walking all over the place!<br/><br/>The e-bay thing is also not a bad idea at all.  You should try it, nothing to lose.<br/><br/>Is it possible to up your loan amount?<br/>  <br/>You could show extra movies (digital) inbetween the times you couldn't afford to bring one in on \"reel film\" - (clearing my throat) donated by my store.  All I'd ask for in return is a few free tckets now and then.<br/>Dead serious.",
      "created_at": "2005-04-02T00:21:28.000Z"
    },
    {
      "author": "Kirsten",
      "body": "free tickets....not tckets...tickets tickets tickets",
      "created_at": "2005-04-02T00:23:03.000Z"
    },
    {
      "author": "bjork24",
      "body": "Kristen: That would be a great idea, except we have to license each film we show through a distributor. Showing a DVD that we borrowed from your store is a major no-no... if we get caught.",
      "created_at": "2005-04-02T00:24:09.000Z"
    },
    {
      "author": "Andrew",
      "body": "I hate to be the continuously wet blanket, but regardless of the progress of the framing, it is not really a great idea to have a fundraiser in a construction site. If you have hundreds of people showing up, somebody is going to notice. If something goes wrong, there is liability. If you have a more moderately sized event, no problem, but how much money can you really hope to raise? You're welcome to have an event across the street, if you want, and walk people over to show them the theater, and you might even be able to get the cabana room or whatever it's called around the corner. I think an event is a good idea, but unlikely to make much of a dent on your capital issue.<br/>FWIW: I think the \"porn\" vs. \"passion of the christ\" example is without merit -- a situation like that would never happen, and is not a good reason for refusing investors. The people around here who might invest a few thousand dollars in a little art cinema are unlikely to fit this profile; to the contrary, they would probably like a controversial film selection as it would provide them with an opportunity to boast of their cosmopolitanism viz. the Assemblies of God, etc.  ",
      "created_at": "2005-04-02T00:35:04.000Z"
    },
    {
      "author": "brian of moore",
      "body": "\"if we get caught\"  ... shhhhh nobody tell",
      "created_at": "2005-04-02T00:35:54.000Z"
    },
    {
      "author": "Kirsten",
      "body": "Ok Dan. Didn't know if that would be the case for a \"fundraiser\" or not.  You should be able to do this for a fundraiser, honestly.  You won't actually be open yet, it won't count!",
      "created_at": "2005-04-02T00:49:14.000Z"
    },
    {
      "author": "Tawny",
      "body": "I'm all for a fundraiser! I'll offer to donate a few cakes for the occasion if your interested. I'll also pitch in with a few hors d'oeuvres too. It won't be fancy, but edible. Let me know if you are interested.",
      "created_at": "2005-04-02T00:52:51.000Z"
    },
    {
      "author": "Matt",
      "body": "I still like the naming idea, though not necessarily tied to ebay.  You need to control it, like you said, so that you don't wind up with the freeviagraonline.com cinebar.  It's really only funny if it's an individual, and then, you have to wonder what price is fair?  I guess whatever you can get is what that sponsorship is worth.  You gotta figure people don't have an interest in advertising themselves generally speaking, so the people who bid on this or do it will be in it for the joke and for the good of the Moxie.  I personally think the private investors is a big pain in the ass and will take away significantly from your bottom line, but if it's the only way... just keep in mind that when you have investors, you suddenly have more paperwork and all that legal stuff that winds up costing more in time than you'd ever think it should.",
      "created_at": "2005-04-02T02:11:37.000Z"
    },
    {
      "author": "brian of moore",
      "body": "I want this cinebar bidding thing to happen.. i dont know if i could afford the highest bid.. ill be bidding for my best friend kristin... she loved independent films.. and drinking.. heh.. and was very much looking forward to the moxie opening... I cant say that she would have wanted her named behind a bar... but it would make me smile",
      "created_at": "2005-04-02T02:39:57.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Eeek. This sounds like Plan B to me. Go ebay, stave off HARD NIPPLES DOT ORG PRESENTS THE CINEBAR and I think everything will come together.<br/><br/>I mean,you set the price at $10k. Ebay will get their 5%, but if you got a $10k bid you'd probably get another and another...",
      "created_at": "2005-04-02T03:03:41.000Z"
    },
    {
      "author": "Oz",
      "body": "I have to agree with you about the problems with investors.  From reading Andrew's comment, he thinks this would never happen.  But from having worked in a fund raising environment before, I can assure you that when people part with their money--even $100 of it--they think they should have some say.  I think that your language in your investor contract should be MUCH stronger.  Skip the part about entertaining suggestions.  Spell it out under no uncertain terms that content will be controlled completely by Dan & Nicole Chilton.  Also put in a bit about your right to buy out an investor at anytime (with some sort of financial bonus for them, of course).  When you hire the lawyer to draft the investor contract, be sure to have them use the strongest lanuage possible about this issue.  If Andrew is right and all of your investors are pure of heart and it would never cross their minds to question or demand certain films, then they won't have any problem signing the contract that states just that, will they?",
      "created_at": "2005-04-02T03:10:05.000Z"
    },
    {
      "author": "Lor",
      "body": "No wonder you don't have any money... you are obviously wasting too much buying gum! Two sticks and nine wrappers.. all in one pant pocket... you have an addiction Dan the man... an addiction...",
      "created_at": "2005-04-02T03:31:45.000Z"
    },
    {
      "author": "Tim",
      "body": "Sounds like a tough position to be in.  But if anyone can hack it, it's the DanMan.  Oh yes.  Yes indeed.",
      "created_at": "2005-04-02T04:14:19.000Z"
    },
    {
      "author": "Andrew",
      "body": "Well, I'm not suggesting that investors wouldn't want \"ownership\", in the sense of feeling like they're making a difference, part of a cool project, etc. Why else would they invest? Although nobody is suggesting \"pureness of heart\", I doubt a small investment in the Moxie is going to appeal to the venal profiteer.  The porn/passion example is hyperbole, regardless.  ",
      "created_at": "2005-04-02T04:39:08.000Z"
    },
    {
      "author": "Aaron",
      "body": "Listening to KSMU kickoff its spring fundraiser reminded me of how you can have investors contribute and be involved but not have control on what is broadcast. Last fall I committed to donating $10 a month to KSMU for various reasons – the basic one being that I want the programming that I like to continue – but I will never call up and tell them what they can and cannot broadcast. I may call or write in to comment (possibly negatively) about a certain topic, but even in the case of a negative comment, it would be for the sole purpose of improving their content/delivery/etc. Granted, in KSMU's case, I could not contribute and still listen, but I would be willing to put up a few bucks a month to support the Moxie and still frequent the theater and pay for tickets (though member perks would, of course, be nice). I couldn't commit to dropping a $100 or so all at one time, but if it was possible to pay monthly or quarterly, I could definitely provide a humble investment. Is the membership idea worth revisiting at all?",
      "created_at": "2005-04-02T05:29:27.000Z"
    },
    {
      "author": "Aaron",
      "body": "Oh, and I'm sure porn with passion is pretty hard to find. But I don't live next to an adult supercenter, so I wouldn't know.",
      "created_at": "2005-04-02T05:30:45.000Z"
    },
    {
      "author": "bjork24",
      "body": "So many comments... so little time.",
      "created_at": "2005-04-02T08:27:40.000Z"
    },
    {
      "author": "matt",
      "body": "there's a big difference between finding investors and doners.  this is not a non-profit organization, so the fundraising examples may be a little moot.  people aren't usually willing to toss money into a for-profit company without expecting a return.",
      "created_at": "2005-04-03T07:02:25.000Z"
    },
    {
      "author": "J.R.",
      "body": "I'll write a song called \"Porn vs. Passion\" and play it at the fundraiser.  There would also be a Phlogging song.",
      "created_at": "2005-04-04T23:56:24.000Z"
    },
    {
      "author": "nicholas",
      "body": "Dan, you've got my permission to show S7 if it will help you get the theater opened. But it can't be a public showing (yet) and I'll have to get a list from you of who saw it. Other than that, go for it.",
      "created_at": "2005-04-06T22:52:39.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
