{
  "id": 185,
  "title": "eBay the Cinebar: The Post",
  "body": "Ok, I'm going to bang this out as fast as possible. I find that the longer I sit and think about what I'm going to write, the worse it sounds once it hits paper, or in this case, the screen. I did a lot of eBay research over the weekend, paying particular attention to the <a href=\"http://www.goldenpalaceevents.com/auctions/\" target=\"_blank\">crazy auctions</a> that <a href=\"http://www.goldenpalaceevents.com\" target=\"_blank\">GoldenPalace.com</a> has been winning. I'm not saying that we should only focus on Golden Palace Casino, but seeing as they're currently the number one purveyor of unique eBay items, it wouldn't hurt to emulate some of the auctions they participated in.<br/><br/>After studying the most famous and successful of the auctions, I've boiled the eBay formula down to four points:<br/><br/><ol><li><b>Unique</b> - Everyone is born with a name, so selling your personal naming rights on eBay isn't very unique. It's all a matter of timing. As long as you're the first person to do it, you might be able to cash in. Likewise, lots of people could find a potato shaped like Pete Townsend or a dorito shaped like the pope's hat if they looked hard enough. The success of those auctions relied more on opportunism than anything else. We, on the other had, are a wee bit different.<br/><br/>How many other independent theaters are offering up the naming rights to their concession bar? None that I know of - and you know why? Because our auction (for the time being) is unique... with just the slightest hint of opportunism for flavoring.</li><br/><li><b>Validity</b> - Big bidders will need to see proof that we're the real deal - a legitimate business. The blog alone won't do the trick, but I have a few more cards up my sleeve: copies of our LLC papers and our sales tax license, links to a couple news stories that ran over the last few months, pictures of me dressed as Slash, etc..</li><br/><li><b>Compelling description</b> - This part is all on my shoulders, covered in dandruff (ha ha, just kidding. I don't have shoulders). If I can't make our auction sound believable and worthwhile, no one will bid on it. That's putting a lot of pressure on my writing ability, but I think I'm up to the challenge, by gum! BUY GUM! Weird.</li><br/><li><b>Exposure</b> - This is the probably the single most important ingredient of success. No matter how well the post is written, or how unique the opportunity is, if no one sees it, no one will buy it. That's where you, my well-connected army of readers, come in. With everyone's help, I have No Doubt (the band) that we can get the auction seen by the right people. Sure, my server might crash due to the increased amount of traffic (Pat over at <a href=\"http://www.pezmp3.com\" target=\"_blank\" class=\"broken\">PEZ MP3</a> knows all about that), but it would be well worth it. We'll cover the logistics of the PR campaign tomorrow.</li></ol><br/>Now, with all that being said... here goes nothing:<br/><br/>NOTE: My blog is really skinny, so the actual post won't be anywhere near this long.<br/><br/>- - - - - - - - - - - - - - - - - - - - - - - - -<br/><br/><b>Synopsis</b><br/><br/>This auction is for the exclusive naming rights of the concession bar, also known as the Cinebar, located within <a href=\"http://www.moxiecinema.com\" target=\"_blank\">Moxie Cinema</a> - Springfield, Missouri's premiere independent movie theater. The winning bidder will reserve the right to have the Cinebar named after themselves or their corporation for the first year of operation (see below for other items included with the naming rights). This is a legitimate auction. Only serious bidders will be considered.<br/><br/><b>The Pitch</b><br/><br/>A little over a year ago, my wife and I set out to open an independent movie theater in our hometown of Springfield, Missouri. Having been movie lovers all our lives, we knew first-hand the pain of watching quality independent and art-house movies pass us by for the larger markets of St. Louis or Kansas City.<br/><br/>[ REENACTMENT - May 2000 ]<br/><br/><b>Dan</b> - Man, I sure wish we had some good movies around here.<br/><b>Nicole</b> - Me too.<br/><b>Dan</b> - Let's go make some moonshine.<br/><b>Nicole</b> - Ok.<br/><br/>It wasn't until we witnessed the success of a <a href=\"http://www.ragagfilm.com\" target=\"_blank\">similar theater in Columbia, Missouri</a> that Nicole and I decided it was time to give Springfield what it wanted - a Macaroni Grill. Unfortunately, due to a lack of start-up funds and restauranteering experience, our dream fell to the wayside. But then inspiration struck...<br/><br/><b>Dan</b> - Why don't we open a little independent movie theater right in the heart of downtown?<br/><b>Nicole</b> - Yeah, that would be wonderful! The current downtown revitalization and cultural renaissance would be quite conducive to an art-house theater!<br/><b>Dan</b> - Do we really talk like this?<br/><b>Nicole</b> - Golly, I sure hope not!<br/><b>Dan</b> - Let's go make some moonshine.<br/><b>Nicole</b> - Ok.<br/><br/>And so began our year-long journey from well-paying corporate jobs straight down the ladder to aspiring theater owners. If you're the least bit interested, you can read all about the process of opening the theater, step by excruciating step, at the official <a href=\"/moxie\" target=\"_blank\" class=\"broken\">Moxie Blog</a>... there's even <a href=\"/phlogs\" target=\"_blank\">pictures</a>! Here's a condensed timeline of the events that have shaped The Moxie thus far:<br/><br/><ul><li><b>March 6, 2004</b> - The idea to open a theater bubbled to the surface</li><br/><li><b>March 10, 2004</b> - A building in downtown Springfield was found</li><br/><li><b>March 13, 2004</b> - Met with the building owners, decided to move forward</li><br/><li><b>May 13, 2004</b> - Began working with the co-founders of <a href=\"http://www.ragtagfilm.com\" target=\"_blank\">Ragtag Cinemacafe</a></li><br/><li><b>May 24, 2004</b> - Started the <a href=\"/moxie\" target=\"_blank\" class=\"broken\">Moxie Blog</a></li><br/><li><b>June 6, 2004</b> - Listed as a Blogger \"Blog of Note\" (shameless plug!)</li><br/><li><b>July 1, 2004</b> - Chose the name \"Criterion Cinema\" for theater</li><br/><li><b>July 6, 2004</b> - Decided we liked the name \"Moxie Cinema\" better</li><br/><li><b>August 1, 2004</b> - Blog readers design, and eventually create, the Moxie's logo</li><br/><li><b>September 26, 2004</b> - Due to excessive renovation costs, a new building was chosen for The Moxie</li><br/><li><b>October 12, 2004</b> - Applied for loans through the SBA and SFDC (Springfield Financial and Development Corporation)</li><br/><li><b>October 31, 2004</b> - Dressed as <a href=\"/posts/90\" target=\"_blank\">Slash for Halloween</a></li><br/><li><b>November 1, 2004</b> - Filed resignations with our corporate jobs</li><br/><li><b>December 1, 2004</b> - Financing was approved from both the SBA and SFDC</li><br/><li><b>December 30, 2004</b> - Moved back to Springfield</li><br/><li><b>January 11, 2005</b> - Moxie Cinema, LLC was formed</li><br/><li><b>February 14, 2005</b> - Received sales license and permit</li><br/><li><b>March 24, 2005</b> - Received our building permit</li><br/><li><b>April 6, 2005</b> - Auctioned off the naming rights to the Cinebar</li></ul><br/>So there you have it - the condensed version of HOW we came to be, but that still doesn't explain...<br/><br/><b>Why we're auctioning off the naming rights to the Cinebar</b><br/><br/>In the beginning of this venture, we were more than confident that our loans would carry us through to opening day, but then came the city-mandated upgrades. To bring the building up to code, we needed to upgrade the building's electrical service and HVAC system. Neither of these building improvements were expected or budgeted for (by us or the building owners), which left us in a heck of a bind. We could either back out completely, or roll up our sleeves and whip the budget into shape.<br/><br/>We chose the latter. Obviously.<br/><br/>Now, after nearly a month's worth of budget trimming, we're still a bit shy of opening day. We can afford the building upgrades, but in order to do so I've had to cut a lot of corners in the equipment and renovation costs. That's not good. The last thing I want is for moviegoers to leave our theater and say:<br/><br/><b>Moviegoer 1</b> - Did you notice how the film kept jumping all over the screen?<br/><b>Moviegoer 2</b> - We were watching a movie?! I thought we were at Office Depot.<br/><b>Moviegoer 1</b> - That makes no sense whatsoever. The purpose of this dialogue was to portray the sacrifice between film presentation and customer retention.<br/><b>Moviegoer 2</b> - Yeah, I know. I'm never coming here again! I couldn't find the ink jet refills ANYWHERE!<br/><b>Moviegoer 1</b> - Just get in the car.<br/><br/>So Nicole, the blog readers, and I all sat down and thought up a way to cover the final start-up costs - we'd auction off the naming rights to the Cinebar... maybe the restrooms too, depending on how well this goes over.<br/><br/>Like most eBay naming rights auctions, this is a once in a lifetime opportunity! Not only will your bid help us cover our final expenditures, but it will also ensure the propagation of independent and art-house film in a market that desperately needs it. Our theater is not like your standard first-run multiplex. We're catering ourselves to you, the movie fan. The Moxie will feature:<br/><br/><ul><li>Personal introductions before each film</li><br/><li>Art on the walls from local and regional artists</li><br/><li>Music from local and regional musicians</li><br/><li>Clever, and dare I say witty, pre-show slides</li><br/><li>Special film series (i.e. the heckler's series where we show cheesy movies, turn down the volume, and let the audience heckle to their heart's content... Mystery Science Theater style)</li><br/><li>Visiting film-makers, actors, and the occasional best boy</li><br/><li>Wine and beer (we're the only theater in Springfield to offer alcoholic beverages), fresh made treats from a local downtown bakery, gourmet coffees and teas, etc., etc., etc.... all served at the Official WINNING BIDDER Cinebar!</li><br/><li>Film festivals for students at the neighboring colleges and regional film-makers</li><br/><li>Collaborations with downtown businesses to create \"Dinner and a Movie\" gift certificates, cross promotional film series, and a whole bevy of other activities that will be unique to The Moxie</li></ul><br/>Once I start talking about the theater, it's hard for me to stop, but this description has to end somewhere. Thankfully, that SOMEWHERE isn't right HERE. If you have any questions, please drop by the <a href=\"/moxie\" target=\"_blank\" class=\"broken\">blog</a> first (most, if not all, questions have been asked and answered there sometime over the last year). If you still need more info, please feel free to contact me through eBay and I'll be happy to answer any questions you might have.<br/><br/>Before I go, here's even MORE Moxie information for your reading/viewing pleasure:<br/><br/>Articles written in the local papers: <a href=\"http://www.news-leader.com/today/0126-Enoughscre-288101.html\" target=\"_blank\" class=\"broken\">Article #1</a>, <a href=\"http://drurymirror.collegepublisher.com/news/2005/02/18/Features/Springfield.Gets.Moxie-868721.shtml\" target=\"_blank\" class=\"broken\">Article #2</a>, <a href=\"/categories/15\" target=\"_blank\">MORE</a><br/><br/>Pictures of the building: <a href=\"/phlogs/2\" target=\"_blank\">not cleaned out</a>, <a href=\"/phlogs/9\" target=\"_blank\">cleaned out</a>, <a href=\"/phlogs/\" target=\"_blank\">MORE</a><br/><br/>Too much Moxie never hurt anyone, right? Right?<br/><br/><b>Future conversation overheard in The Moxie</b><br/><br/><b>Moviegoer 1</b> - Wow, this place is AWESOME!<br/><b>Moviegoer 2</b> - You're telling me. I've never seen such a cool office supply store!<br/><b>Moviegoer 1</b> - Dude, seriously. Can we just keep to the script here?<br/><b>Moviegoer 2</b> - Ok, ok. (<i>clears throat</i>) You're telling me. I've never seen such a cool independent movie theater.<br/><b>Moviegoer 1</b> - I know. Art on the walls, music by cool local bands...<br/><b>Moviegoer 2</b> - Not to mention all the great movies!<br/><b>Moviegoer 1</b> - Have you tried the coffee at the WINNING BIDDER concession bar?<br/><b>Moviegoer 2</b> - You mean the WINNING BIDDER <i>Cinebar</i>! Why would I get coffee when I can sip on a smooth glass of red wine?<br/><b>Moviegoer 3</b> - Excuse me. I couldn't help but overhear you two, but did you say that you can get wine and coffee at the WINNING BIDDER Cinebar?<br/><b>Moviegoer 1</b> - Wine, coffee, beer, tea, brownies, cookies.<br/><b>Moviegoer 2</b> - Popcorn.<br/><b>Moviegoer 3</b> - That's amazing! I wonder how the WINNING BIDDER Cinebar got its name.<br/><b>Moviegoer 1</b> - I don't know, but I suddenly have an urge to go buy a SERVICE OR PRODUCT from WINNING BIDDER right now!<br/><b>Moviegoer 2</b> - Hey, me too!<br/><b>Moviegoer 1</b> - SWEET!<br/><br/><b>The WINNING BIDDER of this auction will receive:</b><br/><br/><ol><li>The naming rights to The Moxie Cinebar for the first year of operation</li><br/><li>A big sign on the side of the Cinebar that reads \"OFFICIAL WINNING BIDDER CINEBAR\"</li><br/><li>Free on-screen advertising as it pertains to the Cinebar, as in: <i>Feeling thirsty? Go grab a drink at the WINNING BIDDER Cinebar!</i><br/><li>A free Moxie Cinema t-shirt, a set of limited edition Moxie buttons, and a Moxie sticker (see <a href=\"/posts/store.php\" target=\"_blank\" class=\"broken\">Moxie Store</a> for examples)</li><br/><li>Two free Moxie VIP memberships that will entitle the holder to free movies for one year</li><br/><li>An apron made by Nicole</li></ol><br/><b>Parting shots</b><br/><br/>Just to cover our butts, we had to set up a few rules:<br/><br/><ol><li>Seller reserves the right to approve or disapprove any name submitted by the winning bidder. Duh!</li><br/><li>The winning bidder is not entitled to any content or business decisions pertaining to Moxie Cinema, whether direct or indirect.</li></ol><br/><img src=\"http://img97.exs.cx/img97/5369/moxiefront6qo.jpg\" width=\"425\"><br/>- - - - - - - - - - - - - - - - - - - - - - - - -<br/><br/>Phew! There it is. That was terrible. I just kept writing and writing and writing... it was like my fingers couldn't stop. Keyboard diarrhea, that's what that is. I definitely read too many auctions that utilized the <a href=\"http://www.goldenpalaceevents.com/ebay_archives/name01.html\" target=\"_blank\">blah, blah, blah technique</a>. Oh well. What do you think?",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-04-04T21:56:47.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "I was going to lay down and finish reading my book tonight, but this post was so long I have decided to never read another book ever again. ",
      "created_at": "2005-04-05T04:41:01.000Z"
    },
    {
      "author": "bjork24",
      "body": "That was its intent.",
      "created_at": "2005-04-05T04:42:12.000Z"
    },
    {
      "author": "Fyse",
      "body": "Woah, that was a marathon. I think it might be wise to go for something slightly shorter on the actual auction. Everything  you need is certainly there, and lots more besides!<br/><br/>It's really good though. I just hope your 'focus group / unholy army of the night' can whip people into a sufficient frenzy of bidding...",
      "created_at": "2005-04-05T05:00:41.000Z"
    },
    {
      "author": "Aaron",
      "body": "Will you set a reserve for the auction? <br/><br/>At this point I'm not entirely opposed.",
      "created_at": "2005-04-05T05:40:20.000Z"
    },
    {
      "author": "Allison",
      "body": "I haven't finished reading the entire post yet, but from what I understand, you can't supply external links on auctions.  This is probably because I would link to, say small-newspaper.com or something and if I had a popular auction, in effect, slashdot them.<br/><br/>I'm not sure what the alternative is besides typing out the whole url.",
      "created_at": "2005-04-05T06:35:28.000Z"
    },
    {
      "author": "justin",
      "body": "You can use regular old HTML on eBay... external links included.",
      "created_at": "2005-04-05T06:51:49.000Z"
    },
    {
      "author": "Allison",
      "body": "yes -- don't be afraid to use colorful html -- pretty it up to suck them in.  bulleted lists and blockquotes around your conversations and stuff.<br/><br/>also, I'd be less inclined to say that you reserve the right to reject \"anything\" and more inclined to word it as reserving the right to reject things that \"don't fit our model of business, e.g. obsenities\".  that way people don't think you're going to reject everything passed to you.",
      "created_at": "2005-04-05T07:01:11.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Keen.  Could be edited down to be punchier (the more screens of text someone has to scroll through, the more readers you lose), but amusing.  We wish we were rich.  (Matt standing in for Stephanie)",
      "created_at": "2005-04-05T07:20:09.000Z"
    },
    {
      "author": "Caleb",
      "body": "wouldn't it be awesome to see a big news story about this on the local news...or even the national news? MAYBE EVEN FOX NEWS!!! woohoo! :-P<br/><br/>well good luck, i think it could really, really help you guys, as long as the word gets out. i'm excited to hear how this all plays out...",
      "created_at": "2005-04-05T07:25:24.000Z"
    },
    {
      "author": "Allison",
      "body": "Dan there's a news source I read that I'll submit this interesting \"tidbit\" to after you submit it to ebay, but I'm wondering if it's acceptible to call you a \"technophile who left his comfortable job to run an independent cinema\"<br/><br/>Also, I can't tell in some cases that \"winning bidder\" is meant as a fill-in-the-blank thing.  It looks like you're really going to name it the \"Winning Bidder Cinebar\", which is also funny.  I don't know how to fix that.",
      "created_at": "2005-04-05T07:37:26.000Z"
    },
    {
      "author": "muddgirl",
      "body": "hmm...put the little \"What the winning bidder will get\" part at the top, and the story at the bottom. There, much better.",
      "created_at": "2005-04-05T07:38:27.000Z"
    },
    {
      "author": "Rachel",
      "body": "Your mom's blog is skinny.  Seriously, it worked for me.  I'm already thinking about bidding.  Of course it will probably go for more than $7.",
      "created_at": "2005-04-05T08:11:47.000Z"
    },
    {
      "author": "Oz",
      "body": "I have to agree with Allison that you might have re-word the \"Seller reserves the right to approve or disapprove any name submitted by the winning bidder.\"  Why bid if any name could be rejected for any reason?  I know that your intent is to keep the name from including profanity, sexual content, or other inappropriate language, but what you're saying is that you can reject anything.  You should modify this statement somehow.<br/><br/>And I find it very amusing that you refer to the Moxie as \"Springfield, Missouri's premiere independent movie theater.\"  You know, since the Moxie doesn't really exist yet.",
      "created_at": "2005-04-05T17:06:41.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Awesome stuff Dan. I agree that it's a bit long in the tooth, and suggest columns, pictures, or \"something\" (that's slang for crack...and crack is wack) to help trim it down a bit.<br/><br/>Oh, and I must insist that a seller question be answered much like the linked \"I'll change my name forever because I'm a stupid\" auction was. Let's recap:<br/><br/>Question: \"Correct me if I am wrong, but aren't you the same Terri I met at the backstage party after Russell Crowe's TOFOG concert in Austin TX about 3 yrs ago?!!?\"<br/><br/>\"OMG, OMG!! Hi Jen! I can't believe you found me! (I can't believe you found this auction--unbelievable! LOL!!) How r'you girly!!\"<br/><br/>Perhaps as long as you could begin each answer with \"OMG, OMG!!\" and refer to each bidder as \"girly\" then we can really get somewhere in terms of getting a company/individual to invest in Cinebar naming rights. I'd say a few teenage euphamisms are worth $10k, probably more.<br/><br/>Oh, and one last thing: You don't really explain in full where the name Cinebar comes from and only mention the wine in the Customer Faux Conversations. Or did I miss something? I probably did. Let's go make some moonshine.",
      "created_at": "2005-04-05T17:26:38.000Z"
    },
    {
      "author": "steph v.",
      "body": "I win!",
      "created_at": "2005-04-05T17:33:06.000Z"
    },
    {
      "author": "Nate",
      "body": "Mmmmm....glass of wine and a nice inkjet cartridge.",
      "created_at": "2005-04-05T18:30:41.000Z"
    },
    {
      "author": "Matt",
      "body": "Lose the side-bar conversations.  No really, take them deep into the woods at night the run away with the only flashlight and leave them to die.  It's the only way.",
      "created_at": "2005-04-05T19:12:05.000Z"
    },
    {
      "author": "Pat",
      "body": "It's never going to be perfect. Get it out there and adjust it on the fly if need be. You might be able to hit the news gap before the Pope's funeral. On the other hand it is all Pope all the time on CNN. They have got to be running out of Pope angles. Maybe you can get part of that coverage. Maybe you should donate the naming rights to the screen to JP2 as a way of drawing coverage to the cinebar auction. Bad taste? yep.",
      "created_at": "2005-04-05T19:52:20.000Z"
    },
    {
      "author": "J.R.",
      "body": "Entertaining, but could be a bit shorter and punchier.",
      "created_at": "2005-04-05T21:02:47.000Z"
    },
    {
      "author": "bjork24",
      "body": "Hmmm, good suggestions. I'll impliment the best of them before the auction goes live.",
      "created_at": "2005-04-05T22:01:24.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
