{
  "id": 186,
  "title": "eBay the Cinebar: The Price, the Length, and the Buzz",
  "body": "<b>The Price</b>\r\n\r\nLow price / high reserve OR High price / no reserve?\r\n\r\nIf we set the price low, we'll most likely get a flurry of bidding from small bidders until the price reaches a certain point (I'd guess around $1,000). At that point, it would be up to the bigger bidders to carry the price even higher. On the other hand, setting the price high might lend an air of exclusiveness to the auction, but it might also make us look crazy and kill the entire auction from the start.\r\n\r\nWhat do you think: low or high? And at what price?\r\n\r\n<b>The Length</b>\r\n\r\nIf the auction goes live tomorrow and runs for 10 days, it will end on Saturday, April 16th, which happens to be my <a href=\"http://www.cincodrive.com\" target=\"_blank\" class=\"broken\">sister-in-law's</a> wedding day. Not that there's anything wrong with ending an auction on a wedding day, but I do have concerns about ending it on a weekend. We could do one of two things to counter this: 1) start the auction tonight so it would end on the evening of Friday, April 15th, OR 2) make the auction only last for 7 days. I think having it last for 10 days is important so we can build...\r\n\r\n<b>The Buzz</b>\r\n\r\nThis is the key ingredient. As far as the local media outlets go, I'll have Nicole draft a small press release this evening and send it out tomorrow. From there, I'll need your help to reach the bigger media outlets, both online and off. I can think of lots of online sources that would bring large and immediate amounts of exposure (i.e. Fark, BoingBoing, Make: Blog, Waxy Links, Kottke, LifeHacker, etc.), but it will take some fancy footwork to get listed on any of those sites. Offline, NPR would be a good choice (they even have an <a href=\"http://www.npr.org/about/pitch/story.html\" target=\"_blank\" class=\"broken\">online story submission form</a>). I'm sure you guys can think of many others.\r\n\r\nIn order to spread the word as far as possible, I'm empowering everyone of you with permission to use my name, the Moxie story, and this blog to drive traffic to the auction. If you have a blog, a quick post would be a great starting point. I don't want to come across as exploitative or sneaky, but you know the old adage: 500 heads are better than one. In most cases, story and link suggestions seem more credible when they don't come from the source, so consider this as me asking you for a BIG favor.\r\n\r\nOnce the auction is live, I'll post the URL here and together we will unleash the very first <i>blog reader-inspired eBay auction marketing campaign designed to save The Moxie</i>! Huzzah!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-04-05T21:03:36.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Justin",
      "body": "I guess start high.  <a href=\"http://www.goldenpalaceevents.com/ebay_archives/name01.html\">This auction</a> started at $15,199.00 and got one bid.  So you <i>could</i> start at the lowest possible price your coftorable with...",
      "created_at": "2005-04-05T22:06:21.000Z"
    },
    {
      "author": "bjork24",
      "body": "But at what price? How much would you say the naming rights are worth?",
      "created_at": "2005-04-05T22:11:22.000Z"
    },
    {
      "author": "Justin",
      "body": "How long will they be for?  I'd say at least $10,000 for a year. You could get into the breakdown of just how many *possible* people would be visiting the theater on a daily basis (number of seats + number of shows per day)",
      "created_at": "2005-04-05T22:14:08.000Z"
    },
    {
      "author": "Pat",
      "body": "I would vote to start low and set a reserve. It allows the little guy to get involved and it sends a different message.To me, starting out high ($10,000) tells the wrong story (we expect to get this at least.) Starting out low (99 cents) tells a more democratic, man of the people story (come one and all and paste your name on our cinebar.) ",
      "created_at": "2005-04-05T22:39:44.000Z"
    },
    {
      "author": "Dave",
      "body": "i wouldn't start below 5,000$.",
      "created_at": "2005-04-05T23:41:00.000Z"
    },
    {
      "author": "J.R.",
      "body": "Start at $5, with a buy it now option at $10.",
      "created_at": "2005-04-05T23:56:43.000Z"
    },
    {
      "author": "Allison",
      "body": "If you start it lower, at $0.99, you're guaranteed to get more watchers (because people don't want to watch an auction they can't partake of or relate to) which generates more buzz if you make it to pulse.ebay.com.  I would, however, set a reserve of, say $5,000-7,000.  If you set it Too high, people will think they can't reach it and either (1) stop watching or (2) stop bidding or (3) both.  If people know they've met the reserve, then there's reason to keep bidding -- there's hope.",
      "created_at": "2005-04-06T00:04:22.000Z"
    },
    {
      "author": "Allison",
      "body": "Also, think of this as a small advertising campaign, too, not just an auction.  So you want to keep the little guys, who have only $0.99 to spare, watching it too.",
      "created_at": "2005-04-06T00:06:06.000Z"
    },
    {
      "author": "Allison",
      "body": "Oh, and re: ending on weekends, studies show that Sunday afternoon and Monday mornings are the most popular day for people to sit at home or at the office and ebay... just fyi",
      "created_at": "2005-04-06T00:08:51.000Z"
    },
    {
      "author": "Kirsten",
      "body": "Definitely END the auction on a SUNDAY!",
      "created_at": "2005-04-06T00:13:31.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ok, I'll start it this Thursday so it will end on a Sunday... opening bid $1.00!",
      "created_at": "2005-04-06T00:28:39.000Z"
    },
    {
      "author": "Oz",
      "body": "Good call, Dan.  Make the opening bid as low as possible.  Set the reserve for whatever you feel is right.  Although I think people become more invested if there is no reserve.  Of course you then run the risk of having the auction end at $500 or something, but it's a risk that might pay off.  However, I understand why you don't want to do it.",
      "created_at": "2005-04-06T00:33:32.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "I disagree. I don't understand why you wouldn't set it for what you need. Now everything after that point is great, but if you set the starting bid for $10,000, and get 1 bid, and that bid is good/serious, then you have accomplished your goal. Everything else is gravy.\r\n\r\nHowever, being the damn Libra (it drives me insane soemtimes, I swear to God), on the other hand starting low -will- get more attention early and may even help drive the buzz. \r\n\r\nHowever, the idea of \"I want to start my movie theater. The minimum bid is what I need to begin.\" etc etc seems much more forthright(sp?) to me. \r\n\r\nAnyway, I'll pull every string I can for ya. Very exciting.",
      "created_at": "2005-04-06T00:37:38.000Z"
    },
    {
      "author": "Stephanie",
      "body": "You know I'll spread the word...it's a pity all of us (your loyal readers) can't get together and bid jointly.  YOu know, The Readers of the Moxie Blog Cinebar!  I doubt one reader alone has the cash, but who knows what your faithful followers could do if they all pulled together...",
      "created_at": "2005-04-06T01:06:29.000Z"
    },
    {
      "author": "Nate",
      "body": "Well, there IS a \"donate\" link on the site.\r\n\r\nIn lieu of cash, I have been weaving friendship bracelets.\r\n\r\nSo, so poor right now.",
      "created_at": "2005-04-06T01:33:35.000Z"
    },
    {
      "author": "Jamie",
      "body": "I think its an awesome idea, Louise does too.  she told me that she would not eat cookies for a year if I would put the money towards the moxie.  Then she said she loves Bogey.  \r\n\r\nI think you should start the bidding at 1000.00.  Because you have to keep in mind that you are doing this to raise like 10k.  which of course you already know.  I just hate those annoying people that state the obvious!\r\n\r\nI also think you should mention something in the add about those fabulous tax refunds people get, maybe people could use those!",
      "created_at": "2005-04-06T01:33:44.000Z"
    },
    {
      "author": "Luke",
      "body": "I think the starting price should at least be within a couple of thousand dollars of the amount that you guys need.\r\n\r\nOtherwise, why even bother having your Cinebar named for someone else, someone who managed to win a cool auction for a couple hundred bucks (worst case scenario.)\r\n\r\nStarting high may discourage the little guy, but while winning the heart of the little guy is the Moxie's mission (basically,) what the Moxie needs now is a big chunk of change in order to fulfill that mission.\r\n\r\nAs a fellow Libra (like Evan), I am on the fence about it, but I would hate to see you guys create an awesome auction for a great cause that fails to meet its desired goal of saving the Moxie.",
      "created_at": "2005-04-06T01:36:46.000Z"
    },
    {
      "author": "bjork24",
      "body": "I still think starting it low, with a high reserve, is the way to go. Like Allison said, this should also be considered as an advertising campaign. If we start it low, lots of people will stop by and bid. Eventually the price will be too high for the small bidders, but they'll still watch to see what happens.\r\n\r\nIf it doesn't get as high as we want it, we can always relist at $7,500 with no reserve.",
      "created_at": "2005-04-06T02:37:55.000Z"
    },
    {
      "author": "mike",
      "body": "Wait! No, Dan... don't do it! People on eBay who start a bid low and have a high [in this case, very high] reserve should be kicked in the toe. \r\n\r\nPeople bid and bid all day long and never reach the damn reserve - it's just frustrating and a tease. You should definitely put all the cards on the table and just start with a comfortable starting bid and see what happens... especially if you are only running it for ten days. Low-starting/ high-reserves are the devil!",
      "created_at": "2005-04-06T03:42:15.000Z"
    },
    {
      "author": "Grey Hodge",
      "body": "Actually, I agree with the Mike-like folks. Just start it at 8 or 10 grand, which is what you're looking for anyway, and no reserve. \"Our budgetary shortfall, is XXX dollars, which is why we're starting at that price for the auction. You get to advertise your business at our business, and help revive a struggling downtown for one low low price!\"",
      "created_at": "2005-04-06T08:21:57.000Z"
    },
    {
      "author": "Surferbill",
      "body": "I'm not an eBayer (I waste enough time online as it is), but whatever you choose to do, there'll be a plug for you on my sites!",
      "created_at": "2005-04-06T15:55:50.000Z"
    },
    {
      "author": "steph v.",
      "body": "I win!",
      "created_at": "2005-04-06T16:40:08.000Z"
    },
    {
      "author": "matt",
      "body": "I have a different opinion again I'm afraid.. personally, if it were me, I'd have it with a low start price with no reserve (as someone previously mentioned, to give people a feeling of attainability and increase the buzz). \r\n\r\nThe key point would be that I would link the final auction price with the length of the naming. Personally I felt a single year was a bit short of a duration for the money you're after (my personal opinion), I understand the reasons you may have selected this duration.  Maybe something like.. up to $2999 buys you 6months, $3000 buys you 1year, $5000 buys you two years, $10,000 buys you five years.. and maybe if you're hoping for a highbidder like goldenpalace offer the option of a (winner supplied) sign panel to fit x feet by x feet in your display, i could see GP having some really cool guady vegas mini sign or something ;)",
      "created_at": "2005-04-06T17:56:41.000Z"
    },
    {
      "author": "Caleb",
      "body": "I dedicated a post to all that is Moxie. Well, at least the Cinebar. I think starting with a low bid is the way to go. That way people like me can at least bid once or twice so I can declare proudly that I bidded on the naming rights. I think you'd get more recognition that way. I think setting a reserve is smart, but like many people say it could damage this interesting advertising campaign. If you do set a reserve, make it a low one. ",
      "created_at": "2005-04-06T19:18:51.000Z"
    },
    {
      "author": "Luke",
      "body": "I like Matt's idea of a tiered pricing to length system.\r\n\r\nThat seems like it could encourage high bidders like Golden Palance to get in on the action and get those bids where you need them.",
      "created_at": "2005-04-06T19:19:43.000Z"
    },
    {
      "author": "bjork24",
      "body": "These conflicting opinions are going to make my head explode!",
      "created_at": "2005-04-06T19:30:33.000Z"
    },
    {
      "author": "Nate",
      "body": "And just when the beard was really filling in! No!!",
      "created_at": "2005-04-06T21:34:37.000Z"
    },
    {
      "author": "Matt",
      "body": "What do you REALLY think this might net you from ebay?  I have honestly no idea becuase while it's kinda a gimmicky grab at attention, it's also a real investment opportunity, but it's also a really small theater.  I'm always interested to see what the market values something at, so I'd be for throwing it up there for a buck with no reserve and seeing what it's worth to people.\r\n\r\nI've sold lots of stuff on ebay and I can tell you from my experience anyway that reserves are lame and don't help your auction.  The allure of an auction is the chance to virtually steal something, and there's no hope of that if you know it's set at a high price with a reserve.  I usually beat out other people with similar items by offering no reserve, a low starting price, and the incentive to people to get a bargain.  Sometimes they bid themselves OUT of a bargain, but that's the beauty of it.",
      "created_at": "2005-04-06T21:35:02.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Ebay will net 5%. That is the plain and simple. Everything else is relative.\r\n\r\nLong live the beard!",
      "created_at": "2005-04-06T21:39:58.000Z"
    },
    {
      "author": "Nicki J",
      "body": "Thanks to Caleb and his links, the local news outlets now have my submissions :D\r\n\r\n\r\n*crosses her fingers realllly hard*",
      "created_at": "2005-04-06T22:20:37.000Z"
    },
    {
      "author": "nicholas",
      "body": "Dan, it really doesn't matter (reserve/high, etc)--what matters is if the auction captures public attention and gains momentum. The more people who know about and talk about it, the better. The real key is publicity and originality. Offer to also send a popcorn scoop with the name on it to the winner, then start low and place a decent reserve...then start publicizing the crap out of it.",
      "created_at": "2005-04-06T23:11:53.000Z"
    },
    {
      "author": "Mena",
      "body": "I'm so so so so so excited! I'll definetly help out and try to get the word around, message boards and such. Since I am someone who often buys from ebay, my opinion would be to start with a low price and high reserve. Everyone gets involved cause the price catches your attention, and once you bid you have something invested in it, which will compell you to keep a look out on it. And will also create \"buzz.\" One poster sait it gets frustrating, attempting to reach the reserve. But isnt that what we want? Tons and tons of people bidding to see how far it will go. It's the best, and probably safest way to go. I def. would set a reserve though, otherwise there is a good chance you will get a bid that is too low. \r\n\r\nOh I'm so excited! Go Moxie!",
      "created_at": "2005-04-07T00:58:07.000Z"
    },
    {
      "author": "Adam",
      "body": "What if the winning bidder doesn't want to keep the \"Cinebar\" in the title?  Will you be willing to remove it?",
      "created_at": "2005-04-07T02:28:17.000Z"
    },
    {
      "author": "bjork24",
      "body": "I suppose we'll cross that bridge when we come to it.",
      "created_at": "2005-04-07T02:29:41.000Z"
    },
    {
      "author": "Jed",
      "body": "What if I wanted to name it Japsicans Tofu Chicken and Grits? Would that be ok. I might have to outbid all if I could do that.",
      "created_at": "2005-04-12T02:02:22.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
