{
  "id": 187,
  "title": "eBay the Cinebar: The Excitement Builds",
  "body": "<img src=\"http://moxie.danchilton.com/pix/grum/ebay_blog.jpg\" width=\"425\" />\r\n\r\n<b>Press Release</b>\r\n\r\n<b>Springfield, MO, April 6, 2005</b>: Moxie Cinema, opening later this spring, is auctioning off the naming rights to the Concession Bar to the highest bidder on Ebay. The winning bidder will reserve the right to have the Concession Bar named after themselves or their corporation for the first year of operation. The auction lasts ten days, starting on April 7 and ending April 17, 2005. A link to the auction is available at http://www.moxiecinema.com.\r\n\r\nDue to unforeseen building costs, the owners of Moxie Cinema need to raise additional revenue before they are able to open. “It’s not a conventional way to raise money,” owner Dan Chilton says. “But then again, we’re not necessarily a conventional movie theater.”\r\n\r\nLocated downtown at 408 West Walnut Street, Moxie Cinema’s mission is to create a unique and inviting venue for the exhibition of smaller, lesser-known films that have traditionally been unattainable in the Springfield market. By providing intriguing film series and offering a cinematic experience that differentiates itself from the typical multiplex affair, the Moxie will create a one-of-a-kind service that will benefit the downtown community along with the rest of the metropolitan area.\r\n\r\nFor more information on the theater or the auction, please visit /moxie.\r\n\r\n###\r\n\r\nI'll be sending it out to all the local media outlets tonight.\r\n\r\n<b>The Price</b>\r\n\r\nCall me crazy (and I know some of you will), but I think I'm going to let the bidding determine the price... as in, starting the auction at $1.00 with no reserve. What can I say, \"unconventional\" is my middle name.\r\n\r\nTomorrow's the BIG day, so try to get some sleep.\r\n\r\n<b>UPDATE</b>: Caleb over at <a href=\"http://www.justlikeinamovie.com/wordpress/?p=34\" target=\"_blank\" class=\"broken\">Just Like in a Movie</a> has a nice post that lists links to a few local media outlets and a sample e-mail to send to them. Thanks!\r\n\r\n<b>UPDATE 2</b>: The post has been submitted! It will go live at 12:00:00 PM CST tomorrow.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-04-07T02:04:57.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Tawny",
      "body": "Yippee! I'm so excited! What time will the fun begin and when can we find a link to the auction?\r\n\r\nGood Luck!!",
      "created_at": "2005-04-07T02:21:28.000Z"
    },
    {
      "author": "bjork24",
      "body": "I have a couple meeting tomorrow morning, so it will probably be later in the afternoon. Don't you worry, I'll post a link as soon as it's live.",
      "created_at": "2005-04-07T02:24:08.000Z"
    },
    {
      "author": "Justin",
      "body": "Oooh. Exciting!",
      "created_at": "2005-04-07T02:28:29.000Z"
    },
    {
      "author": "bjork24",
      "body": "Isn't it though!",
      "created_at": "2005-04-07T02:30:29.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "I'll see if I can finagle something and try to work it into a little blurb on our last page.",
      "created_at": "2005-04-07T02:33:05.000Z"
    },
    {
      "author": "Adam",
      "body": "Oh man, oh man, I piss my pants three times in excitement (Sweet Liberty movie quote by Alan Alda)",
      "created_at": "2005-04-07T02:34:18.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "I think you chose the right bidding pattern, Dan.  Starting low with no reserve will get a lot more people to bid.",
      "created_at": "2005-04-07T04:33:22.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Although, do you really want it to end at midnight?",
      "created_at": "2005-04-07T04:37:35.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Oh wait, 12pm is NOON.  *slaps forehead*",
      "created_at": "2005-04-07T04:39:01.000Z"
    },
    {
      "author": "Oz",
      "body": "I'm glad you decided to go with no reserve.  I think it sends more of the message that you want to send.  Let the bidding begin!",
      "created_at": "2005-04-07T06:06:36.000Z"
    },
    {
      "author": "Allison",
      "body": "I'm Psyched!  I'm going to tell the world!",
      "created_at": "2005-04-07T06:13:48.000Z"
    },
    {
      "author": "Fyse",
      "body": "Good call, I reckon. Setting a reserve sends the wrong messages, and you may as well just get as much as you can for it. Every little helps, right? Even if it's only enough to buy a few beers with which to drown your sorrows...",
      "created_at": "2005-04-07T06:24:25.000Z"
    },
    {
      "author": "Stephanie",
      "body": "I'm no media outlet, but I have a post all about the Moxie and the auction, too...",
      "created_at": "2005-04-07T08:56:30.000Z"
    },
    {
      "author": "Caleb",
      "body": "KY3 contacted me back, said they had been planning on a story about the theater soon but that this interested them a lot. Good luck! ",
      "created_at": "2005-04-07T12:15:45.000Z"
    },
    {
      "author": "Nate",
      "body": "I told the fellas last night at Borders, as I stood around with my mocha.  (Don't tell the Well Fed Head!!) \r\nThey seemed interested and then went back to stocking.\r\nI then looked around for more friends...\r\n(*running across room* \"Excuse me! You sir!\")\r\n",
      "created_at": "2005-04-07T18:22:37.000Z"
    },
    {
      "author": "Nate",
      "body": "It's all a bit like that montage scene in Finding Nemo, with the jumping dolphins, etc.  Or any montage scene where news wildly spreads.\r\n\r\nThese are good storyboards for \"Moxie: The Movie.\"  \r\nAre you writing this stuff down?",
      "created_at": "2005-04-07T18:27:14.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Who does your graphics? That's gorgeous stuff. I'm so jealous.\r\n\r\nI can't wait. As soon as the auction goes live I'll inform all of my Well Connected Buddies (or at least all that will listen). And of course, The Search For A Good Story (my blog) will feature the Moxie today :)",
      "created_at": "2005-04-07T18:29:50.000Z"
    },
    {
      "author": "Matt",
      "body": "Yeah, the logo thing is nice.  Hopefully no one will think you are going to use the Coke font on the real thing and get scared away.",
      "created_at": "2005-04-07T19:09:21.000Z"
    },
    {
      "author": "Nate",
      "body": "I just noticed the Coke font.  Wild, man.  Where does one procure a Coke font?",
      "created_at": "2005-04-07T19:18:36.000Z"
    },
    {
      "author": "steph v.",
      "body": "Did I win?",
      "created_at": "2005-04-07T19:38:25.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "<a href=\"http://www.justfuckinggoogleit.com\">Looking for the coke font</a>?",
      "created_at": "2005-04-07T19:38:47.000Z"
    },
    {
      "author": "Nate",
      "body": "Wait, what's this \"Google\"?\r\n\r\nAnother good name for a dog, I'm thinkin'.",
      "created_at": "2005-04-07T20:46:01.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "<i>It will go live at 12:00:00 PM CST tomorrow.</i>\r\n\r\nWait, so 1pm CDT?",
      "created_at": "2005-04-07T20:50:18.000Z"
    },
    {
      "author": "Justin",
      "body": "It's noon, and I don't see it yet!  Searching eBay...",
      "created_at": "2005-04-07T21:15:23.000Z"
    },
    {
      "author": "Ryan",
      "body": "If it did go up at 12, it may take a bit before you can find it on eBay's search.  The only way to see it would be a direct link.",
      "created_at": "2005-04-07T21:51:35.000Z"
    },
    {
      "author": "Pat",
      "body": "Dan,\r\nExpect a call from Springfield 33.",
      "created_at": "2005-04-07T22:11:22.000Z"
    },
    {
      "author": "bjork24",
      "body": "Sorry for the delay guys, my ISP was down all night. I goofed when I said 12:00 PM CST... it actually won't go live until 12:00 PM PST, which would be 2:00 PM Springfield time.",
      "created_at": "2005-04-07T22:12:31.000Z"
    },
    {
      "author": "Matt",
      "body": "the font is called Loki-Cola, easy to find.  that googleit link is the best thing ever.",
      "created_at": "2005-04-07T22:35:01.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
