{
  "id": 188,
  "title": "eBay the Cinebar: The Auction Is Live",
  "body": "Sorry about the miscommunication yesterday. The auction went live at 12:00 PM eBay time (PST) as opposed to 12:00 PM our time. It's now live and can be viewed <a href=\"http://cgi.ebay.com/ws/eBayISAPI.dll?ViewItem&item=6524021801\" target=\"_blank\" class=\"broken\">right here</a>, or you can just click on the eBay graphic in the sidebar (coming soon). We have an interview set up with the local CBS affiliate for tomorrow. They wanted to run it tonight, but I didn't get back in touch with them in time (damn my hide!). I still have a few more local outlets, mostly radio stations, to send the news tip to.<br/><br/>Thanks again to all of you who have already begun spreading the word! With everyone's help, this could turn out to be quite an exciting adventure... WOOT WOOT!<br/><br/>Also, if you'd like to send a message to the <a href=\"http://www.goldenpalace.com\" target=\"_blank\">Golden Place Casino</a>, you can contact them through their <a href=\"http://feedback.ebay.com/ws/eBayISAPI.dll?ViewFeedback&userid=goldenpalacecasino\" target=\"_blank\" class=\"broken\">eBay user page</a>! If you're an eBay member, don't forget to WATCH the auction!<br/><br/>PS - If we see a HUGE increase in traffic, there's a very real chance that my server might crash. If that's the case, look for updates and details at <a href=\"http://moxieblog.blogspot.com/\" target=\"_blank\">http://moxieblog.blogspot.com</a>.<br/><br/><b>UPDATE</b> - <a href=\"http://justin.retroflux.com/\" target=\"_blank\" class=\"broken\">Justin</a> posted the link to digg.com... <a href=\"http://digg.com/links/Indie_movie_theater_auctions_off_naming_writes_to_cover_extra_opening_costs\" target=\"_blank\" class=\"broken\">Click here</a> and then click \"Digg this story\" to push it to the front page.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-04-07T22:05:29.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Justin",
      "body": "Yippee!  Good luck, and happy bidding...",
      "created_at": "2005-04-07T23:11:16.000Z"
    },
    {
      "author": "bjork24",
      "body": "It's already up to $46.00! I see a few blog readers in the bidding history... THANKS GUYS!",
      "created_at": "2005-04-07T23:15:12.000Z"
    },
    {
      "author": "Jamie",
      "body": "I'm so excited!  (Singing it, like in the 80's song!)",
      "created_at": "2005-04-07T23:15:31.000Z"
    },
    {
      "author": "steph v.",
      "body": "I won!",
      "created_at": "2005-04-07T23:19:35.000Z"
    },
    {
      "author": "bjork24",
      "body": "I think I'm going to barf.",
      "created_at": "2005-04-07T23:19:59.000Z"
    },
    {
      "author": "Matt",
      "body": "i am the high bidder!  end it now dan!!  i'm sure this thing will have some legs.  good luck.",
      "created_at": "2005-04-07T23:20:47.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Matt! It's up to $76... we're almost there!",
      "created_at": "2005-04-07T23:22:19.000Z"
    },
    {
      "author": "Jamie",
      "body": "this is so fun!  I am not teaching because I am too busy watching it!",
      "created_at": "2005-04-07T23:23:35.000Z"
    },
    {
      "author": "steph v.",
      "body": "You need to fix the link on the moxie cinema page. I emailed that link out to about 20 people and it has the pop-up icon saying auction not live yet...<br/><br/>I tried to bid. But I couldn't afford more than $86. Sorry Dan.",
      "created_at": "2005-04-07T23:24:57.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Ooo, Dan, I thought of something – you will probably have to claim this as something on next year's taxes, right? Don't forget about that.",
      "created_at": "2005-04-07T23:25:13.000Z"
    },
    {
      "author": "Justin",
      "body": "currently eBay sales aren't taxable, so you shouldn't have to worry about it.",
      "created_at": "2005-04-07T23:29:23.000Z"
    },
    {
      "author": "bjork24",
      "body": "Steph: I fixed it. Refresh the main page and see if it works.<br/><br/>Aaron: Uh oh!<br/><br/>Justin: Phew!",
      "created_at": "2005-04-07T23:34:51.000Z"
    },
    {
      "author": "steph v.",
      "body": "It works! Thanks buddy ol' pal.",
      "created_at": "2005-04-07T23:35:34.000Z"
    },
    {
      "author": "Stephanie",
      "body": "We did our part, and got it up over $100.00.  <br/>And, I've contacted the UT/NPR radio station, as well.  Hope it helps.",
      "created_at": "2005-04-07T23:37:23.000Z"
    },
    {
      "author": "Justin",
      "body": "I added it to Digg.com... <a href=\"http://digg.com/links/Indie_movie_theater_auctions_off_naming_writes_to_cover_extra_opening_costs\" target=\"_new\">click here</a> and click \"Digg this story\" to try and get it to the front page!",
      "created_at": "2005-04-07T23:47:14.000Z"
    },
    {
      "author": "Stephanie",
      "body": "I've Digged, and bumped it the auction up to 200; but that's as high as we can go!",
      "created_at": "2005-04-07T23:48:53.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Stephanie!",
      "created_at": "2005-04-07T23:54:04.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i went for the 200 ... but alas.. someone has 2 dollars and 50 cents more than me<br/>rich bastards",
      "created_at": "2005-04-08T00:03:10.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "That was me! Hahahaha, I <i>rule</i>!<br/><br/>I've made my <a target=\"_new\" href=\"http://www.misterorange.com/2005/04/make-mine-moxie.html\">blog post</a> and have informed my blogging friends. <br/><br/>Off to send more emails now. Go Moxie, go!",
      "created_at": "2005-04-08T00:18:54.000Z"
    },
    {
      "author": "Tawny",
      "body": "Dan,<br/>Will you let us know when the story runs on the local (or national) news?<br/>Best of Luck!!!",
      "created_at": "2005-04-08T01:04:15.000Z"
    },
    {
      "author": "Nate",
      "body": "Or when they light the mountaintop beacons in that one scene in Lord of the Rings.  That's another good news-spreading-wildly montage.<br/><br/>Very rousing, too!<br/><br/>Yay, rousing for the Moxie.",
      "created_at": "2005-04-08T01:17:59.000Z"
    },
    {
      "author": "jamie",
      "body": "Dan, will you let us know how many people visit the site each day, how many people normally do?<br/><br/>",
      "created_at": "2005-04-08T01:33:51.000Z"
    },
    {
      "author": "Matt",
      "body": "Dan, will you let us know the airspeed velocity of an unladen swallow?",
      "created_at": "2005-04-08T01:40:03.000Z"
    },
    {
      "author": "Caleb",
      "body": "I go to the grocery store and when I return it has gone up $400 to $610?<br/><br/>I figured it would reach that price...but in less than 3 hours? Awesome.",
      "created_at": "2005-04-08T01:40:24.000Z"
    },
    {
      "author": "Rachel",
      "body": "This is getting so rad!  I'm nervous because the high bidder has no bidding history...he must have heard the buzz and signed on to ebay specifically to bid!  Wowza..and you still have 9 days left!",
      "created_at": "2005-04-08T01:44:54.000Z"
    },
    {
      "author": "erin",
      "body": "wooooooh!!!",
      "created_at": "2005-04-08T01:52:41.000Z"
    },
    {
      "author": "Nate",
      "body": "For the Moxie!!!",
      "created_at": "2005-04-08T01:54:34.000Z"
    },
    {
      "author": "Adam",
      "body": "Matt:<br/><br/>Do you even understand the question Jamie asked?  Dan said to watch out, \"If we see a HUGE increase in traffic\", his server might \"crash\" from people coming to this site through eBay.  Jamie merely asked if Dan would let everyone know how many unique hits he gets on his blog from eBay users after all of this.  <br/><br/>Perhaps you should think about what you say before posting a sarcastic reply to a fellow reader of this blog.  And for the record, one \"theory\" of the airspeed velocity of an unladen swallow is roughly \"11 meters per second, or 24 miles an hour\".  Of course, with your intelligence level, you could have looked that up on Google yourself or researched the issue instead of asking over-worked Dan to do the legwork.  Good day.",
      "created_at": "2005-04-08T02:08:00.000Z"
    },
    {
      "author": "bjork24",
      "body": "Here's a few answers:<br/><br/>1. I think the first story is going to run on KOLR 10 tomorrow at 5:00, 6:00, and 10:00. It may also run on Fox 27, but I'm not sure. I'll make a post when I know more.<br/><br/>2. As for how many people a day look at the site, that would depend on which one we're talking about. The auction has already seen roughly 400 people and 6 people are watching it. I get about 500 people a day on the blog, and I haven't noticed a marked spike in incoming traffic... yet.<br/><br/>3. 24 MPH<br/><br/>4. Yes.<br/><br/>5. Only when I'm nude.",
      "created_at": "2005-04-08T02:10:02.000Z"
    },
    {
      "author": "Sancho",
      "body": "I submited the auction to Gorillamask.net, they usually link daily to a strange/unique/interesting eBay auction...hopefully The Moxie counts as at least one of those...we'll find out tomorrow",
      "created_at": "2005-04-08T02:37:17.000Z"
    },
    {
      "author": "Luke",
      "body": "I actually think that Ebay sales are taxable.<br/><br/>Most people don't report them because they're pretty small, but something of this size might have to be picked up.  I would say that an IRS auditor would probably want to know why $10,000 wasn't included in taxable income.<br/><br/>I'll look into it and let you know.  Besides, with all of the major expenses you're incurring during renovation and opening, I would say that The Moxie will most likely show a loss for tax purposes in its first year.",
      "created_at": "2005-04-08T03:11:37.000Z"
    },
    {
      "author": "Luke",
      "body": "OK, I checked and yes any money you guys recieve SHOULD be picked up as revenue.  I can almost gurantee that if Golden Palace (or any business) wins the auction, that they will be deducting the cost as an expense, and so you guys will have to include it in revenue.<br/><br/>But like I said, in your first year you will most likely show a pretty big loss for tax purposes.",
      "created_at": "2005-04-08T03:17:46.000Z"
    },
    {
      "author": "Allison",
      "body": "Your story has been submitted to Slashdot in the guise of an ask-slashdot concerning the internet and marketing.  I'll let you know if it makes it on.",
      "created_at": "2005-04-08T03:27:06.000Z"
    },
    {
      "author": "Fyse",
      "body": "Going well so far! Very exciting!",
      "created_at": "2005-04-08T03:56:16.000Z"
    },
    {
      "author": "Tim",
      "body": "Yay!  I hope it goes through the roof!  Not the roof of the theater though.  That would not be happytime.  Maybe through the roof of the old abandoned bottle cap warehouse on the  rough side of Springfield...",
      "created_at": "2005-04-08T04:26:47.000Z"
    },
    {
      "author": "Ben",
      "body": "Heh.  You said \"the rough side of Springfield.\"<br/><br/>/funny to me",
      "created_at": "2005-04-08T05:08:19.000Z"
    },
    {
      "author": "Luke",
      "body": "Ok Dan I want you to know that I totally have a post about the Moxie auction written, but Blogger has totally dropped the ball today and I haven't been able to post anything all day.<br/><br/>Does anyone know of a decent alternative to Blogger?",
      "created_at": "2005-04-08T07:14:12.000Z"
    },
    {
      "author": "brian of moore",
      "body": "adam - stay calm... what matt said was funny... ",
      "created_at": "2005-04-08T08:55:00.000Z"
    },
    {
      "author": "matt",
      "body": "Take it easy there, chief.  It wasn't a dig at anyone, it was a joke based on two separate people starting off comments with the phrase 'dan, will you let us know...'  Maybe the shirt should have said \"Moxie Blog: No Sense of Humor Required\".  Email me if you've got a problem.",
      "created_at": "2005-04-08T09:20:36.000Z"
    },
    {
      "author": "Grey Hodge",
      "body": "Couple things. Dan: You migh twant to add to the disclaimers that the winner won't get any REVENUES either, as opposed to just business input. They're buying the naming rights, not the cinebar itself.<br/><br/>Second, why do people think ebay auctions aren't taxable income? Sales tax is usually not applicable (although technically we all are supposed to be good citizens and report it to our state tex bureau at the end of the year, which I'm sure we ALL do) but it is indeed taxable income. You sold something and got money for it. That's income. The whole \"Internet tax moratorium: doesn't apply to income tax, or Amazon.com would be rolling in it.<br/><br/>Three, the airspeed of an unladen swallow question was from a certain film. I shall not reveal which film, as since you're so good at Googling, you cna find it, Mr. Smartypantaloons!",
      "created_at": "2005-04-08T13:03:30.000Z"
    },
    {
      "author": "Adam",
      "body": "I shall start my Friday with a good laugh, the honor of a lady princess shall forever win my heart.  Good day chief.",
      "created_at": "2005-04-08T15:06:47.000Z"
    },
    {
      "author": "nicole",
      "body": "Luke - I recently switched over to Word Press. It's nice.",
      "created_at": "2005-04-08T15:23:06.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Unfortunately WordPress means No Sweet Google Juice because of that whole ridiculous adwords crap via the creators (Good Job, Stupids!). Therefore it has been banished from my mind.<br/><br/>Kind of a shame, I heard it was nice too :-\\<br/><br/>I was never really clear on the Google ban--is it just the wordpress.org site or all WordPress sites? Seems kinda harsh for the latter..in which case I could admire/appreciate WP again.",
      "created_at": "2005-04-08T17:33:34.000Z"
    },
    {
      "author": "J.R.",
      "body": "Hope it sells high, real high.",
      "created_at": "2005-04-08T19:19:00.000Z"
    },
    {
      "author": "Surferbill",
      "body": "OK, I've finally got the auction blogged on both my websites now. :)<br/><br/>Luke, you may want to check Blogger's status page: http://status.blogger.com/<br/><br/>I've had problems all day too, but their suggestion to delete your Blogger cookies worked just fine for me!<br/><br/>Hope this helps!",
      "created_at": "2005-04-08T19:38:00.000Z"
    },
    {
      "author": "Luke",
      "body": "Suferbill - I did the same but I'm still having problems.  I can get to my Blogger Dashboard, and write a post but when I try to publish...no dice.<br/><br/>I'm just going to keep trying until it works.<br/><br/>And then I'll try to figure out how to use Wordpress.  It seems a little more complex than I thought it would be.",
      "created_at": "2005-04-08T20:33:43.000Z"
    },
    {
      "author": "Caleb",
      "body": "Wordpress is awesome, at least I think so. Yeah it's more difficult to figure out than Blogger but it's worth it.",
      "created_at": "2005-04-08T21:27:28.000Z"
    },
    {
      "author": "Ole",
      "body": "Wordpress can be awesome, to the point I went from 0 sites to 5 sites in the past six months.  Luckily I've got a guy with reasonable rates to keep me out of trouble with mySQL and FTP and some related items that come with working with & supporting an open source product.  I'm still trying to decide if I add the Simpsons plugin http://phunky.co.uk/simpsons-wp-plugin/<br/>but now that I've had an FTP lesson I've got the option which is the best part.",
      "created_at": "2005-04-08T21:47:33.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
