{
  "id": 189,
  "title": "eBay the Cinebar: The First Day",
  "body": "Well, the first day went off with a bang! Looking at the bidding history, I see that the majority of the bidders, if not all, are my good old blog readers. Aw, shucks... thanks guys! Nicole and I did an interview about the Cinebar auction with KOLR 10 yesterday, and we have another one lined up for this Monday with ABC 33. I'm not sure when either will run, but as soon as I find out, I'll post it here.<br/><br/>The media coverage is starting... slowly but surely. I should contact NPR again. One of my goals in life is to be featured on All Things Considered, Morning Edition, or Fresh Air with Terry Gross. I don't care which. In the meantime, keep doing what you're doing - plugging and buzzing. Thanks again for all the help!<br/><br/>By the way, for those of you who are contemplating a move from Blogger to WordPress, you can sign up for free WordPress blogs (preconfigured) at <a href=\"http://www.blogsome.com\" target=\"_blank\">BlogSome</a>. Hope that helps.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-04-08T21:43:30.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Justin",
      "body": "Hmm, I was hoping we could see you on the news tonight.",
      "created_at": "2005-04-08T22:16:16.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Be sure to post some video or at least a bittorrent link. That would be very nice/cool/interesting/(humorous adjective).",
      "created_at": "2005-04-08T22:28:28.000Z"
    },
    {
      "author": "bjork24",
      "body": "Justin: You'll get to see it tomorrow.<br/><br/>Evan: I'll see what I can do.",
      "created_at": "2005-04-08T22:32:11.000Z"
    },
    {
      "author": "Allison",
      "body": "How many people are \"watching\" the auction as of today?",
      "created_at": "2005-04-08T22:53:31.000Z"
    },
    {
      "author": "bjork24",
      "body": "23",
      "created_at": "2005-04-08T23:00:39.000Z"
    },
    {
      "author": "Luke",
      "body": "OK, finally got my post regarding the auction up.  Blogger finally decided to stop behaving badly.<br/><br/>I will most certainly be cheking into that Wordpress link you provided.  Thanks!",
      "created_at": "2005-04-08T23:16:00.000Z"
    },
    {
      "author": "Nate",
      "body": "Dan,<br/>You and your story would make a hell of a more interesting hour than the ones Terry's had recently.  Trust me, I know:  I sit at a desk all day and I am pathetically eager for 3:00 to roll around, but if I hear one more entire hour devoted to some dead jazz clarinetist, I'm going to beat my radio with my firetruck-red stapler, until it looks like that Yellow dude's head after Bruce Willis was done with him in Sin City.  I tell ya.  Middle East blowin' up every day, and I have to listen to dead jazz musicians?!?!? Worse, dead poets.<br/><br/>Humbug.",
      "created_at": "2005-04-09T00:00:53.000Z"
    },
    {
      "author": "Oz",
      "body": "Hmm, I know someone who works for NPR here in Philadelphia, where Fresh Air is recorded.....",
      "created_at": "2005-04-09T00:25:28.000Z"
    },
    {
      "author": "bjork24",
      "body": "Work your magic, Oz. You can do it!",
      "created_at": "2005-04-09T00:31:50.000Z"
    },
    {
      "author": "Oz",
      "body": "I worked as much of it as I could.  Check your email.",
      "created_at": "2005-04-09T00:47:03.000Z"
    },
    {
      "author": "bjork24",
      "body": "Indeed! Thank you kindly, Ozzilyn Bean.",
      "created_at": "2005-04-09T01:54:05.000Z"
    },
    {
      "author": "Nate",
      "body": "Hey Dan,<br/>I can't believe that I just remembered this, but the lone (that I know of) arthouse theatre in Charleston, SC is named \"The Roxy\"!<br/>How 'bout that, eh? Eh?<br/><br/>This is almost paranormal.<br/><br/>They, however, did not have a dancing robot.  Or a beard.  God I can't stop.",
      "created_at": "2005-04-09T02:55:32.000Z"
    },
    {
      "author": "bjork24",
      "body": "I no longer have the beard, which makes it even MORE uncanny.",
      "created_at": "2005-04-09T03:00:47.000Z"
    },
    {
      "author": "Joshua",
      "body": "Also posted on Sensible Erection:<br/>http://www.sensibleerection.com/entry.php/46770",
      "created_at": "2005-04-09T20:40:29.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
