{
  "id": 19,
  "title": "Monday in Midwestburg",
  "body": "Yesterday was a good day. It started off with a sick stomach and a rash on my face, but ended on a high note with Nicole and I being one step closer to opening the theater. Here's the highlights:<br/><br/>Our first meeting, which was at one of the largest banks in Midwestburg, was good, but not great - and when I say \"not great\", I mean we weren't handed two large bags full of money. The banker, we'll call him Brian, assured us that our plan was well thought-out, unique, and sorely needed in Midwestburg's booming downtown community, but the cash would be difficult to come by based solely on the fact that Nicole and I had nothing to back it up with. Without the required collateral, we would need a guarantor to invest at least 20% into the business, and, in so doing, become a vested partner in the business.<br/><br/>Along with the guarantor, Nicole and I would also need to produce between 10% to 15% of the total loan requirement in injected capital, which would mean that we'd need investors. Of course, I can't say that I was totally surprised by everything Brian told us. Never in my wildest dreams did I assume that a bank would just hand over a quarter of a million dollars to Nicole and I without requiring some sort of financial backing from a more resourceful partner. Them's the brakes.<br/><br/>Not everything Brian told us was bad news, in fact he was very excited and supportive of our idea, which is good since he's also responsible for pushing our idea through the MFDC (Midwestburg Financial Development Center). The MFDC loans up to $75,000 to businesses that plan on opening downtown. Brian is the president of the MFDC. This is good.<br/><br/>Our next appointment was the film forum, which while it was enjoyable and offered us the opportunity to speak at great length about our project, it was not the most beneficial meeting of the day. Nicole and I met lots of interesting people at the forum, the majority of which were film-makers who lived in and around Midwestburg, and came away with lots of support and a few potential business alliances. As was to be expected at such a meeting, everyone was thrilled about our plan and offered us any help they could lend... aside from money. It's great to associate yourself with independent film-makers for the sake of future premieres and symposiums, but they're not the best audience to approach for investment capital. They're just as much in need for money as we are.<br/><br/>We had free hotdogs for lunch.<br/><br/>Our third meeting of the day was with Ann, a member of the City Planning and Development committee. The intention of this meeting was to find out if there were any other financial resources, beyond MFDC and conventional commercial loans, that Nicole and I could take advantage of. Within two minutes of saying hello, our question was answered. No. As it turns out, the first and foremost requirement for the majority of the city's business loans was that the applying business had to own the building it would be operating out of. The only city loan that was available to lease businesses such as ours was the MFDC. Again, them's the brakes.<br/><br/>Even still, Ann was mighty impressed with our business concept, and, like Brian, shared our mutual love of art-house film and believed Midwestburg was ready for just such a venture. The words of support were encouraging, as they always are, but didn't help bring us closer to the end goal. Sticks and stones may break my bones, but words will never fund me... or something like that.<br/><br/>Our last and most beneficial meeting of the day was with Andrew, the building's owner. It began with me relaying the information I had received from Brian and Ann, and ended with all three of us, Nicole, Andrew, and I, questioning whether we'd even need to deal with getting a commercial loan. I don't feel that today would be the most appropriate time to get into the nitty-gritty details of what we're planning, but for the sake of justifiably relating the general sense of optimism and viability of our business plan, I'll give you the long and short of it.<br/><br/>What we've done is taken a good, long look at our start-up expenses and tried to label them as either \"strictly construction\" or \"strictly business.\" Andrew believes that we can roll a good portion of our construction costs into the overall construction loan that's been taken on the building, which would translate into a higher per square footage cost on the lease. The remaining costs would be \"strictly business,\" or, in other words, the cost of the items we'd need if we were starting our theater in a building that had already been fitted to our needs.<br/><br/>After we're completely firm on the \"strictly business\" costs, Nicole and I will sit back down with Andrew and Doug and decide whether we should finance the final portion through a conventional loan, or, if it's low enough, roll that in with the rest of the construction costs and join forces to become a LLC. If we decide on the latter, we'd operate as a partnership, wherein Andrew and Doug would own a percentage of the business and Nicole and I would own the rest, with our percent being paid mainly through sweat equity. Over time, we'd repay the debt through our lease until we reached the buyout threshold, where we'd regain control of the business in it's entirety.<br/><br/>Needless to say, Nicole and I are very pleased with these initial discussions. For us, opening the theater is the single most important step we need to take. Anything that helps us get one step closer to that goal is a good thing, and frankly, we feel incredibly fortunate to have combined our resources with a group of individuals who believe in this project as much as Nicole and I do. Andrew and Doug have been nothing but generous, resourceful, and completely supportive of this project, and for that, above everything else, we have been most fortunate and will remain incredibly thankful. For anyone else considering starting a business of their own, especially those who have little to no start-up capital, you can do a lot worse than to partner yourself with individuals who have the resources and the trust in your project to see it through to the end.<br/><br/>I'm starting to sound like one of those cheaply-framed teamwork posters that hang in windowless conference rooms, so that means it's time for me to end this post.<br/><br/>By the way, although Nicole hates her new bobbed haircut, I think it makes her look cuter than a bug's ear.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-06-15T23:29:45.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Justin",
      "body": "How were the hot dogs, other than being free?",
      "created_at": "2004-06-16T01:28:29.000Z"
    },
    {
      "author": "bjork24",
      "body": "They were good. They were huge.",
      "created_at": "2004-06-16T01:35:32.000Z"
    },
    {
      "author": "Bex",
      "body": "How huge?",
      "created_at": "2004-06-16T04:56:33.000Z"
    },
    {
      "author": "bjork24",
      "body": "They were foot-longs.",
      "created_at": "2004-06-16T05:08:11.000Z"
    },
    {
      "author": "Sean",
      "body": "Wow...that's nice.",
      "created_at": "2004-06-16T06:12:12.000Z"
    },
    {
      "author": "Sandra",
      "body": "I don't recall...but have you considered incorporating as 501c3 arts orgranization?",
      "created_at": "2004-06-16T06:27:36.000Z"
    },
    {
      "author": "Trinity",
      "body": "An FYI in case you hadn't discovered this.  And I won't profess to be an expert in financials, but the Small Business Administration has a loan program.  I've read a little about it, and it makes little sense to me (i.e., still seems pretty tough to get $$), but it is supposed to be easier to get money that way.",
      "created_at": "2004-06-19T01:27:40.000Z"
    },
    {
      "author": "bjork24",
      "body": "If we go through a bank, an SBA loan will be our only option. They are very difficult to get, despite the progress the president has \"claimed\" is being made to bolster small businesses.",
      "created_at": "2004-06-19T01:36:13.000Z"
    },
    {
      "author": "Trinity",
      "body": "Why doesn't that surprise me!  Good luck (with it all - I'm really enjoying reading through your progress).",
      "created_at": "2004-06-19T01:40:30.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
