{
  "id": 190,
  "title": "eBay the Cinebar: News Story",
  "body": "The story about the Moxie Cinebar auction will run on KOLR 10 tonight at 10:00 PM (full length story), or you can catch an abbreviated version at 9:00 PM on Fox 27. Everyone should watch it in the nude.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-04-10T02:46:33.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Jamie",
      "body": "How great!  This is one of those few moments in life that I wished I lived closer to my parents.  ",
      "created_at": "2005-04-10T04:12:14.000Z"
    },
    {
      "author": "erin",
      "body": "they gave a little plug......\r\nyou too could have your name in lights!!!",
      "created_at": "2005-04-10T05:51:55.000Z"
    },
    {
      "author": "bjork24",
      "body": "I liked my giant eyeballs.",
      "created_at": "2005-04-10T08:44:17.000Z"
    },
    {
      "author": "brian of moore",
      "body": "im always at work.. when something cool is happening.... bah",
      "created_at": "2005-04-10T09:11:14.000Z"
    },
    {
      "author": "brian of moore",
      "body": "oh.... and YAY!",
      "created_at": "2005-04-10T09:11:32.000Z"
    },
    {
      "author": "brian of moore",
      "body": "btw.. anyone else still worried about this stevo.. being apparently new to ebay.. and having no feedback... slightly unsettling.. but hopefully its all good... \r\noh look i just made three comments in a row... woopsers",
      "created_at": "2005-04-10T09:15:11.000Z"
    },
    {
      "author": "bjork24",
      "body": "No, don't worry about steveo... I know him. He's legit... too legit to quit.",
      "created_at": "2005-04-10T10:48:35.000Z"
    },
    {
      "author": "Caleb",
      "body": "I missed it - I was slaving away at Movie Gallery. Steve Grant (the day journalist on KY3) came in to rent a movie, I contemplated asking him to run a story on the Moxie, but thought it might be bad taste. Haha. Any chance you got the KOLR 10 footage to put on here? \r\n\r\nIt's only Sunday and already you're about to hit $1,000! I think that's a good sign...hope the news coverage helps.",
      "created_at": "2005-04-10T10:52:56.000Z"
    },
    {
      "author": "Ole",
      "body": "to legit to quit... Is it Vanilla Ice? Is he making a comeback now like MC Hammer?",
      "created_at": "2005-04-10T19:26:00.000Z"
    },
    {
      "author": "nicholas",
      "body": "The Ice Man never went away...he tours college campuses now...in fact he came to SMSU not too long ago...",
      "created_at": "2005-04-10T20:15:18.000Z"
    },
    {
      "author": "Nate",
      "body": "Some of you may remember that \"2 Legit Too Quit\" became the unofficial theme song of the Jerry Glanville coached Atlanta Falcons during their wild 1994 run through the playoffs, back when Deion Sanders was cool and before Left Eye (god rest her soul) burned his down.\r\nIf I remember correctly, there was a sort of hand signal one made to go along with the lyrics: two fingers up, then an L shape with the thumb and index finger, then a sort of cutting motion.  2 Legit to Quit, see?  Deion Sanders, MC Hammer AND myself all did this quite a lot.  My life has been changed ever since.",
      "created_at": "2005-04-10T20:49:37.000Z"
    },
    {
      "author": "Nate",
      "body": "That's \"burned his HOUSE down.\"",
      "created_at": "2005-04-10T20:50:12.000Z"
    },
    {
      "author": "brian of moore",
      "body": "ive found myself doing the handsignal to the uneducated (17-22yr olds) quite often.. and often getting perplexed looks",
      "created_at": "2005-04-10T21:50:23.000Z"
    },
    {
      "author": "Nate",
      "body": "Oh dear.  I just had a conversation with somebody and I had to come back here to correct myself:  That was Andre Rison who lost his mansion to the flames of passion!\r\nI got my cocky cornerbacks with bling bling confused.\r\nMy rep could be damaged, here.\r\nSeriously, I'm looking at my rep right now and it's out of alignment.\r\n\r\nIs it still hip to say bling bling? Isn't it more street these days to shorten it to just say bling?  I've been watching The Wire which is about as street as it gets and nobody's said a single bling.\r\n\r\nBling: Another good name for a dog.\r\n\r\nIt's a slow Sunday.",
      "created_at": "2005-04-10T22:23:26.000Z"
    },
    {
      "author": "bjork24",
      "body": "The conversations that go on here amaze me.",
      "created_at": "2005-04-10T23:29:06.000Z"
    },
    {
      "author": "brian of moore",
      "body": "you should sell them on ebay\r\nthe moxie blog comments!©",
      "created_at": "2005-04-10T23:41:24.000Z"
    },
    {
      "author": "matt",
      "body": "bling is a great name for a dog!  however it's the least street thing you can utter in any seriousness.",
      "created_at": "2005-04-11T06:50:27.000Z"
    },
    {
      "author": "Caleb",
      "body": "you're all wrong...the latest lingo is:\r\n\r\nchitty chitty bang bang, yo.\r\n\r\nif i won, i would name the Cinebar the \"Chitty Chitty Bang Bang Cinebar\"\r\n\r\nthat would bring the masses in for sure!\r\n\r\n",
      "created_at": "2005-04-11T08:18:33.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Two suggestions:\r\n\r\n1) Since your trying to raise money, maybe you could switch out the top image of Benzo with a tshirt to an image of Benzo pulling out his pockets ala that one illo that used to be up there. Wait – do robots even have pockets?\r\n\r\n2) After searching for the auction after it went live, I instead found a bunch of listings for old Moxie soda stuff and learned that it was endorsed by Ted Williams back in the 40s. So, in that case, could the Moxie the theater be endorsed by Ted Williams' cryogenically frozen head? That would be awesome.",
      "created_at": "2005-04-11T18:33:44.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Dude, frozen head...best. idea. ever.\r\n\r\nNow, where is the bittorrent video file of said giant eyeballs?",
      "created_at": "2005-04-11T19:20:10.000Z"
    },
    {
      "author": "J.R.",
      "body": "We know now, that Dan Chilton truly is a man with vision, look at those gigantic, perfect eyeballs.",
      "created_at": "2005-04-11T19:43:58.000Z"
    },
    {
      "author": "bjork24",
      "body": "My eyeballs were gigantic! And the crow's feet... don't get me started.",
      "created_at": "2005-04-11T19:46:31.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
