{
  "id": 191,
  "title": "Another day, another news story",
  "body": "Another news story about the eBay auction will run tonight on ABC 33 at 5:00 PM and 10:00 PM. Let's hope it doesn't have an extreme close-up of my eyeballs like the last one did. I think the News-Leader is running a blurb about the auction in tomorrow's paper as well, so keep an eye out for that. Nicole and I are going to go clean the floors at the theater... fun, fun, fun!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-04-11T20:41:30.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Justin",
      "body": "Dan Chilton.... has a vision....",
      "created_at": "2005-04-11T22:14:40.000Z"
    },
    {
      "author": "matt",
      "body": "Dan Chilton... has vision!  News at 11.",
      "created_at": "2005-04-11T23:28:51.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Did you know that your eyeballs are the only organ that doesn't grow/change in shape from the time you're born until you die?<br/><br/>See Dan, you've had giant eyeballs your whole life...you just didn't know it.<br/><br/>Vision baby...vision.",
      "created_at": "2005-04-12T00:41:05.000Z"
    },
    {
      "author": "Chuck",
      "body": "He is the man.",
      "created_at": "2005-04-12T02:50:58.000Z"
    },
    {
      "author": "Laura",
      "body": "Forgive me if this has been brought up before, but have you sent press releases about the auction to major news services like AP or Reuters?",
      "created_at": "2005-04-12T08:49:01.000Z"
    },
    {
      "author": "Surferbill",
      "body": "<a href=\"http://www.ananova.com/\">Ananova</a> has a quirkies section that might run the story too.",
      "created_at": "2005-04-12T13:42:37.000Z"
    },
    {
      "author": "Pat",
      "body": "I submitted the release to Ananova and Reuters. I guess that proves how much pull I have. <br/><br/>Afterwards, I was told by a PR friend that it is much better to submit story ideas and releases to an actual person. It would require a bit of research to figure out which reporter might be interested. But I am told the success rate will be much higher.",
      "created_at": "2005-04-12T16:15:22.000Z"
    },
    {
      "author": "Nate",
      "body": "I missed it AGAIN!  I was on the phone and forgot.  Dan's giant eyeballs prove as elusive as ever.  I'm shaking my fist in the air and saying, \"Damn you giant eyeballs!  DAMN YOU!\"<br/><br/>Then I sip my Juicy Juice.",
      "created_at": "2005-04-12T17:33:01.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
