{
  "id": 192,
  "title": "An apology to my readers",
  "body": "My posts have really sucked lately. Sorry. There's definitely a correlation between the amount of work being done on the theater and the quality of my posts. For example, look at these two posts:\r\n\r\n<a href=\"/post/29\">Example #1</a> - this post was written when we were still living in St. Louis. Not much work was being done on the theater at the time. Back then it was a man, a dream, and a lot of time on my hands at work.\r\n\r\n<a href=\"/post/193\">Example #2</a> - this post was written after a long day of working at the theater. I think it speaks for itself.\r\n\r\nMy one year of leprachuan-granted writing ability is nigh upon us, so I better get a move on! I'll write a witheringly long post tonight... I promise!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-04-12T18:22:29.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "If it's not witheringly long, I'm suing.",
      "created_at": "2005-04-12T18:51:49.000Z"
    },
    {
      "author": "Dave",
      "body": "double space it, increase the margins, and use a bigger font. and repeat stuff... like \"Today was a really really really really really really really really really really hard day. I'm feeling very very very very very very very very very tired.\"",
      "created_at": "2005-04-12T19:04:22.000Z"
    },
    {
      "author": "Nate",
      "body": "Oh, now, I'd still come here day after day because frankly I can't get enough of just looking at a robot in a T-shirt.\r\nHeh, heh.  Crazy Benzo, you kill me.",
      "created_at": "2005-04-12T19:24:39.000Z"
    },
    {
      "author": "erin",
      "body": "does your wife sew?",
      "created_at": "2005-04-12T20:30:32.000Z"
    },
    {
      "author": "erin",
      "body": "....or collect little tiny huks of fabric. or anything remotely close to the sewing/fabric world??",
      "created_at": "2005-04-12T20:31:18.000Z"
    },
    {
      "author": "Caleb",
      "body": "the sewing thing - it's a chain letter scam. erin is a scam artist - likes to hang people out to dry.\r\n\r\njust kidding.",
      "created_at": "2005-04-12T21:32:12.000Z"
    },
    {
      "author": "erin",
      "body": "shut it caleb!!!!\r\ncomeone.. i just need two more people to send it to. and i SWEAR i saw a sewing machine in some picture on this blog.  you dont know HOW HARD IT IS TO FIND PEOPLE WHO KNOW HOW TO SEW! someone please pitty me. please! or else im really going to be letting some older ladies down.",
      "created_at": "2005-04-12T22:38:08.000Z"
    },
    {
      "author": "bjork24",
      "body": "Nicole sews like the wind!",
      "created_at": "2005-04-12T22:45:44.000Z"
    },
    {
      "author": "Justin",
      "body": "The wind sewed me a scarf once.  It was nice.",
      "created_at": "2005-04-12T22:47:39.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Yeah, the wind is going to be on Martha Stuart's Apprentice next fall. Watch for it.\r\n\r\nOh, and Dan, you're officially on Blog Suspension. You'll need at least three (3) Full-length Super Posts to earn back the respect of your readership.\r\n\r\nOr perhaps more photographs of scary roaches and/or HUMONGO EYES. \r\n\r\nYou know what I'm talkin about here.",
      "created_at": "2005-04-12T23:26:06.000Z"
    },
    {
      "author": "erin",
      "body": "i think that nicole REALLY wants this chain letter. i think she does. i mean. im not sure if she could survive without it.\r\nseriously.\r\nif i were to send this little puppy to the moxie address. would mrs. nicole get it? and perhaps send it onward to her own little sewing circle?\r\nbecause if she does.. man. i only have to send it to one other person. and im scott free.\r\nand isnt that what the moxie is about.... sewing. chainletters. and the ocassional movie..... and if not. well thats not any kind of movie theater I want to be in.\r\n\r\nso yeah. can i send it there?",
      "created_at": "2005-04-12T23:27:05.000Z"
    },
    {
      "author": "brian of moore",
      "body": "erin.. i cant believe you didnt ask me... what kind of gender biased sewing friend are you?  and dont try and ask me now... its too late.. you lost your chance....... oh and i dont sew... ",
      "created_at": "2005-04-12T23:38:27.000Z"
    },
    {
      "author": "nicole",
      "body": "I'm the only person I know who sews (and I'm not very good), so if you send something to me, the chain would be broken. Sorry.",
      "created_at": "2005-04-12T23:51:46.000Z"
    },
    {
      "author": "Nate",
      "body": "They don't call me So-Ho for nothin'.\r\n\r\nWell, actually they do.  I've tried to compensate them but They will have none of it.",
      "created_at": "2005-04-12T23:56:15.000Z"
    },
    {
      "author": "Carl",
      "body": "Dan, how about having Nicole as a guest writer?  But, since she is out bring home the bread and bacon she may not have time.  Possibly if you were to give her a foot massage while she was blogging you could convince her.",
      "created_at": "2005-04-13T03:00:39.000Z"
    },
    {
      "author": "Caleb",
      "body": "She didn't ask me if I could sew either.\r\n\r\nOf course I can't, but what does that matter...\r\n\r\nAnd personally I thought the Moxie was about chocolate milk drinkers anonymous. A bunch of movie buffs gathering together to celebrate life...love...and chocolate milk. But sewers are welcome too. But not the stinky kind.",
      "created_at": "2005-04-13T05:32:48.000Z"
    },
    {
      "author": "nicole",
      "body": "I would most likely let Dan's blog audience down if I were to write a post. I do have a blog, however, where you can read about my hi-larious days as a substitute teacher (among other things).",
      "created_at": "2005-04-13T22:34:26.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    }
  ]
}
