{
  "id": 194,
  "title": "The indentured rhinoceros",
  "body": "<b>A Case of Mistaken Semantics</b>\r\n\r\n<i>Setting</i> - Architect's office. Dan (blog writer), Andrew (building owner), Chris (general contractor), Jana (architect), Electonicus (electrical engineer, whose name escapes me), and Achvacuumus (HVAC engineer, whose name ALSO escapes me).\r\n\r\n<b>Jana</b> - We are gathered here today to discuss the financial disparities between Dan...\r\n<b>Dan</b> - Hello.\r\n<b>Jana</b> - ... and the unruly upgrade bids.\r\n<b>Bids</b> - (<i>as a pirate</i>) Argh.\r\n<b>Jana</b> - Electonicus, these bids are too high, says I.\r\n<b>Dan, Andrew, and Chris</b> - Aye aye.\r\n<b>Jana</b> - What say you to this?\r\n<b>Electronicus</b> - The price is only justified. Look here! (<i>points to the electrical schematic</i>) See how the projection booth requires so much juice.\r\n<b>Jana</b> - Indeed. (<i>reads schematic</i>) 130 amps for the projector. 120 amps for the soundhead. Why, these numbers are proposterous! How could a machine eat so much amperage?\r\n<b>Dan</b> - The machine needs electrons to produce an image.\r\n<b>Electronicus</b> - But 250 amps? My God man! That could power a shack of Canadian leprechauns for fourteen weeks. Surely you jest?\r\n<b>Dan</b> - I speak only of what my equipment dealer has relayed to me over this phone. (<i>lifts phone high into the air, before accidentally dropping it to the ground</i>) Perhaps I should call him back and reconfirm the electronomical load.\r\n<b>All, save Dan</b> - Yes. Perhaps.\r\n<b>Dan</b> - (<i>picks phone up off the floor</i>) Excuse me for a moment.\r\n<b>All, save Dan</b> - (<i>excuses Dan</i>)\r\n\r\n<i>CUT TO:</i> The hallway\r\n\r\n<b>Dan</b> - (<i>to phone</i>) Dial damn you, dial!\r\n<b>Equipmentimus</b> - Dan's Equipment Dealer, how may I help you?\r\n<b>Dan</b> -  Equipmentimus, it's me.\r\n<b>Equipmentimus</b> - Me who?\r\n<b>Dan</b> - Dan!\r\n<b>Equipmentimus</b> - Ah yes. (<i>feigning cordiality</i>) What can I do for you today, Dan? Would you like me to further reduce my mark-up? Are you calling to kindly inform me that you've decided to buy the majority of your equipment on eBay again?\r\n<b>Dan</b> - No, no. I need to double-check the electronomical load of the projection booth before we start shaving savings from the electrical bid.\r\n<b>Equipmentimus</b> - Ok. What specs did you give them?\r\n<b>Dan</b> - 130 (read: one thirty) amp for the projector, and 120 (read: one twenty) for the soundhead. Is that right?\r\n<b>Equipmentimus</b> - That's right.\r\n<b>Dan</b> - Damnit. I was hoping you'd say I had my numbers wrong. I guess we really are going to have to upgrade to a 600 amp service.\r\n<b>Equipmentimus</b> - 600 amps! Are you running a leprechaun shack in there or something?!\r\n<b>Dan</b> - Of course not! But what else can we do when the projection room ALONE requires 250 amps of electronation?\r\n<b>Equipmentimus </b> - 250 amps? How did you get that number?\r\n<b>Dan</b> - 130 for the projector, and 120 for the soundhead.\r\n<b>Equipmentimus </b> - No, no, no. You misunderstood me! It's ONE 30 amp for the projector, and ONE 20 amp for the soundhead. You only need 50 amps to run the booth.\r\n<b>Dan</b> - Oh my....\r\n\r\n<i>CUT TO:</i> Flashback, early 80s\r\n\r\n<b>Teacher</b> - I'll whisper the sentence to Jimmy, and then he'll whisper the sentence to his neighbor, and so on and so forth until it gets to Daniel.\r\n<b>Class</b> - Yippee!\r\n<b>Teacher</b> - (<i>whispers</i>) The little fish waved at the green turtle.\r\n<b>Jimmy</b> - (<i>whispers</i>) The little fist waved at the green turtle.\r\n<b>Jane</b> - (<i>whispers</i>) The brittle fist waved at the keen turtle.\r\n\r\n<i>FADE TO:</i> The last student whispering in Dan's ear\r\n\r\n<b>Teacher</b> - Very good class. Okay Daniel, what did you hear?\r\n<b>Dan</b> - Poop poop nard sack - Mrs. Jenkles smells like urinal cakes. Daniel is AWESOME!\r\n<b>Class</b> - (<i>breaks into hysterics</i>)\r\n\r\n<i>CUT TO:</i> Present day\r\n\r\n<b>Electronicus</b> - 50 amps! That's quite a difference.\r\n<b>Dan</b> - Is it?\r\n<b>Electronicus</b> - Yes, it is.\r\n\r\n<b>WHAT HAPPENS NEXT?</b>\r\n\r\n- Does this new revelation save money for the Moxie, or ultimately spell d-i-s-a-s-t-e-r?\r\n- Will Dan every get over his fear of the telephone game?\r\n- Why do all urinal cakes have that little skunk on it?\r\n- Who wants to bet that 30% (or more) of the female readership have never seen a urinal cake?\r\n\r\nCome back tomorrow to find out!\r\n\r\n<b>Addendum #1</b> - Greetings new blog readers! This blog is about starting an independent movie theater in Springfield, Missouri. No, seriously, it is. Don't believe me? Read the archives. I used to be quite pithy and informative. Ah, those were the days.\r\n\r\n<b>Addendum #2</b> - In lieu of a new phlog, my good friend <a href=\"http://justin.retroflux.com\" target=\"_blank\" class=\"broken\">Justin</a> has published a <a href=\"http://justin.retroflux.com/?p=213\" target=\"_blank\" class=\"broken\">set of photos</a> depicting his fun-filled MOXIE weekend in Springfield. Be warned, the photos contain awesome shots of me looking cooler than anyone you've ever seen in your whole entire life. Seriously.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-04-13T06:08:47.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "Those years studying Shakespeare sure paid off, eh?",
      "created_at": "2005-04-13T07:14:30.000Z"
    },
    {
      "author": "bjork24",
      "body": "(<i>as Shakespeare</i>) Yes.",
      "created_at": "2005-04-13T07:15:54.000Z"
    },
    {
      "author": "Rachel",
      "body": "I've never seen a urinal cake.  I was amused by the skunk reference...oh yeah...what's a skunk?",
      "created_at": "2005-04-13T07:20:04.000Z"
    },
    {
      "author": "Caleb",
      "body": "Wonderful story. Hopefully it has a happy ending...",
      "created_at": "2005-04-13T07:24:40.000Z"
    },
    {
      "author": "Allison",
      "body": "urinal cakes are gross (but probably better than having nothing). we had them in the bathrooms when I was a lifeguard.  so I've seen them. ew.",
      "created_at": "2005-04-13T07:26:58.000Z"
    },
    {
      "author": "bjork24",
      "body": "Happy ending?\r\nWe shall see.\r\nMore urinal cakes?\r\nMost definitely.",
      "created_at": "2005-04-13T07:28:16.000Z"
    },
    {
      "author": "Aaron",
      "body": "Those urinal cakes were probably supplied by Aire-Master, whose mascot thing is a skunk. I think his name is Stinky. Seriously, they have a skunk costume. Around Christmastime, they had an open house with Stinky Claus or something like that. ",
      "created_at": "2005-04-13T08:05:46.000Z"
    },
    {
      "author": "erin",
      "body": "nope. no urinal cake sighting for me.\r\n\r\ni think the aire master skunk is cute.\r\n\r\nis aire master just a regional thing...? hummm.\r\n\r\nyeah. anyway. : )",
      "created_at": "2005-04-13T08:10:04.000Z"
    },
    {
      "author": "Ole",
      "body": "Hey Aaron,\r\n\r\nHow did the show at the Outland go?  Do you do design work for hire?  if so, how does a guy go about getting in touch with you?\r\n\r\n",
      "created_at": "2005-04-13T08:19:28.000Z"
    },
    {
      "author": "Aaron",
      "body": "Ole, Ole Ole Ole::\r\n\r\nThe exhibition at the Outland Ballroom was okay. I was worn out from the previous week, so I left around eleven. Sold a few posters, made a bit of scratch. As far as design work goes, I'm trying to not take on many projects right now but I'm willing to listen. Just shoot me an email. If I can't help you, I'll try to find someone who can. Thanks for the interest.",
      "created_at": "2005-04-13T08:59:44.000Z"
    },
    {
      "author": "brian of moore",
      "body": "oh.. tis good news it seems\r\nyay\r\nalthough im not so sure of the 14 weeks estimation for the Canadian leprechauns\r\nprobably less... they like their gadgets",
      "created_at": "2005-04-13T10:39:58.000Z"
    },
    {
      "author": "Emily the Marketing Dork",
      "body": "Chiming in as a female who has never seen a urinal cake.  Good luck with the amperes...as soon as I started reading, I thought, \"Wow!  That's a fricking TON!\"  Heh heh, miscommunication is funny like that...although your architect should have spotted that as 'couldn't-possibly-be-correct' misinformation.  They're trained in that, you know.",
      "created_at": "2005-04-13T11:00:03.000Z"
    },
    {
      "author": "Fyse",
      "body": "Dan's back, and kicking bottom once more.",
      "created_at": "2005-04-13T13:35:22.000Z"
    },
    {
      "author": "Fyse",
      "body": "Oh, and how about a 'best of' post for new readers? The DAFT formula was definitely a classic, but there's plenty of others people shouldn't miss out on.",
      "created_at": "2005-04-13T13:38:41.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "So, now that you've gone from 250 amps (meaning a separate panel for the production room) to a mere 50 amp breaker, how much does that slice off the bid price?\r\n\r\nAnd I've seen plenty of urinal cakes in my day, but none with a skunk. You'll have to stock the restrooms with them.",
      "created_at": "2005-04-13T16:44:10.000Z"
    },
    {
      "author": "nicholas",
      "body": "Aaron, you may be the only other person I've come across who knows of the Santa Skunk. Check out the post I made about it back in December... <a href=\"http://www.ncoleman.com/blog/2004/12/santa-skunk.html#comments\"> http://www.ncoleman.com/blog</a>",
      "created_at": "2005-04-13T18:27:11.000Z"
    },
    {
      "author": "bjork24",
      "body": "Urinal cakes - an endless mine of comedic gold.",
      "created_at": "2005-04-13T18:37:10.000Z"
    },
    {
      "author": "WhimsyCHick",
      "body": "Urinal... cake? Why can't they call it something else? Ew.\r\n\r\nWhat's wrong with urinal deodorizer? Urinal freshener? Urinal sanitizer? Bar of urine? Er, no...",
      "created_at": "2005-04-13T19:00:03.000Z"
    },
    {
      "author": "Tawny",
      "body": "I've discovered that is is impossibly hard to answer the phone at work while I'm laughing out loud at today's post! It was fun anyway!\r\n\r\nIt's nice that they guys have something they can bond over, like urnal cakes. We girls get the pain and agony of that once-a-month torture! At least it's something all girls have and can relate to each other through.Oh yeah, I've seen a urnal cake. Not has hilarious as you might assume. Maybe it was because it was missing the skunk!\r\n\r\n",
      "created_at": "2005-04-13T19:17:52.000Z"
    },
    {
      "author": "Nate",
      "body": "According to Hardee's commercials we also bond over a half slab of cow between bread.\r\n\r\nBeats urinal cake, though.  Man, that was the worst birthday EVER.",
      "created_at": "2005-04-13T19:31:59.000Z"
    },
    {
      "author": "Pat",
      "body": "I tell you Urinal cakes are buzzworthy. I will reiterate my statement of a week ago. Sell the naming rights to the urinals with custom urinal cakes. If they can put a skunk on them they can put John Q's mug on them.",
      "created_at": "2005-04-13T19:33:00.000Z"
    },
    {
      "author": "Oz",
      "body": "Good bit of writing, Danny-boy.  You're a funny guy with your little dialogues.  \r\n\r\nI think I saw a urinal cake in a movie once....",
      "created_at": "2005-04-13T20:43:37.000Z"
    },
    {
      "author": "brian of moore",
      "body": "this reminds me of the fly in the urinal thing \r\n[url]http://www.tiggysribticklers.com/images/flyintoilet.jpg[/url]\r\ngo ahead.. click it.. its funny",
      "created_at": "2005-04-13T21:53:09.000Z"
    },
    {
      "author": "brian of moore",
      "body": "or copy and paste it.. and ignore the [url][/url]  whichever works best for you.. err",
      "created_at": "2005-04-13T21:53:42.000Z"
    },
    {
      "author": "Nicki J",
      "body": "perhaps a bit of <a href> for ya brian? :-D though, I've never tried to insert a link here before.\r\n\r\nmy family now owns a cleaning company. I've had the pleasure of viewing many-a-urinal cakes. Can't say I've ever looked THAT closely, though. My eyes are usually closed when I'm licking them...",
      "created_at": "2005-04-13T22:38:54.000Z"
    },
    {
      "author": "Nicki J",
      "body": "hmm. that was interesting. my botched html example turned my text red. Rock.",
      "created_at": "2005-04-13T22:39:45.000Z"
    },
    {
      "author": "brian of moore",
      "body": "oh? so we can just use <a href=\"http://www.whiteninjacomics.com>html</a> i was unaware... figured it was like message board \"pretend\" html... good to know",
      "created_at": "2005-04-14T03:25:54.000Z"
    },
    {
      "author": "brian of moore",
      "body": "<a href=\"http://www.whiteninjacomics.com\">html</a> i was unaware... figured it was like message board \"pretend html... good to know... woops entered too ... nevermind.. i need a nap",
      "created_at": "2005-04-14T03:27:15.000Z"
    },
    {
      "author": "Oz",
      "body": "Dan, they're hijacking your redness.  You won't be special anymore.",
      "created_at": "2005-04-14T04:42:23.000Z"
    },
    {
      "author": "brian of moore",
      "body": "but his redness is <b>bold</b>",
      "created_at": "2005-04-14T06:20:29.000Z"
    },
    {
      "author": "nicholas",
      "body": "<font color=\"red\"><b>Dan says:</b></font> nick rocks.\r\n\r\nAnd probably now caused Dan to shut off html tags...",
      "created_at": "2005-04-14T18:21:40.000Z"
    },
    {
      "author": "Oz",
      "body": "Cool trick, Nicholas!  I want to try it out.  Let's see if I get the bold tag right....\r\n\r\n6.  <b>Dan says:</b>\r\n\r\nI like weiner dogs.  To shorthand it, I usually just say, \"I like weiners.\"",
      "created_at": "2005-04-14T18:50:16.000Z"
    },
    {
      "author": "bjork24",
      "body": "You guys are nerds.",
      "created_at": "2005-04-14T19:10:50.000Z"
    },
    {
      "author": "Oz",
      "body": "What??????\r\n\r\n<b>Dan says:</b>\r\n\r\nNot you, Oz.",
      "created_at": "2005-04-16T02:32:46.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 14,
      "name": "Dialogue"
    }
  ]
}
