{
  "id": 195,
  "title": "Audio post numero uno",
  "body": "All my fingers were temporarily broken today, so I created the first, and possibly last, Moxie audio post. <a href=\"/pix/mp3/audio_post_01.zip\">Download it here</a>.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-04-14T03:44:51.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "whitty",
      "body": "Wicked awesome!",
      "created_at": "2005-04-14T03:57:10.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Brilliant! I want more, but only when I'm at work. I won't wait forever, you know.",
      "created_at": "2005-04-14T04:18:02.000Z"
    },
    {
      "author": "Nicole",
      "body": "So this is what Dan does when I leave him alone for a few hours...",
      "created_at": "2005-04-14T04:41:41.000Z"
    },
    {
      "author": "bjork24",
      "body": "You should listen to it as you sleep... seriously.",
      "created_at": "2005-04-14T05:28:39.000Z"
    },
    {
      "author": "Ole",
      "body": "Ooh, Danny's a podcaster! ",
      "created_at": "2005-04-14T05:54:20.000Z"
    },
    {
      "author": "Ole",
      "body": "and since his fingers are temporarily broken (packing for the wedding?) then follow the link under the URL banner to the News-Leader article today about your favorite theatre to be.",
      "created_at": "2005-04-14T05:56:23.000Z"
    },
    {
      "author": "brian of moore",
      "body": "awesomeness... except for 'bloggerinos'\r\nyou need to start a pirate radiostation",
      "created_at": "2005-04-14T06:24:26.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i have this urge to patronize the moxie cinema.. not in a bad way.. but as in be a patron there and spend all my money there... is that just me?\r\ni better go to the atm",
      "created_at": "2005-04-14T06:28:22.000Z"
    },
    {
      "author": "Rachel",
      "body": "Hey when am I gettin' that arm and a leg t-shirt?  Man, I want answers...I don't care if you don't like my tone!",
      "created_at": "2005-04-14T07:22:09.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ole: I need to post something about that article. It really made us sound pathetic, didn't it.\r\n\r\nBrian: I'm glad you caught that. Now listen to it while you sleep... or on the way to the ATM.\r\n\r\nRachel: The t-shirts should be here soon. I already have the buttons. I'm just waiting on the shirts and stickers.",
      "created_at": "2005-04-14T07:40:14.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Oh, good...I was worried the shirts were lost in the mail.",
      "created_at": "2005-04-14T08:49:09.000Z"
    },
    {
      "author": "Nicki J",
      "body": "That was freaking awesome. I want mooooore. \r\n\r\nExcept that part at the end.\r\n\r\nThat was just creepy.",
      "created_at": "2005-04-14T09:52:43.000Z"
    },
    {
      "author": "Laura",
      "body": "I love the audio post.  Keep 'em coming.",
      "created_at": "2005-04-14T11:28:05.000Z"
    },
    {
      "author": "Surferbill",
      "body": "brian of moore: I have that odd feeling too... and I don't know why (maybe it's my bloggery nose) but I feel the need to donate all my money to Moxie cinema. The Moxie cinema is great!\r\n\r\nUnfortunately I have no money left since I spent it all on flights to Springfield, MO for the opening of Moxie cinema in late 2004, February and March.\r\n\r\n:-p",
      "created_at": "2005-04-14T16:08:04.000Z"
    },
    {
      "author": "justin",
      "body": "Yes.... brilliant!",
      "created_at": "2005-04-14T17:27:12.000Z"
    },
    {
      "author": "Emily",
      "body": "Brilliance!  More, please.",
      "created_at": "2005-04-14T17:30:31.000Z"
    },
    {
      "author": "Oz",
      "body": "Cool radio voice.",
      "created_at": "2005-04-14T17:56:05.000Z"
    },
    {
      "author": "Oz",
      "body": "Not at all like that girly voice you had in that TV interview I watched a while back.",
      "created_at": "2005-04-14T17:56:31.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks for noticing my manly husk, Oz. I made the audio post for the sole purpose of proving to everyone that my voice doesn't sound like a frog prince.",
      "created_at": "2005-04-14T18:11:36.000Z"
    },
    {
      "author": "nicholas",
      "body": "oh man, dial-up is killing me...I may provide a transcript of this post to save the other dial-up folk (i'm travelling).",
      "created_at": "2005-04-14T18:24:06.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'm sure they'd appreciate that.",
      "created_at": "2005-04-14T18:26:38.000Z"
    },
    {
      "author": "Fyse",
      "body": "Dan, you're a freakin' genius. And a freak. But mostly a genius.\r\n\r\nI've been considering a leap into the podcasting world, but I'm now convinced I first need my own theme song / jingle. Must get working on that. (But not till after my exams...)\r\n\r\nAnd Oz is right, your voice was much better in that. Not as good as Nicole's though. She sounded hot!",
      "created_at": "2005-04-14T18:53:36.000Z"
    },
    {
      "author": "Dave",
      "body": "great. i got that damned jingle stuck in my head now.",
      "created_at": "2005-04-15T01:00:50.000Z"
    },
    {
      "author": "matt",
      "body": "oooooooooh, i don't know.  stick with the written word, dan.  the humor works better on the page than in my ears.  but don't worry, i've thought the same thing about every blog that i've read that's become an audioblog.  a blog is in itself sort of self-absorbed, but when you know someone took the time to produce an audio segment, it just gets embarrassing! :)",
      "created_at": "2005-04-15T07:59:43.000Z"
    },
    {
      "author": "Liz",
      "body": "Hahahaha! That was excellent. <br><br>Hey, my roommate was asleep while I listened to this, so now she will patronize the Moxie cinema because it's great and deserves all her money.  And maybe she'll stop making fun of your grammar and my inability to analyze poetry! (One can only hope.)",
      "created_at": "2005-04-15T12:23:28.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
