{
  "id": 196,
  "title": "Hey look, Part 8",
  "body": "I meant to add this one quite awhile back, but then I forgot. I need to start taking ginko bilbo baggins suppliments.<br/><br/><b>The Indie-Movie Phenomenon</b><br/>by Jenny Lupica<br/>417 Magazine, March 2005<br/><br/>Independent movies like The Motorcycle Diaries and I Heart Huckabees attracted a lot of attention in the national media last year, yet they never played Springfield, much to the chagrin of local cinema connoisseurs.<br/><br/>Enter Moxie Cinema.<br/><br/>At press time, this one-screen movie theatre was due to open in March at 408 West Walnut Street. The owners say it will be the kind of place that would show a movie like Sideways. \"We'll show whatever is out there, whether it's foreign, documentary or a local director,\" says Dan Chilton, who owns Moxie Cinema with his wife, Nicole. Indeed, the Chiltons say they've patterned the Moxie after the Ragtag Cinemacafe in downtown Columbia, which became immediately popular after opening five years ago. Like the Ragtag, Moxie Cinema won't have much in common with the average multiplex. There will be a different beverage menu, for starters. You will be able to sip on a beer or a glass of wine and enjoy a gourmet treat while you watch the show. And they plan to display work by local artists and play music from local bands before and after shows.<br/><br/>\"We're trying to give people a different experience than they're used to,\" Chilton says. When asked if people will latch on to this new activity, Chilton's pretty sure it's a yes. \"Downtown has gotten to the point now that it can support a theatre like this; people are coming downtown looking for something to do,\" he says.<br/><br/>If people are coming downtown looking to do more than dinner or nightclubs - even if it's the third Friday of the month and not a single art gallery is open - then Moxie Cinema and Skinny Improv have a chance for success.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-04-14T19:17:43.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "Jenny Lupica should have checked her facts. I Heart Huckabee's did indeed play in Springfield at Campbell 16. I saw it there! ",
      "created_at": "2005-04-15T06:46:45.000Z"
    },
    {
      "author": "MIke",
      "body": "What are the costs to actually screen the movie? What do the film distributers charge? I hear horror stories about the big chains only making money of conssesions. Is this why you are screening Indie and documentary filmes?<br/><br/>Mike",
      "created_at": "2005-05-09T18:42:28.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
