{
  "id": 197,
  "title": "Hey look, Part 9",
  "body": "Here's the piece that ran in yesterday's edition of the News-Leader. The full story is <a href=\"http://entertainment.news-leader.com/today/20050413-Costsdelayopeni.html\" target=\"_blank\">here</a>, complete with a grainy shot of me standing in front of the building. Do you think this article makes us sound a little amateurish? I'm sure that wasn't Sony's intention, but it makes our situation sound a lot worse than it actually is. I don't know... perhaps that's a good thing.\r\n\r\n<b>Costs delay opening of Moxie</b>\r\nBy Sony Hocklander\r\nSpringfield News-Leader, April 13, 2005\r\n\r\n<i>The downtown art and independent movie theater may open in late May.</i>\r\n\r\nThe Moxie Cinema is still in the works, says Dan Chilton who, with wife Nicole, hopes to establish the new art and independent movie theater downtown. But they've had a few setbacks.\r\n\r\nNamely — after filing for a permit to bring the building up to city code — a bigger budget than anticipated.\r\n\r\nThe theater will show art-house, foreign and documentary films, and be a venue for local filmmakers' work, Chilton says. The Springfield couple, who conceived of the business a year ago while living in St. Louis, wanted to open in March, then April. Now it could be late May or beyond.\r\n\r\nThey've obtained a small business loan, but bids to improve electrical capabilities, plus meet heating and air requirements among other things, were more than initially estimated.\r\n\r\n\"None of us had foreseen them or budgeted for them,\" Chilton says. \"So we started scrambling.\"\r\n\r\nWhich is one reason they put naming rights to their concession bar up for auction on e-Bay. The concession will serve traditional movie fare, along with beer, wine, coffee drinks and baked goods. By Wednesday, the bid was over $1,000 with four days to go.\r\n\r\n\"It's quirky enough, it might work,\" Chilton says.\r\n\r\nThey've also considered inviting investors.\r\n\r\nAndrew Baird owns the Moxie's Walnut Street building. People are excited about the theater, says Baird. Downtown projects are often more complicated than they initially seem, but it shouldn't take long to open once work has begun.\r\n\r\n\"I have every confidence that Dan and Nicole will have the theater open by the summer,\" he says. \"And I think people will rise up and support the enterprise when it gets together.\"",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-04-14T19:21:30.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Ole",
      "body": "Your just feeling the heat of your own expectations Dan.  It happens on any and all construction projects.  You & Nicole made a conscious decision to maintain independence rather then get open sooner but with investors.  Revel in that decision and live with the rest of it - inspectors, architects, et. al.   Go pet your dog, you'll feel better! ",
      "created_at": "2005-04-14T20:00:52.000Z"
    },
    {
      "author": "bjork24",
      "body": "Good advice.",
      "created_at": "2005-04-14T20:01:44.000Z"
    },
    {
      "author": "Nate",
      "body": "Nah, it sounds alright.\r\n  \r\nI like the low angle of the picture though - very local band-ish.  You should have folded your arms and scowled straight into the lens.",
      "created_at": "2005-04-14T20:09:57.000Z"
    },
    {
      "author": "Oz",
      "body": "Not the greatest article, but not the worst either.  I for one am not surprised that it's taking longer than you thought.  When we bought our house and decided to do the work ourselves, my partner's uncle had a great bit of wisdom (which I scoffed at):  \"Whatever you try to do, it will take you FOUR TIMES LONGER THAN YOU THOUGHT.\"  That sounded preposterous to me!  Oh, how true it was/is.",
      "created_at": "2005-04-14T20:13:47.000Z"
    },
    {
      "author": "bjork24",
      "body": "4x as long, and 28x as much... that's my new motto. I works on so many levels!",
      "created_at": "2005-04-14T20:16:19.000Z"
    },
    {
      "author": "Matt",
      "body": "It doesn't sound so bad, as long as you don't read the words \"inviting investors\" as \"inventing investors,\" as I did. ",
      "created_at": "2005-04-14T22:10:15.000Z"
    },
    {
      "author": "Allison",
      "body": "They say that any publicity is good publicity! ;)  (unless they're saying how much you suck, which I would consider bad publicity)\r\n\r\nhow many watchers on the auction these days? Any hope of making it to ebay's pulse?  :)",
      "created_at": "2005-04-14T22:43:08.000Z"
    },
    {
      "author": "bjork24",
      "body": "53 watchers. I don't know how many you have to have to get on eBay's pulse, but I fear we're far from it.",
      "created_at": "2005-04-14T23:18:40.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
