{
  "id": 199,
  "title": "Going to Kansas City... Kansas City here I come",
  "body": "They've got some crazy little women there, and I'm gonna... avoid them at all costs. The LAST thing I need is another crazy leprechaun chasing me around all day!\r\n\r\nWe're actually heading up for Nicole's twin sister's (<a href=\"http://www.cincodrive.com\" target=\"_blank\" class=\"broken\">Stephanie</a>) wedding. The rehearsal dinner is tonight, the wedding is tomorrow, and their birthday is on Sunday, which is also when the AUCTION ends. So:\r\n\r\n<b>Congratulations Stephanie and Joel!</b>\r\n<b>Happy Birthday Nicole and Stephanie!</b>\r\n\r\nAnd now back to the business at hand... the auction. We have roughly 2 days to make this thing explode. Right now, 55 people are watching the auction and a little over 2,300 have stopped by to take a gander. I'm hoping the auction follows the trend of other big ticket items, as in: a flurry of activity on the first day, a lull in the middle, and a frantic bidding war in the last couple hours before the auction closes. If so, the best has yet to come.\r\n\r\nI met with a guy from Clear Channel on Wednesday (hi Ken!), and he told me that his company might be interested in winning the auction and naming it after one of their local radio stations or morning shows. That's fine by me. In fact, I think it's pretty funny. I wouldn't mind having the \"Woody and Suzanne Morning Show\" Cinebar. I think that kind of exposure would make other local businesses jealous, which would be a good thing if we decided to turn this into a annual auction (as suggested by the ABC 33 reporter). Who knows?! Weeeee!\r\n\r\nAnyways, if we want this auction to be seen by the right people, today is our last chance. If you have a spare moment, send an eBay message to Golden Palace Casino, submit the story to Boing Boing, tattoo the URL across your cleavage, etc., etc., etc.. If you're at work, stop what you're doing... it's FRIDAY! You shouldn't be working anyways. If you were REALLY supposed to be working, why are reading this post? Huh? Huh!\r\n\r\nOk, I'm off. I'm going to get a shave and a haircut from the barber down the street, pick up Nicole, and hit the road. Why? Because I hate the road and it bad mouthed my mom. Until next time... pimp that eBay auction like Julia Roberts in a blonde wig!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-04-15T17:23:34.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Aaron Scott",
      "body": "Hey, I look like I'm working, right? I'm doing \"research\" on local business, or something.\r\n\r\nSay hello to my Granddad as you drive past the Flying J station. He lives off of that exit, a few miles down the road.",
      "created_at": "2005-04-15T18:43:04.000Z"
    },
    {
      "author": "J.R.",
      "body": "Have a safe trip!  Be sure to stock up on the wedding cake so you have some food on reserve.",
      "created_at": "2005-04-15T20:05:19.000Z"
    },
    {
      "author": "Luke",
      "body": "Hope you guys have a great trip.  I'll be watching that auction throughout the weekend and hoping for the best!",
      "created_at": "2005-04-15T20:06:22.000Z"
    },
    {
      "author": "brian of moore",
      "body": "hah.. clear channel... oh how we loathe clear channel... but if they pay 10 grand for a cinebar sign.. and help the moxie.. thats fine by me",
      "created_at": "2005-04-15T22:06:47.000Z"
    },
    {
      "author": "mike",
      "body": "You should definitely make the auction an annual event, that's a fantastic idea! \r\n\r\nMaybe one year (when you don't desperately need the money) you could just award a random movie-goer with the cinebar name-thingy', for example: \"the Michael Amb's Cinebar\" - then I'd be the talk of the town, and I would tell everyone I know to go there and check it out.",
      "created_at": "2005-04-15T22:42:25.000Z"
    },
    {
      "author": "Jamie",
      "body": "Happy Birthday to me, happy birthday to me, happy birthday to Nicole, Stephanie and \r\nJamie!",
      "created_at": "2005-04-16T04:30:24.000Z"
    },
    {
      "author": "brian of moore",
      "body": "there were no last minute bids!?  thats crap!",
      "created_at": "2005-04-17T23:02:23.000Z"
    },
    {
      "author": "Luke",
      "body": "Guess it's $1001 then",
      "created_at": "2005-04-17T23:21:28.000Z"
    },
    {
      "author": "Ole",
      "body": "Well folks, to paraphrase:\r\nRachel - he must have heard the buzz...\r\nNate - very rousing...\r\n\r\nbut mmore directly\r\nMatt - I am the high bidder\r\nSteph v - I won!\r\n\r\nand finally\r\nEvan Erwin - Hahahaha, I rule!\r\n\r\nThe link to the site that will be promoted at the CineBar is part of this post.  Now if I could just get Aaron to call me so I can get a logo created, I'd be getting somewhere.  Come home & collect your check Dan & Nicole!\r\n ",
      "created_at": "2005-04-17T23:30:23.000Z"
    },
    {
      "author": "brian of moore",
      "body": "oh.. soccer.. ... i dont really like sports.. but soccer girls are usually hot.. so thats good",
      "created_at": "2005-04-18T00:59:08.000Z"
    },
    {
      "author": "Oz",
      "body": "Sorry you didn't get the $10k you were hoping for--or even the $5k minimum you wanted.  But maybe with the reduction in cost from the electrical upgrade, you'll make out okay.",
      "created_at": "2005-04-18T02:02:54.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yes, it's true, Steve is the winner. Nicole and I are meeting with him tomorrow to hash out the details. As soon as we agree on the name, I'll post it here.",
      "created_at": "2005-04-18T02:05:47.000Z"
    },
    {
      "author": "Fyse",
      "body": "Sorry it didn't do as well as you'd hoped, but it's better than a kick in teeth, no? (That's a saying in England, just in case it doesn't translate well into American...)\r\n\r\nI'm sure you guys will do fine anyway, and I hope many bloggers I read will give an account of your triumphal opening. (I know a few of them have said they'ere planning to travel down.) I only wish I could be there too...",
      "created_at": "2005-04-18T04:16:19.000Z"
    },
    {
      "author": "Allison",
      "body": "I wonder if naming rights to a urinal would be more \"popular\" on ebay...\r\n\r\nI was thinking the other day about how much money probably ends up in landfills each year on accident.  Even if people just lose a quarter or dime, it adds up.  You need to somehow get your hands on that \"lost\" money without actually visiting a landfill...",
      "created_at": "2005-04-18T06:11:12.000Z"
    },
    {
      "author": "brian of moore",
      "body": "no update in 3 days means we deserve a photoblog ... im not sure if thats actually justified... i just want to see some pictures.... they can be of parakeets and bicycles for all i care.. i just want some pictures",
      "created_at": "2005-04-19T02:06:27.000Z"
    },
    {
      "author": "Tawny",
      "body": "Is there still need for a fundraiser? If so, I'm still offering to help! ",
      "created_at": "2005-04-19T04:02:20.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
