{
  "id": 2,
  "title": "Introduction, Part 2",
  "body": "Today's post will address the simplest aspect of our project: the idea. Of course, everyone has ideas, and I'm sure there's been a lot of cinephiles who've lived in Midwestburg and thought the very same thing that Nicole and I did... \"This place could really use an art-house theater.\" So what makes our idea better than the next guy's?<br/><br/>1. <b>Timing</b> - Midwestburg's downtown is growing at a remarkable rate. Five years ago, no one would've considered placing art galleries, trendy restaurants, high-rent loft apartments, and locally-owned boutiques in the decaying area that made up downtown... but all that's changed. The community is seeing a rebirth of cultural and artistic spirit, with the majority of it focused on downtown, making a unique, art-house cinema like Cinema 24 the ideal fit for a burgeoning district seeking a new identity.<br/><br/>2. <b>Competition</b> - Currently, Midwestburg has three multiplex theaters operating on the South side of town: a gaudy 16 screen first-run in the middle of the South side, a slightly less gaudy 8 screen first-run on the Southeast corner, and a disgusting 8 screen second-run in the Southwest section of town. To date, none of these theaters have ever focused on playing independent, let alone foreign, films.  The closest purveyor of less-mainstream cinema is 45 minutes away in Hicksville, which not even half the size of Midwestburg. Cinema 24 will be the only venue in town for independent and foreign film.<br/><br/>3. <b>Colleges</b> - Midwestburg has three plump colleges nestled around the downtown area: Midwestburg Public University (enrollment around 20,000 students), Midwestburg Technical College (8,000 students), and Midwestburg Private University (4,000 students)... bring our student body population to roughly 32,000 students. Now, before I continue, it should be noted that students are not our main marketing segment. We will direct a healthy portion of our marketing to students and offer discounts to those with valid ID's, but college students are notoriously cheap, so basing a profit-driven business on their patronage isn't a smart idea. Still, college students love independent film, and we plan on designing a \"Midnight Movie\" film series to satiate their diverse tastes (can anyone say <b>Donnie Darko</b>, <b>Office Space</b>, and <b>Spaceballs</b>?).<br/><br/>4. <b>Unique</b> - Midwestburg's current theaters are loud, gaudy, catchpenny affairs with terrible presentation and even worse customer care... save the Aztec, which is where Nicole and I used to work, whose customer care is a tad bit better than the rest. Cinema 24 will be a horse of a different color. No tacky carpet and multi-colored, sound-dampening, faux-velvet curtains here... we're all about atmosphere. We want our theater to be as inviting as possible. Before or after you see a film, we invite you to sit around in our spacious lounge area, chat with Nicole and I, and most importantly, buy more of our wonderfully unique concession items!<br/><br/>5. <b>Wonderfully Unique Concession Items</b> - Cinema 24 will be the only theater in Midwestburg that serves alcohol, coffee, and Moon Pies to our patrons. As trite as sounds, alcohol is a big draw. Wouldn't you like the opportunity to sit back, sip on a nice cold beer or glass of wine, and watch an interesting movie? We're going to work with local bakeries and restaurants to supply their goods in our concession area... not to mention Cracker Jacks, Moon Pies, popcorn in boxes (4 sizes: small, medium, large, and the \"Damn, that's huge!\"), etc..<br/><br/>*Man this post is getting long, I better wrap it up.<br/><br/>6. <b>Wrap Up</b> - Beyond the 5 items I mentioned above, our theater will further set ourselves apart by offering / featuring the following:<br/><br/><ul><li>Art on the walls - we'll lease our auditorium wall space to local and regional artists to exhibit their work.</li><br/><li>Introductions - each film will be introduced by a real person (most likely Nicole or I).</li><br/><li>Interaction - certain films will have guest speakers attached to them for interaction with the audience, symposiums, etc..</li><br/><li>Free stuff - we'll randomly give away free stuff to audience members... because we're cool that way.</li><br/><li>Dinner and a movie - we'll work with downtown restaurants to offer \"Dinner and a Movie\" certificates... something like $25 dollars to a certain restaurant and 2 free tickets for $35.</li></ul><br/>I could go on and on, but I'm going to leave it at that. Tomorrow's post will be about... I haven't decided yet.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-05-25T19:48:37.000Z",
  "author": "Dan",
  "comments": [],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
