{
  "id": 20,
  "title": "Fears",
  "body": "Like the \"oh so creative\" title suggests, today's post will be focused on some of the fears that Nicole and I are having about starting our theater. Of course, we're much more excited than we are scared, but I don't think this would be a fair representation of the total experience without chronicling the good with the bad. Anyone in their sane mind would, and should, think twice about leaving a good-paying, secure job for the untested waters of a risky business venture, which is something Nicole and I have thought about many times.<br/><br/>Are we ready for this? Can we handle the stress, the customers, the debt, the responsibility, the employees, the hours, the lack of personal medical insurance? Yes, I think we can. Otherwise, why else would we be doing this? Nicole and I are entirely committed to starting this theater - come hell or high water, we will succeed - but I'd be lying if I said we weren't the least bit frightened of stepping out on our own.<br/><br/>We're scared witless, but at the same time we're excited beyond belief. In a way, our rational fears and worries feed the unbelievable excitement of trying something new. It's almost as if we're welcoming obstacles, goading them to come at us and try, just try, to hold us down. We're not so naive to think that starting our own business is going to be a walk in the park, nor are we too scared to attempt it. It looks as though I've waxed metaphorical for long enough, so let me list off a few of the worries that are on our minds.<br/><br/><b>Surviving</b><br/>In order to funnel as much of our profits back into the business, Nicole and I have decided to sacrifice our salaries - not completely, but severely - until the theater pulls through its first few bumpy, formative years. After you figure in the amount of time we'll be working, our pay will only be about 10 cents higher than what our entry-level employees will be making. Still, that's a sacrifice we're both willing to make. If we can't afford an apartment or money for food, we'll just have to sleep in the lobby and feast on the nightly surplus of uneaten popcorn, but let's hope it never has to come to that.<br/><br/><b>Insurance</b><br/>The lack of personal insurance (medical, dental, vision, and otherwise) is a serious problem that anyone who starts their own business has to worry about. Some entrepreneurs are lucky enough to have a spouse who keeps his or her day-job, thus assuring insurance coverage for the both of them. Nicole and I won't be so lucky. I've heard talk about COBRA extending your current benefits up to 18 months beyond the date you leave your company, but I'm highly skeptical of such coverage.<br/><br/>In all likelihood, any extra money we have will go towards securing insurance for Nicole, while I, being the stubborn, invincible, never-gets-sick, 20/20 vision, perfect specimen of health that I am, will simply have to be more careful when I cross the street. Then, after we've made enough to insure us both, I'll allow my body to go to pot and I'll fall to pieces. Yipee!<br/><br/><b>Bogart</b><br/>Ah, Bogey. Our beloved and loyal pup. He loves Nicole and I so much that his heart breaks everytime we leave for work in the morning, and then again at lunch, and again in the evening if we decide to go out. He's locked up in our tiny two bedroom apartment, pining for us, and it tears us apart. I know it's a silly thing to be worried about, but we hate the thought of leaving Bogey all alone throughout the long hours we'll be required to work. Here's a couple pictures of Bogey:<br/><br/>* PICTURES HAVE BEEN REMOVED *<br/><br/>\"Could you just die?\" That's what Nicole says everytime Bogey flashes his puppy eyes at her. \"You're the sweetest little puppy in the whole wide world!\" As hard as it will be to tear ourselves apart from him each and every day, I'm sure Bogey will cope. He's a fighter. AND the great thing about moving to Midwestburg is that both of our families will be close by, and my best friend Doug (who has a fenced in backyard) will only be a few blocks away. I suspect that Bogey will have never had it so good as when we set up camp in Midwestburg.<br/><br/><b>Lack of a social life</b><br/>Oh, come on... who's kidding who? Nicole and I never had one of these to begin with. As long as we have each other, our loyal dog, and our Netflix subscription, all is good. Or is it?<br/><br/><b>Constant interaction with one's spouse</b><br/>Nicole and I currently work with each other, but due to the expansive size of our company's building we rarely see each other throughout the course of the day. All of that will change when we start our theater. Nicole will always be where I am, and vice versa. If we're not careful, this constant interaction will quickly build itself into a furious head just waiting to explode. Of course, Nicole and I realize this and we're going to try our hardest to give each other breathing room. We've already delegated the majority of our tasks so they won't overlap each other, and we've agreed to give each other one day off per week while the other works. Hopefully, within a year or two of opening, we'll be able to promote one of our employees to assistant manager so we can both take a day off at the same time, but until that day comes, we'll have to make do with alternating breaks.<br/><br/>I realize that a lot of these worries seem trivial, but there's a whole lot more where those came from. For instance, what will we do if one of our exes shows up at the theater?! GASP! Or a drunken patron decides to relieve himself in the lobby? Oh, the horror! Those scenarios, and more, will be covered in tomorrow's post, so until then... fare thee well.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-06-16T23:55:54.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "alleycat",
      "body": "I Wish yall the best of luck with yalls new business venture. I bet it is pretty scary leaving your job.Neat blog check out mine <a href=\"http://theworldaroundtheworld.blogspot.com/\" target=\"_blank\">The World Around The World</a>",
      "created_at": "2004-06-17T01:10:15.000Z"
    },
    {
      "author": "Oz",
      "body": "I don't know where a person makes suggestions on this blog, so I'll just slap one in here.  I think I remember you saying that you'd have two screens.  If you have two different bathroom areas, you should pipe the sound feed from screen 1 to bathroom 1 and the sound feed from screen 2 to bathroom 2.  Then if someone has to use the facilities, they wouldn't miss much.",
      "created_at": "2004-06-17T05:33:31.000Z"
    },
    {
      "author": "Justin",
      "body": "I wasn't aware that Bogart was a Siamese Dog.",
      "created_at": "2004-06-17T01:01:39.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks. I just flipped the pictures. Poor Bogey.",
      "created_at": "2004-06-17T01:05:23.000Z"
    },
    {
      "author": "Farid",
      "body": "I am also in the process of opening up my own business and see many parallels in your journey with my own journey. We are courageous people aren't we? <br/>see more at www.bogotabistro.com",
      "created_at": "2004-06-17T07:53:05.000Z"
    },
    {
      "author": "Justin",
      "body": "In response to Oz's comments, another idea would be to have a camera on the screen, and pipe the feed into the restroom along with the sound.",
      "created_at": "2004-06-17T08:53:22.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'd hate to see people spend all their time in the john, but they're good ideas, none-the-less.",
      "created_at": "2004-06-17T08:59:32.000Z"
    },
    {
      "author": "sarni",
      "body": "Is there any way you can bring Bogey into the cinema? I know of a cinema where I live that has a resident cat which wanders around. I guess it depends on how large/boisterous he is.",
      "created_at": "2004-06-18T16:59:59.000Z"
    },
    {
      "author": "bjork24",
      "body": "Sarni, we're too paranoid to bring Bogey inside b/c he tends to be rather protective of Nicole and I. He also sheds a lot, and not everyone is a dog person. Still, it would be nice if we could keep him inside as the resident cinema hound.",
      "created_at": "2004-06-18T17:47:21.000Z"
    },
    {
      "author": "Abbi",
      "body": "Got to your site through \"blogs of note\" - pretty awesome undertaking. :) Wanted to leave an fyi about COBRA as well, working in insurance I can tell you that if you elect they are required to offer you the same benefits as everyone else. Of course, you'll probably pay out the nose for it, and if the plan sucks anyway it's probably not worth it. And as long as you're both healthy now and there's no alarming family history, I'd probably go for it to save capital. If your interesting in an insurance peon's perspective... good luck w/ everything.",
      "created_at": "2004-06-18T23:40:10.000Z"
    },
    {
      "author": "Nigel",
      "body": "I thought you had two dogs at first!  The brown bits seem white in the 2nd photo!<br/><br/>I work in film produciton (sometimes for the evil large conglomerates) and wish you all the best with your venture!",
      "created_at": "2004-06-20T06:01:40.000Z"
    },
    {
      "author": "Betty",
      "body": "good dog",
      "created_at": "2004-06-28T22:20:02.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 7,
      "name": "Lists"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
