{
  "id": 200,
  "title": "Filthy Tiddles",
  "body": "We all knew this day would come - Tuesday, April 19th, 2005. It was inevitable. It was right there on the calendar all along.<br/><br/>Sorry I didn't post yesterday, but I've been busier than two muskrats copulating in a wool sock in the desert. No. Wait a minute. That's my analogy for being hot. I guess I don't have one for being busy. Oh well.<br/><br/>Work has officially begun on the theater. My dad and I built the first false wall for the Cinebar (expect a phlog in the near future). OH YEAH, and speaking of the Cinebar:<br/><br/>The winner of the Cinebar auction was none other than Springfield's own Steve Olson! Steve is a frequent blog reader (you probably know him as Ole), and has helped keep my and Nicole's finances in check by tossing a few odd jobs our way on occasion (thanks!). Steve's a marketing consultant here in town, but he won't be naming the Cinebar after his consulting firm. Instead, he's going to name the Cinebar after one of his websites, <a href=\"http://www.sgfsoccer.com\" target=\"_blank\">SGFsoccer.com</a>. Steve's a huge soccer fan - he played the sport for 20+ years and currently coaches the Pershing soccer team - so he decided to create a website that would centralize information, promote local teams from the high school up through college levels, and showcase his soccer videography skills. So, a big CONGRATULATIONS to Mr. Olson and the SGFsoccer.com Cinebar!<br/><br/>On that same note, we've decided to continue the tradition of auctioning off the Cinebars naming rights on an annual basis. Every year, on or around our anniversary mark, we'll auction off the naming rights for the preceding year, but instead of pocketing the money ourselves, the proceeds will fund an annual grant for a local independent film-maker. Woo hoo!<br/><br/>Let's see, what else...<br/><br/>We should be getting the new bids on electrical and HVAC sometime this week. I'm hoping the new quotes will shave at least $15K off our initial estimates, but I'm not holding my breath.<br/><br/>However, if the bids come back and they're STILL too high, we have alternate avenues of funding the theater. Llama black market.<br/><br/>Ha ha, just kidding.<br/><br/>Or am I?<br/><br/>Llama.<br/><br/>I just realized something - I never fully explained why our initial bids were so ridiculously high. Here's a quick breakdown:<br/><br/>Electrical - I supplied the engineers with bad data, which led them to believe we needed to upgrade to 600 amps. After discovering my mistake, the plans are being scaled down to a 400 amp upgrade... a HUGE difference. I'm hoping this will save us somewhere in the neighborhood of between $10K to $15K, but I have nothing to base that on other than a really funny Bazooka Joe comic.<br/><br/>HVAC - Or initial bid specified that the heat exchanger - a somehwat simple piece of machinery that sucked in outside air, conditioned it, and spit it into the auditorium - would cost us over $10,000. But, after speaking with the engineer, we were told the heat exchanger sells for roughly $2,100... <br/><br/>*mouth drops open*<br/><br/>So why did the subcontractor bid the heat exchanger to us at 5x the initial cost? Who knows. Seriously. Who among you knows? I want answers!!! Chris (GC) is currently investigating. After the dust settles, I'm hoping to save anywhere between $5K to $8K, but again... I have nothing to base that on.<br/><br/>I have more to mention, but I'm running out of time to type it out in length, so here's a CNN Headline News overview of what's left:<br/><br/>- On April 24th, a movie called <a href=\"http://hotdocs.ca/schedule_window.cfm?ProgramCode=HOME1\" target=\"_blank\" class=\"broken\">Homemade HillBilly Jam</a> is premiering at Canada's <a href=\"http://www.hotdocs.ca\" target=\"_blank\">Hot Docs Documentary Festival</a> in Toronto. The documentary is all about Springfield's most popular band, <a href=\"http://www.bigsmithband.com\" target=\"_blank\">Big Smith</a>. My goal is to get in touch with Mark Bilyeu and coordinate something - ANYTHING - with him and the band. Any suggestions?<br/><br/>- Why the title \"Filthy Tiddles?\" Why not?<br/><br/>- I think KY3 is running a little tiddle about the Moxie tonight. I'm meeting with them at 10:00.<br/><br/>- When I was 13 years old, I perfected a fighting move known as \"The Raptor.\" It consisted of running and jumping towards your opponent while frantically kicking your feet and punching your fists. The only way to effectively counter this move is to quickly move out of the way. Still, 12 years later, I can't think of a way to counter that defense.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-04-19T17:46:25.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "erin",
      "body": "im first! wooh! this sort of thing never happens to me.<br/><br/>...the proceeds will fund an annual grant for a local independent film-maker...<br/><br/>neat! tell us more!",
      "created_at": "2005-04-19T19:22:49.000Z"
    },
    {
      "author": "justin",
      "body": "yes, very neato idea.",
      "created_at": "2005-04-19T19:34:05.000Z"
    },
    {
      "author": "whitty",
      "body": "Um, Jodi Bilyeu was my poetry professor, sometimes I see him and I am like, \"Hey.\" and he is like, \"Hey.\"... and I went to school with his cousin... and my grandparents live two hollers over from his uncle.... yeah, I got nothing.<br/><br/>Hmmm, a friend of mine developed \"The Lumbering Panda\" defense, it might just work!",
      "created_at": "2005-04-19T19:34:24.000Z"
    },
    {
      "author": "rwj850t",
      "body": "Steve O, if you are going to plug the Pershing Soccer program, you've got to give people the URL: http://www.pershingsoccer.com",
      "created_at": "2005-04-19T20:05:23.000Z"
    },
    {
      "author": "Nate",
      "body": "Try Spastic Weasel.  Will work in a pinch.<br/><br/>The move, by the way, is left, left, up, right, right, down, B, A, Jump.",
      "created_at": "2005-04-19T20:24:40.000Z"
    },
    {
      "author": "Mark",
      "body": "Hey Dan, good to things are motoring along - cine bar pimped, those quotes busted down and construction is good-to-go.<br/><br/>Any news on the t-shirts? You never got back about the extra international post costs.<br/><br/>M",
      "created_at": "2005-04-19T20:42:11.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "When they run, you chase. Defense found!<br/><br/>And I take all of my life advice from Bazooka Joe comics. The sheer depth to be learned from those...it makes Archie Comics look like <i>The Necrinomicon</i>.",
      "created_at": "2005-04-19T21:14:35.000Z"
    },
    {
      "author": "whitty",
      "body": "Man, it is Jody with a 'y.' I bet I don't even get a \"hey\" anymore.  How embarassing.<br/><br/>I blame the rogue 'i' on the creepy little Jodie girl in Amityville Horror.<br/>",
      "created_at": "2005-04-19T21:21:50.000Z"
    },
    {
      "author": "Jed",
      "body": "I know a good defense for \"The Raptor.\" The stick sword, nope that doesn't work either. Anyway, who the f**k is Mark Bilyeu? If I ever see that guy \"The Raptor\" is defenitely going to come out. Does anyone have a name of a publicist or producer or the production team who made that movie? That would defenitely help out. ",
      "created_at": "2005-04-19T23:14:21.000Z"
    },
    {
      "author": "bjork24",
      "body": "Jed, the director is some German guy... his name escapes me. I don't think he's found a distributor yet.<br/><br/>Mark is the lead singer to Big Smith.",
      "created_at": "2005-04-19T23:17:52.000Z"
    },
    {
      "author": "brian of moore",
      "body": "busier than jeff goldblum at a scientology convention!.... hah!.. oh.. i kill me",
      "created_at": "2005-04-19T23:30:14.000Z"
    },
    {
      "author": "Fyse",
      "body": "When I was younger, my sister and I made up characters for a beat-em-up game, with names like 'old granny' and 'business man'. Old granny's special move was 'hand bag swing'.<br/><br/>I was a very cool kid.",
      "created_at": "2005-04-20T00:06:53.000Z"
    },
    {
      "author": "Jed",
      "body": "Has anyone seen my pen?",
      "created_at": "2005-04-20T00:09:52.000Z"
    },
    {
      "author": "Jed",
      "body": "NO...I'm OK I found it.",
      "created_at": "2005-04-20T00:10:12.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Ebay kindly reminded me that I did not win the auction...and suggested some other, similar, items to bid on. <br/><br/>Apparently, naming rights to the Cinebar are on par with Elton John, Celine Dion and Lion King tickets...<br/><br/>Does this mean The Moxie is like Disney?",
      "created_at": "2005-04-20T03:15:50.000Z"
    },
    {
      "author": "J.R.",
      "body": "I think you'd be correct, hopefully we wouldn't have the Eisner bar.  Bad stuff, bad stuff.  (Shakes sunburned head.)",
      "created_at": "2005-04-20T03:43:30.000Z"
    },
    {
      "author": "Laura",
      "body": "I also got the email from eBay suggesting tickets to Elton and Celine but my list also included the \"Movie Theater Concession Stand Nacho Cheese Warmer Cart.\"  I'm tempted but I think I will let Hammons Field be my source of hot, processed cheese product.  ",
      "created_at": "2005-04-20T09:34:00.000Z"
    },
    {
      "author": "nicholas",
      "body": "\"Big Smith\" provided some tunes for \"Suburban Seven\" and Mark is doing the music for \"Ozark Mile\" (an opus currently in the works). I'll give you his number on Saturday--if you're not going to make up some bogus reason not to see me (wedding, right...riiiiight).",
      "created_at": "2005-04-20T18:13:33.000Z"
    },
    {
      "author": "Ole",
      "body": "An April 21st<a href=\"http://springfield.news-leader.com/columnists/brothers/index_new.shtml\"> column</a> describing Mark Bilyeu's latest excursions by Micheal Brothers in the News-Leader <br/><br/>",
      "created_at": "2005-04-21T19:13:56.000Z"
    },
    {
      "author": "Will Bilyeu",
      "body": "Try bigsmithband.com to reach Mark and the boys.  Rick Minnich is the director of the documentary.  ",
      "created_at": "2005-04-29T18:08:44.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
