{
  "id": 201,
  "title": "I'm bleeding on the keyboard",
  "body": "Fewer posts = more theater progress. Good for the Moxie, bad for the blog readers. Here's how it went down:\r\n\r\n- We finally got our liquor license. HELLO! We are now licensed to sell wine and beer on the entire first floor of 406 W. Walnut. The only problem is, our address is 408 W. Walnut. HELLO! 406 W. Walnut is occupied by a little gym called <i>Czech Us Out</i>. I should go next door and let the owner know that he can start selling beer in lieu of Gatorade. Not to worry though, we contacted the state agent and everything is on the mend. It was their fault, by the way. I wrote out 408 WEST WALNUT no less than 43 times on that damn application. HELLO!\r\n\r\n- I now have accounts with all the beer distributors, and I'm ready to drink myself to death... Nic Cage style. After perusing the beer catalogs, I have to wonder: since when did unfiltered wheat become the MOST popular beer in the world? Every brand carried it, and proudly at that. Boulevard Unfiltered Wheat, Shlafly Unfiltered Wheat, Springfield Brewing Company's Unfiltered Wheat. Thank G.O.B. for Bud Light. Eh? Eh?! Eh! I'm a dark beer fan myself, so shut up.\r\n\r\n- I'm seriously bleeding on the keyboard. I scraped the back of my hand across a patch of unfinished cement to prove to myself that I wasn't a wuss. I screamed and cried, but I'll be damned if I didn't pull it all the way across. I am AWESOME! Of course, that's not really what happened, but what would this blog be without unfounded exaggeration?\r\n\r\n- More work has been done to the theater over the last three days than the entire first three months of this year. That, my friends, is progress. I really need to post a phlog showing what we've done, but I'm sooooo worn out. I've been working for the last 12 hours... not all of it has been physical labor, mind you, but it's all been HARD work. Especially the part with the nude Icelandic women and the chestnut-scented candles from Illuminations. Sometimes, after a hard day like today, I come home, look at the computer, and vomit everywhere. Had I not been bleeding tonight, I would've vomited. Everywhere.\r\n\r\n- I woke up this morning to a news piece about the Moxie on KY3. I glanced up, saw myself on the tube, and immediately fell back asleep. I'm too cool for this, I said to myself as I drifted back into my dream where Heather (of dooce fame) was chasing me around the theater.\r\n\r\n- Speaking of dreams, many of you have appeared in mine... even if by name only. I had this one dream where <a href=\"http://www.srcf.ucam.org/~nrcf2/blog\" target=\"_blank\">Fyse</a> and <a href=\"http://ozzilynbean.blogspot.com\" target=\"_blank\">Oz</a> were attacking me with pipe cleaners until Heather (of dooce fame) swooped in and saved me. I won't tell you about the other dreams... for obvious reasons.\r\n\r\n- I think we're finally picking up our popcorn popper tomorrow. It's been sitting on the ground for far too long.\r\n\r\nHELLO!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-04-21T05:53:12.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Ben Dillon",
      "body": "HELLO!! It''s double punctuation day!!",
      "created_at": "2005-04-21T07:05:49.000Z"
    },
    {
      "author": "Sancho",
      "body": "I take it your dream-love for Heather (of dooce fame) is unrequitted since I am yet to see her mention Dan (of Moxie fame)...",
      "created_at": "2005-04-21T07:37:48.000Z"
    },
    {
      "author": "Oz",
      "body": "Where, exactly, were we attacking you with the pipe cleaners?  Sounds kinky.  Speaking of which, were the pipe cleaners kinked?  That could make it even more fun.",
      "created_at": "2005-04-21T17:27:41.000Z"
    },
    {
      "author": "bjork24",
      "body": "You were trying to stick them in my ears. Pull your head out of the gutter, Oz!",
      "created_at": "2005-04-21T18:09:23.000Z"
    },
    {
      "author": "Fyse",
      "body": "Well Dan, I don't know whether to be flattered, scared, aroused or just amused. Currently I'm going for an uneasy combination of all four...\r\n\r\nI'm assuming I appeared in the dream as nothing more than a disembodied head, but how did Oz feature? As I was saying to her before, she's never actually posted a photo of herself.",
      "created_at": "2005-04-21T18:40:17.000Z"
    },
    {
      "author": "Oz",
      "body": "I'm assuming I was stunnigly attractive.  A Gwyneth Paltrow type perhaps?  Or knowing Dan, maybe Bjork?",
      "created_at": "2005-04-21T19:34:41.000Z"
    },
    {
      "author": "Nate",
      "body": "Ah, Bjork.  Never has a swan dress/flotation device so turned me on.\r\n\r\nHey.  Bjork.  \r\nGood dog name.",
      "created_at": "2005-04-21T19:55:39.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Bjork is an excellent name for all things.\r\n\r\nI call my children Bjork sometimes, just to mess with em.\r\n\r\nCongratulations on providing <i>Czech Us Out</i> (holy shit, is that a real place?) the ability to serve Jack D. in a boxing glove (coming up this week on the Contender...spousal abuse!). You are a man of the people if nothing else.\r\n\r\nYeah, 3 days of work means that it is far too much work to pushing the button on that digital camera, connect said camera to the Beige Box with the Magic Cord and then uploading via a Web Interface.\r\n\r\nMy heart...it bleeds for you. I just recently had to move offices, which included moving all of my files, folders, the fucking <i>file cabinets</i> AND the tables!\r\n\r\nI'm like a moving company, except I'm, like, the company.\r\n\r\nOh, and congratulations on bringing blood to the surface. You are indeed awesome, sir.",
      "created_at": "2005-04-21T20:49:06.000Z"
    },
    {
      "author": "Fyse",
      "body": "I can't say I've ever seen Bjork as particularly attractive, but to check that was still the case I did a quick google for photos. I was presented with <a href=\"http://firstavenuenorth.com/pictures/pics/josh-as-bjork.jpg\" target=\"_blank\">this photo</a>. Hope I haven't just ruined that outfit for anyone...",
      "created_at": "2005-04-21T21:29:55.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Ahhh!\r\n\r\nI hate you :(",
      "created_at": "2005-04-21T21:32:51.000Z"
    },
    {
      "author": "nicole",
      "body": "I went as Bjork for <a href=\"http://tapioca.retroflux.com/?p=19#comments\">Halloween this past year.</a> It was a nice compliment to Dan's Slash.",
      "created_at": "2005-04-21T21:35:52.000Z"
    },
    {
      "author": "bjork24",
      "body": "I love Bjork.",
      "created_at": "2005-04-21T21:37:59.000Z"
    },
    {
      "author": "Nicki J",
      "body": "That man in the swan dress was the most awesome thing I've seen all day.\r\n\r\nThank you :D",
      "created_at": "2005-04-21T22:00:34.000Z"
    },
    {
      "author": "Nate",
      "body": "I were gay, I might be attracted to that man.\r\n\r\nIf I WERE gay?  If I WAS gay?\r\n\r\nNever been clear on that.\r\n\r\nThe grammar I mean.  Me likes the ladies.",
      "created_at": "2005-04-21T22:23:32.000Z"
    },
    {
      "author": "Nate",
      "body": "Sigh.  I suppose I am one of those men that must end the previous-type statements with something like \"Not that I AM gay!!\"  I always to slap such people, and slapping myself is no small task.  The angle and leverage is all wrong.  \r\n\r\nBut it would not be an effeminate slap.  Bet your bee-hind it would be a MANLY slap.",
      "created_at": "2005-04-21T22:29:10.000Z"
    },
    {
      "author": "J.R.",
      "body": "The slapping talk is too much.  Slap the people who have strange ideas on the costs of heat exchangers.",
      "created_at": "2005-04-21T23:36:32.000Z"
    },
    {
      "author": "erin",
      "body": "for some reason this post reminded me of we didnt start the fire. you know... the billy joel song. hummm. strange.\r\nanyway.\r\nphlog--get ontop of that!\r\n: )",
      "created_at": "2005-04-22T05:46:36.000Z"
    },
    {
      "author": "mike",
      "body": "Ahhh... Heather from Dooce... yes. \"Yes\" is all that needs to be said...",
      "created_at": "2005-04-22T11:29:46.000Z"
    },
    {
      "author": "brian of moore",
      "body": "mmmm... bjork\r\n\r\nlast night i had a dream that i was running down some pathway.. inbetween some mountains.. and all these minors were chasing me... i ended up taking a crowbar from one of them.. and beating the crap out of everyone matrix style\r\nit was odd",
      "created_at": "2005-04-22T17:06:55.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
