{
  "id": 202,
  "title": "Batten down the hatches",
  "body": "Storm's a'brewin', so I can't talk long. The power could go off at any time. Don't you just love the sound of tornado sirens? I bet 50% or more of the readership have never been in a tornado... and I mean actually being inside the funnel, strapped to an oil pipe by a piece of leather, clutching Helen Hunt. That's happened to me... several times. Living in the Midwest, I guess we take severe weather for granted. I hope the compu-",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-04-22T05:59:37.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Nicki J",
      "body": "Hah! It's gonna get us!!<br/><br/>Has anyone seen my shiny red shoes??",
      "created_at": "2005-04-22T07:02:42.000Z"
    },
    {
      "author": "Rachel",
      "body": "I'm jonesin for a phlog.",
      "created_at": "2005-04-22T08:15:04.000Z"
    },
    {
      "author": "brian of moore",
      "body": "mmm helen hunt... two posts in a row reminding me of hot famous women...  Go for THREE!<br/><br/>the power never went off at my house.. but then again my internet and tv have been off for two days... so who needs electricity anyway",
      "created_at": "2005-04-22T17:08:40.000Z"
    },
    {
      "author": "justin",
      "body": "our sirens went off yesterday too! no tornado, though - those hippy weatherpeople sure are enjoying getting people all excited, though.  we lost power for about an hour last night.",
      "created_at": "2005-04-22T17:20:19.000Z"
    },
    {
      "author": "nicole",
      "body": "The storm wasn't as bad as the news people made it out to be. Bogey wasn't even that scared.",
      "created_at": "2005-04-22T17:41:32.000Z"
    },
    {
      "author": "Nate",
      "body": "KY3's \"Stormtracker 3 Live Doppler Radar\" interrupts my show with the kind of breathless urgency that should be reserved for Battle of Britain bombing raids.  <br/><br/>Usually it's for a bovine populated county several hundred miles beyond the furthest edge of their viewing area, but, hey, acting like an indispensable warning service for the Dresden firebombing makes viewers bond with the station.  That's what I bet the suits came up with.  KY3 The Place to Be Placated.",
      "created_at": "2005-04-22T17:46:49.000Z"
    },
    {
      "author": "Trint",
      "body": "Nate, I felt a little the same way. But they I realized I was watching 'Joey' and killed myself.",
      "created_at": "2005-04-22T19:11:41.000Z"
    },
    {
      "author": "Nate",
      "body": "Dude, I am SO busted.<br/><br/>No, not a good show, but I keep hoping Rachel will show up.  Lord knows she ain't coming back to Springfield.",
      "created_at": "2005-04-22T19:29:56.000Z"
    },
    {
      "author": "nicholas",
      "body": "When I felt myself growing angry at the interruptions, I tried to remind myself the someone's life could be saved. But then they did it about seventy-six and a half times and when they <i>weren't</i> cutting away to Doppler, they were scrolling the danger message and playing some weird trumpet sound signalling the impending scroll. One or the other would have been sufficient. Dammit. I love Joey. Bastards. If I read about someone injured in the storm I'm going to feel like a heel.",
      "created_at": "2005-04-22T19:31:30.000Z"
    },
    {
      "author": "Laura",
      "body": "Doesn't it seem like they pick the worst possible times to get their smug meteorological mugs on TV?",
      "created_at": "2005-04-22T20:54:45.000Z"
    },
    {
      "author": "J.R.",
      "body": "I like to drink from mugs...",
      "created_at": "2005-04-22T22:01:46.000Z"
    },
    {
      "author": "Jed",
      "body": "Ahhh, storm weather, I miss it so. I also miss a meteorologist who doesn't say, \"I'm just not sure?\" oh, and Ned Reynolds, that guy Rocks. I hate Los Angeles.....and life. I'm leaving now.    ",
      "created_at": "2005-04-22T22:11:35.000Z"
    },
    {
      "author": "Nate",
      "body": "Ned Reynolds - I do a pretty good impression.  Local celebrity impressions are the best.<br/><br/>That guy's brow has more furrows than Watership Down.",
      "created_at": "2005-04-22T23:13:40.000Z"
    },
    {
      "author": "Nate",
      "body": "Wait.  That's 'burrows'.",
      "created_at": "2005-04-22T23:14:05.000Z"
    },
    {
      "author": "Nate",
      "body": "But Ned IS a \"Big Wig\" in the local sports scene.<br/><br/>Get it?  \"Big Wig\"? Huh? Huh?<br/><br/>Ah I kill me.  Gimme a High Fiver.",
      "created_at": "2005-04-22T23:15:34.000Z"
    },
    {
      "author": "Zach",
      "body": "I just wanted to drop you a note on how enjoyable this site is. I had no idea about this project...it sounds like a great thing as a Springfield resident. Good luck with your venture. Count one more person as a local supporter of what you are doing.",
      "created_at": "2005-04-23T00:33:53.000Z"
    },
    {
      "author": "nicholas",
      "body": "Nate, did you mean to say \"give me a high fever?\" Cause that's what I get when I listen to Ned...",
      "created_at": "2005-04-23T00:35:00.000Z"
    },
    {
      "author": "Nate",
      "body": "\"Fiver\" as in prescient rabbit who cries out riddles in Yoda-like syntax, and who is the most annoying character in the book.  \"High Fiver\" as stupid pun that works on multiple stupid levels.<br/><br/>Dammit man!  Did no one read Watership Down?  Double Dammit man!<br/><br/><br/>High fever works too.",
      "created_at": "2005-04-23T00:52:56.000Z"
    },
    {
      "author": "Nate",
      "body": "Sample Fiver dialogue:<br/><br/>The wire!  The wire!  Frith and elil, will kill us all!!! (passes out.)",
      "created_at": "2005-04-23T00:55:00.000Z"
    },
    {
      "author": "Jamie",
      "body": "Louise was very scared during the storm.  St. Louis hasn't had any sirens, but who knows what may come!",
      "created_at": "2005-04-23T01:15:59.000Z"
    },
    {
      "author": "nicole",
      "body": "I got it, Nate. Don't get me started on Watership Down...when I was a little kid, my neighbor thought the cartoon would be fun to watch. Rabbits bleeding and being killed is not my idea of a fun cartoon to watch...",
      "created_at": "2005-04-23T03:36:29.000Z"
    },
    {
      "author": "nicholas",
      "body": "Have you ever seen the cartoon version of \"Animal Farm\"? That one was scaaaary...we watched that when I was about six. Then my family went around the neighborhood accusing our neighbors of being red commie bastards. Man that was fun...<br/><br/>\"Charlotte's Web\" was disturbing too.<br/><br/>And \"The Secret of Nimh\". Hey, now that I think of it, what happened to cartoons that scare the sh*t out of children?",
      "created_at": "2005-04-23T18:33:32.000Z"
    },
    {
      "author": "Nate",
      "body": "2 silly things that scared me as a small child:<br/><br/>1) The Kool Aid Pitcher Guy busting through the wall and saying (in deep voice) \"Oh Yeah!\"<br/><br/>2) The two chinless, flabby necked aliens that would come out of a spaceship onto some stretch of nondescript Sesame Street muppet real estate, accompanied by decidedly creepy X-Files music, and say something that sounded like (if I can accurately type it out) \"Yeeeep, Yep, Yep, YepYepYepYepYep, Uh Huh, Uh Huh, Uh huh.\"  Then they would get back in their ship and leave.<br/><br/>The first thing made me afraid to drink Kool-Aid for fear of being crushed and doing some real property damage.<br/><br/>The second thing just plain freaked me out for days.  Like, in broad daylight.",
      "created_at": "2005-04-23T19:08:34.000Z"
    },
    {
      "author": "Allison",
      "body": "Those Sesame Street monsters were my FAVORITES!  I liked it when they learned the word \"phone\" and one of them picked up the phone with one of those dangling tentacles.  It was so bizarre!  It still makes me laugh.  I, personally, had nightmares about Oscar the Grouch coming to kill me.  My other recurring nightmare was about the giant, man-eating ants in the 1960's movie \"Them!\" that my parents so wisely let me watch when I was six.  As if that weren't bad enough, they let me watch \"Invasion of the Body Snatchers\" the next year.  Absolutely scarring.  I hope The Moxie shows classics like these on nights where \"Children Watch Free!\"",
      "created_at": "2005-04-23T21:26:49.000Z"
    },
    {
      "author": "nicole",
      "body": "Ooh, Good idea Allison! <br/><br/>My scarring moments unfortunately didn't happen until later in life, when I found out that my Mom had edited movies such as Dirty Dancing and Gone With the Wind so we only saw \"pretty parts.\" Was I in for a shock when I saw a midnight showing of Dirty Dancing. And all along, I thought Penny was just anorexic, and that's why she couldn't dance...",
      "created_at": "2005-04-23T23:47:55.000Z"
    },
    {
      "author": "James Sheldon",
      "body": "Wha-?  I'm missin' storms?  Well, experienced my first earthquake last weekend...that was awesome :-)  California is very overcast today.  Tomorrow I find myself in South Central working on a new independent feature (I'm stoked about this role...my face won't even be seen)  I'm watchin' your progress in Missouri...I'll be back for a few days at the beginning of May.  Just to hopefully enjoy a tornado ridden sky!!  <br/><br/>",
      "created_at": "2005-04-24T05:23:12.000Z"
    },
    {
      "author": "Brandon",
      "body": "i'm delerious right now, but i needed my dose of moxie... like....  \"now.\"  um.... oh yeah-- i went to a giant christian music festival in kentucky this weekend, and during the main concert series one night we were sent from the main stage to \"your vehicles or low ground, whichever comes first!\"  tornado warning.  it was crazy-- i could hardly imagine 15,000 screaming people being swept into a funnel cloud from an open grassy field...<br/><br/>oh wait, yes i can.  i'm imagining robots running in circles over to my left. mmmmmmmmmm",
      "created_at": "2005-04-24T21:03:43.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
