{
  "id": 204,
  "title": "Rain, rain, go away",
  "body": "Dad and I were scheduled to continue working on the Cinebar tonight, but we ran out of materials, and, thanks to rain, were unable to go buy more. So tonight's work-a-thon was cut short. Damn. On the bright side, I have three great pieces of news:\r\n\r\n1. Our second HVAC bid came in... $10,500. Woo hoo! That's $10,000 less than the original bid!\r\n\r\n2. The electrical bid is still being reconfigured, but it looks like it's going to come in around the $20K mark. Again, a savings of roughly $10,000! Of course, it should be noted that the new bid does NOT include ridiculously priced fixtures like the last one did. Also, Andrew and Doug are going to cover the actual cost of upgrading the electrical service. Prior to us moving in, the building was only equipped with a 200 amp service, which is far too low for commercial usage. Regardless of who or what had moved into the space, the electrical would have still needed to be upgraded, thus making it a building necessity rather than a theater-specific modification. Woo hoo!\r\n\r\n3. Chris, our general contractor, is going to start laying out the walls tomorrow, which means the framing should begin shortly... and that, my friends, is REAL progress. Woo hoo!\r\n\r\nIf you find yourself in the general vicinity of the Moxie on a weekday evening or weekend day, swing by and see if dad and I are hard at work. If so, run to the nearest convenience store and buy us some beer. Dad likes Coors Light, but I'll drink anything... except urine. Woo hoo!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-04-26T03:31:44.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Maddy",
      "body": "In all the months of reading, never before have I had the chance to respond first.  Thus, I must delurk to take advantage of such an opportunity.\r\n\r\nOh yeah, good job on the theatre (I enjoy the much more pretentious of spellings).",
      "created_at": "2005-04-26T03:46:03.000Z"
    },
    {
      "author": "nicholas.",
      "body": "\r\nBest of luck.  Hopefully when I visit springfield again, I can see a cool movie.\r\n\r\nToo bad there was nothing like this a few years ago when I was still there.\r\n\r\nHope all goes well.",
      "created_at": "2005-04-26T03:59:07.000Z"
    },
    {
      "author": "bjork24",
      "body": "Maddy: Congratulations on your delurkment! If you ask me, THEATRE is live action plays, THEATER is midget wrestling, and CINEMA is Moxiesque.\r\n\r\nNicholas: Thanks for the support! ",
      "created_at": "2005-04-26T04:01:17.000Z"
    },
    {
      "author": "Nate",
      "body": "I always KNEW that the News-Leader, The Yellow Pages, and the Springfield Movie Theatre website were pretentious!  Now I have proof.\r\nTransposing 2 letters does not always equal a high falutin' British dialect.  Sometimes it's just common usage! \r\n\r\n(Requisite smile emoticons here)\r\n\r\nGood thing I have a sense of humour.",
      "created_at": "2005-04-26T04:09:48.000Z"
    },
    {
      "author": "Fyse",
      "body": "So, do all these savings mean The Moxie's financial crisis is alleviated?",
      "created_at": "2005-04-26T04:50:24.000Z"
    },
    {
      "author": "Jamie",
      "body": "Woo hoo!",
      "created_at": "2005-04-26T05:28:28.000Z"
    },
    {
      "author": "Maddy",
      "body": "Theater-- lots of gum stuck to the floor\r\n\r\nTheatre- no gum stuck to the floor\r\n\r\nThe Moxie- floor isn't finished yet...",
      "created_at": "2005-04-26T05:55:59.000Z"
    },
    {
      "author": "steph v.",
      "body": "Yea! I want to help with renovations...or stand and watch.",
      "created_at": "2005-04-26T16:54:44.000Z"
    },
    {
      "author": "J.R.",
      "body": "'Tis more fun to simply just stand and watch.",
      "created_at": "2005-04-26T17:50:51.000Z"
    },
    {
      "author": "bjork24",
      "body": "Agh! Too many comments to reply back to... I'll answer all your questions with one word: yes.",
      "created_at": "2005-04-26T17:53:58.000Z"
    },
    {
      "author": "justin",
      "body": "Woo hoo!",
      "created_at": "2005-04-26T18:20:33.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Good luck on your work schedule dude. I suggest you pick up a collectable card game to raise the last of the funds, like <a target=\"_new\" href=\"http://www.misterorange.com/2005/04/success.html\">I did this past weekend</a>.\r\n\r\nJust think of the juicy quotes:\r\n\r\n\"Playing for the money? Pfft. I'm playing for the Moxie, bitches!\"\r\n\r\n\"What's a Moxie?\"\r\n\r\n\"It's when you lose and I win.\"",
      "created_at": "2005-04-27T00:13:03.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
