{
  "id": 207,
  "title": "Springfield shirt buyers",
  "body": "If you're from Springfield, or within a reasonable driving distance, and bought one of the limited edition Moxie shirts, you're cordially invited to drop by the theater and pick up your merchandise so I don't have to send it. In exchange for saving me $3+ on shipping, I'll give you a quick tour of the theater AND a souvenir cockroach... if you so desire. However, please remember that the theater is still a MAJOR construction site, and I won't be held liable if a board falls on your head or I \"accidentally\" shot you in the leg with the nail gun. You've been warned, Springfield!<br/><br/>If you'd like to pick up your shirt(s) and/or buttons, feel free to drop by between 5:00 and 7:00 on Monday or Tuesday of next week (May 2nd and 3rd). I'll have the buttons and shirts with me, but NO STICKERS. They still haven't arrived yet, but you can always drop back by later to pick them up once they finally arrive.<br/><br/>As for everyone else OUTSIDE of Springfield, your shirts will be sent next week, sans-sticker. Once I get the stickers, I'll fold them into an envelope and send them your way. Fair enough? Good.<br/><br/>I'm wearing my shirt right now... it's AWESOME!<br/><br/>PS - If you haven't yet bought a shirt, we still have 9 left (as of this post). If you'd like one, I'll have them with me at the theater on Monday and Tuesday, OR you can still buy them online. There's only a few sizes left, so I'd buy them while you still can... Woo HOO!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-04-29T20:56:03.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Nicholas",
      "body": "How do I buy the shirt online? I would like to do so...",
      "created_at": "2005-04-29T21:26:50.000Z"
    },
    {
      "author": "Nicholas",
      "body": "Wait...is it size normal, or size huge? I tend to buy a \"small\" as I'm tiny-boned (but the rest of me is good, I'll prove it).",
      "created_at": "2005-04-29T21:27:37.000Z"
    },
    {
      "author": "Nate",
      "body": "Don't say that Nick.  <br/>Remember that one act in high school where you were in that little pink tank top?<br/>You were HOT!",
      "created_at": "2005-04-29T22:14:21.000Z"
    },
    {
      "author": "Caleb",
      "body": "I should be able to come by on Monday. ",
      "created_at": "2005-04-29T22:41:10.000Z"
    },
    {
      "author": "bjork24",
      "body": "Nick: You can buy them through the Moxie Merchandise page... as long as you have a credit card.",
      "created_at": "2005-04-29T22:55:01.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Man, why couldn't you be opening a theater closer to Oak Ridge? C'mon man, we got nuclear power for those nail guns...<br/><br/>I would love to come by and provide free labor. And bad jokes. More latter than former, of course.<br/><br/>Anyway, I would like to wish (secretly) that a sticker may find its way in my package, but I doubt it. I -so- didn't earn it, but in my mind yes, I did earn it (see, that's a little setup-and-execute there). The Wifely Spiel about What Are You Spending Our Money On Again felt very sticker-worthy.",
      "created_at": "2005-04-30T00:02:58.000Z"
    },
    {
      "author": "nathan springer",
      "body": "sweet we get to see the moxie plus get a shirt, ah my life is grand. ",
      "created_at": "2005-04-30T02:14:44.000Z"
    },
    {
      "author": "Fyse",
      "body": "The chance for a Moxie guided tour? Again I am foiled by geography.",
      "created_at": "2005-04-30T04:00:06.000Z"
    },
    {
      "author": "Jo",
      "body": "is there anyway the pick-up could be like....3 to 7? Because I could walk down from my school (Central) and pick it up so my parents wouldn't have to complain about driving me down...you wouldn't have to give me the tour...only my shirt and button...",
      "created_at": "2005-04-30T04:35:22.000Z"
    },
    {
      "author": "Carl",
      "body": "I cann't wait to be the first in West Virginia to wear the Moxie shirt.",
      "created_at": "2005-05-01T00:25:42.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Evan...I didn't know you were in Oak Ridge!  We're in Knoxville...",
      "created_at": "2005-05-01T23:58:03.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
