{
  "id": 208,
  "title": "This is the last post about the shirts... I swear",
  "body": "As mentioned in last Friday's post, Nicole and I will be at the theater tonight and tomorrow from 5:00 until 7:00. If you'd like to drop by and pick up your shirts, please do. The shirts that aren't picked up at the theater will be shipped on Wednesday, which brings me to my next point: PayPal and incorrect shipping addresses.<br/><br/>As Nicole and I were labeling the packages this weekend, I noticed that several of the addresses (provided by PayPal) were wrong. SO, to ensure that you get your shirt, please do one of the following:<br/><br/>1. Show up at the theater and pick it up.<br/>2. Check your PayPal receipt to see if the shipping address is correct.<br/>3. Send me an e-mail (dan [at] moxiecinema [dot] com) with your current mailing address.<br/><br/>As for the stickers, I'll mail them out separately once they arrive (hopefully soon). Also, we'll have a few additional shirts and buttons available for sale at the theater tonight and tomorrow.<br/><br/><b>Please note</b>, despite the way I act and/or come across on this blog, both Nicole and I are really quite introverted and have been known to mumble and stare at other people's feet while they're talking. I'm just letting you know now so you won't be surprised when it happens... and by \"IT\" I mean \"I lose control of my bladder.\"<br/><br/><i>Dan, enough with the shirts! What's going on with the theater?!?!?!</i><br/><br/>Three new phlogs aim to answer that question. Check back in an hour...",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-05-02T20:14:04.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "whitty",
      "body": "Hey, what's up with the RV parked outside the Moxie?  Have you guys taken to camping outside the building?  Is that where the line forms for tickets for opening night?  And probably the most important question of all, will be Moxie be showing zombie movies?  <br/><br/>I am all about zombie movies this summer.",
      "created_at": "2005-05-02T21:15:59.000Z"
    },
    {
      "author": "bjork24",
      "body": "Whitty: I'm not sure what's up with the RV. Hopefully it will be gone by the time we open, but you never know... it does add kitsch.",
      "created_at": "2005-05-02T21:36:33.000Z"
    },
    {
      "author": "Nate",
      "body": "Introverted?  Mumbling?<br/><br/>I thought you came across as pretty articulate and passionate, though businesslike – as one would expect from somebody trying to get the word out about his venture.<br/><br/>A fairly good representation of the exchange went something like -<br/><br/>Dan:\tThe equipment.  The equipment is what I want to talk about. (leaning forward; gesturing with hands) We will have what is called a ‘platter system’ in order to show movies by--<br/><br/>Me:  (Interrupting) Like Shangai Knights!?!<br/><br/>Dan: (Frozen, mid-gesture).<br/><br/>Me:  Movies like Shangai Knights!  Dude, that movie was so funny.  Owen Wilson is all, like, Whoah, and Jackie Chan was all like Hee-Yah! Hee Yah! (chopping air with hands.)<br/><br/>Dan:  Yes...  We could... possibly... show Shanghai Knights.  Back to the equipment though.  We don’t have a lot of room in our projection booth, so—<br/><br/>Me:  Oooh.  Have you seen Phonebooth?  I have.  It was okay.  I think Colin Farrell’s way overrated, though.  Hey did you guys see Alexander?!  Wouldn’t it be hot to have Angelina Jolie as your own mom?!?<br/><br/>Dan:  (long, long pause)<br/><br/>Nicole:  (Tugs on ear as secret signal that she wants to leave.)<br/>",
      "created_at": "2005-05-02T21:38:28.000Z"
    },
    {
      "author": "bjork24",
      "body": "My long, long pause to the Angelina Jolie comment was an attempt to contain my thoughts about her. So was Nicole's ear tugging.",
      "created_at": "2005-05-02T21:46:35.000Z"
    },
    {
      "author": "whitty",
      "body": "What about zombies?",
      "created_at": "2005-05-02T22:13:02.000Z"
    },
    {
      "author": "bjork24",
      "body": "We'll show <i>Shaun of the Dead</i>!",
      "created_at": "2005-05-02T22:17:50.000Z"
    },
    {
      "author": "whitty",
      "body": "Excellent.",
      "created_at": "2005-05-02T22:19:31.000Z"
    },
    {
      "author": "steph v.",
      "body": "Gahhhhh! Zombies.",
      "created_at": "2005-05-02T22:44:09.000Z"
    },
    {
      "author": "J.R.",
      "body": "They ate my neighbors...",
      "created_at": "2005-05-03T00:13:59.000Z"
    },
    {
      "author": "erin",
      "body": "the place really is taking shape...<br/>im getting really excited now. woooh!",
      "created_at": "2005-05-03T06:02:19.000Z"
    },
    {
      "author": "Nicki J",
      "body": "Dan, Dan, Dan, Dan. GRAGH!<br/><br/>No fame for me.<br/><br/>For some reason, that roll of film didn't have ANY pictures on it.<br/><br/>Now, most people would be quick to point a finger at the camera operator. But, I blame sattelite interference. And aliens.<br/><br/>I'm really freaking sad. And mad. I had some good ones. Or atleast I thought I did. It's all Wal-Mart's fault.<br/><br/>If you're even kinda curious, here are other pictures I've taken. You don't have to look. Heh. http://photos.yahoo.com/nickirae2003.<br/><br/>*sniffle* But the Moxie looks awesome!",
      "created_at": "2005-05-03T06:26:18.000Z"
    },
    {
      "author": "erin",
      "body": "who is that sexy beast in the picture titled erin?? ((http://pg.photos.yahoo.com/ph/nickirae2003/detail?.dir=e0c9&.dnm=e9c6.jpg&.src=ph))<br/>grrr baby. grrrr.<br/>i wish the moxie pictures would have worked out too nicki.. boo sattelites! boo aliens! boo walmart! -- but definatly DO NOT boo moxie. --",
      "created_at": "2005-05-03T08:32:01.000Z"
    },
    {
      "author": "Luke",
      "body": "This is a transcript of a conversation I had with a friend recently.  His name is Chuck and he's a little odd.<br/><br/>Chuck: I'm thinking about getting a gun.<br/><br/>Me: Why would you want a gun?  You live with your parents in a pretty posh subdivision.<br/><br/>Chuck: (With a look of complete and utter seriousness on his face) In case of Zombies.<br/><br/>That was all.  And he totally seemed serious.",
      "created_at": "2005-05-03T22:14:23.000Z"
    },
    {
      "author": "whitty",
      "body": "Um, well, doesn't everyone have a zombie contingency plan?  Granted, you don't need a gun, I have an aluminum bat. And a board with nails in the end.",
      "created_at": "2005-05-03T22:29:16.000Z"
    },
    {
      "author": "Nate",
      "body": "I have a Rob Zombie contingency plan.  It involves shampoo.",
      "created_at": "2005-05-03T22:57:28.000Z"
    },
    {
      "author": "Nate",
      "body": "Heh heh.<br/><br/>Pooh.",
      "created_at": "2005-05-03T22:57:48.000Z"
    },
    {
      "author": "Jed",
      "body": "If you want me to get rid of the RV Dan, just say the word. Also if anyone has any problems with Zombies I can get rid of those too. As well as: turtles, uncles, babies mommas, babies daddies, clowns, dogs, terrorists, cult leaders, monkeys, giant pandas, ex wives/girlfriends, co-workers, lovers, old friends, goldfish, mice, roaches, and midgets.  ",
      "created_at": "2005-05-04T02:39:23.000Z"
    },
    {
      "author": "brian of moore",
      "body": "maybe when i come to get the sticker i wont be fighting a deadly illness... and will beg for a tour... this time though, i felt i should look out for your guys health.. and my own.. by leaving quickly and going home to take a nap.. speaking of....",
      "created_at": "2005-05-04T03:27:46.000Z"
    },
    {
      "author": "nicholas",
      "body": "My friend Brian went to high school with Rob Zombie. Except his name wasn't Rob. Or Zombie. And since he was Brian's friend, he was probably a dork. Like me.",
      "created_at": "2005-05-04T03:37:03.000Z"
    },
    {
      "author": "erin",
      "body": "not this past weekend. but the weekened before. there was some little special section of the sunday paper about this little dog ball thing.. it was pictures of the dogs who won little awards at the ball (one being.. most bling).. yes anyway. one of the dogs was named MOXIE!<br/><br/>did you see that?? yeah. pretty cool. pretty frickin cool.",
      "created_at": "2005-05-04T04:48:07.000Z"
    },
    {
      "author": "nicole",
      "body": "For Christmas this year I gave my sister a book on how to survive zombie attacks. I'm a really good sister. Now she'll live if they ever do come. ",
      "created_at": "2005-05-04T05:55:15.000Z"
    },
    {
      "author": "brian of moore",
      "body": "and they will come... just read <a href=\"http://65.127.124.62/south_asia/4483241.stm.htm\">this</a>",
      "created_at": "2005-05-04T07:53:20.000Z"
    },
    {
      "author": "Caleb",
      "body": "That is just...disturbing.",
      "created_at": "2005-05-04T19:04:44.000Z"
    },
    {
      "author": "whitty",
      "body": "And fake!",
      "created_at": "2005-05-04T19:22:59.000Z"
    },
    {
      "author": "brian of moore",
      "body": "shhhh",
      "created_at": "2005-05-04T20:02:24.000Z"
    },
    {
      "author": "Nate",
      "body": "\"Zombism\"  Zombizzle.<br/>It's like Snoop slang.",
      "created_at": "2005-05-04T20:09:27.000Z"
    },
    {
      "author": "Mark S",
      "body": "Dan, what did you say about the UK shipping costs? Was it an extra $6?<br/><br/>I know you've told me but my home PC has died and I can't get to your orgigional mail.<br/><br/>Damn computers!<br/><br/>M",
      "created_at": "2005-05-05T03:01:05.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
