{
  "id": 209,
  "title": "The hurdy-gurdy",
  "body": "Man oh man. I'm stressed... ever so slightly. The closer we get to opening, the more things need to get done. At times it seems a bit overwhelming, but I'm getting used to that feeling. It's like when you leave home for an extended vacation, and in the back of your mind you're thinking, \"I know I'm forgetting something.\" That's pretty much how I feel all day long. I used to have a memory like a steel trap - I could remember names, numbers, appointments, and even a few recipes (i.e. spaghetti, cereal, and tortilla sandwiches) - but now... I can't even remember where I was going with that last sentence!\r\n\r\nPerhaps I'll make a list of things that need to get done; I've heard that can help when you're feeling stressed. So, if you wouldn't mind indulging me for a bit, I'm going to squirt a few lists out of my head. I'll keep the list focused on BIG events, because a list of all the minutia would literally take me 14 years to write out.\r\n\r\nCOMPLETED TASKS\r\n\r\n<ul><li>Acquired building</li>\r\n<li>Filed and received all pertinent business and taxation licenses</li>\r\n<li>Building permit was approved</li>\r\n<li>Filed and received liquor license</li>\r\n<li>Purchased a splicer</li>\r\n<li>Purchased the digital projector</li>\r\n<li>Purchased the popcorn popper</li></ul>\r\nUPCOMING TASKS\r\n\r\n<ul><li>Buy 2 refrigerators</li>\r\n<li>Buy prep room equipment (sinks, etc.)</li>\r\n<li>Finish building the Cinebar</li>\r\n<li>Order the movie screen (air ducts must be moved first)</li>\r\n<li>Drive up to St. Louis and pick up 35mm projector, et al.</li>\r\n<li>Create custom P.O.S. system</li>\r\n<li>Build official Moxie website</li>\r\n<li>Determine an opening date</li>\r\n<li>Coordinate testing dates with volunteer audience</li>\r\n<li>Make initial inventory purchase</li>\r\n<li>Recreate a first year budget and projection sheet</li>\r\n<li>Screen employees</li>\r\n<li>Filter through submissions to determine an opening artist</li>\r\n<li>Determine our film schedule for the first month of operation</li>\r\n<li>Create fliers... distribute fliers</li>\r\n<li>Have projection equipment installed and calibrated</li>\r\n<li>Clean and paint, and clean and paint, and clean some more</li>\r\n<li>Get our chairs from Ken and install them</li>\r\n<li>Activate our insurance policy ($$$)</li>\r\n<li>Set-up trash service</li></ul>\r\nOk, I have to stop there. I'm starting to get a headache. There's a lot more stuff that needs to be done, but the thought of it is making my elbows tingle. I need to figure out what needs to be done today... and then do it.\r\n\r\nOn a good note, I think I figured out a way to build our menu for the Cinebar. Here's how:\r\n\r\n- Take a 4x8 piece of plywood and cut it into an interesting shape.\r\n- Sand it and apply <a href=\"http://amos.shop.com/amos/cc/main/ccn_search/st/magnetic%20paint/sy/productsx/ccsyn/260/prd/16965758/ccsid/382244499-150/adtg/05030523\" target=\"_blank\">magnetic paint</a>\r\n- Buy several packages of <a href=\"http://www.amazon.com/exec/obidos/tg/detail/-/B00006HN5Q/qid=1115220919/sr=8-1/ref=sr_8_xs_ap_i1_xgl229/102-2425324-5071347?v=glance&s=office-products&n=507846\" target=\"_blank\">printable magnetic paper</a> and start printing out menu items and other fun objects\r\n\r\nIt's simple, efficient, and leaves plenty of room for creativity. I can already see it now...\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/menu2.jpg\" width=\"425\" />",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-05-04T20:02:55.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Stephanie",
      "body": "The important thing is to remember to breathe, Dan...just breathe.",
      "created_at": "2005-05-04T20:15:31.000Z"
    },
    {
      "author": "Nate",
      "body": "IF you were planning on making a special trip to St. Louis JUST to pick up the projector, (and not planning other things into it: seeing friends, etc.) and IF any of your readers just happened to be making a St. Louis trip in the next few weeks, would they be willing to pick up the projector?  Would YOU be willing to trust such a reader with such a momentous task?  Seems like it could save you a day.",
      "created_at": "2005-05-04T20:15:44.000Z"
    },
    {
      "author": "bjork24",
      "body": "I appreciate the thought, Nate, but I really want to eat at Stir Crazy... mmm, Stir Crazy. And we might make a night of it and see some old friends.",
      "created_at": "2005-05-04T20:17:47.000Z"
    },
    {
      "author": "Nate",
      "body": "Get your own damned projector then!",
      "created_at": "2005-05-04T20:22:26.000Z"
    },
    {
      "author": "whitty",
      "body": "Hey, Dan, you know I am always one to be helpful, so I am gonna help knock one of those items off the list.  I will volunteer to be in the volunteer audience.  Nice of me, eh? EH!?",
      "created_at": "2005-05-04T20:30:26.000Z"
    },
    {
      "author": "whitty",
      "body": "PS: I love hurdy-gurdies!",
      "created_at": "2005-05-04T20:30:52.000Z"
    },
    {
      "author": "steph v.",
      "body": "Well, now that my wedding is finished and Joel is working on the house, I have plenty of time to help.\r\n\r\nI'll be in Springfield in 11 hours.",
      "created_at": "2005-05-04T20:42:40.000Z"
    },
    {
      "author": "Nate",
      "body": "Quick cut to a montage of the projector and I having a crazy road trip:\r\n\r\n-Snapping photos of us in front of the Arch, Mt. Rushmore, Biggest Ball of Yarn, etc.\r\n\r\n-top down, laughing, the wind blowing both my hair and a strip of loose celluloid back.\r\n\r\n-on our backs in the desert, looking up at the stars.  I shyly place an arm around the projector.  \"You have such a beautiful...lens.\"\r\n\r\nI could go on.  Montages should be short.  About half a song short.\r\n\r\n\r\n\r\n",
      "created_at": "2005-05-04T20:58:35.000Z"
    },
    {
      "author": "Aaron",
      "body": "You're going to create a custom piece-of-shit system? I thought you wouldn't be showing many Hollywood-type movies.",
      "created_at": "2005-05-04T21:20:30.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i have plenty of experience in handing out/putting up flyers... whenever/if im needed",
      "created_at": "2005-05-04T22:13:44.000Z"
    },
    {
      "author": "erin",
      "body": "opening artist --- jennifer manning peirson.\r\nno filtering through submissions will be required...\r\n\r\n: )",
      "created_at": "2005-05-05T01:52:19.000Z"
    },
    {
      "author": "Ole",
      "body": "Dan, I wonder if this could be what's happened to your <a href=\"http://www.cnn.com/2005/WORLD/europe/04/22/text.iq/\">steel trap</a>?",
      "created_at": "2005-05-05T04:37:34.000Z"
    },
    {
      "author": "Steve Kirks",
      "body": "Dan:\r\n\r\nPlease consider offering some type of \"season pass' so I can buy my movies upfront.  Also, please make your movie schedule available as an iCal *and* a RSS feed.\r\n\r\n",
      "created_at": "2005-05-05T06:49:14.000Z"
    },
    {
      "author": "Adam",
      "body": "Dan, I think you need to do as celebrities do and hire a personal assistant.  You might even be able to pay them in peanut butter and jelly sandwiches?",
      "created_at": "2005-05-05T15:36:13.000Z"
    },
    {
      "author": "nicole",
      "body": "(that's my job at the moment)",
      "created_at": "2005-05-05T16:15:57.000Z"
    },
    {
      "author": "J.R.",
      "body": "Screening employees can be done by hitting them as hard as you can with a screen and if the imprint stays on them longer than five minutes, they're hired!",
      "created_at": "2005-05-06T05:25:38.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 7,
      "name": "Lists"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
