{
  "id": 21,
  "title": "Hypotheticals",
  "body": "Up to this point, starting the theater has been a lot of hard work. Nicole and I have spent hours upon hours researching ideas, writing the business plan, creating revenue/cost projections, speaking with theater owners, getting quotes from vendors, and doing all the other fun stuff that goes along with being in the developmental stage of a start-up business. Yet, amidst all those hours of grown-up seriousness, we still find time to indulge ourselves and hypothesize about more trivial issues, which is what I'd like to talk about today.\r\n\r\nThe majority of these scenarios will probably never occur, but on the off chance that they do, Nicole and I have had lots of fun coming up with creative, and often off-the-wall, approaches for each of them. If you don't mind, I'd like to share a few with you... so here goes:\r\n\r\n<b>Return of the Ex</b>\r\nI think anyone who has ever had an ex has thought of this situation at least once in their life. You've imagined yourself running your own business, being the talk of the town, and then one day, inevitably, you run into your ex. Would you flaunt your success in his or her face? Of course you would! The only differences in this flight of fancy would lie in the subtlety of your approach.\r\n\r\nNicole and I both have exes, the majority of which live in or around Midwestburg, so the possibility of running into one is fairly high. I don't harbor ill will towards any... oh, who am I kidding... towards <i>either</i> of the girls I've dated, but that doesn't necessarily mean the feeling is mutual. I won't go into details, but I'm sure there's at least one jilted young woman out there who would just as soon slap me across the face as she would buy popcorn and soda from me. All of this begs the question - what would we do if they showed up?\r\n\r\nThe answer is nothing. If Nicole and I really end up running our own theater, there would be little else we'd need to do to impress our preternatural coolness upon our jealous exes. As I said before, it all lies in the subtlety of your approach, and ours will be as subtle as they come. I know that sounded a bit less than modest, but don't forget, this is a \"fantasy,\" and if I want Nicole and I to be cool in it, by gum, we're cool! If, however, the angry ex from the prior paragraph appears at our door, I'll quickly bolt into the projection room and pelt her with popcorn until she capitulates and buys a \"DAMN HUGE\" combo meal.\r\n\r\n<b>I'm Seeing Stars</b>\r\nOk, this scenario will be a little tricky, because if I divulge too much I might end up comprising the true location of Midwestburg, which would mean I'd have to kill myself, but for the sake of longevity, I must, and shall, proceed. There is a certain A-list celebrity who calls Midwestburg his or her home. This celebrity is famous enough that if you were to run into her/him on the street, you would immediately either a) pass out, b) start crying, or c) lose control over your bladder. It also happens to be that our hometown celebrity is married to another person who is close to, but not surpassing, him/her in famousness. They come to town often, and if our theater is up and running, they may, just maybe, darken our doorstep and demand to see a movie.\r\n\r\nWhat would we do? What if the celebrities... we'll call them Jack and Jill... what if Jack and Jill wanted to see <i>Napoleon Dynamite</i> all by themselves. No nosy fans, no bothersome theater owners, no DAMN HUGE meal combos, no shirts, no shoes, no DICE!? As a respectable theater owner, should I charge them for the cost of selling out the entire auditorium, or should I let it slide and exact my repayment in some other way - like having them film the theater's intro reel, which is the little movie before the movie that tells you to turn your cell phone off, and not to talk or smoke. That would be cool. I guess we'll have to cross that bridge when we come to it.\r\n\r\n<b>Unruly Patrons</b>\r\nSo you're right in the middle of a movie, right? You're enjoying it, you're drawn into the action, and then the butthole sitting next to you starts talking loudly, or his/her cell phone starts ringing to the tune of \"Tipsy\" by J-Kwon, or they start making out with their straw. You know what I'm talking about. How annoying is that? I wish I could have the <a href=\"/posts/15\">camera above the screen</a> suddenly pan in on the offender and say \"SHUT UP\" or \"STOP THAT\" or \"MIMOSAS FOR EVERYONE!\" Of course, that would interrupt the movie for everyone else, but wouldn't it be worth it? I mean, really?\r\n\r\nMaybe it would be more plausible if I made something up that I could tell the audience before each show, like \"if anyone's cell phone goes off during the show, a pulse of electro-magnetic energy will be focused on the cellular source and it will melt in your pants... regardless of whether it's in your pocket or not.\" That would be funny, at least to me. Then someone would say something like, \"Shut up, man, and play the freakin' movie!\" and I'd be like, \"Yeah! Yeah?! Yeah? Oh.\" Then I'd bow my head and shuffle up to the projection room where I'd throw popcorn out of the porthole onto the heckler until they capitulated and bought a deceivingly-packaged bag of Twizzlers. Yippee!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-06-17T23:38:05.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "david",
      "body": "Pretty neat blog check mine out <a href=\"http://theworldaroundtheworld.blogspot.com\">Click Here</a>",
      "created_at": "2004-06-18T19:27:05.000Z"
    },
    {
      "author": "Brian",
      "body": "Celebrity moviegoers: depending on how uptight the celebrity in question is, they will probably be satisfied with the anonymity that goes with sitting in the darkness. But hey, it's a nice fantasy.",
      "created_at": "2004-06-18T01:09:59.000Z"
    },
    {
      "author": "Funnybunny",
      "body": "LOL!  I really liked the last one, as you referred back to the \"Camera Above the Screen\" entry.  \r\n\r\nFunny stuff.\r\n\r\nMaybe I'll come into your theatre in a drunken stupor and pee in the lobby.\r\n\r\nThen again I'm a girl so it would be a little harder...\r\n\r\nOh well -- I'm always up for a challenge! ;-)",
      "created_at": "2004-06-18T06:00:24.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "\"...there would be little else we'd need to do to impress our preternatural coolness upon our jealous exes.\"\r\n\r\nHahah! Becoming hugely successful and being able to showoff to the ex nonchalantly. Isn't that part of fun?",
      "created_at": "2004-06-18T20:34:59.000Z"
    },
    {
      "author": "Becky",
      "body": "I see two options here: Let the \"celebrities\" decide which they would prefer. If they're that big, they'll call you in advance. They would already have enough experience with crowds to know what to expect. I've read that some small midwest towns with resident celebrities become accustomed to seeing them in the gas station, so people are cool and don't mob them. However, there are some that are so big they can't go anywhere. They would be the ones to arrange a private screening, and then you could charge whatever you'd lose in ticket sales. Don't wait until these situations occur before you make a plan. You mess it up once, and your reputation goes down the toilet. The second option is to call their agent or publicist to find out what the usual practice is.",
      "created_at": "2004-06-24T19:04:43.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
