{
  "id": 210,
  "title": "Dan: Cat Burglar Extraordinaire",
  "body": "This all happened yesterday.<br/><br/>The silicone I applied to the <a href=\"/phlogs/21\">front window</a> had finally dried up (for the most part), so I decided to go outside and fill the remaining cracks from there. The first step was to remove the duct tape I had placed along the seam in the window. As I began to slowly pull the tape away from the window, being ever so careful so as not to pull out any silicone, I heard a voice from over my shoulder.<br/><br/>\"HEY!\"<br/><br/>I paused for a moment.<br/><br/>\"HEY YOU! HEY!\"<br/><br/>I turned around to find a woman yelling at me from her car.<br/><br/>\"What are you doing? Are you breaking into that building?!\"<br/><br/>The woman lifted her cell phone so I could see it. I stood there for a moment, allowing everything to sink in. Was this woman serious? Did she really think I was trying to break into the building, in broad daylight, in the middle of rush hour, while 20 cars were waiting at the stop light 10 feet behind me? Do I really look that stupid and/or criminal-like?<br/><br/>\"No. This is my building [<i>not technically</i>]. I'm fixing the window.\"<br/><br/>Had she laughed, apologized, and driven away, I would've been fine. Instead, she looked at me with a mixture of contempt and incredulity, as if she were thinking, \"Yeah, right. Do you expect me to believe that a roustabout like you would ever own their own business? I wasn't born last night, son.\" I know that's what she was thinking, or else she wouldn't have said:<br/><br/>\"Uh huh [as in, <i>yeah, right</i>]. If you're breaking into that building, I'll call the cops. I know what you look like.\"<br/><br/>Then she drove away. The exchange was so quick that I didn't even have time to formulate a witty retort. I just stood there - caulk gun in hand - looking as if someone had just kicked me in the balls. I still can't believe it! On the one hand, I'm happy to know that the general public is concerned enough with downtown crime that they'll do anything and everything in their power to thwart it, but on the other hand, I'm more pissed than the pissiest pisser on the pissiest day of his life.<br/><br/>I can't believe the nerve of that woman! I should've shot a big wad of silicone caulking right into her filthy mouth.<br/><br/>*SQUIRT*<br/><br/>\"That'll teach you, you dumb bitch!\"<br/><br/>Then I'd have a couple good hardy laughs until the cops showed up to arrest me on some trumped up charge of aggravated assault or something.<br/><br/>*SQUIRT* *SQUIRT*<br/><br/>\"Take that, coppers!\"<br/><br/>Then... um... I'd squirt some more... silicone...<br/><br/>I'm having trouble ending this post. Wait! <a href=\"http://www.eatatfish.com/fish_people.asp\" target=\"_blank\" class=\"broken\">Look over there</a>!!! Who's that handsome fellow?<br/><br/>*SQUIRT*",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-05-05T23:06:49.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Nate",
      "body": "Wishful thinking for a witty retort that was too late in coming, a feeling I am all too familiar with, is known as \"esprit de l'escalier.\"  I recently learned this.  <br/>It is French for Spirit of the Escalator.  I'm not sure why, but if you know any French minors I'm sure they could tell you.",
      "created_at": "2005-05-05T23:28:49.000Z"
    },
    {
      "author": "Jeremy",
      "body": "I know the feeling - I was once thrown out of a Git n' Go because the guy running the counter accused me of stealing something during a prior visit.  I tried to explain to the guy that I'd never do anything like that, but he wouldn't hear it. I hate sterotypes.",
      "created_at": "2005-05-05T23:31:09.000Z"
    },
    {
      "author": "bjork24",
      "body": "On second thought, maybe I shouldn't have been wearing my Hamburgler outfit.",
      "created_at": "2005-05-05T23:39:00.000Z"
    },
    {
      "author": "Laura",
      "body": "If only you could have thought of a witty retort involving the word \"caulk.\"  If only...  By the way, did you enjoy Fish?  ",
      "created_at": "2005-05-06T00:25:08.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "\"I just stood there - caulk gun in hand - looking as if someone had just kicked me in the balls.\"<br/><br/>If you truly can stand after being kicked in the balls, then you're either a Shaolin monk or my greatest hero. Or both.",
      "created_at": "2005-05-06T00:47:16.000Z"
    },
    {
      "author": "bjork24",
      "body": "Fish wasn't very good, but that's coming from a professed sea food hater.",
      "created_at": "2005-05-06T00:48:42.000Z"
    },
    {
      "author": "Jed",
      "body": "Just tell me what that lady looked like. I will hunt her down and do awful things to her. Like punch her baby for instance. If you want it done, just give me a shout. Oh and if you really don't like that seafood place, I will punch the owners baby too. ",
      "created_at": "2005-05-06T01:32:26.000Z"
    },
    {
      "author": "brian of moore",
      "body": "\"What are you doing? Are you breaking into that building?!\" <br/>'yes, yes actually am... although the front door is unlocked, and i have the keys right here *lifts keys and jingles them* i thought it would be much more adventurous to try using this calk gun to break in through the window'",
      "created_at": "2005-05-06T01:55:32.000Z"
    },
    {
      "author": "Trint",
      "body": "Nate said:<br/><br/>\"Wishful thinking for a witty retort that was too late in coming, a feeling I am all too familiar with, is known as \"esprit de l'escalier. I recently learned this.<br/>It is French for Spirit of the Escalator.\"<br/><br/>I think a more meaningful translation is Witch on the Stairs. You know, like a witchy remark you only come up with as you're walking away, presumably up some stairs.<br/><br/>Ah, the French.<br/>",
      "created_at": "2005-05-06T02:35:47.000Z"
    },
    {
      "author": "Caleb",
      "body": "When you open maybe she'll come in and try to tell the owners she witnessed someone trying to break in. Because then she will see you and since she knows what the \"burglar\" looked like she will feel like a real dumbass. And nobody likes a dumbass...",
      "created_at": "2005-05-06T03:24:11.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "Did you burgle any cats?",
      "created_at": "2005-05-06T04:02:27.000Z"
    },
    {
      "author": "J.R.",
      "body": "Did you burgle any nintendoes?",
      "created_at": "2005-05-06T05:26:47.000Z"
    },
    {
      "author": "whittler",
      "body": "The funniest part is her parting statement. That's got holes in it which you could drive a train through.<br/><br/>How is she going to determine whether you broke in, after she drove off? Unless she had a camera, knowing what you look like will be of no assistance (you kinda look like about 10 million other guys your age).<br/><br/>I'd lay that down to an encounter with someone who is as stupid as a bucket full of hammers. I have a couple of them every year. ",
      "created_at": "2005-05-06T05:48:16.000Z"
    },
    {
      "author": "bjork24",
      "body": "*SQUIRT*",
      "created_at": "2005-05-06T08:23:10.000Z"
    },
    {
      "author": "Allison",
      "body": "you should have been like \"oh... sorry.  i'll stop breaking in since you suggested it...\" and then you should have quietly duct taped the window back up and walked away.",
      "created_at": "2005-05-06T09:30:16.000Z"
    },
    {
      "author": "steph v.",
      "body": "That place takes pictures of you while you eat?",
      "created_at": "2005-05-06T17:28:56.000Z"
    },
    {
      "author": "Dave",
      "body": "you could've held the caulk gun to your temple and threatened to end it all.",
      "created_at": "2005-05-06T17:47:08.000Z"
    },
    {
      "author": "Nate",
      "body": "This is courtesy of Brett Miller, professor extraordinaire and all around swell guy.  He subscribes to Merriam Webster's Word of the Day, and TODAY was...you guessed it!<br/><br/>The Word of the Day for May 06 is:                                 <br/>moxie   \\MAHK-see\\   noun<br/>     1 : energy, pep <br/>    *2 : courage, determination <br/>     3 : know-how, expertise<br/>Example sentence:<br/>It took a lot of moxie for Brandon to<br/>go back to school to follow his dream of becoming a lawyer.        <br/>                                    <br/>Did you know?<br/>     \"Hot roasted peanuts! Fresh popcorn! Ice-cold Moxie!\" You might<br/>have heard such a vendor's cry at a baseball game #151; if you attended<br/>one in 1924. That was the heyday of the soft drink called \"Moxie,\"<br/>which some claim outsold Coca-Cola at the height of its popularity. The<br/>beverage was a favorite of American writer E.B. White, who wrote,<br/>\"Moxie contains gentian root, which is the path to the good life. This<br/>was known in the second century before Christ and is a boon to me<br/>today.\" By 1930, \"moxie\" had become a slang term for nerve and verve,<br/>perhaps because some people thought the drink was a tonic that could<br/>cure virtually any ill and bring vim back to even the most lethargic<br/>individual.<br/>                        <br/>*Indicates the sense illustrated in the example sentence.",
      "created_at": "2005-05-06T18:59:22.000Z"
    },
    {
      "author": "Nate",
      "body": "vim?<br/><br/>I hope that is tomorrow's Word of the Day.",
      "created_at": "2005-05-06T19:00:29.000Z"
    },
    {
      "author": "Tim",
      "body": "Heh heh...I like Dave's idea:  \"Awright, lady!  One more step and I caulk myself!  So help me, I'll do it!\"",
      "created_at": "2005-05-06T19:28:24.000Z"
    },
    {
      "author": "nicholas",
      "body": "How are you pronouncing \"caulk?\" Because you're story could be very, very, very different in the spoken sense (callk or cahk).<p><br/><br/>\"I just stood there - (callk) gun in hand - looking as if someone had just kicked me in the balls.\"<p><br/><br/>\"I just stood there - (cahk) gun in hand - looking as if someone had just kicked me in the balls.\"<p><br/><br/>See?",
      "created_at": "2005-05-06T23:01:07.000Z"
    },
    {
      "author": "Trint",
      "body": "I prefer cahk. And you can quote me on that.",
      "created_at": "2005-05-07T05:40:54.000Z"
    },
    {
      "author": "Grey Hodge",
      "body": "\"Are you breaking into that building?\"<br/><br/>Well I _WAS_ until you ruined it. Now I'll go have to go pry someone else's window open with caulk.",
      "created_at": "2005-05-07T06:46:05.000Z"
    },
    {
      "author": "nicholas",
      "body": "Dan, any plans to RSS feed the Moxie blog? Just curious...I've been screwing around with my own blog and it occurred to me that I didn't think you did that...",
      "created_at": "2005-05-07T22:47:24.000Z"
    },
    {
      "author": "bjork24",
      "body": "Nick: Check the last option on the menu.",
      "created_at": "2005-05-07T23:08:03.000Z"
    },
    {
      "author": "nicholas",
      "body": "i'm blind. and ashamed. and because of you and nicole i've been screwing with WordPress for two days straight.",
      "created_at": "2005-05-08T18:55:25.000Z"
    },
    {
      "author": "Caleb",
      "body": "This is a general message to everyone who reads this board...<br/><br/>I assume you all are interested in the types of movies that will be shown at the Moxie, and so I am HIGHLY recommending you all go see Crash at your local theater. It was amazing.<br/><br/>That is all.",
      "created_at": "2005-05-09T00:37:51.000Z"
    },
    {
      "author": "Brandon",
      "body": "It's O.K. that you don't post a ton, Dan.  You know, since you can't sleep over the fact and everything..  puking, even.  It'll be allright.<br/><br/>But since I'm terrible at coming up with funny things to say (you, it appears, simply need your time) I won't comment about the neighborhood watchwoman.<br/><br/>I'll make a random comment:  I've just decided to attend Case Western Reserve University in the fall.<br/><br/>This doesn't mean I won't be road-tripping it to Springfield from Ohio this summer before I hole myself in my dorm.<br/><br/>So continue your hard labor.  And congrats for living your dream.<br/><br/>BTW- Ben Folds (Thursday night in Indianapolis) was the best concert I've ever seen.",
      "created_at": "2005-05-09T06:27:07.000Z"
    },
    {
      "author": "Ole",
      "body": "I'm wondering if the link to the Fish site could be construed as a nefarious plot on Dan's part to make us think he wasn't trying to break into the Moxie at that time when in fact...",
      "created_at": "2005-05-09T06:53:07.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "Judging from the delay in a new post, one can only assume that either <br/><br/>a) Dan and Father of Dan (FOD) are busy sheetrocking the new walls.<br/><br/>b) Dan is down at central booking and the caulk gun and window are being processed for fingerprints, which of course will make him the primary suspect in a string of recently draft-free windows in the area.",
      "created_at": "2005-05-09T16:04:30.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Hahaha, brilliant :)",
      "created_at": "2005-05-10T00:13:52.000Z"
    },
    {
      "author": "Tawny",
      "body": "Blog...withdrawl....",
      "created_at": "2005-05-10T02:56:57.000Z"
    },
    {
      "author": "Cynde",
      "body": "When do you believe you will begin taking applications? Is there anything I can do to help you and your wife get things started? ",
      "created_at": "2005-05-12T10:41:05.000Z"
    },
    {
      "author": "Alan Golder",
      "body": "I am a jewel thief.",
      "created_at": "2005-07-11T01:22:00.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
