{
  "id": 212,
  "title": "When will the Moxie be open?",
  "body": "So, when is that theater of yours gonna open? When's opening night? When will the Moxie be open? When? When? When?\r\n\r\nI hear this question at least ten times a day from friends, family, media contacts, new acquaintances, complete strangers, and the occasional talking mailbox. Sometimes it bothers me, sometimes it doesn't. It all depends on the reaction of the person who asks me the question. For instance:\r\n\r\n<b><i><u>Scenario 1</u></i></b>\r\n\r\n<b>Not Dan</b>: When's the theater going to open?\r\n<b>Dan</b>: That's a good question. I'm hoping to get the majority of the work done during the month of May so we can open in mid-to-late June. I'm working as fast as I can, but it really depends on how soon the sub-contractors get their work done.\r\n<b>Not Dan</b>: Weren't you supposed to originally open in March?\r\n\r\n<b><i><u>Scenario 2</u></i></b>\r\n\r\n<b>Not Dan</b>: When's the theater going to open?\r\n<b>Dan</b>: That's a good question. I'm hoping to get the majority of the work done during the month of May so we can open in mid-to-late June. I'm working as fast as I can, but it really depends on how soon the sub-contractors get their work done.\r\n<b>Not Dan</b>: Uh huh. It seems that everytime I ask when you're going to be open, the date keeps getting pushed further and further back. You're never going to get open, are you?\r\n\r\n<b><i><u>Scenario 3</u></i></b>\r\n\r\n<b>Not Dan</b>: When's the theater going to open?\r\n<b>Dan</b>: That's a good question. I'm hoping to get the majority of the work done during the month of May so we can open in mid-to-late June. I'm working as fast as I can, but it really depends on how soon the sub-contractors get their work done.\r\n<b>Not Dan</b>: Fuckin' sub-contractors! Let's go wash away our problems with some dark beer and a brillo pad.\r\n<b>Dan</b>: OK! You're the bestest talking mailbox EVER!\r\n\r\nCan you guess which scenario DOESN'T end with me clinching my fists so tightly that my palms bleed?\r\n\r\nAs I was envisioning this post yesterday, I was primed and ready to write out a huge rant about how the theater will be ready when it's ready, and I'm working as hard as I can, and can't you see that my hands are bleeding, and for the last time, where's my hat?! The more I thought about it, the more angry I became. Then I smashed my finger with a hammer and everything stood still for a second.\r\n\r\n<i>I wasn't mad at people for asking me when the theater was going to open - I was mad because I couldn't give them an answer. I was mad because the sub-contractors haven't started working yet. I was mad because I didn't have control over the project.</i>\r\n\r\nAnd I'm still mad.\r\n\r\nWhen I spoke to Chris (GC) yesterday, I asked him when the HVAC work was scheduled to begin. He didn't know. The HVAC contractor hadn't given him an ETA. That was the same thing he told me last Thursday, last Monday, and the week prior to that.\r\n\r\nNow, don't get me wrong - this isn't Chris's fault. He's delivered on his end of the deal in a (somewhat) timely manner. The walls are up... or more specifically, the walls are framed. They can't be sheetrocked until 1) the HVAC guy does his job, and 2) the electrician does his. As the GC, it's Chris's job to coordinate the work of the sub-contractors. I wonder if I can call the HVAC and electrical guys and try to get an ETA from them...\r\n\r\nFunny story: the phone just rang. It was Chris. The HVAC guy should be starting tomorrow. *blushes*\r\n\r\nSo...\r\n\r\nHow about those Cardinals?!\r\n\r\nSeriously though, that's good news. My mood has been significantly lightened, but I'm not completely placated.\r\n\r\nJust as I finished typing that, Bogart spilled roughly 3 gallons of green diarrhea out of his butthole and onto the kitchen floor. That's the second time he's done that today! This post is bad/good luck, that's what it is!!! Everytime I say one thing, something bad, or good, happens.\r\n\r\nI bet I won't find $1,000 hidden in this Sunbelt granola bar wrapper...\r\n\r\nDamn.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-05-11T01:15:23.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Nicki J",
      "body": "Dude. That was gross.",
      "created_at": "2005-05-11T01:31:59.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "MMMM Sunbelt...",
      "created_at": "2005-05-11T01:42:28.000Z"
    },
    {
      "author": "Justin",
      "body": "I laughed.  So when will the theater be open?",
      "created_at": "2005-05-11T02:10:45.000Z"
    },
    {
      "author": "J.R.",
      "body": "\"The theater will be open!!!\" That's what you should say, then caulk their eyes and say, \"But you will never see it come to its glorious fruition!\"",
      "created_at": "2005-05-11T02:30:43.000Z"
    },
    {
      "author": "nicholas",
      "body": "That's the same thing that happens when you're doing a movie:\r\n\r\nWhen will the script be finished?\r\nWho's in it?\r\nWhen's it filming?\r\nWhen will it be edited?\r\nWhen will it be in theaters?\r\nWhen will it be on DVD?\r\nWhen will you get paid for it?\r\n\r\nEtc, etc, etc.\r\n\r\nWith all creative endeavors, there will always be those who ignore the process and demand the product.\r\n\r\nBlech.",
      "created_at": "2005-05-11T02:33:30.000Z"
    },
    {
      "author": "Fyse",
      "body": "Green?! What on earth have you been feeding poor Bogey?",
      "created_at": "2005-05-11T04:10:46.000Z"
    },
    {
      "author": "nicole",
      "body": "Greenies. (they're a dog treat that he loves)\r\n\r\nAnd Dan gave him half a ham last night. Lots of fat. I bet that did it. ",
      "created_at": "2005-05-11T04:20:08.000Z"
    },
    {
      "author": "bjork24",
      "body": "It didn't taste like the ham I gave him last night. bu-dum-ching!",
      "created_at": "2005-05-11T04:36:40.000Z"
    },
    {
      "author": "justin springer",
      "body": "how about them cardinals?! they freaking rule! green poop is funny! gross, but terribly funny. poor bogart and his green butthole.",
      "created_at": "2005-05-11T04:41:13.000Z"
    },
    {
      "author": "Oz",
      "body": "Wait a second.  Shouldn't the response of Not Dan in Scenario 1 be, \"Weren't you supposed to originally open for Valentine's Day?\"\r\n\r\nGet your facts straight, man!",
      "created_at": "2005-05-11T04:49:52.000Z"
    },
    {
      "author": "bjork24",
      "body": "Hey, don't tell me... tell Not Dan!",
      "created_at": "2005-05-11T04:50:37.000Z"
    },
    {
      "author": "brian of moore",
      "body": "its good thing chris called... i had already put my shoes on.. and found my trusty switchblade.... an hvac guy was about to have 2 1/2 flat tires....\r\n(note: not really.. im far too lazy to find out where such a person would live.. much less go over there to flatten tires... oh but i thought about it!! believe you me)",
      "created_at": "2005-05-11T06:37:31.000Z"
    },
    {
      "author": "nathan springer",
      "body": "great post, who doesnt love green diarrhea. well other than the person that has to clean it up, but hey it was funny to me. why is poop is funny no matter how old i get?",
      "created_at": "2005-05-11T08:16:22.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "Hmmmm. I had stomach issues yesterday too!",
      "created_at": "2005-05-11T17:04:38.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "Anyone who has been through a major construction project knows that these things always take longer than expected. Don't be so hard on yourself, Dan. When you first started blogging about the project last year, did you ever expect you'd be this far along so soon? Perspective. :)",
      "created_at": "2005-05-11T17:07:45.000Z"
    },
    {
      "author": "Caleb",
      "body": "How does one eat a granola bar after witnessing such an act of excretion? \r\n\r\nThat HVAC guy better be there today...or else!",
      "created_at": "2005-05-11T18:30:41.000Z"
    },
    {
      "author": "Fyse",
      "body": "Oh no! Benzo has been seduced by the dark side!",
      "created_at": "2005-05-11T19:45:14.000Z"
    },
    {
      "author": "DUG",
      "body": "You should just not say anything when someone asks you.  Silent treatment is the best.  They will soon think that you're tounge had been cut out when you were a small child and feel sorry for your unfortunate disability.  Then they will donate money and all will be well!  Yes, I do read you're blog, but I still hate you and want you dead.  Have a good day and peace out!\r\n",
      "created_at": "2005-05-11T20:38:59.000Z"
    },
    {
      "author": "Jed",
      "body": "Thats funny Dug, I was thinking more along the lines of me coming back to town for a month and creating horrible pain to the people who bug Dan. I would then use my time for beating/kidnapping members of family of those who would delay the opening of Dans brainchild. I would then spend the remainder of my time getting drunk and yelling with/at you guys as usual. Dan, I'm serious, just give the ok.   ",
      "created_at": "2005-05-11T22:47:36.000Z"
    },
    {
      "author": "Allison",
      "body": "My Moxie tshirt arrived in the mail today!  It makes me the coolest kid in Western Massachusetts!  Soon, I'll be the coolest kid in Baltimore, too!  Any Baltimorians out there with Moxie tshirts?!  I don't THINK so!  shizaam!",
      "created_at": "2005-05-11T23:02:45.000Z"
    },
    {
      "author": "Matt",
      "body": "Just to point out what is a glaringly obvious geek faux pas: the blade of a lightsaber is white, with a colored outer aura.  DUH!",
      "created_at": "2005-05-11T23:18:33.000Z"
    },
    {
      "author": "bjork24",
      "body": "Jed, perhaps you could start your beating with Doug.",
      "created_at": "2005-05-11T23:42:59.000Z"
    },
    {
      "author": "Jed",
      "body": "Done and Done. ",
      "created_at": "2005-05-12T00:32:32.000Z"
    },
    {
      "author": "Rachel",
      "body": "I got my Moxie Survival Kit in the mail today.  Now I could make it until September if I had to do it!  My \"Moxie Loves Art\" button is now living happily on my purse.",
      "created_at": "2005-05-12T01:24:18.000Z"
    },
    {
      "author": "nicole",
      "body": "I made a purse just for my Moxie buttons. ",
      "created_at": "2005-05-12T03:45:17.000Z"
    },
    {
      "author": "justin",
      "body": "My shirt arrived today too! <a href=\"http://justin.retroflux.com/?p=235#more-235\" target=\"_new\">See?</a>",
      "created_at": "2005-05-12T04:16:22.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
