{
  "id": 213,
  "title": "Where am I?",
  "body": "My time totally got away from me today. In fact, I've been operating outside of the space-time continuum since about 7:32:44 in the ante meridiem. All posts have been delayed a day. Sorry.\r\n\r\nBut before I go, I'd like to leave you with this:\r\n\r\nYou know that part in the song <i>Too Much</i> by Dave Matthews and his band where he sings...\r\n\r\n<i>I need more,\r\nI'm going over my borders,\r\nIt's gonna take more\r\nMore from you, less of Vanessa</i>\r\n\r\nDo you think he's talking about Vanessa Huxtable?\r\n\r\nThink about it.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-05-12T07:16:36.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "whitty",
      "body": "I was just watching the Cosby Show today and thought, \"Man, that Vanessa is a snappy dresser.\"\r\n\r\nI need sleep. And less Cosby Show.",
      "created_at": "2005-05-12T07:34:20.000Z"
    },
    {
      "author": "justin",
      "body": "Funny thing is, Vanessa <i>is</i> a snappy dresser, and that's why Dave needs less of her.",
      "created_at": "2005-05-12T07:36:45.000Z"
    },
    {
      "author": "justin springer",
      "body": "you can never get enough of the cosby show and those j-e-l-l-o pudding pops that mr cosby used to sell.also note of reference its \"more from you letter by letter.\"",
      "created_at": "2005-05-12T09:30:42.000Z"
    },
    {
      "author": "james sheldon",
      "body": "Just wanted to say that I had one of hopefully many surreal encounters today, when I was called into an audition...showed up 45 minutes late after I had left for the destination 2 hours early (freeway accident=parking lot style traffic) to be told that I'd be reading for the producer and director, and I walked in the room and there sat the producer, Ms. Katy Wallin, a gem in this jaded business, and Tom Green.  Yes, my bum in on your face my bum is on your face, and the dude was so chill I didn't know what to say:  So instead of saying \"nice to meet you,\" I say, \"it's really good to see you...\"  that goes over every time...anyway, f'n subcontractors.  I'm tellin' ya Dan, it's a midwestern thing.  You'd never get away with it elsewhere or someone else would have the job for a lower bid!!!  Hang in there buddy!  I can't wait to see a movie there when I'm back sometime this summer!\r\n\r\nJames",
      "created_at": "2005-05-12T12:36:15.000Z"
    },
    {
      "author": "Nate",
      "body": "Is Vanessa the one that spun off into a Different World?  All the siblings moved up a notch and they brought in Rudy.\r\n\r\nRegardless, Duane Wayne is the BEST name for a dog EVER!",
      "created_at": "2005-05-12T16:27:28.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "Uh, sorry to burst the bubble there, but it's\r\n\r\nI need more, \r\nI'm going over my borders\r\nI'm going to take more,\r\nMore from you, LETTER BY LETTER",
      "created_at": "2005-05-12T17:16:40.000Z"
    },
    {
      "author": "Dave",
      "body": "ah Tempest Bledsoe. one of the most underrated of the mediocre child sit-com actors of the 1980s.\r\n\r\nby the way I got my t-shirt and pins and sticker. I put them all on, stood in the middle of a busy intersection and played air guitar for a good hour last night... but nobody honked for me.",
      "created_at": "2005-05-12T17:51:19.000Z"
    },
    {
      "author": "brian of moore",
      "body": "hmm.. vanessa.. turned 32 today.. weird\r\nhappy birthday vanessa\r\ni think i prefer <a href=\"http://www.lenny.hello.pl/pliki/kobiety_pliki/bonet.jpg\">lisa bonet</a> she is super foxy\r\nbtw.. i think you should show <a href=\"http://movies.apple.com/trailers/independent/stephentobolowskysbirthdayparty.html\">this movie</a>",
      "created_at": "2005-05-12T22:21:41.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i keep forgetting to make it open in a new window... my bad",
      "created_at": "2005-05-12T22:22:31.000Z"
    },
    {
      "author": "Nate",
      "body": "Oh dude.  I totally didn't realize that was Vanessa Huxtable in that Chicago-ized Cusak-ized High Fidelity.  Cool.",
      "created_at": "2005-05-13T00:53:32.000Z"
    },
    {
      "author": "Cynde",
      "body": "Dear Nate:  Lisa Bonet was in \"hi-Fidelity\" not Tempest Bledsoe. ",
      "created_at": "2005-05-24T04:29:54.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
