{
  "id": 214,
  "title": "Windows are the eyes to the sole proprietorship... or LLC",
  "body": "It's time to figure out what we're going to put in the big windows that, unfortunately, fall in the auditorium. I'm going to build the frames tonight, but I need to figure out what I want it to look like from the outside. Hmm, here's a few thoughts I've had.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/051205/windows1.jpg\" width=\"425\" />\r\n\r\nI like the disjointed feel one. It kind of gives the impression of a big sign that's been split in two.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/051205/windows2.jpg\" width=\"425\" />\r\n\r\nThis one has a bit more pizzazz and khutzpah... but it also looks like chicken pox. I do, however, like the idea of painting the remaining part of the logo on the bricks (if we're given permission). A little \"trompe l'oeil\" never hurt anyone. Right? Well, excluding Willy Coyote.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/051205/windows3.gif\" width=\"425\" />\r\n\r\nHmm, I'm not sure what we have here... but I like it!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-05-12T23:00:19.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "DUG",
      "body": "If it's going to be your front windows, shouldn't the movie posters of what's playing be there, and if it's the side, I could dress up in a fat suit and dance, dance, dance for a small fee!",
      "created_at": "2005-05-12T23:37:44.000Z"
    },
    {
      "author": "bjork24",
      "body": "It's the side windows... now that you mention it Doug, that kid does kinda look like you!",
      "created_at": "2005-05-12T23:44:14.000Z"
    },
    {
      "author": "Carl",
      "body": "I like the second choice the best.  Just got the shirt and it looks great. Thanks for sending it.\r\n",
      "created_at": "2005-05-12T23:44:49.000Z"
    },
    {
      "author": "whitty",
      "body": "Dude, I wouldn't even need to dress in a fat suit.  How ever my window dancing fee is quite large.\r\n\r\nI do like the idea of movie posters.  I think there would be a problem in that those are west facing windows and would get alot of direct sun and anything you put in the would fade pretty fast.  So, maybe it would be best if there was a way to change out what you put in there.",
      "created_at": "2005-05-12T23:47:20.000Z"
    },
    {
      "author": "bjork24",
      "body": "Unfortunately, there's no easy way to change the windows. Vinyl will last the longest in direct sunlight... 5 to 7 years before it will start to fade.",
      "created_at": "2005-05-12T23:54:26.000Z"
    },
    {
      "author": "Dave",
      "body": "that kid is so freakin disturbing",
      "created_at": "2005-05-12T23:55:57.000Z"
    },
    {
      "author": "Tiffany",
      "body": "All the hos be shake-shake-shakin' it at the Moxie.  ",
      "created_at": "2005-05-13T00:07:13.000Z"
    },
    {
      "author": "Steve Kirks",
      "body": "I'm viewing the third choice with ABBA's \"Dancing Queen\" in the background.  Creepy, yet mesmerizing.  Officially, the second choice.  It will grab your eye, even when stumbling out of the BrewCo.",
      "created_at": "2005-05-13T00:14:05.000Z"
    },
    {
      "author": "bjork24",
      "body": "Oh man, I need some ABBA... I'm going to go \"legally\" download some.",
      "created_at": "2005-05-13T00:18:34.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "That kid is... mesmerizing. He's kind of like a lava lamp...\r\n\r\n(drool)\r\n\r\n(dope slaps self back to reality)\r\n\r\nHowzabout a nice shot of Benzo terrorizing the city (of Townsville) with a nice Moxie billboard in the foreground?",
      "created_at": "2005-05-13T00:34:52.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "Or the Benzo-themed dancers (the Benzonettes) in the window?",
      "created_at": "2005-05-13T00:36:11.000Z"
    },
    {
      "author": "J.R.",
      "body": "I like the first one, but if you got a fat kid to do that all day long, I'd say option number 3.",
      "created_at": "2005-05-13T00:47:33.000Z"
    },
    {
      "author": "Allison",
      "body": "I love the second option.  Maybe if you don't want the chickenpox, you could replace them with different sized red and white stars.  Or you could just leave the chickenpox out altogether.",
      "created_at": "2005-05-13T00:53:16.000Z"
    },
    {
      "author": "Nate",
      "body": "Definitely second.  Chicken pox and all.\r\n\r\nThe third?  I just blew Coke all over my keyboard and wet my g**d*m Dockers.",
      "created_at": "2005-05-13T00:58:27.000Z"
    },
    {
      "author": "Nate",
      "body": "Coke as in soda.  I normally do my lines off of my Kate Beckinsale mousepad.",
      "created_at": "2005-05-13T00:59:11.000Z"
    },
    {
      "author": "Liz",
      "body": "I like the second one, possibly with stars like Allison said.  Sam's Benzo-terrorizing-the-city idea is cool too.\r\n\r\n(I also got my shirt today--and I'm fully keeping the part of the packaging that Dan drew on, it's cute.)",
      "created_at": "2005-05-13T01:22:32.000Z"
    },
    {
      "author": "Nate",
      "body": "I do a pretty good Townsville Mayor by simply picking up my phone and yelling \"Girls!\"\r\n\r\nThat does not leave this website, people.",
      "created_at": "2005-05-13T01:44:58.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "As your designer/design consultant, I would recommend something similar to number two, minus the polka dots and exterior wall painting. Something simple. Something big. Something that would require several square acres of cut vinyl.",
      "created_at": "2005-05-13T02:07:08.000Z"
    },
    {
      "author": "Justin",
      "body": "You could get a local muralist to paint a theater-looking scene, perhaps from a different era, and involving Benzo.",
      "created_at": "2005-05-13T02:17:33.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "The second is my standout favorite. But you should lose the pox.",
      "created_at": "2005-05-13T03:16:20.000Z"
    },
    {
      "author": "Fyse",
      "body": "WTF is that last one about?\r\n\r\nDan, my friend, you need help...",
      "created_at": "2005-05-13T03:23:09.000Z"
    },
    {
      "author": "nicole",
      "body": "If the fat kid danced all day, he'd no longer be fat. But probably still happy. I love that kid. ",
      "created_at": "2005-05-13T03:43:34.000Z"
    },
    {
      "author": "whitty",
      "body": "Can I just say, on my Mac at home the chubby kid is dancing about 5 times as fast as on my work PC.  It is 5 times as scary.",
      "created_at": "2005-05-13T03:44:33.000Z"
    },
    {
      "author": "brian of moore",
      "body": "yeah.. i like stars idea..instead of spots... only im thinking like 50s retro stars... kinda like <a href=\"http://www.uselessvoid.com/bored/windowsign.jpg\">this</a> maybe\r\ni dunno.. eh\r\n\r\nalso i dissagree with aaron... as do two other graphic designers i just asked.. we like the painting on the brick\r\n(no.. im not a graphic designer.. they are... i just do it in my spare time)\r\nsooo.. yeah.. stuff",
      "created_at": "2005-05-13T04:02:03.000Z"
    },
    {
      "author": "Allison",
      "body": "The painting on the brick is Very good in theory, but if you're putting the vinyl signs inside the windows, perhaps you should consider how the \"ox\" will stick out from the rest of the sign.  It could end up being WAY brighter than the rest of the sign and really awkward looking.",
      "created_at": "2005-05-13T04:12:31.000Z"
    },
    {
      "author": "Aaron",
      "body": "Brian, you just disagree to disagree, don't you? Tell your designer friends to look up Gestalt's theories, particularly the one on closure. The connection of the MO to the XIE doesn't need to be pointed out to the viewer--they will connect the two on their own...with mind powers!",
      "created_at": "2005-05-13T07:18:21.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i do dissagree to dissagree.. sometimes.. i like to stir things up... but also.. i just happen to very often dislike most of your design ideas.. and so i ask design majors that i know.. to see if maybe im just dumb... but every time i ask.. they seem to agree with me... sorry.. maybe its just the difference between smsu and drury",
      "created_at": "2005-05-13T08:49:36.000Z"
    },
    {
      "author": "nathan springer",
      "body": "i would take the red back ground of #1 and the Moxie of #2, put them together to make a baby. that is the winner",
      "created_at": "2005-05-13T09:40:12.000Z"
    },
    {
      "author": "Caleb",
      "body": "Definitely paint the brick if you do option #2. And to get in on the fiesta, if a person, say, should cover the brick part up with their pinky finger, say, and then pretended you were a newbie to downtown Springfield and saw the sign, then my friend, Gestalt would be wrong. Dead wrong.\r\n\r\nI actually like #1 the best, but I'm the odd man out. So option #2 is just swell!",
      "created_at": "2005-05-13T09:45:05.000Z"
    },
    {
      "author": "mike",
      "body": "Noooooooo! Dan - did you know your dancing robot's head has been replaced with George Lucas's suck-ass-Darth-Vader... why, Dan? Why?",
      "created_at": "2005-05-13T13:36:24.000Z"
    },
    {
      "author": "nicole",
      "body": "Option 1 looks like the business card I made for myself (but have yet to print...).",
      "created_at": "2005-05-13T16:25:46.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "I like the first personally...the tromp l'oil should be Mr. Benzo painted on the brick.",
      "created_at": "2005-05-13T16:30:59.000Z"
    },
    {
      "author": "Kirsten",
      "body": "Like #2.  If you decide you need something painted, by a someone who knows how to paint....contact Lauren Sudduth.  She's done some wonderful window painting for us!  Check it out on our website under the displays of the month page.  A link to her personal art page is there as well.\r\nRock On.",
      "created_at": "2005-05-13T16:53:57.000Z"
    },
    {
      "author": "Fyse",
      "body": "If it's not possible to get a real life dancing fat kid, then go with the first one. I too like the disjointed feel of it.",
      "created_at": "2005-05-13T19:16:36.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Got my shirt btw Dan, thanks! The button is...interesting :)\r\n\r\nAnyway, #2 minus the chicken pox is the way to go. Good luck!",
      "created_at": "2005-05-13T19:38:32.000Z"
    },
    {
      "author": "Nate",
      "body": "#2 with retro stars.  That's what I like.\r\n\r\nOR!  Just a giant mudflap-girl sihouette.  Pink maybe.  And 'Moxie' works with a strip-club motif as well.\r\n\r\nYou can sucker the patronage of Illusions and Centerfolds into seeing 'Sideways.'  It'll be great fun.",
      "created_at": "2005-05-13T20:26:00.000Z"
    },
    {
      "author": "Steve Croxton",
      "body": "For the umpteenth time, I will add my vote on numero dos, sans the pox. Perhaps a poll on the blog to help decide such issues? Then, should any said decisions turn out to be total disasters, you can always blame it in the ignorance of the masses...",
      "created_at": "2005-05-13T22:52:52.000Z"
    },
    {
      "author": "Nate",
      "body": "No, no.  Please refer to \"The Wisdom of Crowds\" on amazon.com.\r\n\r\nI still don't know how to post links,  being a mere wiseguy and not a wise crowd.\r\n\r\nOr you can just fucking google it, as has been suggested.",
      "created_at": "2005-05-13T23:37:58.000Z"
    },
    {
      "author": "Jed",
      "body": "I think someone should find that fat kid  and slap him hard. Then with a stick, a piece of string, a cheeseburger and a well designed track outside The Moxie, force him to walk around aimlessly until he walks himself to death. Wearing, of course, a magnificent Moxie t-shirt. People would come from miles around to see him walk. Sportsbook.com would then allow wagers to see when he dies. All local and national news outlets will cover the story and people worldwide will come to love The Moxie. Now that's advertising.  ",
      "created_at": "2005-05-13T23:59:51.000Z"
    },
    {
      "author": "nicholas",
      "body": "Dan, will you show <a href=\"http://www.nytimes.com/2005/05/13/business/media/13morris.html\" target=\"_blank\">this</a> movie? Please? I think Springfieldians would go for it...",
      "created_at": "2005-05-14T00:21:09.000Z"
    },
    {
      "author": "Tiffany",
      "body": "This is totally crass so consider yourself warned if you choose to cut and paste the link.  It features the young chap from choice #3 along with a catchy tune about shaking hos.\r\n\r\nhttp://www.ebaumsworld.com/flash/shakeass.html",
      "created_at": "2005-05-14T00:22:04.000Z"
    },
    {
      "author": "nicholas",
      "body": "Dammit. I meant <a href=\"http://www.nytimes.com/2005/04/27/movies/27dirt.html?ex=1272254400&en=7d3cbb8604241000&ei=5088&partner=rssnyt&emc=rss\" target=\"_blank\">THIS</a>.",
      "created_at": "2005-05-14T00:22:09.000Z"
    },
    {
      "author": "Mena",
      "body": "My vote is for number 2. I like the painting on the brick. Looks fat, I mean phat...",
      "created_at": "2005-05-15T00:04:57.000Z"
    },
    {
      "author": "Matt",
      "body": "being both a graphic designer and working for a large sign, vehicle wrap, and window vinyl company in the uk.. I'd definately say something along the lines of No2.\r\n\r\nI REALLY like the continuation onto the brick, too many people have blind faith in theories so you ignore the fact that it actually stands out as something you dont see oten (for that reason) and actually looks good!\r\n\r\nIf you're concerned about keeping the colours consistent, rather than paint it, have the sign company make you a panel to fit in that gap (I would use foamex, dibond or aluminium), shaped to fix the lettering, and the same white and black vinyl applied to the face as used on the windows... it will still fade at a slightly different rate and look slightly different because I assume the others are internally applied behind the glass, but if you fix the panel straight to the brick, it would look nice and nifty and you wouldnt have to match paint to the vinyl shades...\r\n\r\n2 definately would catch my attention anyway",
      "created_at": "2005-05-15T21:49:33.000Z"
    },
    {
      "author": "Nick Skyles",
      "body": "No. 2, no doubt.\r\n\r\nAs a friend of Aaron Scott, I... wait,  does that qualify me for anything?\r\n\r\nRegardless.\r\n\r\nI would even suggest doing the ENTIRE outer wall by printing a design/logo/whatever in tiles (on a material made for outdoor signage) and adhere them in 2x2 squares (so you don't need to make one impossible print job).\r\n\r\nBut no. 2 is the best one.  You can't read no. 1.  and number 3 is just creepy :)\r\n\r\n",
      "created_at": "2005-05-17T21:18:04.000Z"
    },
    {
      "author": "Matthew Martin",
      "body": "NUMBER THREE!",
      "created_at": "2005-06-01T04:38:37.000Z"
    },
    {
      "author": "Deborah Goodwin",
      "body": "In my humble opinion, design 2 would be fine, with some tweaking. Carry the full design through on the bricks, so that it makes a big rectangle and paint the window frames so that they blend into the background.Design 3 has a great idea in it:Set up a hidden video camera with rear-projection on the windows. People could pose with the dancing robot. And,of course, use a portion of the space for the Moxie logo. ",
      "created_at": "2005-06-06T05:57:46.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
