{
  "id": 215,
  "title": "10 things I learned this week",
  "body": "1. When your $16,000 worth of owner investment dries up, don't continue writing checks. Overage charges are not cheap, and bouncing checks isn't as fun as it sounds.<br/><br/>2. Don't tell the sub-contractors what to do, nor change their current course of action. That's the general contractor's job. To avoid conflicting directives, all information should come from one source. If ignored, prepare to be in trouble with both the sub-contractors and your GC.<br/><br/>3. Soundboard smells like rotten garbage.<br/><br/>4. Government and city loans are not disbursed in one lump sum. Prior to spending, an itemized list of expenses must be approved by each bank. If the expenses are not considered within the realm of the loan's purpose (equipment in our case), no money will be given. Checks and reimbursements take up to seven days to be issued.<br/><br/>5. I am the greatest <a href=\"http://www.sceneit.com/\" target=\"_blank\">Scene It?</a> player of all time. Unbeatable even.<br/><br/>6. People who run into me with their carts at Lowe's are stupid.<br/><br/>7. Becoming \"involved\" with various business-related associations is expensive, but the increased amount of networking justifies the price. I hope.<br/><br/>8. Fourteen feet of wall space does not equate to a fourteen foot movie screen.<br/><br/>9. I don't know the phraseology of the expression \"chew me out,\" but I've always wanted to know. Think about it. How does being yelled at correspond with the vision of a little Pac-Man eating your guts from the inside out?<br/><br/>10. Animated .GIF's of obese youngsters have feelings too, you know. But what about <a href=\"http://evstar.eatsleepcode.ca/forum/Did%20i%20just%20get%20served%20or%20owned.....gif\" target=\"_blank\" class=\"broken\">this one</a>!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-05-14T01:33:33.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Rachel",
      "body": "oh my god, THAT is why cat's are better than dogs!",
      "created_at": "2005-05-14T01:41:48.000Z"
    },
    {
      "author": "Rachel",
      "body": "(apostrophes are now for emphasis, didn't you get the mem'o?)<br/>",
      "created_at": "2005-05-14T01:42:13.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Oh, that's terrible.  Poor little kid!  Nasty cats...<br/><br/>We have the Lord of the Rings scene it; played it once.  You're welcome to come take a crack at it.<br/><br/>Shirts came today...Matt quickly changed out of work garb to don his, and show anyone who might care in Knoxville that he supports independent movie theaters in towns far, far away...",
      "created_at": "2005-05-14T02:13:41.000Z"
    },
    {
      "author": "Liz",
      "body": "I bet I could take you in the Scene It? 007 Edition.  I've been trained by my dad, the Jedi Master of all things Bond.  (Ugh, genre clash...)",
      "created_at": "2005-05-14T03:20:35.000Z"
    },
    {
      "author": "Fyse",
      "body": "That kid is damn lucky it pestered the only cat in the world with terrible paw-eye coordination.",
      "created_at": "2005-05-14T03:55:51.000Z"
    },
    {
      "author": "brian of moore",
      "body": "im pretty sure it had great paw-eye coordination.. it just doesnt have claws... either way that was extremely fantastic.. and i shall now share it with everyone i know... ",
      "created_at": "2005-05-14T07:57:31.000Z"
    },
    {
      "author": "Aaron",
      "body": "Oh geez...playing that game against a movie junkie is no fun at all. The only time I've played it, I didn't get even a third of the way around the board before the game was over.",
      "created_at": "2005-05-14T20:21:51.000Z"
    },
    {
      "author": "Oz",
      "body": "Oh Dan.  It's never easy, is it?",
      "created_at": "2005-05-15T12:12:47.000Z"
    },
    {
      "author": "brian of moore",
      "body": "and hi.. so if those stickers come in next week.. ill be out of town.. so uhmm.. if you could just hold on to mine until i get back :-)  <br/>.. btw you can trust that this is really me saying this.. because of this special code - &#8252;ÖéB&#9689;A&#931;µ£<br/>only I would ever use that code<br/>i promise.... seriously",
      "created_at": "2005-05-16T08:26:43.000Z"
    },
    {
      "author": "DUG",
      "body": "I've beat you at Scene it you ignorant son of a bitch!  You smell like soundboard!",
      "created_at": "2005-05-16T22:21:22.000Z"
    },
    {
      "author": "Jed",
      "body": "Dan, seriously. I'm getting pretty sick of DUG. I think I'm going to pull a Robert Blake and Bonnie Lee Blakely his ass.",
      "created_at": "2005-05-17T02:41:31.000Z"
    },
    {
      "author": "DUG",
      "body": "What do you know Jed, you're japanese!<br/>",
      "created_at": "2005-05-17T03:24:08.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
