{
  "id": 216,
  "title": "Very exciting times",
  "body": "Not much happened today with the theater, but since you took the time to drop by the blog I better write something meaningful. Here's a somewhat comprehensive list of all the celebrity crushes I've had over the years:<br/><br/>Pre 1990 - Jennifer Connelly<br/>1991 - Jenna von Oÿ (\"Six\" from <u>Blossom</u>)<br/>1992 - Sarah Jessica Parker<br/>1993 - Laura Dern<br/>1994 - Bjork<br/>1995 - Gillian Anderson<br/>1996 - Elizabeth Hurley<br/>1997 - Kate Winslet<br/>1998 - Gwenyth Paltrow<br/>1999 - Charlize Theron<br/>2000 - Nicole<br/>2001 - Angelina Jolie<br/>2002 - Audrey Tautou<br/>2003 - Natalie Portman<br/>2004 - Elisha Cuthbert<br/>2005 - That girl from the Sonic commericials",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-05-17T06:41:35.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Maddy",
      "body": "You mean the wife of the guy in the car?  Who went to New Orleans without her husband?<br/><br/>I was just wondering today if she has completely replaced the other guy.  I mean, why is it that when a guy gets married, he has to ditch his guy friends?  That woman has completely taken away a part of his soul by coming between him and his Sonic friend.<br/><br/>Damn her, damn her all to hell.  She makes all us women look so bad...",
      "created_at": "2005-05-17T07:19:00.000Z"
    },
    {
      "author": "Luke",
      "body": "From 1998 thru 2004, with the exception of Nicole, my own celebrity crushes closely mirror yours.  I think Franke Potente might have to take the 1999 spot though, and Charlize Theron could slide down to 1997.",
      "created_at": "2005-05-17T07:47:37.000Z"
    },
    {
      "author": "bjork24",
      "body": "Don't act like you don't think the Sonic girl is hot, Luke. You too Maddy!",
      "created_at": "2005-05-17T07:49:23.000Z"
    },
    {
      "author": "erin",
      "body": "wait... where is bill murray?<br/><br/>he is oh so sexy. you know it dan.",
      "created_at": "2005-05-17T09:08:09.000Z"
    },
    {
      "author": "Allison",
      "body": "Bill Murray is an interesting case because looks exponentially older every time he hits the screen.  Back in 93 (circa Groundhog Day), he still looked really young.  Then all of a sudden, poof!  He's like 70 years old!  Did they just lose the jar of makeup they were using on him, or what??",
      "created_at": "2005-05-17T09:18:26.000Z"
    },
    {
      "author": "Oz",
      "body": "It was very odd seeing \"Blossom\" on an episode of Fat Actress.<br/><br/>We've got a few women in common here.  Gillian Anderson...yummy.",
      "created_at": "2005-05-17T16:53:48.000Z"
    },
    {
      "author": "Steve Croxton",
      "body": "Ooooo...Audrey Tautou. 'Amelie' is my favorite film of the past five years. How `bout an Audrey Tautou Film Festival at some point...?",
      "created_at": "2005-05-17T17:18:01.000Z"
    },
    {
      "author": "Nate",
      "body": "What, like all three?",
      "created_at": "2005-05-17T17:28:21.000Z"
    },
    {
      "author": "Nate",
      "body": "Mmmm.  Jenna Von Oy.  No need to clarify who she is, Dan.  I would tune in just to see her in her hats and skirts and have to ignore the Joey and Gin Blossom parts.  Her shtick was that she would get all stressed and start talking fast like the Micro Machine guy.  Cute.<br/><br/>Mmmmm.  Micro Machine guy.",
      "created_at": "2005-05-17T17:37:05.000Z"
    },
    {
      "author": "Nate",
      "body": "I think about that age it was also Danica McKellar, she of the sullen Winnie Cooper who would have about one line an episode on Wonder Years.  I was forever imploring Kevin to smack her and yell, \"Talk, man!\"",
      "created_at": "2005-05-17T17:39:28.000Z"
    },
    {
      "author": "Nate",
      "body": "That new Sonic couple SUCKS compared to the improvisatinal comedy duo that was the first 2 guys.  <br/>What did they do, hold out for raises or something?",
      "created_at": "2005-05-17T17:42:04.000Z"
    },
    {
      "author": "Caleb",
      "body": "A Very Long Engagement comes out next Tuesday. Woot! I have yet to see it but it's from Jean-Pierre Jeunet and stars Audrey Tautou. <br/><br/>2002 was your best year though Dan. With 2003 following closely behind.",
      "created_at": "2005-05-17T17:45:10.000Z"
    },
    {
      "author": "Caleb",
      "body": "Oh - and I meant it comes out on DVD. Although you probably assumed that. We're getting it at Movie Gallery if you haven't seen it yet. I don't know how many copies though. ",
      "created_at": "2005-05-17T17:46:06.000Z"
    },
    {
      "author": "Jed",
      "body": "Hmmm, I think I am still partial to Jessica Biel. Although her movies are crap, she is still smokin hot. I can't wait until a sex tape comes out with her in it...I'll have to buy stock in Jergens and Puffs just in case.  ",
      "created_at": "2005-05-17T20:17:09.000Z"
    },
    {
      "author": "Craig",
      "body": "I think it'd be interesting for you to program a film festival involving the people on this list.<br/><br/>Can't you see it? <br/><br/>Start off with Footloose (Sarah Jessica Parker) followed by Trial and Error (Charlize Theron) and then a special showing of Bat Out of Hell II: Picture Show (Angelina Jolie)...",
      "created_at": "2005-05-17T21:11:44.000Z"
    },
    {
      "author": "Luke",
      "body": "I actually don't know who the Sonic girl is.  I don't think I've seen that commercial.  I wanna now though.",
      "created_at": "2005-05-18T02:27:45.000Z"
    },
    {
      "author": "nicole",
      "body": "Ok, so I begged Dan to put me as someone he had a crush on in 2000. I feel guilty now...",
      "created_at": "2005-05-18T02:51:02.000Z"
    },
    {
      "author": "ava",
      "body": "We have a couple group blogs on the go<br/><br/>http://www.woofactor.com<br/><br/>Care to contribute from time to time on either?",
      "created_at": "2005-05-18T03:06:08.000Z"
    },
    {
      "author": "Fyse",
      "body": "Gwenyth and Natalie would certainly be on my list too. In fact, Natalie Portman would make up a list of her own. What was it you said about her? America's answer to the 10,000 megawatt cuteness of Audrey Tautou? Amen, brother. Amen.",
      "created_at": "2005-05-18T04:33:52.000Z"
    },
    {
      "author": "Maddy",
      "body": "And what about Bradd Pitt?  You know you have a male crush on him!",
      "created_at": "2005-05-18T05:45:37.000Z"
    },
    {
      "author": "Steve",
      "body": "Note to Nate:<br/><br/>Ms. Tautou has done more a few more films than 3, not the least of which is the plum role of Sophie Neveu next year in Opie's 'The DaVinci Code':<br/>  <br/> • The Da Vinci Code (2006) <br/> <br/> • A Very Long Engagement (2004) <br/> <br/> • Dirty Pretty Things (2003) <br/> <br/> • He Loves Me, He Loves Me Not (2003) <br/> <br/> • L'Auberge Espagnole (2003) <br/> <br/> • Not on the Lips (2003) <br/> <br/> • The Spanish Apartment (2003) <br/> <br/> • God is Great, I'm Not (2002) <br/> <br/> • Amelie (2001) <br/> <br/> • Happenstance (2001) <br/> <br/> • Pretty Devils (2000) <br/> <br/> • Venus Beauty Institute (Venus Beaute Institut) (2000)  <br/><br/>Those eyes, man...<br/> <br/> ",
      "created_at": "2005-05-20T22:54:51.000Z"
    },
    {
      "author": "Steve",
      "body": "Correction to previous post:<br/><br/>Ms. Tautou has done a few more films than just 3, not the least of which is the plum role of Sophie Neveu next year in Opie's 'The DaVinci Code':<br/><br/>(yadayadayada, blahblahblah, yakity smakity)<br/><br/>*sigh* This is why I am annoyingly quiet in person; I even put my foot in my mouth in print...geez",
      "created_at": "2005-05-21T01:01:50.000Z"
    },
    {
      "author": "Nate",
      "body": "Argh!  I should have just f***in' IMDB'd it too! Foiled again!  No worries Steve - I'm quite the Tautou gamine fan, and am  aware of most of her movies, even if I haven't seen them all.  Being a fan of something has never stopped me from pokin' a little fun...kinda like Star Wars...<br/><br/>No, really.  Good relations with the Wookies I have!",
      "created_at": "2005-05-24T23:27:55.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
