{
  "id": 217,
  "title": "A call for questions... again",
  "body": "You see, I think the reason(s) I haven't been updating the blog as much is twofold:\r\n\r\n1. More work / progress on the theater = less time to blog. A conundrum, to be sure, when your blog is based on the progress / work going on at the theater.\r\n\r\n2. I've forgotten where we left off. Seriously.\r\n\r\nBut now we have a chance to kill two excuses with one post. If you've been reading this blog regularly, I'm sure there are some points that need clarifying. What's the progress on the theater, Dan? Did the HVAC guys ever finish? Start? Those types of questions are what I'm looking for. Yes, I know we've <a href=\"146\">done this before</a>, but it all <a href=\"147\">worked out in the end</a>.\r\n\r\nHelp me, Old Blog Readers. You're my only hope.\r\n\r\nIt's 12:12 AM right now. I'll take questions until 10:24 PM tomorrow... er, today. The 18th.\r\n\r\n<b>UPDATE</b> - there has been a time extension for your questions... mainly because I scored some tickets to the midnight showing of Star Wars! Woo hoo! I'll write the answer post tomorrow. Do you realize this is the first movie Nicole and I have gone to in the theaters since November 2004? That's what opening a movie theater will do to you, folks. That and give you hemroids.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-05-18T09:12:12.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Luke",
      "body": "When do we get a new phlog that will show us all of the new progress?  It sounds like a lot has been done lately.  How about a virtual tour?\r\n\r\nWhere's your hat?",
      "created_at": "2005-05-18T09:22:47.000Z"
    },
    {
      "author": "Luke",
      "body": "A post or two ago you mentioned that 14 feet of wall space does not equal 14 feet of screen.  Are you guys running into problems with screen size?",
      "created_at": "2005-05-18T09:24:04.000Z"
    },
    {
      "author": "Luke",
      "body": "Hve you replaced/fixed your iPod?",
      "created_at": "2005-05-18T09:25:02.000Z"
    },
    {
      "author": "Nicki J",
      "body": "Who's your favorite video store girl?\r\n\r\nAnd why is she awake at 1:32am when she has to be at work at 9?",
      "created_at": "2005-05-18T10:32:56.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "Uh, Joely Bean and I miss you and Nic. When are you two and Bogey coming up to visit and ride some roller coasters? Cedar Point has a new one! You get the feel of no gravity with it.",
      "created_at": "2005-05-18T16:55:01.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "The last thing I recall is the contractors came back with a smaller proposal because you needed less electricity. And what about the projector booth? Is it built/operational?\r\n\r\nAlso, the 14 sq. feet of wallspace != 14 foot screen I think is on everyone's mind. Is this a huge problem?\r\n\r\nPhlogs are needed as well for the virtual tour So Far (tm).",
      "created_at": "2005-05-18T17:20:25.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "Letseehere, for starters...\r\n\r\n1. The Moxie window coverings\r\n\r\n2. Proof of your Scene It? championship status. A photo of the title belt will do.\r\n\r\n3. Did we learn to play nice with with subcons, GC, bank, and various other authority figures?\r\n\r\n4. Who (or what) chewed you out to spawn the etymological discussion on the phrase?",
      "created_at": "2005-05-18T17:22:23.000Z"
    },
    {
      "author": "nicholas",
      "body": "How are relations with distributors? Are they wondering when you'll open/ready to get movies to you? Is all of that lined out?",
      "created_at": "2005-05-18T19:28:37.000Z"
    },
    {
      "author": "Caleb",
      "body": "Why don't you ever rent movies when I am working?\r\n\r\nDid the guy in the RV ever leave?\r\n\r\nWho is your favorite movie critic? Or do you hate them all?\r\n\r\nWhat IS the airspeed velocity of an unladen swallow?\r\n\r\nWhatever happened to predictability?",
      "created_at": "2005-05-18T19:31:22.000Z"
    },
    {
      "author": "Caleb",
      "body": "Oh, and are you still planning on having a \"preview\" night for blog readers when you open? And if so, any idea what movie you might be showing? A new one or classic?",
      "created_at": "2005-05-18T19:32:13.000Z"
    },
    {
      "author": "whitty",
      "body": "I am worried about Benzo.  Once you go all Darth, can you go back? I mean, without being killed by your son, deathbed confessions and becoming a luminous smiling ghost and all.\r\n\r\nAlso, I hope you and Nicole are getting enough downtime, you guys sound stressed and busy. ",
      "created_at": "2005-05-18T20:07:02.000Z"
    },
    {
      "author": "J.R.",
      "body": "Hope you don't explode, crazy head!",
      "created_at": "2005-05-18T20:36:54.000Z"
    },
    {
      "author": "DUG",
      "body": "Just go ahead and tell your favorite big blue dido story.  You know you want to!",
      "created_at": "2005-05-18T23:28:17.000Z"
    },
    {
      "author": "Nicole",
      "body": "Will Jack Bauer save America?\r\n\r\nWhen do I get to stop working temp jobs?",
      "created_at": "2005-05-18T23:32:10.000Z"
    },
    {
      "author": "Nate",
      "body": "\"Big blue dido\"?\r\n\r\nIs Eminem choking her in an MTV video duet or what?\r\n\r\nBack on the ranch...\r\n\r\nLittle brother JUST scored both his older siblings tickets to the officially \"NOT THAT CRAPPY\" STAR WARS!!!!\r\n\r\nCrank up the music and make the lightsabre noises, brah.",
      "created_at": "2005-05-19T00:02:21.000Z"
    },
    {
      "author": "Dave",
      "body": "in the moxie bathrooms... will the stalls go all the way down to the floor?",
      "created_at": "2005-05-19T00:56:17.000Z"
    },
    {
      "author": "Nicki J",
      "body": "When I see \"Big Blue Dido\" I don't really see \"Dido\"... Am I just a perv?",
      "created_at": "2005-05-19T02:30:10.000Z"
    },
    {
      "author": "Allison",
      "body": "Nicki J -- if you're a perv, so am I.\r\n\r\nAlso -- how is advertising and collaborating with the neighbors going?  Any exciting ideas come up... like little Moxie Quiches?",
      "created_at": "2005-05-19T04:02:19.000Z"
    },
    {
      "author": "erin",
      "body": "add me to the list of perves.",
      "created_at": "2005-05-19T04:57:47.000Z"
    },
    {
      "author": "nicole",
      "body": "Did DUG actually mean dildo or dido? That's my question.\r\n\r\nAnd, what did you think of Star Wars? ",
      "created_at": "2005-05-19T06:16:58.000Z"
    },
    {
      "author": "Maddy",
      "body": "What was the final decision in the Custard/Yogurt war?  And the coffee is coming from?  The beer?  You know, your choice of beverages and food will play a large role in my attendance.\r\n\r\n(But you don't want to have too much good food or we won't be able to fit in the tiny chairs, right?)",
      "created_at": "2005-05-19T06:22:52.000Z"
    },
    {
      "author": "Nate",
      "body": "Hold me like you did by the lake on Naboo.\r\n\r\nMeh.\r\n\r\nBut \"Shark Boy and Lava Girl\" looks to ROCK!!!",
      "created_at": "2005-05-19T17:51:28.000Z"
    },
    {
      "author": "Tawny",
      "body": "Will your patrons get to request movies? Will you do a customer appreication evening and show the movie with the most requests? If so, may we start requesting now? ",
      "created_at": "2005-05-19T18:52:47.000Z"
    },
    {
      "author": "DUG",
      "body": "That was the only Star Wars I've ever seen where everyone was balling in the theater.  And some of the flying scenes almost made me vomit, but it was awesome, awesome, awesome!!!!!!!!!!!!!",
      "created_at": "2005-05-19T20:51:37.000Z"
    },
    {
      "author": "Nate",
      "body": "Hemmoroids?  There's a \"big blue Dido\" joke there that I could make.\r\n\r\nBut I won't, because good relations with the Wookies I have.",
      "created_at": "2005-05-19T21:52:55.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    }
  ]
}
