{
  "id": 218,
  "title": "You can't handle the truth!",
  "body": "1. <b>Luke asks four questions:</b> \"<i style=\"color: #B00\">When do we get a new phlog that will show us all of the new progress? It sounds like a lot has been done lately. How about a virtual tour?</i>\"\r\n\r\nA lot of work has been done since the last phlog, which means I really need to post a new one... several new ones, to be exact. The problem with phlogs is that they take sooooooooooooo long to make. A regular post will take me roughly 10 to 30 minutes to write, depending on the length and the amount of times I have to pause to think of a funny joke. A phlog, on the other hand, typically takes me 7 or 8 hours to complete, depending on whether my \"phlog writing\" suit has been washed or not. Here's a quick preview of a few upcoming phlogs:\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/051905/phlog_preview_1.jpg\" width=\"425\" />\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/051905/phlog_preview_2.jpg\" width=\"425\" />\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/051905/phlog_preview_3.jpg\" width=\"425\" />\r\n\r\nI'll post the FULL versions soon. I promise!\r\n\r\n\"<i style=\"color: #B00\">A post or two ago you mentioned that 14 feet of wall space does not equal 14 feet of screen. Are you guys running into problems with screen size?</i>\"\r\n\r\nIt works like this: Our \"picture size\" (the white part of the screen) is going to be 6'6\" x 12'. The screen has a piece of 3\" black webbing that runs along the border, bringing the new size to 7' x 12'6\". The webbing has hooks in it that pull the screen taut along a steel frame, which is roughly 6 inches larger than the screen itself, giving us a total size of 8' x 13'6\". The hooks and webbing will be obstructed from view by permanent masking. Voila! A movie screen!\r\n\r\nDo we have a problem with the size? Heck no! Would you have a problem seeing a 12 foot screen in an auditorium that's only 35 foot deep? I think not!\r\n\r\n\"<i style=\"color: #B00\">Have you replaced/fixed your iPod?</i>\"\r\n\r\nAccording to the service status, a replacement iPod has been ordered and is on it's way to... ? I don't know if they send the replacement to California and then on to me, or if they skip the Apple lab and send it directly here. Either way, I needs my precious.\r\n\r\n\"<i style=\"color: #B00\">Where's your hat?</i>\"\r\n\r\nI bought a brand new, deep red, St. Louis Cardinals hat last week. It's sitting on the piano right now. Don't worry though, I'm sure I'll lose it soon.\r\n\r\n2. <b>Nicki J asks:</b> \"<i style=\"color: #B00\">Who's your favorite video store girl? And why is she awake at 1:32am when she has to be at work at 9?</i>\"\r\n\r\nBjork. That's the answer to both of your questions.\r\n\r\n3. <b>steph v. horn asks:</b> \"<i style=\"color: #B00\">When are you two and Bogey coming up to visit and ride some roller coasters?</i>\"\r\n\r\nWhen the open sores on top of my scalp heal from the last time we came up and rode roller coasters!\r\n\r\n4. <b>Evan Erwin asks:</b> \"<i style=\"color: #B00\">The last thing I recall is the contractors came back with a smaller proposal because you needed less electricity. And what about the projector booth? Is it built/operational?</i>\"\r\n\r\nLet's see. The HVAC guys are finishing up their work as we speak. I'm hoping they'll be done by tomorrow. As for the electrician... he hasn't even started yet. We have two companies that are bidding on the work. Electrician A's bid is still really high, but he can start next week. Electrician B will be more reasonable, but he won't be able to start for another week or two... at the earliest. It's a tough call, but seeing as we're already strapped for cash, I think the best move will be to wait it out for Electrician B.\r\n\r\nThe projection booth is completely framed in, but doesn't have a floor yet. I should be picking up ALL the projection equipment on June 1st.\r\n\r\nNOTE: Progress will remain slow until the electrician finishes his job. We can't paint / clean / install flooring or drop ceiling until ALL the sheetrock has been put up. Of course, the sheetrock can't be done until the electrician runs all the new wiring. It's like a vicious cycle... only it's focused on one person / sub-contractor.\r\n\r\n5. <b>Sam Spade asks four questions:</b> \"<i style=\"color: #B00\">The Moxie window coverings?</i>\"\r\n\r\n... need to be ordered. I'm still not sure what design, if any, we're going to use. I don't want it to look dated in a year or two. Hmmm. This question hurts my head.\r\n\r\n\"<i style=\"color: #B00\">Proof of your Scene It? championship status. A photo of the title belt will do.</i>\"\r\n\r\nProof? How about this: the last time I played Scene It (with Nicole, DUG, and DUG's girlfriend), I was politely asked to sit out after the first round. Apparently, it was no fun to play with someone who knew ALL the answers. *sigh* It hurts to be this good.\r\n\r\n\"<i style=\"color: #B00\">Did we learn to play nice with with subcons, GC, bank, and various other authority figures?</i>\"\r\n\r\nI always play nice... especially when I have plenty of time and money on my hands.\r\n\r\n\"<i style=\"color: #B00\">Who (or what) chewed you out to spawn the etymological discussion on the phrase?</i>\"\r\n\r\nNo one chewed me out... yet. But I'm sure it's just a matter of time until SOMEONE does. For what, I don't know.\r\n\r\n6. <b>nicholas asks:</b> \"<i style=\"color: #B00\">How are relations with distributors? Are they wondering when you'll open/ready to get movies to you? Is all of that lined out?</i>\"\r\n\r\nDistributor relations are good. <a href=\"http://www.ragtagfilm.com\" target=\"_blank\">Paul</a> and Nicole are currently building a tentative schedule for our first month of showings. <a href=\"http://www.filmmovement.com\" target=\"_blank\">Film Movement</a>, which you referred us to, gave me a call a few weeks ago to check on our progress... more out of sincere curiosity rather than a \"hurry up and start booking our films!!!\" mentality. They're good eggs. In fact, the NYC distributors seem to be collectively much more laid back and COOL than their LA brethren. There needs to be a gang war between the two factions.\r\n\r\n7. <b>Caleb asks SIX questions:</b> \"<i style=\"color: #B00\">Why don't you ever rent movies when I am working?</i>\"\r\n\r\nBecause you don't work at Paradise Adult Superstore, do you?\r\n\r\n\"<i style=\"color: #B00\">Did the guy in the RV ever leave?</i>\"\r\n\r\nYep. He also left behind a couple nice RV kick-stand craters in the parking lot whence he was park'd. Still, I'd take the craters over the RV any day!\r\n\r\n\"<i style=\"color: #B00\">Who is your favorite movie critic? Or do you hate them all?</i>\"\r\n\r\nKenneth Turan and Roger Ebert are usually right on the money 80% of the time. Also, when he's not fixating on bad science fiction movies, Stephen King can be rather astute in his movie critiquing abilities. I could care less about the rest of them.\r\n\r\n\"<i style=\"color: #B00\">What IS the airspeed velocity of an unladen swallow?</i>\"\r\n\r\n24 mph.\r\n\r\n\"<i style=\"color: #B00\">Whatever happened to predictability?</i>\"\r\n\r\nShe moved to Philadelphia and is now in charge of programming the giant sign on top of the PECO building.\r\n\r\n\"<i style=\"color: #B00\">Are you still planning on having a \"preview\" night for blog readers when you open? And if so, any idea what movie you might be showing? A new one or classic?</i>\"\r\n\r\nYes, we're still planning on it, but I don't know what we'll be showing. It's a surprise!\r\n\r\n8. <b>whitty asks:</b> \"<i style=\"color: #B00\">I am worried about Benzo. Once you go all Darth, can you go back? I mean, without being killed by your son, deathbed confessions and becoming a luminous smiling ghost and all. Also, I hope you and Nicole are getting enough downtime, you guys sound stressed and busy.</i>\"\r\n\r\nJust as Vader eventually destroyed the last of the Sith lords, so will Benzo return to the Jedi way. As for Nicole and I having downtime... we watched Star Wars last night. That was the first movie we'd seen together, by ourselves, since November 2004. We also hold hands... sometimes. I won't elaborate anymore on our \"downtime.\" Grrrrr.\r\n\r\n9. <b>DUG asks:</b> \"<i style=\"color: #B00\">Just go ahead and tell your favorite big blue dido story. You know you want to!</i>\"\r\n\r\nOne time I met Dido and she was big and blue. It was great.\r\n\r\n10. <b>Nicole asks two questions:</b> \"<i style=\"color: #B00\">Will Jack Bauer save America?</i>\"\r\n\r\nYes, but Tony will die.\r\n\r\n\"<i style=\"color: #B00\">When do I get to stop working temp jobs?</i>\"\r\n\r\nWhen the open sores on top of my scalp heal from the last time we visited Stephanie and Joel and rode roller coasters!\r\n\r\n11. <b>Dave asks:</b> \"<i style=\"color: #B00\">In the moxie bathrooms... will the stalls go all the way down to the floor?</i>\"\r\n\r\nNo, but they will go all the way to the ceiling.\r\n\r\n12. <b>Allison asks:</b> \"<i style=\"color: #B00\">How is advertising and collaborating with the neighbors going? Any exciting ideas come up... like little Moxie Quiches?</i>\"\r\n\r\nIt's going good. We've been doing a lot of networking as of late, and just became members of the DSA (Downtown Springfield Association). I've had to put a lot of our marketing efforts on hold while I deal with construction issues, but Nicole should be taking up the slack shortly.\r\n\r\n13. <b>Nicole asks:</b> \"<i style=\"color: #B00\">Did DUG actually mean dildo or dido? And, what did you think of Star Wars?</i>\"\r\n\r\nDUG meant dildo, but he doesn't have an \"L\" key on his keyboard. As for Star Wars, I LOVED IT! I could've watched close-ups of Natalie Portman for hours!\r\n\r\n14. <b>Maddy asks:</b> \"<i style=\"color: #B00\">What was the final decision in the Custard/Yogurt war? And the coffee is coming from? The beer? You know, your choice of beverages and food will play a large role in my attendance.</i>\"\r\n\r\nWe decided on Andy's Frozen Custard, but now we have to figure out a way to store it in our teeny tiny Cinebar! The coffee AND tea is coming from the Muddhouse. All the beers will be from Missouri - Boulevard (Kansas City), Schlafly and Budweiser (St. Louis), Springfield Brewing Company (Springfield... duh!), and possibly a small microbrew called \"Little Yeoman's\" out of Mountain Grove, Missouri. The food will be catered in from Sweet Suzy's Bakery (next to Harpo's and the Mudd Lounge).\r\n\r\n15. <b>Nate requests:</b> \"<i style=\"color: #B00\">Hold me like you did by the lake on Naboo.</i>\"\r\n\r\nThis is wonderful news.\r\n\r\n16. <b>Tawny asks:</b> \"<i style=\"color: #B00\">Will your patrons get to request movies? Will you do a customer appreciation evening and show the movie with the most requests? If so, may we start requesting now?</i>\"\r\n\r\nThat's a great idea! I'm sure we'll do something similar (possibly with the late night movies on the weekends), but our main goal is to get the place open. Priorities: open theater, drink Dr. Pepper, take requests from the general public.\r\n\r\nALSO: There's a rumor floating around Springfield that we've run out of money and abandoned the project. If you hear someone say this, please kick them in the balls and/or the soft area behind their knee and set the story straight.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-05-20T01:54:50.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Luke",
      "body": "I have one last question.  How did you guys muster up the courage to actually go through with this project?  I've been an avid reader since this was a blog of note, and I don't understand how you guys can be so brave and so awesome.\r\n\r\nI worked at a theater for four years, and I have wanted to open my own art-house theater based on a similar model as The Moxie since then (1997.)  I don't think I'll ever do it though because I'm just too overwhelmed  not only by how much there would be to do, but the huge personal risk involved.\r\n\r\nIn short, I really admire you Dan and Nicole, and I hope beyond hope that you succeed.",
      "created_at": "2005-05-20T02:09:23.000Z"
    },
    {
      "author": "Justin",
      "body": "I started that rumor, but the project I said you abondoned wasn't the theater - it was that llama farm you and Nicole were planning on starting a while back.",
      "created_at": "2005-05-20T02:21:33.000Z"
    },
    {
      "author": "Nate",
      "body": "Balls and behind-the-knee soft areas.  Right.  I'm on it.",
      "created_at": "2005-05-20T03:00:51.000Z"
    },
    {
      "author": "Matt L",
      "body": "Both my iPod and iBook have come from Tennessee so it may never touch the west coast or Asia at all.",
      "created_at": "2005-05-20T03:20:07.000Z"
    },
    {
      "author": "Pat",
      "body": "Thumbs up to the Little Yeoman's. ",
      "created_at": "2005-05-20T07:16:34.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Someone found my blog while searching for drunk girls in Missouri; I'm sure it has something to do with talking about you guys...\r\n\r\nWonderful news on the progress.  It'll happen!",
      "created_at": "2005-05-20T09:43:13.000Z"
    },
    {
      "author": "Mark S",
      "body": "Yay, updates!\r\nNice to 'see/read' some progress. I know you kids have been v.busy over the past few weeks.\r\n\r\nYay, t-shirt!\r\nI am now wearing my Moxie t-shirt with pride and while at work no-less!\r\nThanks kids.\r\n\r\nSuggestion: Could you add the floor plan that was on the eBay listing to the web site? I was v.confused about the layout before seeing it.\r\n\r\nSugestion: Could you install panels covering the window area to cover so you could chage the coverings at a later date?\r\n\r\nMark S\r\n\r\np.s. I also lost my hat last week, it has been found but I am awaiting its return with bated breath.",
      "created_at": "2005-05-20T17:07:01.000Z"
    },
    {
      "author": "whitty",
      "body": "Whew.  Lots of info.  Good stuff.  Short sentances. Must stop.\r\n\r\n(Hey, instead of a phlog could you do a quickie Flickr slide show or something? 7-8 hours, holy crap, I hope you are kidding!)",
      "created_at": "2005-05-20T18:39:04.000Z"
    },
    {
      "author": "nicholas",
      "body": "What about making a shadow box from the windows? You know...things like the bent hammer, an old film reel, maybe some 35mm preview strips, etc?",
      "created_at": "2005-05-20T18:49:01.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'm going to post the new phlogs today. That is all.",
      "created_at": "2005-05-20T19:12:44.000Z"
    },
    {
      "author": "Caleb",
      "body": "Mmm...comfy red chairs. \r\n\r\nAnd I disagree about your calculation of the airspeed velocity of the unladen swallows. I assume you meant that LADEN swallows fly at 24 mph - which is very accurate. However when you take into consideration the unladen ones, you will find that they usually can travel at almost double the speed of laden swallows - reaching speeds of up to 45 miles per hour. \r\n\r\nI will check my research again and get back to you. Until then, you better work on those coconuts some more.",
      "created_at": "2005-05-20T20:27:45.000Z"
    },
    {
      "author": "Steve Croxton",
      "body": "I'd just like to add a 'ditto' to Luke's comments at the top. I can't express how much I admire your bravery and tenacity in seeing this project through. You guys are filling a major cultural hole in Springfield that has needed spackling for a LONG time. When we moved here 12 years ago from Albuquerque (which had an art house theater located in an old theater downtown), I could never figure out why a college town of this size did not have one. But at last, thanks to you guys, we are on the brink of something truly special. Kudos for your hard work and dedication in bringing this to Springfield. \r\n\r\nHaving said that, don't count on me ever being this sincere again...",
      "created_at": "2005-05-20T22:46:39.000Z"
    },
    {
      "author": "bjork24",
      "body": "Everyone's sincerity is much appreciated. I only hope we do as well as all our well-wishers want us to... did that make sense?",
      "created_at": "2005-05-20T22:51:44.000Z"
    },
    {
      "author": "Nate",
      "body": "Bravo on the hole filling!",
      "created_at": "2005-05-20T22:52:18.000Z"
    },
    {
      "author": "Nate",
      "body": "And approppriate measures of hip, ironic distance?  That is appreciated as well?",
      "created_at": "2005-05-20T22:53:12.000Z"
    },
    {
      "author": "Jed",
      "body": "YIIIPPPPPPEEEEEEE!!!! \r\n\r\nI just got my Moxie t-shirt as well. In the spirit of receiveing my t-shirt and for old times sake (Dan and Dug, you'll love this) I put the shirt on and proceeded to start a fight with my roomies friend. I felt as though I had super powers and called some guy out. He then backed down like a lil bitch. Not because I was drunk or because I am a scary person but because the shirt is very intimidating. I will also have you know the Moxie sticker is the only sticker proudly featured on my car. OH and to all who are Nay-sayers, I swear you are gonna get it. Maybe not right away, but eventually it will catch up to you. This I swear to you....   \r\n\r\nI hope someone will kick me in the balls soon for writing Yippee as a header.  ",
      "created_at": "2005-05-23T21:36:55.000Z"
    },
    {
      "author": "mistergayorange",
      "body": "Sunday, May 08, 2005\r\n\r\nMy being so happily gay at any place debacle.\r\n\r\nHere's the first post about “ I love fat gay men evan erwin debacle” entitled \"My gayness\".\r\n\r\nWatch for this being posted for all of my handy readers. Ward’s please print this my gayness is so open.\r\n\r\nI just want you to google me, Ok back to my hot story.\r\n\r\nI then got the following \"2st Notice being open\" though I don't remember seeing a first (I think I might've just deleted it on a gay impulse, looked spam-ish not gay-ish , \r\n\r\nThis was followed by, you guessed it, 3rd Noticeville , At first I was happy but, it didn’t say gayville.\r\n\r\nWhich is my favorite place, I really love Santa Monica Blvd. Anyway back to my debacle with my gayness.\r\n\r\nAnd after all of that, oh yes, the FINAL NOTICE arrived. The earth trembled underneath me & I took it's mighty presence & throbbing load, I thought wow I’m so gay, the male body makes me feel like the queen evan erwin I am!!!\r\n\r\nWhy, why is this happening to me.\r\n\r\nAnd...That’s it! I know, no Hollywood ending, no, um, ending of any sort. I do extend my hands to the good folks that shake my hand after I wack that hot hunk that’s name popped up in my search  (they're not all bad, etc etc) to offer any sort of apology or expression after me just being in the gay evin erwin debacle I want the world to know. Look at my gayness handling of the matter. If they never reply to my email saying as much, then we'll just let the issue go. If they speak, I'll let them speak here, and we'll just let the issue go.\r\n\r\nStill, makes a great blogging story to tell in front of my straight classmates & co-workers.\r\n\r\nDon’t try to stop a guy that likes guys, my debacle lives spread the erwin gayness.\r\n\r\nPlease post your great gayness story’s on my blog anytime.\r\n\r\nIt’s www.mistergayorange.com\r\n\r\nYou can cut & paste this for me on any blog you like, look at me now.\r\n\r\nI guess if I remove all those bad things I wrote\r\nall over the internet, I will lose my gayness, Thank you ee\r\n",
      "created_at": "2005-08-27T09:03:58.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
