{
  "id": 219,
  "title": "I'm sorry, but I don't speak Whinese.",
  "body": "Four new phlogs. No more whining. Word to your mother!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-05-20T23:40:51.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Luke",
      "body": "Thanks Dan.  That must have taken forever.",
      "created_at": "2005-05-20T23:54:26.000Z"
    },
    {
      "author": "bjork24",
      "body": "I started at 11:43 AM... on Tuesday.",
      "created_at": "2005-05-20T23:55:53.000Z"
    },
    {
      "author": "Luke",
      "body": "The theater is really coming along.  With all of the walls partially built, it's much easier to see what the place is going to look like.  Looking good!",
      "created_at": "2005-05-21T00:01:44.000Z"
    },
    {
      "author": "nathan springer",
      "body": "AHHHHH 4 all at one time i think i might explode",
      "created_at": "2005-05-21T01:56:12.000Z"
    },
    {
      "author": "nicholas",
      "body": "What stereo system are you going to use? 5.1, 4.1, 7.1, Old School Stereo, Mono?",
      "created_at": "2005-05-21T02:22:28.000Z"
    },
    {
      "author": "bjork24",
      "body": "It's called center-surround. The center backstage channel handles mid-range, the sub handles the bass, and the 6 surround speakers handle the left-right / front-back. It's a pretty good set-up for our little auditorium.",
      "created_at": "2005-05-21T02:26:50.000Z"
    },
    {
      "author": "justin",
      "body": "Is it a special screen that allows sound waves to pass through?",
      "created_at": "2005-05-21T02:27:16.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yep. It has tiny holes in it to prevent it from moving when the sound waves pass through.",
      "created_at": "2005-05-21T02:34:12.000Z"
    },
    {
      "author": "J.R.",
      "body": "But what about the Gas waves?",
      "created_at": "2005-05-22T00:03:13.000Z"
    },
    {
      "author": "Nicki J",
      "body": "While I was whoring around downtown with Caleb and Stephanie tonight, I wore my Moxie shirt to act as a walking billboard (please, no fat jokes). We popped into Well Fed Head for a few minutes and the woman at the counter informed us that she was a blog reader. I'm anti-social and social-phobic, so I didn't think to ask her name or if she ever posted any comments.<br/><br/>But that's my story. I hope you enjoyed.",
      "created_at": "2005-05-22T08:35:05.000Z"
    },
    {
      "author": "Caleb",
      "body": "Yeah, I thought about asking her name but I thought she might have been frightened by me or something - cause that would be understandable. On a side note though, Well Fed Head is one kickass bookstore. And Trolley's has HORRIBLE service (or maybe we were just really unlucky).<br/><br/>Also - people probably think you're strange when you're standing on the side of the street just staring at the Moxie with your mouth open and drool dripping. So hopefully someone will be nice enough to say \"why are you standing here staring at a building?\"",
      "created_at": "2005-05-22T10:43:10.000Z"
    },
    {
      "author": "Liz",
      "body": "Yay phlogs...  Hey, on Tuesday it'll be a year since your first post! I went back and read it and was reminded of how freaking awesome it is that you've come so far.  Many much kudos to you and Nicole.",
      "created_at": "2005-05-23T05:47:58.000Z"
    },
    {
      "author": "Allison",
      "body": "I request that you show StoreWars at your theatre.  http://www.storewars.org/flash/",
      "created_at": "2005-05-23T10:09:26.000Z"
    },
    {
      "author": "Jed",
      "body": "YIIIPPPPPPEEEEEEE!!!! <br/><br/>I just got my Moxie t-shirt as well. In the spirit of receiveing my t-shirt and for old times sake (Dan and Dug, you'll love this) I put the shirt on and proceeded to start a fight with my roomies friend. I felt as though I had super powers and called some guy out. He then backed down like a lil bitch. Not because I was drunk or because I am a scary person but because the shirt is very intimidating. I will also have you know the Moxie sticker is the only sticker proudly featured on my car. OH and to all who are Nay-sayers, I swear you are gonna get it. Maybe not right away, but eventually it will catch up to you. This I swear to you.... <br/><br/>I hope someone will kick me in the balls soon for writing Yippee as a header. ",
      "created_at": "2005-05-24T01:24:17.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
