{
  "id": 22,
  "title": "The tide has turned",
  "body": "Well, it was fun while it lasted, but it looks as though the incredible influx of traffic resulting from being named a \"Blog of Note\" is coming to a slow and steady stop. Not that I mind so much, but the added exposure was nice. Still, I was happy writing this blog when the only people reading it were myself, Nicole, and <a href=\"http://www.justinglow.com\" target=\"_blank\">Justin</a>. I'd say the majority of people who stop by are immediately scared off once they get a glance at how long one of my typical posts are, but for those of you who stuck around, and continue to drop by, I give you my most sincere thanks.\r\n\r\nToday's post will be dedicated to you, my loyal readers and commenters, without which I would not be able to have a post dedicated to my loyal readers and commenters. My posts have generated a lot of comments, some more than others, so I'd like to take a moment to comment on a few of them, after which time, you can then feel free to comment on the comments I commented on yourself. So let's get started...\r\n\r\n<b>Bringing Up Baby</b>\r\n\r\n\"<i>My wife and I would take in about 10 times the number of movies we do now if there was some viable option for our daughter.</i>\"\r\n\r\n\"<i>One suggestion: as a mother of four, it would be nice if there were Mommy Days.</i>\"\r\n\r\nThis is a great idea. Nicole and I have talked about doing something similar to this on numerous occasions. We'd like to screen children's classics (think <i>Mary Poppins</i>, <i>Heidi</i>, or <i>A Clockwork Orange</i>) at least once a month - maybe more if attendance warrants it. The show would be during the early part of the day, which would allow us plenty of time to clean up before the evening shows, and we'd be sure to offer plenty of cavity-endorsing, gummi-based, dinner-ruining candy to assure an optimal movie-watching attention span amongst the youngsters.\r\n\r\n<b>I Can't Believe It's Not Butter!</b>\r\n\r\n\"<i>I think that one of the biggest draws is having REAL butter on the popcorn. People come just for that.</i>\"\r\n\r\n\"<i>Now what's up with this no-butter shit? I'm a popcorn fanatic, but it ain't no good without no butta.</i>\"\r\n\r\nWe hear you loud and clear - butter is good, but have you ever had to clean a butter dispenser at the end of a ten hour concession shift. Let me put it in context for you. Cleaning a butter dispenser is akin to splitting open a pig carcass and removing the boiling contents from its stomach. You don't want to touch the steaming, putrid sides of the thoracic cavity, or else you'll run the risk of severely burning yourself or getting curdled fat stuck to your skin... forever. It smells bad, it's disgusting, it's wasteful, and you and I both know it's not very good for you. However, I don't want to push my beliefs onto anyone else, so if you want to bring in your own stick of butter and melt it all over the top of your DAMN HUGE combo meal... go right ahead. Knock yourself out.\r\n\r\n<b>Pre-show Advertising</b>\r\n\r\n\"<i>I do not know how much work you want to put into your slide program, but I suggest trying to make the slides yourself using digital photography a some photoshopping and sell the advertising yourself to your local downtown businesses.</i>\"\r\n\r\n\"<i>I think I would rather enjoy a few well done ads, comedic or dramatic, as long as they didn't include the Fantanas.</i>\"\r\n\r\nYes, we do plan on building our own ads in-house. I used to work as an advertising coordinator for a real estate company a few years back, so it shouldn't be much of a problem. We'll buy a nice DLP projector for each auditorium and I'll concoct some sort of flash program that will allow me to integrate moving and static ads into the pre-show lineup, along with the occasional <a href=\"/posts/15\">video feed of the audience staring back at themselves</a>. I also plan on having a multi-racial group of colorfully clothed singers called the Dantanas. They'll ride jet skis and harass people in full-body casts.\r\n\r\n<b>Intermissions</b>\r\n\r\n\"<i>I'd rather wear a diaper and piss my pants than pause during the climax. But I'm a pig that way.</i>\"\r\n\r\nHmmm, we better make sure our seats are spill-proof. Nicole and I haven't come to a conclusion about whether we'll use intermissions or not. Yes, they'd be great for concession sales, but a major pain when it comes to finding an appropriate stopping place. We'll keep you posted.\r\n\r\n<b>Harry, Your Hands Are Freezing!</b>\r\n\r\n\"<i>... I purchased about 10 fleece lap blankets that customers can pick up on their way in. I haven't heard anyone complain about the heat or A/C since!</i>\"\r\n\r\nNicole loves this idea. She wants to buy yards and yards of fleece and fashion it into moderately-sized theater blankets, which we'd then sell to chilly clientele at our Cinebar. We'd considered only keeping a few on hand and letting patrons \"borrow\" them, but who knows what would get on them over time. I'd hate to see what a couple frisky teenagers, and/or senior citizens, would do with said blanket. Time for the <a href=\"/posts/15\">screen camera</a>!\r\n\r\n<b>Midwestburg?</b>\r\n\r\n\"<i>... and for what it's worth I'd pay a visit to your venue if I knew where this mystery town was. [All of which have been promised to be disclosed at the proper junction.]</i>\"\r\n\r\nCorrect. Midwestburg's true identity will be unveiled in the coming months, but if you really, really, really want a hint, I can tell you this: it's close to <font color=\"orange\"><b>[ BLOGGER EXCEPTION ERROR 480 - Please republish ]</b></font>, which isn't too terribly far away.\r\n\r\n<b>Insert Creative Title Here</b>\r\n\r\n\"<i>so far I have spotted a number of serious errors that are entirely unacceptable. Please kill yourself immediately.</i>\"\r\n\r\nIts true, I sometime don't proof my posts as well as I shuld, but I think my points stil get across ,\r\n\r\n\"<i>I am learning at your expense. sorry.</i>\"\r\n\r\nThat's okay, blogger isn't that expensive at all. In fact, it's free!\r\n\r\n\"<i>Work Harder, it pays off!!!!!!</i>\"\r\n\r\nWill do, but on the off chance that it doesn't pay off... I'll find you.\r\n\r\n\"<i>how do i get favorites, and links on my blong site?</i>\"\r\n\r\nI will forever refer to this site as my blong.\r\n\r\n\"<i>write some LESS YOU FUCK .. :grade 0.1</i>\"\r\n\r\nYes, it's true, my posts do tend to be a bit long in the tooth, but you've read this far, right? Right? Right? Hello?\r\n",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-06-18T22:30:12.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Oz",
      "body": "I'm still here..... :)",
      "created_at": "2004-06-19T00:05:36.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Oz, you're a very loyal reader! I'm going to go read your blog right now.",
      "created_at": "2004-06-19T00:25:00.000Z"
    },
    {
      "author": "Amy",
      "body": "Funny how someone took the time to actually write out a complaint:\r\n\r\n\"write some LESS YOU FUCK .. :grade 0.1\"\r\n\r\nabout how much you write when the time spent typing it in could have been used to finish reading your posts. Or hey, great idea...just stop reading it if it gets too long. Geez, the g*d d*mn m*therf**king anger this b*stards spew out is f**king amazing.",
      "created_at": "2004-06-19T00:31:07.000Z"
    },
    {
      "author": "Kameron",
      "body": "rofl . . . A Clockwork Orange . . . children's classic . . . tries to catch breath.",
      "created_at": "2004-06-19T00:32:23.000Z"
    },
    {
      "author": "bjork24",
      "body": "Amy, I couldn't f**king agree with you any f**king more than I f**cking do right f**king now. The nerve of that stupid m*therf**ker!\r\n\r\nKameron, breath. Breath. Breath... and then join Amy and me in cussing out that stupid m*therf**ker!",
      "created_at": "2004-06-19T00:39:02.000Z"
    },
    {
      "author": "Stef",
      "body": "Hey I'm still here and I LOVE your blog. I myself would like to start my own theater but wouldn't have a clue how to do it.  (Don't worry I'm far far away from Midwestburg.) I'm learning so much from you, please keep us posted.  Just something to note, they have a series up here called \"Movie for Mommies\" where they show all kinds of films (adult and kids films) and you can bring all the crying babies you want.  Apparently its pretty successuful.",
      "created_at": "2004-06-19T00:45:55.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Stef! We're really looking into the \"Movie for Mommies.\" Several theaters have had success with it, so I'm willing to give it a shot.",
      "created_at": "2004-06-19T01:00:41.000Z"
    },
    {
      "author": "Pat Coleman",
      "body": "I write as if English is my second langauge and I don't care. Please keep posting. I'm enjoying it and guess what? I'm also learning a little too. By the way, love Netflix as well.",
      "created_at": "2004-06-19T05:09:29.000Z"
    },
    {
      "author": "Newell",
      "body": "When I write stuff on my blog I sometimes get a bit long winded as well. I used to worry about that but got over it after a while. I figure a) I'm writing mostly for myself. If other people get enjoyment out of it, good. b) The only people that really matter are the ones that can appreciate the time it takes to make a good point.",
      "created_at": "2004-06-19T07:32:08.000Z"
    },
    {
      "author": "Chalrey Bravo",
      "body": "I'ma go ahead and tell the truth and say that I haven't read any of your posts except for an excerpt, and then the one you recently posted.  I intend to because I am interested in what I have read.  I work in the theatre industry out in California so I imagine i can relate to what you have to say, or at least have a suggestion or two.  Working at some of the higher profile theatres in existence, I imagine I've gathered some knowledge of the business along the way.  Anyway, I hope it works out for you.",
      "created_at": "2004-06-19T15:09:13.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Wow, you guys are truly inspiring. If there was any 'Dream job' it would be running a theater, and an art-house one no less! That is fantastic.\r\n\r\nI'll keep reading, and hoping that you guys can find the means to make this happen.\r\n\r\nOne of the most fascinating blogs I've ever read. I hope the story doesn't end...",
      "created_at": "2004-06-19T17:40:15.000Z"
    },
    {
      "author": "Alex Hamilton",
      "body": "hey all,\r\nGreat blog by the way. \r\nI timed the amount of adverts before a film started once.. yes its over 30 mins..\r\n\r\n34 mins and 25 seconds...\r\n\r\nits most amusing",
      "created_at": "2004-06-19T20:56:10.000Z"
    },
    {
      "author": "Diane",
      "body": "Hmmmm as I've just recently stumbled along this blog I must say I'm impressed. Your wit is intriqueing, and keeps me very much amused- impressive since I have ADHD...keep up the good...ohhhh a butterfly",
      "created_at": "2004-06-20T00:35:06.000Z"
    },
    {
      "author": "ME",
      "body": "this is the crappiest site ever. DUMB!",
      "created_at": "2004-06-20T05:31:05.000Z"
    },
    {
      "author": "cirkus_bear",
      "body": "hey man, your hilarious. i think the length of your posts aree fine, you keep me hoooked the whole way through! your cinema sounds fantastic..... i i lived anywhere neer midwestburg i might even come visit! thanks agin !",
      "created_at": "2004-06-20T12:11:53.000Z"
    },
    {
      "author": "Allen",
      "body": "if you ever need any help with any html then go to w3 schools it has everything you need to know.its helped me alot on my blog.to check it out <a href=\"http://theworldaroundtheworld.blogspot.com\">Click Here</a>",
      "created_at": "2004-06-20T17:09:46.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Here's a place that might serve as an inspiration, if you haven't already heard of it. http://www.picturepubpizzza.com\r\nWhen I lived in the Bay area, hubby and I saw Enter the Dragon there, and it was such a great experience.\r\nI'm rooting for you two...",
      "created_at": "2004-06-20T20:47:45.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Errr...that's http://picturepubpizza.com/; with just TWO z's...",
      "created_at": "2004-06-20T20:49:43.000Z"
    },
    {
      "author": "Chris",
      "body": "I only recently discovered your blog (er, blong?). Anyway it makes for a wonderful read. I started mine a few months ago with a focus on reviews and entertainment columns. If you feel so inclined and have a moment, please give it a quick perusal!",
      "created_at": "2004-06-21T05:07:43.000Z"
    },
    {
      "author": "James",
      "body": "I think it's great to know that there are some ambitious film nerds out there.  I work at the Fleur Cinema and Cafe, which you have linked on your site, and think it's great that a city can have a great local theatre that supports the community, and is supported by the community.  I really hope you get this plan pushed through.  I'm sure Miswestburg really needs this theatre.  I know Des Moines needs ours(although ticket sales would beg to differ).  Thank you so much for doing this!",
      "created_at": "2004-06-21T12:21:34.000Z"
    },
    {
      "author": "alleycat",
      "body": "im still here 2 well check out my blog <a href=\"http://theworldaroundtheworld.blogspot.com\">The World Around The World</a>\r\n\r\nand let me know if you like it.",
      "created_at": "2004-06-21T19:01:08.000Z"
    },
    {
      "author": "Cathy",
      "body": "Just came across your blog, just a few days after seriously considering opening up an independent theatre in my small town in California. But, I think I'll see how you guys do before I jump in with both feet.\r\n\r\nAnyway, regarding accomodating babies, on of my favorite theatres, in Sebastopol, has three private rooms upstairs next to the projection booth, with six or eight seats each, and can be reserved for people with kids. They are fully enclosed, and have sound piped in, with a sound proof window to see the screen. I have seen so many movies up there with my kid, it's really made a huge difference. If you're building from scratch, or doing a bunch of remodeling anyway, it might be worth it for you. \r\n\r\nI've seen at least a dozen movies in the last couple years in those rooms, and I live three hours away. Thery're part of cinemawest.com, if you're interested.",
      "created_at": "2004-06-22T05:12:01.000Z"
    },
    {
      "author": "Will",
      "body": "Hey, thanks for the answers, especially on the butter topping. That stuff's bad for me? Who knew? Good luck.",
      "created_at": "2004-06-22T22:40:01.000Z"
    },
    {
      "author": "XA04",
      "body": "Umm, yes i'm here",
      "created_at": "2004-06-30T14:28:36.000Z"
    },
    {
      "author": "orotienza29",
      "body": "I love the quotes that you post.  Thanks for the much needed inspiration.",
      "created_at": "2004-06-30T21:44:04.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
