{
  "id": 220,
  "title": "The Moxie Blog: One year old and still not listed on the National Registry of Historic Buildings",
  "body": "One year. 365 days. 8,760 hours. 525,600 minutes. 31,536,000 seconds. That's a lot of time, my friends. You'd think I would've been able to churn out a few more than 217 posts in a year... but you're wrong. And besides, it's quality, not quantity that matters to me. In fact, in what may be the most amazing coincidence in the last 14 years, this post also marks the typing of my 100,000th word on this blog. That's a lot of words, my friends. I wonder which word will be the BIG 100K? It could be any one of these words... the pressure is killing me!!!<br/><br/>Let's look at it this way - here's a breakdown of literature classes based on word count:<br/><br/>• Micro-Fiction = up to 100 words<br/>• Flash Fiction = 100 - 1,000 words<br/>• Short Story = 1,000 - 7,500 words<br/>• Novellette = 7,500 - 20,000 words<br/>• Novella = 20,000 - 50,000 words<br/>• Novel = 50,000 - 110,000 words<br/>• Epics and Sequels - Over 110,000 words<br/><br/>So, if I printed out every post on this blog, along with all of your comments, we'd have an EPIC on our hands. An incredible story of a husband and wife team who --<br/><br/>WEENUS<br/><br/>Sorry, I wanted to make sure that the 100,000th word was a good one. I'm not sure if that was it, but I'd rather be safe than sorry.<br/><br/>BUNGO<br/><br/>Ok, so where was I? Right... this blog is an Epic. You know, I briefly considered doing an interview betwixt myself and 2004 Dan, but I decided not to since 2004 Dan isn't different enough from 2005 Dan (i.e. me) to make it funny. With that being said, I want everyone to know that I could totally take 2004 Dan if I had to. Think about it. I bet 2004 Dan can't even remember the last time he picked up a hammer. What a wuss.<br/><br/>Here are 10 things I had in May of 2004 that I don't have in May of 2005.<br/><br/>1. Cable TV<br/>2. Regular paychecks<br/>3. Good health and dental insurance<br/>4. Lots of free time<br/>5. A couch<br/>6. A savings account... with money in it<br/>7. Vacation time<br/>8. The ability to eat at Taco Bell every day<br/>9. A psychotic neighbor<br/>10. A job I hated<br/><br/>Now, let's switch sides and see what I have in 2005 that I didn't in 2004<br/><br/>1. 100x the stress<br/>2. A piano<br/>3. Walking distance to a porn store<br/>4. Hemroids... a little one<br/>5. Cool Moxie shirt, buttons, and sticker<br/>6. A backyard<br/>7. An 18\" core of solid concrete<br/>8. A theater that is 65% finished<br/>9. A savings account... with no money in it<br/>10. A job I like (eventually)<br/><br/>Wee! Wasn't that fun?! And now it's time for a song:<br/><br/><i>[SPOKEN]<br/>C’mon baby where you going?<br/>Cos ya know I want it...<br/>I don’t wanna blog ya to get ya<br/>Because I want it<br/>Cutie just slip into your Firefox-ay<br/>And let big Dan blog ya all day<br/>Cos the first time I saw ya<br/>I wanted to kick it to ya<br/>Your blog is slammin’<br/>So honey can I bookmark ya<br/>Cos you and I both know tricks are for kids<br/>So get the Don Perignon outta the fridge<br/>I wanna do the first thing that comes to mind<br/>Cos on a scale of one to ten<br/>No question you're a dime<br/>I’m attracted to ya cos you blogrolled me<br/>And sweetheart, Color Me Badd<br/>Is gonna blog you up<br/><br/>Hey, beautiful lady, I need you tonight<br/>Lovely, lovely lady<br/>I wanna make you feel all right, yeah<br/>I can’t deny, baby<br/>I wanna blog you down<br/>You are so fine, baby<br/>All I wanna do is<br/><br/>(I wanna blog you up)<br/>I want to blog you up<br/>All night (girl you make me feel good)<br/>I want to (let me type you down) blog you up.<br/><br/>Say do you feel lonely girl<br/>Let me turn down the lights<br/>So I can blog you in the darkness<br/>Ooh baby, let’s read Dan's blog tonight<br/>Yeah, dig, you read so right baby<br/>When I blog you down<br/>Please link me, sugar<br/>Cause all I wanna do is<br/><br/>(I wanna blog you up)<br/>I want to blog you up<br/>All night (girl you make me feel good)<br/>I want to (let me type you down) blog you up.<br/><br/>Girl you just make me feel so good<br/>I just wanna... I just wanna<br/>Just lay back, and enjoy the blog<br/>All I wanna do is<br/><br/>(I wanna blog you up)<br/>I want to blog you up<br/>All night (girl you make me feel good)<br/>I want to (let me type you down) blog you up.<br/><br/>Read sweet bloggin’ all night long<br/>Feels so right it can’t be wrong<br/>Don’t be shy girl come to me<br/>Open up your browser and Dan will set you free<br/>I want to blog you in all the right places, baby<br/>I want to make blog to you<br/>All night...</i><br/><br/>Oh yeah! It doesn't get any hotter than that. Happy Birthday Moxie Blog!!!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-05-24T19:48:14.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "Oh, Moxie Blog, how far you've come!",
      "created_at": "2005-05-24T19:56:45.000Z"
    },
    {
      "author": "Liz",
      "body": "An epic, eh?  Say, would it be dorky to imagine your story becoming an epic film? Because \"The best damn <i>movie</i> about starting an art-house theater in Springfield, Missouri in the whole entire world!\" has a nice ring to it as well.",
      "created_at": "2005-05-24T20:05:32.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "I think Liz is on to something there. I'll see if I can scare up Morgan Spurlock's phone number for you.",
      "created_at": "2005-05-24T20:22:02.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Woohoo! Happy B-Day Moxie Blog!",
      "created_at": "2005-05-24T20:27:59.000Z"
    },
    {
      "author": "nicholas",
      "body": "Happy Birthday! I want a hat too.",
      "created_at": "2005-05-24T20:51:57.000Z"
    },
    {
      "author": "DUG",
      "body": "Happy Birthday to the best damn blog in the history of God.  Nice song Dan, I'll need to hear the actual music to it sometime!  ",
      "created_at": "2005-05-24T21:17:49.000Z"
    },
    {
      "author": "Jimmy",
      "body": "Happy Blogiversary!",
      "created_at": "2005-05-24T21:29:07.000Z"
    },
    {
      "author": "Fyse",
      "body": "Happy Birthday Moxie Blog!",
      "created_at": "2005-05-24T22:16:34.000Z"
    },
    {
      "author": "Oz",
      "body": "RE:  An 18\" core of solid concrete. <br/><br/>Come on, there's some steel bars mixed in there, if I remember correctly.<br/><br/>And happy blog birthday.  Mine is Thursday.",
      "created_at": "2005-05-24T22:32:38.000Z"
    },
    {
      "author": "Allison",
      "body": "If ever there were a reason to celebrate drunkenly, it is your birthday, Blog!",
      "created_at": "2005-05-24T23:04:55.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "Is it too soon for the Moxie Blog to be going to a strip club?<br/><br/>P.S. That song is hotter than Barry White and Marvin Gaye covered in gravy.",
      "created_at": "2005-05-25T00:09:03.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "Jeez, Ben, it's only a year old!<br/><br/>Although I think we can sneak out some beer from the fridge in the garage for it. And for Benzo.",
      "created_at": "2005-05-25T01:58:39.000Z"
    },
    {
      "author": "Tawny",
      "body": "So, should the movie go ahead, who would you like to play you and Nicole?<br/><br/><br/>Happy Birthday Blog!<br/>",
      "created_at": "2005-05-25T02:20:33.000Z"
    },
    {
      "author": "Fyse",
      "body": "Well, Bjork would obviously have to play Nicole. As for Dan, er.... ummmm... Natalie Portman? No, wait. Hayden Christensen! I bet he could bring a certain credibility to the role...",
      "created_at": "2005-05-25T02:25:35.000Z"
    },
    {
      "author": "Jed",
      "body": "HAPPY BIRTHDAY MOXIE BLOG!! I will be getting torn up tonight in honor of the Blogs first birthday/it's Tuesday. Thanks to all the bloggers as well for supporting my friends endeavor. Just thought I'd throw that in there. Dan, that was a smooth ass song. If it doesn't leave my head soon, you are going to get it.       ",
      "created_at": "2005-05-25T03:38:47.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'd be played by Chris O'Donnell.",
      "created_at": "2005-05-25T04:47:43.000Z"
    },
    {
      "author": "whittler",
      "body": "I love weenus (the word). Weenus Pissman. Ha ha ha ha er ha.",
      "created_at": "2005-05-25T06:00:35.000Z"
    },
    {
      "author": "nicole",
      "body": "Dan sometimes looks a lot like Chris O'Donnell. But not Chris O'Donnell from Three Musketeers.",
      "created_at": "2005-05-25T06:41:00.000Z"
    },
    {
      "author": "erin",
      "body": "that was THEE greatest thing that has happened all day.",
      "created_at": "2005-05-25T07:36:41.000Z"
    },
    {
      "author": "Rachel",
      "body": "If you make a movie I want to play Bogart...or a hammer.",
      "created_at": "2005-05-25T08:44:31.000Z"
    },
    {
      "author": "Surferbill",
      "body": "Happy Blogday!",
      "created_at": "2005-05-25T13:47:05.000Z"
    },
    {
      "author": "Caleb",
      "body": "I think you've got a hit record on your hands! When is it coming on the radio? <br/><br/>You should contact Darcy Stevens at the SMSU Music Department (dws695t@smsu.edu) to get you a little Chopin ditty to play on the radio about the Moxie. He teaches MUS 216 and 316 which are all about electronic music recording and the whole point of the class is to make a jingle for a local business...though usually no one wants them cause they'd rather pay more to get more cheese for their commercials. I bet a group in the MUS 216 class next semester would make a jingle for you and wouldn't charge you much for it. Just an idea if you have enough money in the fall for radio marketing. <br/><br/>Happy birthday Moxie blog!",
      "created_at": "2005-05-25T17:20:48.000Z"
    },
    {
      "author": "Nate",
      "body": "I decree this idea as awesome.",
      "created_at": "2005-05-25T20:50:43.000Z"
    },
    {
      "author": "Sarah",
      "body": "Happy Birthday Moxie blog! (and to me too, my 21st!!) How very special...<br/>And now that I have found this special place and special Dan...I will do my best to refrain from asking you when the theater will be open. I think the best plan of action for me would be to find a bar in the general vicinity and get drunk (bc I can do that now) until I notice a 'Now Playing' sign or something of the sort.",
      "created_at": "2005-05-25T23:08:03.000Z"
    },
    {
      "author": "Steve",
      "body": "In an attempt to show you how much time you waste on the blog, I was gonna ask you what your typing rate is, do the math ([100 KWords/XX wpm]/60) to figure approximate typing time in hours, then roughly triple that to get a general idea on the amount of time you've spent actually writing the blog (taking in account extra time thinking, pee breaks, mental breakdowns, etc.), then double THAT for reading and responding to readers comments, for a ballpark figure on GTBT (Grand Total Blog Time), which, if say, you type at an average 35 wpm, would work out to something under 300 hours GTBT (285.7, to be exact). This would work out to about 11.9 days, or about 3.26 % of your previous year. About 47 minutes a day. Which actually doesn't seem like such a waste of time afterall...<br/><br/>Wish I could say that about the time I just lost forever on this comment...<br/><br/>Unless...you are a one-letter-at-a-time typest! Let's see, one letter per second...hmmmm...where'd I put the calculator...",
      "created_at": "2005-05-26T00:02:02.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
