{
  "id": 221,
  "title": "The roof, the roof, the roof is too low",
  "body": "The ceiling in the projection booth is too low. Simple as that. Currently, the floor of the projection booth is 2 feet off the ground, and the ceiling is 8 feet above the projection floor... making it roughly 10 feet off the actual floor. Here's the problem: the lens of the projector is centered 4 feet from the base. Meaning the center of the lens will be 6 feet off the actual floor of the auditorium (2 feet to projection booth floor + 4 feet to projector lens). That's not good.\r\n\r\nAt that height (6 feet), anyone as tall, or taller than me will be able to completely block out the projector by standing up in the center of the back row. As you move closer to the screen, the obstruction will become less and less, but the height needed to block the screen will become smaller. That probably doesn't make much sense, so here's a quick diagram:\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/052505/scenario1.gif\" width=\"425\" />\r\n\r\nAs you can see, the closer you get to the screen, the less height it takes to obstruct the picture. The screen is only 5 foot 3 inches off the floor, which means that anyone taller than 5'6\" would be able to block a small portion of the screen if they stood up in the first two rows.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/052505/scenario2.gif\" width=\"425\" />\r\n\r\nThe obvious solution is to raise the projector, but to do that we'll have to cut a hole in the booth ceiling. Problem solved, right? Wrong. We have to leave room for an exhaust fan... but we don't know the dimensions of the fan yet. All we know is that it will weigh roughly 50 pounds and that it needs to be located above the projector. Chris (GC) is working on getting the exact specs for me, but I haven't heard back from him yet. Hold on... I'll call him real quick...\r\n\r\n*calling*\r\n\r\nHe wasn't there. I left a voicemail.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/052505/scenario3.gif\" width=\"425\" />\r\n\r\nThe higher we get the projector, the better off we'll be, BUT we also have to consider how tall we're making the projector itself. If we build a 2 foot platform for the projector to sit on, that means both the projector and the top reel are going to be taller than me, which isn't a good thing when it comes time to thread the film. GAHH!\r\n\r\nCan't we have anything go our way? Just once... I mean, COME ON!\r\n\r\nOn a happier note, Andrew and Ellen (the building owners) just welcomed a new miniature version of themselves into the world. Congratulations!\r\n\r\nAlso, on another side note, we're debating on whether we're going to represent the Moxie for First Friday on June 3rd. I think we need to do SOMETHING just to prove to everyone that the project isn't dead... but what? Any and all suggestions would be appreciated.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-05-25T23:03:54.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Allison",
      "body": "What is this \"First Friday\" you speak of?  A street fair?",
      "created_at": "2005-05-25T23:06:40.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ah yes, I guess I should've clarified that. First Friday is like a big downtown open house where all the businesses stay open late and allow the general public to tromp through their building and eat lots of cheese and wine. It draws a HUGE crowd.",
      "created_at": "2005-05-25T23:09:04.000Z"
    },
    {
      "author": "Justin",
      "body": "Isn't there apartments above the theater?  How can you cut a hole in the booth cieling without effecting the floor of the space above it?  How much room is in between the two?",
      "created_at": "2005-05-25T23:16:47.000Z"
    },
    {
      "author": "bjork24",
      "body": "The booth ceiling is actually a false ceiling that is roughly 3 feet from the actual ceiling... of course, 2 of those 3 feet are taken up by air ducts and the like...",
      "created_at": "2005-05-25T23:19:06.000Z"
    },
    {
      "author": "Caleb",
      "body": "I say you put up a sign offering free tours of the building. \r\n\r\nAnd offering some cockroach dip would be a nice idea too. Actually you should try out the ole popcorn popper and offer free popcorn to people who wander in to visit you. Wouldn't that be a swell idea? ",
      "created_at": "2005-05-25T23:19:58.000Z"
    },
    {
      "author": "Justin",
      "body": "Popcorn popper is a good idea...  \r\n\r\nI doubt you can let the general public into a construction site, but you <i>could</i> rope off the door and allow people to look in... like at Anne Frank's house.",
      "created_at": "2005-05-25T23:23:46.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "Artwork. Now's the time to put up some local artwork. And popcorn. Not on the walls, but for people to cram in their pieholes.",
      "created_at": "2005-05-25T23:45:52.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Popcorn is perfect because it's cheap and it reminds everyone what you're going to be, a movie theater. Server it by the piehole-full. Wow that made even less sense than I anticipated.\r\n\r\nI'd also suggest chips and salsa, to remind them what you're -not- going to be: An authentic Mexican restaurant. Unless you changed your mind on that one.\r\n\r\nOh, and as for the troubles? They simply fill the space in your soon-to-be-published post-opening book: \"Moxie and Me: How One Movie Theater Nearly Killed My Ass.\" Afterwards it is to be adapted into a film that will be so commercially hyped you'll never actually get to show it in its namesake (Dan will be played by Steve Buscemi, natch), but you will sell the DVD 3 months after it's release.\r\n\r\nAnd by then there better be chips and salsa available in the lobby, or there'll be hell to pay.",
      "created_at": "2005-05-25T23:54:47.000Z"
    },
    {
      "author": "DUG",
      "body": "I don't want to sound stupid, but I always do, so I'll ask anyway.  I haven't seen the projector, but is there any chance you could rest it on it's side?  Maybey if it could be supported long ways, you could get it higher and it might be easier to reach the reals, but that's just a stupid thought.  I could make some artwork for you for that Friday if you wanted.  I could make little movie poster drawings that you might be able to hand out.  Pop corn is brilliant.",
      "created_at": "2005-05-26T00:08:02.000Z"
    },
    {
      "author": "nicholas",
      "body": "Dan...use mirrors to bounce the image.\r\n<img source=\"http://www.ncoleman.com/files/cine-bounce.jpg\">",
      "created_at": "2005-05-26T00:13:31.000Z"
    },
    {
      "author": "nicholas",
      "body": "Like this: <a href=\"http://www.ncoleman.com/files/cine-bounce.jpg\" target=\"_blank\">http://www.ncoleman.com/files/cine-bounce.jpg</a>",
      "created_at": "2005-05-26T00:14:03.000Z"
    },
    {
      "author": "nicholas",
      "body": "You would just need to keep those f*ckers really windexed at all times.",
      "created_at": "2005-05-26T00:15:18.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ah yes, the old periscope trick. That's a possibility that I've considered, but it is undesirable for several reasons... looks like I'm going to need a follow-up post tomorrow to field all of these suggestions. Either way, keep 'em coming!",
      "created_at": "2005-05-26T00:20:21.000Z"
    },
    {
      "author": "Steve",
      "body": "Just ask everybody to duck or crawl when they need to move around during a film.\r\n\r\nMaybe not...\r\n\r\nProbably no way to lower the floor, is there...?\r\n\r\nThe First Friday Art Walk idea is a good one; get more T-shirts and sell them with maybe a different design for the general public as a fund raiser...just a random thought.",
      "created_at": "2005-05-26T00:21:07.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i apologize for being tall... ill make sure to sit in the back\r\n\r\nbtw.. did the stickers come in?\r\nim ready to proudly display one on my car as i deliver pizzas all day :-)",
      "created_at": "2005-05-26T01:20:08.000Z"
    },
    {
      "author": "Liz",
      "body": "Half-price tickets for those of legal midget height!",
      "created_at": "2005-05-26T02:12:14.000Z"
    },
    {
      "author": "Steve",
      "body": "Wooooops! I double-clicked. Sorry...",
      "created_at": "2005-05-26T00:21:45.000Z"
    },
    {
      "author": "Dave",
      "body": "yeah. mirrors... like in that movie \"Legend\"",
      "created_at": "2005-05-26T06:06:17.000Z"
    },
    {
      "author": "nathan",
      "body": "if you can't take people inside to have a look-see, you could just have a picture board on an easel outside showing the progress. just a thought.",
      "created_at": "2005-05-26T08:13:17.000Z"
    },
    {
      "author": "erin",
      "body": "POPCORN is brilliant! simply brilliant. : ) \r\n\r\ni think just letting people look around the building. and being able to ask you questions about the project... is good enough.\r\n\r\ndisplaying some art would be...... busy? with all the construction and stuff that will be going down.\r\n\r\nmaybe you could just display pictures of the progress you all have made? a before and \"after\" type thing.",
      "created_at": "2005-05-26T08:41:22.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "So how hard would it be to slope the floor down half a foot over the whole span of the theater? All the dropped beer and soda would drain...",
      "created_at": "2005-05-26T16:47:33.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Will you be able to have people in the building? As in, will the permits you have allow people to roam around the site if it is unfinished? If so, I wonder if you can plant yourselves and your popcorn popper outside the door on the sidewalk and hand out small bags of popcorn to the passerbys. That should attract some attention and allow you to show off your fancy antique popper.",
      "created_at": "2005-05-26T17:53:29.000Z"
    },
    {
      "author": "Caleb",
      "body": "I'm glad everyone likes the popcorn idea so much, but I still think cockroach dip would be a big hit.\r\n\r\nGuess I'm the odd man out.",
      "created_at": "2005-05-26T18:05:44.000Z"
    },
    {
      "author": "Steve Kirks",
      "body": "1.  Popcorn.  Can't do any better than that.\r\n2.  Tours.  Schedule them every 10 minutes and make up a \"show times\"-style board with \"tickets\".  The \"tickets\" will have info about the theater and (for ___-sake) the blog's address.  My interest and mental investment in the Moxie has tripled since I started reading.\r\n3.  A \"sandwich board\" out front on the sidewalk, with \"chase lights\" around the border and your logo smack in the middle.\r\n4.  Merch, merch merch!\r\n\r\nBTW, I should be \"shot\" for using so many \"quotes\" in my post.\r\n\r\nSteve",
      "created_at": "2005-05-27T18:33:15.000Z"
    },
    {
      "author": "JEsus Christ",
      "body": "I have AIDS in my ass.",
      "created_at": "2006-03-29T20:03:10.000Z"
    },
    {
      "author": "The Cow",
      "body": "Moo",
      "created_at": "2006-03-29T20:03:45.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
