{
  "id": 223,
  "title": "Peanut butter jelly with a baseball bat",
  "body": "It's Friday, so I'll make this quick:<br/><br/>1. Direct your attention to the top of the page. See that new menu? That's the all-encompassing <a href=\"http://www.moxiecinema.com\">MOXIECINEMA.COM</a> menu. It's proves, once and for all, that the Moxie blog is a \"part\" of the <a href=\"http://www.moxiecinema.com\">moxiecinema.com</a> universe, and not the other way around. There's all kinds of fun stuff for you to play with, like a <a href=\"http://www.moxiecinema.com/forum\" class=\"broken\">forum</a> and a <a href=\"http://www.moxiecinema.com/mail.php\" class=\"broken\">mailing list</a>... and a <a href=\"/moxie\" class=\"broken\">blog</a> even! Once the theater opens, the main page will transform into AWESOMENESS and the menu will grow seven new buttons. So... there that is.<br/><br/>Also, if you notice any bugs with the design or functionality of the new homepage (or any of the other pages), please let me know. I took the time to make sure everything was XHTML Strict / CSS compliant (there's even links in the footer to prove it), so hopefully it will look just as good in Safari as it does in Firefox... Mac or PC.<br/><br/>2. First Friday. Moxie Cinema. Here's what we're thinking: Open the front doors (the entrance off Walnut) and set up a little table just inside the doors. The table will include:<br/><br/><ul><li>Robot versions of Nicole and I</li><br/><li>Popcorn from the Moxie popper (free)</li><br/><li>What's left of our merchandise (buttons - $1.00, stickers - $0.50)</li><br/><li>A sign-up sheet for The Moxie Mailing List</li><br/><li>A \"guess when the Moxie will open\" contest, where people cast their votes and whoever gets the closest will win something cool... like an invitation to one of the pre-opening test screenings</li><br/><li>The chance to look in, but not walk through, the work zone (sorry, liability is too big of an issue in these litigious times we live in)</li></ul><br/>And... that's that. Have a great memorial day weekend everyone!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-05-27T19:58:28.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "I'll be there too!",
      "created_at": "2005-05-27T20:25:23.000Z"
    },
    {
      "author": "Steve",
      "body": "Cool! You've been needing a general contact email for a while. Some of us might have thoughts and questions we want to direct at you, so me might monopolize even more of your already short time. And a forum too...Dan, are you going to find time to sleep?",
      "created_at": "2005-05-27T20:25:27.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'll sleep when I'm dead. Coincidentally, I die every night around 11:45 PM.",
      "created_at": "2005-05-27T20:29:24.000Z"
    },
    {
      "author": "Caleb",
      "body": "Lol...I'm still laughing over you linking the blog on the blog as it were special edition news coverage. That's old news, Dan. The forum should add new levels of excitement.<br/><br/>The plans for First Friday sound great! I'll be there (unless I get conned into working at Movie Gallery)!<br/><br/>",
      "created_at": "2005-05-27T20:30:22.000Z"
    },
    {
      "author": "whitty",
      "body": "I was gonna suggest the vestibule space for first friday, mainly because I like the word vestibule, but I figured you would think of that.  <br/><br/>The new menu is nifty.  Did you add the forum because you knew I was slacking off too little at work? Well, back to slacking.",
      "created_at": "2005-05-27T20:43:41.000Z"
    },
    {
      "author": "Steve",
      "body": "First Friday sounds great; I'll be there! That is July 1, correct?<br/><br/>Uh-oh, did I sound sincere again?",
      "created_at": "2005-05-27T20:43:43.000Z"
    },
    {
      "author": "bjork24",
      "body": "Don't believe Steve... it's June 3rd... seriously.",
      "created_at": "2005-05-27T20:46:56.000Z"
    },
    {
      "author": "Craig",
      "body": "Man, I wish I could get my hands on a couple of those robots.",
      "created_at": "2005-05-27T21:41:03.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Benzo totally kicks ass now.",
      "created_at": "2005-05-27T21:58:23.000Z"
    },
    {
      "author": "erin",
      "body": "sounds excelent.<br/>can people make multiple guesses? i never win anything. so i figure.... if i put every date in for the next..... couple months or something... i could win that puppy.",
      "created_at": "2005-05-27T22:22:21.000Z"
    },
    {
      "author": "erin",
      "body": "how many stickers/buttons do you have left? a few? hardly any? a lot?<br/><br/>perhaps i should camp out on that thursday night to assure i get one? (i was too poor when the marring the moxie and such was going down..)<br/>: )",
      "created_at": "2005-05-27T22:26:33.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "HA! I just remembered what the post title was from. I have a fond little memory of waking my roommate up at half past one in the afternoon to that Flash animation thing.",
      "created_at": "2005-05-27T22:38:44.000Z"
    },
    {
      "author": "Oz",
      "body": "Your First Friday plans sound nifty.  If only I was going to be in Missouri on June 1st!<br/><br/>(I never, ever thought I would say/think THAT!)",
      "created_at": "2005-05-27T22:42:31.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "I don't know if I've forgiven you yet for the 50% polyester shirt (I can't wear it or I'll sweat myself to death), but the stickers/buttons were pretty sweet.<br/><br/>Good luck with the opening. Say the winner of the Opening Contest should get a free kick in the nuts, a small piece of revenge for what this cinema has taken from you, your family, and your life as you've tried to get it off the ground. Why kick these peeps in the nuts?<br/><br/>Ah-ah, wrong question. The question is, Why Not? :)",
      "created_at": "2005-05-27T23:14:09.000Z"
    },
    {
      "author": "Nate",
      "body": "No, June 1st is First Wednesday, which is Twenty Ninth Birthday (Nate), which should get people out in equal numbers.  I plan on having an \"Open Apartment\" where I will display requisite bachelor-pad artwork such as the requisite Salvador Dali, the requisite M.C. Escher, and the requisite \"Guiness is Good For You.\"  Patrons can discuss the post-modern deconstruction of 20th century hyper-commercialized art.  Budweiser Select will be in the fridge, along with a block of half-eaten Cheddar.",
      "created_at": "2005-05-27T23:14:59.000Z"
    },
    {
      "author": "Steve",
      "body": "Duh...June 3...not July 1...<br/><br/>Somehow I managed to transport myself a month into the future, while remaining in contact with the present. I hate it when that happens...",
      "created_at": "2005-05-27T23:39:52.000Z"
    },
    {
      "author": "Ole",
      "body": "Dan - will Erin's 60 entries be sufficient to fall within the window of your planned opening?",
      "created_at": "2005-05-28T05:43:44.000Z"
    },
    {
      "author": "brian of moore",
      "body": "please dont give my sticker away :-(<br/>... i never got a reply to the comment i left two posts ago... <br/>i left town for a week.. so i guess i missed the post about the stickers finally getting in... but I still havn't gotten mine yet..<br/><br/>my life will surely be worthless if i do not get my beautiful (and yes i paid for it) sticker... :-)",
      "created_at": "2005-05-28T10:28:52.000Z"
    },
    {
      "author": "mike",
      "body": "damn! I'm jealous of that new menu... it's so simple - yet tasteful.",
      "created_at": "2005-05-28T11:35:11.000Z"
    },
    {
      "author": "bjork24",
      "body": "Don't worry Brian, your sticker won't be sold. I'm saving a bunch for all the people who picked their shirts up at the theater.",
      "created_at": "2005-05-28T18:27:16.000Z"
    },
    {
      "author": "brian of moore",
      "body": "WOOHOOO!  thank you sir *relief sigh and such*",
      "created_at": "2005-05-28T19:43:29.000Z"
    },
    {
      "author": "Nicki J",
      "body": "You must not love us at movie gallery. How dare you merely drop your movies off and not come in to speak to us. Caleb and I were *both* working tonight. And all we ask is a simple \"hello\" I don't think that's asking for too much.<br/><br/>........<br/><br/>That's it! You're gettin' late fees! Muahaha!",
      "created_at": "2005-05-29T11:14:13.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
