{
  "id": 224,
  "title": "Biff! Bam! Boom!",
  "body": "Okay, so here's the list of GOOD things that happened over Memorial Day weekend + today:<br/><br/><ol><li>We found out that my sister is pregnant, which means Nicole and I will be an aunt and uncle for the first time! We've made a pact to be the coolest aunt and uncle in the world.</li><br/><li>I heard from / saw old acquaintances that I hadn't seen in years. Allow me to summarize the majority of the conversations, \"When is your theater going to open? I saw you on the news. Are you really out of money? I don't know how it's possible, but you're better looking now than you were seven years ago! Father my children!!!\"</li><br/><li>We had two free meals yesterday! YAY! I made a comment about Nicole using her toothbrush to clean the grout in the bathroom that, after having been said, made my father-in-law spit water all over Nicole. It was AWESOME!</li><br/><li>I found out the electrician is going to start working today! He's currently ordering all of our fixtures, because tomorrow EVERY light fixture in the world is going to have a price increase of 10%! Isn't that amazing? I asked why that was, but no one knew for sure. It's just something that happens I guess.</li><br/><li>I called the Health Department and asked if we could serve free popcorn for First Friday. They said yes, as long as we have a three compartment sink available where we can/could wash the scoops. I then called the general manager at the Springfield Brewing Company (right across the street), and asked if we could use his sink... if needed. He said yes. All is good. Free popcorn on FRIDAY!</li><br/><li>We're picking up all of our 35mm projection equipment tomorrow in St. Louis. I just reserved a U-Haul pull-behind trailer. We're going to eat at Stir Crazy... mmm, Stir Crazy.</li><br/><li>At 2:00 PM, Nicole and I are meeting with the SFDC (Springfield Financial Development Corporation) to extend our loan repayment schedule. We were supposed to make our first payment tomorrow, but seeing as we're not open yet, they took pity on our souls and allowed us to push our first payment back to September 1st, 2005. Hip hip HOORAY!</li></ol><br/>Here's the bad things that happened this weekend:<br/><br/><ol><li>I contracted some sort of flu or cold at the wedding I attended on Saturday. It feels like a miniature Keanu Reeves is running amuck inside of my body, smacking random organs and muscles with a bamboo cane until they're red and swollen. It's unending... he never stops, I tell you. NEVER!</li></ol><br/>All in all, not a bad extended weekend.<br/><br/>Also, I think we'll be sending our first e-mail newsletter tonight, so if you're not already <a href=\"http://www.moxiecinema.com/mail.php\" class=\"broken\">signed up</a>... may 284 miniature Keanu Reeves haunt your dreams FOREVER!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-05-31T20:45:22.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "boo!",
      "created_at": "2005-05-31T21:40:19.000Z"
    },
    {
      "author": "bjork24",
      "body": "What, exactly, are you booing Brian? I took out the section about ghetto chickens and urban turkeys.",
      "created_at": "2005-05-31T21:42:05.000Z"
    },
    {
      "author": "brian of moore",
      "body": "hahah.. i won.... whatever game that is.. that everyone seems to play.... ahem<br/>anyway... im curious about this light fixture thing... hmm... i might have to go out and buy a huge one... sadly my ceiling isnt very high... maybe i could get one that reaches all the way down and touches the floor.... how sweet that would be!!<br/><br/>i think im signed up for the mailing list... if i recall.. i got signed up wayyyy back when you first posted on morawk.. and i took that questionaire<br/><br/>ahhh good memories",
      "created_at": "2005-05-31T21:42:56.000Z"
    },
    {
      "author": "brian of moore",
      "body": ".. it was more of a BOOYA! .. i just forgot the \"YA\"",
      "created_at": "2005-05-31T21:43:27.000Z"
    },
    {
      "author": "Nate",
      "body": "Everyone needs a large light fixture in their room just in case they are ever cornered by a gaggle of clumsy, incompetent ninja/henchmen and need to drop said light fixture on them with a well-placed sword swipe to a conveniently located rope, thus taking out a dozen ninjas at once.<br/><br/>Extra points if you hang onto the end of the rope and the weight of the falling light fixture pulls you to the top of a banister.<br/><br/>It is a shame that doing this will now cost that much more.",
      "created_at": "2005-05-31T22:01:58.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "Good thing we bought our expensive chandelier 2 weeks ago!",
      "created_at": "2005-05-31T22:08:20.000Z"
    },
    {
      "author": "JED",
      "body": "Quick summary of my weekend. Sat: went to Tanqueray party in the Hills, saw Jesse Metcalfe, Tyler Hilton, Rachel Leigh Cook mistook me for someone, got drunk, punched JC Chasez in the neck, broke out. Sun: Drunk, puked, passed out and it's only 4pm. Got up at 8 went to OC, went to White Party (not with hoods and burning crosses, have to wear all white) sponsored by DefJam and Tony Gonzales. Tried to punch Gonzales in the neck but security was an issue. Monday, Beach, Beach, Beach. Took pictures of my new Moxie shirt gazing at the ocean, playing in the sand, and punching a baby in the neck(Dan I'll send you the pictures). They were sweet pics and Moxie Shirt is quite a photogenic lil guy. Thats it.      ",
      "created_at": "2005-05-31T22:16:10.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Dan::<br/><br/>I think you are suffering from all that chocolate beer you consumed Saturday night. It's like sex and baseball--two great things that should never be combined.",
      "created_at": "2005-05-31T22:17:40.000Z"
    },
    {
      "author": "Nate",
      "body": "But how would we use sports metaphors when discussing sex?<br/><br/>Dude 1: \"Last night, after the dance, I got to the twenty yard line and kicked a field goal with Amy!\"<br/><br/>Dude 2: \"Sweet.  That beats the birdie I shot on her out of the sandtrap!\"<br/><br/>Eww.  No thanks.",
      "created_at": "2005-05-31T22:25:19.000Z"
    },
    {
      "author": "Justin",
      "body": "Congrats on the Aunt/Uncle dealyo.  Are you going to be the crazy old uncle?",
      "created_at": "2005-05-31T22:53:55.000Z"
    },
    {
      "author": "erin",
      "body": "but... but... im already the coolest aunt in the world. and. i dont really think its fair of nicole to try and steal my title.<br/>: * (",
      "created_at": "2005-05-31T23:13:44.000Z"
    },
    {
      "author": "nicholas",
      "body": "Those mini-Keanu's freaking suck man...",
      "created_at": "2005-06-01T01:33:44.000Z"
    },
    {
      "author": "Maddy",
      "body": "I can sleep soundly knowing the cinema is this much closer to perfection.",
      "created_at": "2005-06-01T08:24:00.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Yay to late payments! :)",
      "created_at": "2005-06-01T17:20:46.000Z"
    },
    {
      "author": "Caleb",
      "body": "Congrats on becoming an uncle. I too will become one somewhere around Sept. 7. <br/><br/>And sadly since my internet at home is down I did not get to read your post about the light fixtures until this morning, and now I missed out on cheaper light fixtures. What a sad day...",
      "created_at": "2005-06-01T17:31:02.000Z"
    },
    {
      "author": "Caleb",
      "body": "This is why everyone should go downtown this Friday (and visit the Moxie while you're at it)...<br/><br/>When you're alone, and life is making you lonely<br/>You can always go...Downtown<br/><br/>When you've got worries, all the noise and hurry<br/>Seems to help, I know...Downtown<br/><br/>Don't hang around, and let your problems surround you,<br/>There are MOVIE SHOWS..Downtown",
      "created_at": "2005-06-01T18:52:21.000Z"
    },
    {
      "author": "Oz",
      "body": "How odd about your flu/cold.  I usually think of Keanu Reeves as being just stupid rather than malicious.",
      "created_at": "2005-06-01T19:30:04.000Z"
    },
    {
      "author": "whitty",
      "body": "Hey, I got the news that I was going to be an aunt for the 3rd time this weekend (a sibling-in-law).  Man, everyone must be doing it lately.  <br/><br/>But I have to say, I happen to be the most awesome aunt ever.  Aunt NeeNee rules!",
      "created_at": "2005-06-01T22:29:35.000Z"
    },
    {
      "author": "Sancho",
      "body": "Can we expect a Moxie baby jumper coming down the pike? Moxie Diapers? ",
      "created_at": "2005-06-02T02:04:41.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
