{
  "id": 226,
  "title": "If I die from lung cancer...",
  "body": "... it will be because I've inhaled unhealthy amounts of the following substances over the last 25 years of my life:\r\n\r\n1. Black mold\r\n2. Sawdust\r\n3. Oven cleaner fumes\r\n4. Helium\r\n5. Cigarette smoke\r\n6. Wood screws\r\n7. <a href=\"http://www.backyardnature.net/pix/cockrch2.jpg\" target=\"_blank\">Chinese wood cockroaches</a>\r\n8. Calvin Klein's Escape for men\r\n9. That sugary dust that collects at the bottom of cereal bags\r\n10. Dr. Pepper\r\n\r\nNeedless to say, my throat hurts all the time and I have lymph nodes the size of hackey sacks.\r\n\r\nI'm watching Bogey chase squirrels across our backyard. The expression on his face is much like mine if I were to see a couple well-done steaks scurrying through the branches. <i>Why are there steaks up in that tree? I don't know, but if one of them drops... I'm eating it!</i>\r\n\r\nIsn't it sad that there's all kinds of work going on at the theater right now, and this is the kind of post I write? Sometimes you feel like a nut. Sometimes you don't.\r\n\r\nI'm off to go cuddle with the projector.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-06-02T23:11:29.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "whitty",
      "body": "I can testify that when I drove by the theater earlier today there was a man with lots of stuff in the back of his truck came out and got his lunch box.  Indeed there is so much work being done it requires a lunch break!\r\n\r\nAnd there is a single shoe in the parking lot behind the theater.\r\n\r\nI hope you start feeling better.  I had giant nodes once.  It sucked.",
      "created_at": "2005-06-02T23:22:51.000Z"
    },
    {
      "author": "One Legged Man",
      "body": "I was wondering where that thing went.",
      "created_at": "2005-06-02T23:27:40.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i miss playing hackey sack\r\ni miss smoking cigarettes\r\ni think ill go eat some of that sugary dust you spoke of .. to fill my need for the other two",
      "created_at": "2005-06-02T23:50:45.000Z"
    },
    {
      "author": "One Legged Man",
      "body": "I miss playing hackey sack as well.",
      "created_at": "2005-06-02T23:53:41.000Z"
    },
    {
      "author": "JamesSheldon",
      "body": "Lookin' good :-)  \r\n\r\nJames",
      "created_at": "2005-06-03T00:40:50.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "You should play Hackey Sack with the projector! You could rename the game \"Break my ankle Sack\"",
      "created_at": "2005-06-03T01:15:28.000Z"
    },
    {
      "author": "And Dr. Dre",
      "body": "...nothing you idiot! Dr. Dre's dead, he's locked in my basement.",
      "created_at": "2005-06-03T01:21:49.000Z"
    },
    {
      "author": "Nicki J",
      "body": "Go Team Moxie! (ala the venture brothers)\r\n\r\nOk.. so maybe I'm just a dork. I'm prolly the only Venture Brothers lover on here...\r\n\r\nI'll shut up now.",
      "created_at": "2005-06-03T03:46:01.000Z"
    },
    {
      "author": "nicole",
      "body": "I believe it's Estee Lauder Pleasures you breathe in. And don't forget dog hair.\r\n\r\nBut don't worry blog readers - if Dan were to die suddenly, he's instructed me write a post to inform everyone. Quite the fatalist.",
      "created_at": "2005-06-03T04:55:14.000Z"
    },
    {
      "author": "erin",
      "body": "what nicki?!?! i love the veture brothers and you know that. but i bet i just dont count. or something. geeeeee.\r\n\r\nmissourians drink way too much dr. pepper.",
      "created_at": "2005-06-03T08:41:10.000Z"
    },
    {
      "author": "Caleb",
      "body": "\"My name is Caleb and I'm a Pepperholic.\"\r\n\r\n[Audience response]\r\n\r\n\"I am getting help these days. My therapist introduced me to caffeine-free Dr. Pepper. I figured there was no way it could be as good. But now I have found myself liking it better than the original. And my headaches have decreased tremendously! Of course from time to time I will drink a caffeinated beverage, but my therapist does not know this. So for the love of the Pepper, don't tell her.\"\r\n\r\n[Sighs from a very bored audience]",
      "created_at": "2005-06-03T09:50:51.000Z"
    },
    {
      "author": "nicholas",
      "body": "I have giant nodes right now. That's right. Giant. Nodes. Heh heh. That's right. Giant.\r\n\r\nI said GIANT.",
      "created_at": "2005-06-03T10:08:10.000Z"
    },
    {
      "author": "Yoda",
      "body": "For First Friday, excited I am.  \r\n\r\nTo First Friday's on Coruscant, compare it will not, but intrigued nonetheless I am.\r\n\r\nWhen open, will you be?",
      "created_at": "2005-06-03T21:54:56.000Z"
    },
    {
      "author": "Chewie",
      "body": "Mrawrrrrrrrrrrrr Ungrrrrrrrrr",
      "created_at": "2005-06-03T21:55:59.000Z"
    },
    {
      "author": "Maddy",
      "body": "So if he dies, we will get a post to tell us.  But what about the cinema?  What happens then?  Dan, have you adequately prepared for your possible demise?",
      "created_at": "2005-06-04T06:45:47.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
