{
  "id": 227,
  "title": "Popper Hemmingway",
  "body": "I only have 10 minutes to make a post, so I'm going to make this quick:<br/><br/>Yesterday I decided it would be a good idea to clean the popper, because the rumor is that most people (Nicole excluded) like clean popcorn out of clean poppers. So, the first thing I did was consult the internets. I made a post on film-tech asking for advice on how to clean the popper.<br/><br/>*Gagh... running out of time*<br/><br/>Long story short, the people at film-tech suggested I use oven cleaner, which I did. Fast forward six hours, and now the inside of our kettle is black? I scrub and scrub and scrub, but the strange black film won't go away. I then sanitize the kettle with boiling water and a USDA approved kettle cleaning agent... twice. I open the lid... still black. Super clean, but still black. This all happened yesterday.<br/><br/>So today I wake up at 6:00 AM and within 15 minutes I'm leaving Wal-Mart with extra strength steel wool, oxygenated brillo pads, Gojo, concentrated grease-cutting dish soap, plastic putty knifes, a wire brush, and one of those curly silver dish scrubbers. By 8:30 AM, after using painful amounts of elbow grease, the kettle was finally back to the way it looked yesterday. Two days of work and all I have to show for it is a right arm that's disproportionately larger than my left. After the scouring was through, I sanitized the kettle twice more (in fact, the last application of sanitizer is still sitting in the kettle... sanitizing as we speak).<br/><br/>After the whole kettle ordeal, I drove back home, took Bogey to the groomers, drove out to my parent's house (18 miles SW of Springfield), borrowed two big table's for First Friday, drove back to Springfield, went to the theater, re-sanitized the kettle, straightened up the front of the building, set up the tables, drove to Springfield Paper Company, bought 500 small white paper bags, went to the popcorn distribution place, bought some popcorn and a scoop, drove back to the groomers, picked up Bogey, came back home, wrote this post...<br/><br/>And that's where I find myself right now. Uh oh, time's up. Nicole's home. We still have a ton, ton, TON to do to get ready for tonight. Be there or be square!<br/><br/>More later.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-06-03T22:03:09.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "mmm black popcorn<br/>... wish i could come tonight... <br/>sadly i have to work... and im currently poor<br/>so i cant make up an excuse not to go",
      "created_at": "2005-06-03T22:23:02.000Z"
    },
    {
      "author": "brian of moore",
      "body": "oh.. but if you ordered a pizza.. i could come!!",
      "created_at": "2005-06-03T22:23:50.000Z"
    },
    {
      "author": "Ben",
      "body": "I have a bad feeling about this.",
      "created_at": "2005-06-03T22:50:06.000Z"
    },
    {
      "author": "Ben",
      "body": "That was supposed to go on the last post in continuation of the Star Wars comments...",
      "created_at": "2005-06-03T22:51:05.000Z"
    },
    {
      "author": "Luke",
      "body": "Tonight?  But I was supposed to go Toshi Station to pick up some power converters!",
      "created_at": "2005-06-03T23:05:56.000Z"
    },
    {
      "author": "whitty",
      "body": "Did Bogey get all spiffed up for First Night?  Is there going to be popcorn AND a dog there?  If so, that is thrilling. I am stupid over dogs. And popcorn. Super sanitized popcorn, that is.",
      "created_at": "2005-06-03T23:09:33.000Z"
    },
    {
      "author": "nicholas",
      "body": "This will sound dumb, but it used to work when I had to clean shit like that at McDonalds. Warm it up, then turn it off...when it's still warm (but won't burn you), wad up a big wad of cling-wrap, and use the cling-wrap to wipe it down. Don't ask me how or why (I don't understand the physics of it) but it works. Well, it's worked for <i>me</i> in the past.",
      "created_at": "2005-06-03T23:23:51.000Z"
    },
    {
      "author": "Oz",
      "body": "Good luck tonight, Dan!",
      "created_at": "2005-06-03T23:40:36.000Z"
    },
    {
      "author": "Allison",
      "body": "I was waiting for you to say that you had come back from Walmart to find it magically cleaned itself.  Or that once you had removed the black, that it had, an hour later, re-blacked itself.  That would be one hell of a popcorn maker.",
      "created_at": "2005-06-03T23:54:51.000Z"
    },
    {
      "author": "Chewie",
      "body": "Mngwaaarrr?",
      "created_at": "2005-06-04T00:24:35.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "*makes note not to eat the popcorn*",
      "created_at": "2005-06-04T00:36:51.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Two summers ago I had to clean out a fryer until it was shiny and new again--all while the metal was at least eight billion degrees. Before the second degree burns it was a huge pain in the ass. <br/><br/>And from my popcorn kettle cleaning days, I never remember the inside being shiny--but it had been used about a billion times.",
      "created_at": "2005-06-04T02:01:12.000Z"
    },
    {
      "author": "ron",
      "body": "Nice article in 417 about your theater. ",
      "created_at": "2005-06-04T17:32:05.000Z"
    },
    {
      "author": "ron",
      "body": "(in the june issue) and aren't we all paying for your \"government loan\" whilst you dilly dally? Please get serious and open your business and start paying us all back.  Man.  I'd like to have all of the taxpayers support me for a year while I farted around. ",
      "created_at": "2005-06-04T17:40:01.000Z"
    },
    {
      "author": "whitty",
      "body": "Please, Dan, take my tax money!  I would much rather my taxes go to you than some of the crappy crapola it has been going towards as of late.  Is there anyway we could arange this?  <br/><br/>Dear Government, I would like my tax money to go to education, health care, roads and Dan and Nicole.  75 cents to each of them please!  Thank you, whitty",
      "created_at": "2005-06-05T00:27:28.000Z"
    },
    {
      "author": "whitty",
      "body": "Also, \"dilly dally\"?  Really?  Christ, ron, I hope you were kidding. Really I do.<br/><br/>And who the f' says dilly dally these days.",
      "created_at": "2005-06-05T00:31:48.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ron, you'd have a valid point if our money came from a government <i>grant</i> as opposed to a government <i>loan</i>. Regardless of how much we \"dilly dally\" or \"fart around\" that money still has to be paid back.<br/><br/>Perhaps you'd like to stop by on any given night that my dad and I are there working and fart around with us. Do you have a hammer? We could sit around, waste government money, and talk about how cool it would be to open a <i>real</i> theater.",
      "created_at": "2005-06-05T00:51:19.000Z"
    },
    {
      "author": "Aaron",
      "body": "BLAH BLAH BLAH By the way, did you guys sell anything last night? I forgot to ask.",
      "created_at": "2005-06-05T02:09:49.000Z"
    },
    {
      "author": "Kirsten",
      "body": "Dan, the popcorn popper kettle will blacken and it's OK.  Wipe the kettle with a paper towel (dry) after each use.  Gently wipe down the insides of the glass with a mixture of vinegar/water and clean the light bulb (after it cools).  I've broke more than a few!  You don't have to make it sparkling clean for every single popping. It's not worth it, I tried it, it's crazy and you will go insane!  We gave away FREE popcorn from our big popper for years, until the health department decided we had to have like 3 sinks instead of 1.  Sold our popper, wasn't gonna put in another two sinks to give away free stuff.  Hope your First Friday went well, I was in Florida couldn't make it.  You guys are getting closer!  ",
      "created_at": "2005-06-05T03:01:15.000Z"
    },
    {
      "author": "Caleb",
      "body": "I don't think Ron should be allowed in the theater. Heh heh. <br/><br/>Maybe Ron should share his opinion with our tax-payed President though...",
      "created_at": "2005-06-06T03:54:03.000Z"
    },
    {
      "author": "Melinda",
      "body": "The popcorn was so good that I got hit on all evening (probably because I kept licking my fingers and smacking my lips).  Seriously... delicious.  I walked down Walnut and South street ramming it into my mouth (with the Moxie-labeled side of the bag facing out for promo purposes, of course).<br/><br/>Nice to meet both of you.  Good luck and keep on poppin!",
      "created_at": "2005-06-06T23:16:26.000Z"
    },
    {
      "author": "Nate",
      "body": "Penn Jillette, of Penn and Teller, has a new baby daughter that he has named - I am not making this up - \"Moxie CrimeFighter Jillette.\"<br/><br/>Teller, typically, was rendered speechless.",
      "created_at": "2005-06-07T00:04:19.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i think ron was being sarcastic....<br/><br/>maybe not<br/>i dont know ron<br/>unless it was ron howard...<br/>ron howard is never sarcastic<br/>thats hot it is with people that bald<br/>really bald = completely serious",
      "created_at": "2005-06-07T06:52:47.000Z"
    },
    {
      "author": "brian of moore",
      "body": "lol... <br/>\"thats hot\" should have been \"thats how\"<br/>i am not paris hilton",
      "created_at": "2005-06-07T06:53:39.000Z"
    },
    {
      "author": "nicole",
      "body": "I hope Ron was being sarcastic.<br/><br/>I'm glad, though, to hear the popcorn was tasty!",
      "created_at": "2005-06-07T06:57:56.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
