{
  "id": 228,
  "title": "Hey look, Part 10",
  "body": "This little blurb ran in the June issue of 417. What do you think of it?\r\n\r\n<b>The Softest Opening</b>\r\n<a href=\"http://www.417mag.com\" target=\"_blank\">417 Magazine</a>, June 2005\r\n\r\nWill Moxie Cinema ever open its freakin' doors? Readers of <i>417 Magazine</i> may recall coverage of this Walnut Street spot in our March story on downtown Springfield. \"At press time, this one-screen movie theatre was due to open in March,\" we naively wrote, giddy with the prospect of a Springfield-based indie-movie house where we could watch films such as <i>Sideways</i>. Finally. At long last. Now the egg's on our face because Moxie has, so far, failed to open. And it's three months later!\r\n\r\nWe have been anxiously following Moxie's progress via blog.moxiecinema.com, created by Dan and Nicole Chilton, the owners. The blog has been used as a publicity tool (the couple auctioned off the rights to operate Moxie's \"Cinebar\" via eBay) and as a fundraising device for the many necessary items that Moxie Cinema wasn't able to cover in its small-business loan: You, too, can donate $300 for a 14' x 7' movie screen (though the $6 toliet plunger has already been sponsored, thank you very much).\r\n\r\nAs we were banging out this very blurb, the blog was festooned with photos of Dan in his new Moxie Cinema-branded T-shirts. On the back they say \"Opening Late 2004... February... March... Soon!\" We are hoping \"soon\" means \"actually soon.\"\r\n\r\n\"June,\" Nicole Chilton told us at press time. \"Sometime in June. That's the goal.\"",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-06-07T07:24:58.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "whitty",
      "body": "Geez, that was a bit nasty, eh?  Like nothing has ever gone over deadline before.  Sheesh.   What exactly was the purpose of that blurb?  To discourage downtown business?  Guilt trip you into stop your \"dilly dallying\"?  Rub your nose in it? Really, what a worthless piece.",
      "created_at": "2005-06-07T07:45:10.000Z"
    },
    {
      "author": "Allison",
      "body": "Any publicity is good publicity.  Even though they suck for being so damned pushy.",
      "created_at": "2005-06-07T08:02:08.000Z"
    },
    {
      "author": "Caleb C.",
      "body": "Don't worry Dan and Nicole. You're gonna knock 'em dead when you open those doors. \r\n\r\nThose people at 417 Magazine are just excited to get their butts in those stylish red seats that they're being a tad rude to express their impatience.",
      "created_at": "2005-06-07T08:11:56.000Z"
    },
    {
      "author": "George",
      "body": "Agreed - pointless article.  Though any press is \"good\" press, 417 doesn't earn much respect from me by writing this type of blurb.\r\n\r\nI applaud them for their excitement in the opening of the theater, but the article could have been written as to not come off as so brash.\r\n\r\nDo they think that Dan and Nicole are delaying the opening on purpose?  Do they think that they aren't doing everything they can to get their business open as quickly as humanly possible?  \r\n\r\nOf course not.  So why write a hasty article?  It helps the theater in no way (other than giving them a little bit more publicity -- good or bad.), and makes the magazine come across as being presumptuously forward and impudent.\r\n\r\nDan and Nicole want the theater to open quickly just like everyone else does.  It will open when it's open, and any articles like this (or remarks from people like Ron in the earlier post) won’t do anything to change that.\r\n",
      "created_at": "2005-06-07T08:13:44.000Z"
    },
    {
      "author": "Rachel",
      "body": "I think it was less mean and more tongue-in-cheek, hipster cool. If it was mean there would be a \" :( \"",
      "created_at": "2005-06-07T08:36:16.000Z"
    },
    {
      "author": "matt",
      "body": "I agree.  It didn't sound mean so much as snarky, which is par for the course with a lot of contemporary media.",
      "created_at": "2005-06-07T08:41:03.000Z"
    },
    {
      "author": "brian of moore",
      "body": "the only annoying part is \r\n\r\n\"Now the egg's on our face because Moxie has, so far, failed to open. And it's three months later\"\r\n\r\nthe egg is on their face?\r\nyes.. so you might have printed that it was due to open in march... big friggin deal.. aside from that... the previous article was still correct.. for the moxie WILL open.. so if the egg was on anyone's face it would be on dan and nicole's (no offense) ... and i think they are dealing with enough right now... without being blamed for scarring the name of (hah) 417 magazine",
      "created_at": "2005-06-07T09:05:53.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "I try to do my part, even if all I can donate is a $6 toilet plunger. How's that working out for you so far? I imagine it hasn't seen much action yet.",
      "created_at": "2005-06-07T10:41:41.000Z"
    },
    {
      "author": "Yoda",
      "body": "Farted around, they have not.  Dilly-dally-ing, they have not been!  Much anger you have, like your father before you.  Hip and breezy, the tone 417 Magazine going for, was.  Relax, everyone should.  Let go of their feelings, they should.  The path to the Dark Side are they!\r\n\r\nTeach you, Dan, I cannot.  Reckless, you are.\r\n“Trying, we are,” you say. \r\nTry not!  Do. Or do not.  There is no try!\r\n\r\n“Too large for the booth, the projector is,” you say.  “Too small for the screen, the wall is.”  Size matters not! Look at me. Judge me by my size, do you? Hmmm?\r\n\r\n(When 29 years old YOU become, look as good, you will not)\r\n\r\nA “Gangsta Lean,” your hammer has.  The problem, maybe this is.  Bent to the Dark Side, perhaps it is.  Hmmmm?",
      "created_at": "2005-06-07T16:52:20.000Z"
    },
    {
      "author": "Scott",
      "body": "Had you paid them enough money or run enough advertisements in their pages, they would have written a nice article about you guys. It's entertainment, not journalism.",
      "created_at": "2005-06-07T16:56:12.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "Frankly the article sounds like some whiny junior-level journalist who's still ticked he lost that dream job reviewing nightclubs for the Philly Inquirer. I mean, getting paid to be drunk at a new club every week? Who wouldn't want that?!\r\n\r\nAnd, if the writer really did read the blog, they'd get a complete picture of what it takes to put this together on a daily basis. It's not like you keep us in the dark for three weeks then post something like:\r\n\r\n\"Um, I've been busy. There's gonna be a new phlog soon, promise.\"",
      "created_at": "2005-06-07T17:07:16.000Z"
    },
    {
      "author": "Ole",
      "body": "No way I'm \"operating the Cinebar\", not even in one of Nicole's aprons. I only paid to stand in front of it and look good while doing it.. No wait, I just paid for a sign on the Cinebar, didn't I.  Damn journalist!",
      "created_at": "2005-06-07T17:32:53.000Z"
    },
    {
      "author": "whitty",
      "body": "Am I the only one giggling at the title?  \"The Softest Opening\"?! That double-entendre has really made my day.",
      "created_at": "2005-06-07T19:33:49.000Z"
    },
    {
      "author": "Oz",
      "body": "As Allison said, all publicity is good publicity.  As long as they spell your name right.  And they did.",
      "created_at": "2005-06-07T20:10:17.000Z"
    },
    {
      "author": "nicholas",
      "body": "I think it's a way for 417 to post a correction without seeming as though they made a mistake. They didn't make a mistake in their original reporting, but I imagine they have received emails or phonecalls asking about the Moxie opening. So, they wrote this blurb. I'm a little surprised that it wasn't more objective, delving into the real reasons behind the delays, but I can understand why they wanted to write a blurb. Snarky is the current tone in journalism--until we hold our journalists to higher standards (more facts, less opinions) this is the sort of thing we can expect.",
      "created_at": "2005-06-07T20:20:02.000Z"
    },
    {
      "author": "Nate",
      "body": "Pardon us, Dan, while we turn this into a forum for journalism ethics:\r\n\r\nCome on, Nick.  Let’s not lump a side bar’s Maxim-ish tone (I like that:  “I am Maxim-ish!  Are you not entertained!”) with the truly grating cretins of journalism today.  Crossfire.  Rich Gannon.  New York Times reporters who cite anonymous sources when they “just f***ing Googled it,” Tim Russert who won’t pin that brow-beating pitbull Ken Mehlman down on any facts, and a certain, bombastic cable news source, with an exploding logo and penchant for outrage, and if you’re thinking of ______ and the Hound, you’d be right.  Plus, it’s uncanny that you recall a fondly remembered but, in the end, mediocre Disney movie.\r\n\r\nLuv ya, Nick.  How’s New Yawk?  Did you go to the Tony’s, you Nathan Lane groupie?\r\n",
      "created_at": "2005-06-07T21:45:44.000Z"
    },
    {
      "author": "Nate",
      "body": "Argh!  I thought I figured out how to do links!  I had one for the Ken Mehlman thing.  It's on the Huffington post like anyone cares.",
      "created_at": "2005-06-07T21:46:37.000Z"
    },
    {
      "author": "JED",
      "body": "Dan, I didn't really appreciate the tone of this particular writer. Does he have a problem with the theater? I do agree with the statement \"all publicity is good publicity,\" but this guy went about it wrong. You should contact 417 and let them know of the troubles you have had. Then after you open the Moxie, they can write about the things you had to overcome and then turn it into a movie of the week on Bravo. If they (417) want to continue to be dicks, we can persuade them otherwise. Nothing gains cooperation like cutting a mans fingers off and feeding them to his children. It's just a thought. Oh and I have now worn my Moxie shirt 12 consecutive days. I smell like pee.     ",
      "created_at": "2005-06-07T22:49:54.000Z"
    },
    {
      "author": "Allen",
      "body": "Damn journalists demanding people open when they say they will. And to use a humorous tone, in a magazine? There should be no humor in anything we read if it has anything to do with news. We sould burn copies of 417 the magazine in Park Central Square. And then an effigy of the journalist should be shat upon.",
      "created_at": "2005-06-11T05:01:16.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
