{
  "id": 229,
  "title": "First Friday and my overwhelming halitosis",
  "body": "I meant to post something about First Friday yesterday, but the 417 article took precedence. As many of you already know, especially those of you who were able to drop by, our First Friday appearance was a HUGE success (and that comes from a guy who's not prone to superlatives). Prior to opening at 7:00 PM, Nicole and I debated whether we needed to prop open the front door to let people know we were welcoming them inside. By 7:05, the debate was settled by the line of people flooding into the theater. Woo hoo!\r\n\r\nWe met all kinds of people on Friday night - blog readers, Moxie supporters, government officials, downtown proprietors, popcorn enthusiasts, actors, producers, directors, looky-loos, peek-a-boos, and, of course, an interesting fellow in a cowboy hat who was insistent upon breaking my balls over our delayed opening (in a good-spirited way, of course). A couple blog readers (<a href=\"http://whittycism.typepad.com/blog/\" target=\"_blank\">Whitty</a> and Nate) even brought gifts! Nate swung by with some well-needed Taco Bell, and Whitty presented Nicole with a dancing bowl of tapioca (get it?! <a href=\"http://tapioca.retroflux.com\" target=\"_blank\" class=\"broken\">Tapioca Dance</a>!) and a cute huggable Benzo for me (see picture below)! Thanks guys! A <a href=\"http://whittycism.typepad.com/blog/2005/06/again_not_much.html\" target=\"_blank\">few</a> <a href=\"http://springfieldian.blogspot.com/2005/06/first-friday-artwalk-photos.html\" target=\"_blank\" class=\"broken\">blog</a> <a href=\"http://www.justlikeinamovie.com/wordpress/?p=108\" target=\"_blank\" class=\"broken\">readers</a> mentioned their Moxie excursion on their own blogs, and Trint from <a href=\"http://springfieldian.blogspot.com\" target=\"_blank\" class=\"broken\">The Springfieldian</a> managed to <a href=\"http://www.flickr.com/photos/trint/17431334/\" target=\"_blank\">grab</a> <a href=\"http://www.flickr.com/photos/trint/17431331/\" target=\"_blank\">a</a> <a href=\"http://www.flickr.com/photos/trint/17430203/\" target=\"_blank\">few</a> <a href=\"http://www.flickr.com/photos/trint/17430202/\" target=\"_blank\">pictures</a> <a href=\"http://www.flickr.com/photos/trint/17430201/\" target=\"_blank\">too</a>.\r\n\r\nAll in all, I'd say we had a little over 150 people squeeze through our doors and peek into our naked auditorium. The \"guess when the Moxie will open\" sheet was wildly popular, as was the \"actual size of the Moxie screen\" button. I imagine we'll be having a repeat performance during the July First Friday, and by then we should be able to let people venture a lot further into the theater.\r\n\r\nAs for other events going on this week, we've ordered the 1) custom vinyl coverings for the windows, 2) Formica for the Cinebar, and 3) we'll be preparing the ceiling for painting (in the auditorium mainly) today and tomorrow. Although the electrician has been splitting his time between the theater and another project, I've been very pleased with his progress thus far. Hopefully we'll be sheetrocking by the end of next week... maybe sooner. Nicole is starting to work with Paul (our booking agent / mentor / friend / co-owner of <a href=\"http://www.ragtagfilm.com\" target=\"_blank\">Ragtag</a>) to hash out a preliminary film schedule for July and August. I don't have much material for a new phlog quite yet, but I imagine that will be changing in the upcoming week.\r\n\r\nALSO, I really, really, REALLY need to update the budget page. I haven't touched it in nearly two months and it's seriously out of whack. I'll need to take an hour or so to bring it up to par before we head off to Sherman Williams for some paint.\r\n\r\nP.P.S - I just looked through our list of donations, and it seems that I missed the last two that came in. I sincerely apologize. Typically, PayPal sends me an e-mail whenever we receive a donation, allowing me to write a personal thank you e-mail to each donor, but for reasons unknown, I didn't receive anything to notify me about the last two. I'll get those posted along with the revised budget. Good grief. I suck.\r\n\r\nAND FINALLY, here's a few more pictures from our First Friday extravaganza:\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/060705/table.jpg\" width=\"425\" />\r\n\r\nNo, our table wasn't broken. I had to stitch together four different pictures just to fit everything into one shot... that's how LITTLE space there was to move around. Those are authentic Moxie 35mm movie reels on the wall, along with our actual Simplex XL projector on the left side of the table. The other goodies included: the bent hammer, the 18\" wall plugs, museum plaques for each Moxie artifact, a reel of 35mm film, the newsletter sign-up sheet, hand-made (by Nicole) Moxie merchandise posters, and one of our theater chairs.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/060705/nicole.jpg\" width=\"425\" />\r\n\r\nNicole: popcorn wench extraordinaire. Isn't her apron cute?\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/060705/popcorn.jpg\" width=\"425\" />\r\n\r\nThis is a picture of the Moxie's very first batch of popcorn. Of course, by the time this picture was taken, we had already consumed the vast majority of it... but there it is, all the same. Take a moment to notice the sparkling clean kettle, courtesy of Dan's big right arm.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/060705/benzo.jpg\" width=\"425\" />\r\n\r\nAnd here's Mr. Benzo, who now resides on my desk and chides me whenever my mind starts to wander or I decide it's time to look at naked celebrity websites. Thanks Whitty!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-06-07T10:37:40.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "JED",
      "body": "I am glad First Friday was a success. Springfield is going to love the theater. I myself, can't wait to check it out. Oh and I hope DUG dies. ",
      "created_at": "2005-06-07T22:57:47.000Z"
    },
    {
      "author": "DUG",
      "body": "Mr. Benzo is awesome, I want one.  You going to mass produce and sell them?",
      "created_at": "2005-06-07T23:27:00.000Z"
    },
    {
      "author": "bjork24",
      "body": "You'd have to ask Whitty.",
      "created_at": "2005-06-07T23:44:10.000Z"
    },
    {
      "author": "Justin",
      "body": "Little Benzo needs a life-size brother!",
      "created_at": "2005-06-08T00:15:09.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "And a plastic missle shooting bigger brother!",
      "created_at": "2005-06-08T00:48:31.000Z"
    },
    {
      "author": "whitty",
      "body": "Hey, people you can make your very own Benzo with some commercial felt and a glue gun!  Everybody's doing it!  \r\n\r\nAlso, cutting really crookedly is key.  Apparently.",
      "created_at": "2005-06-08T01:00:31.000Z"
    },
    {
      "author": "whittler",
      "body": "What does the \"i\" on Benzo's chest stand for? Is it Igloo?",
      "created_at": "2005-06-08T01:59:06.000Z"
    },
    {
      "author": "bjork24",
      "body": "That's not an \"i\", it's his life monitor. It has a read out at the top, two buttons in the middle, and a vent at the bottom.",
      "created_at": "2005-06-08T02:17:00.000Z"
    },
    {
      "author": "Craig",
      "body": "Congrats on a successfull first interaction with your future customers. I would have swung by, but, well, I'm in California.",
      "created_at": "2005-06-08T02:55:48.000Z"
    },
    {
      "author": "Caleb C.",
      "body": "Yep, you can blame Brew Co for ruining my appetite for popcorn. Although it did smell quite good.\r\n\r\nThat was actually the first First Friday I've ever been to because normally I'm always working on Friday nights. But I don't anymore so I can enjoy the large crowds flowing through downtown Springfield.\r\n\r\nAnd I'm sure you've answered this question before, but how many seats will there be in the theater when it is finished?",
      "created_at": "2005-06-08T03:05:02.000Z"
    },
    {
      "author": "bjork24",
      "body": "About 70, give or take 69...huh huh...69.",
      "created_at": "2005-06-08T03:21:10.000Z"
    },
    {
      "author": "Trint",
      "body": "Hey, thanks for the link! And the button, which has already provided me the opportunity to proselitize a couple of heathens into the Church of Moxie.",
      "created_at": "2005-06-08T03:29:45.000Z"
    },
    {
      "author": "Nate",
      "body": "I too have a vent on the bottom.",
      "created_at": "2005-06-08T17:02:14.000Z"
    },
    {
      "author": "Laura",
      "body": "This has nothing to do with First Friday, but I haven't seen it posted anywhere else.  Say hello to <a href=\"http://news.yahoo.com/news?tmpl=story&u=/ap/20050605/ap_en_ce/people_penn_jillette_7\">Moxie CrimeFighter</a>.  \r\n\r\n(I hope I posted this link right...fingers crossed)",
      "created_at": "2005-06-09T00:22:33.000Z"
    },
    {
      "author": "Laura",
      "body": "Ok, so maybe try this one instead.\r\n\r\n<a href=\"http://news.yahoo.com/news?tmpl=story&u=/ap/20050605/ap_en_ce/people_penn_jillette_7\" target=\"_blank\">Moxie CrimeFighter</a>) ",
      "created_at": "2005-06-09T01:52:16.000Z"
    },
    {
      "author": "bjork24",
      "body": "Laura: indeed, I have heard about that. Quite strange. I'm going to name my daughter \"Daughter.\"",
      "created_at": "2005-06-09T02:12:18.000Z"
    },
    {
      "author": "Nate",
      "body": "...something self serving.",
      "created_at": "2005-06-09T02:25:02.000Z"
    },
    {
      "author": "Gay",
      "body": "Ummmm...I could be wrong, but I don't think there IS a First Friday Arts Walk in July. The event resumes in August.",
      "created_at": "2005-06-09T03:51:22.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
