{
  "id": 230,
  "title": "417-I-59-ha-ho",
  "body": "I don't like paying more for something when I know I can find it elsewhere for much less. You dig? That's why I love Froogle. However, when it comes to getting a phone for the theater, I don't have much of a choice. It's SBC or nothing. I could use a VoIP service, like Vonage, but they're still too new for my liking. Plus, Vonage can't be used for data lines (i.e. credit card transactions). Let me break it down for you again... you know I only say it ’cause I’m truly genuine... don’t be a hard rock when you really are a gem... sorry. I don't know what came over me just then.<br/><br/>MOXIE LINES<br/>Line 1 - Business line<br/>Line 2 - Movie line<br/>Line 3 - Credit card line<br/><br/>According to SBC, I have two choices for my first line. I can pay $48.95 for a line that includes everything (long distance, call forwarding, caller ID, and a whole bunch of other stuff we don't need). After that, each additional line is $39.99... DAAAAAMN, GINA! That's a lot of money. Not to mention the additional $29.99 we have to pay for DSL, which, regardless of what anyone else thinks, is ESSENTIAL. So, I ask the SBC sales lady, \"what's the absolute lowest I can get a line for. I don't need long distance or call forwarding or anything like that. Just a local line. Period.\" The answer: $34.25! So there it is, my two choices: $160 for a line with everything or $135 for a bare-bones set-up.<br/><br/>You'we in big twouble, mistew.<br/><br/>I just don't understand it. I pay $17.95 for our home phone. It doesn't do anything special other than work when I pick it up... 72% of the time. So why can't I get a business line for the same price? According to a friend of mine who works for SBC - we'll call him Deep Throat - there's absolutely no difference between a residential line and a business one... other than the \"perceived notion\" that the business line will have a higher call volume than the one wired into your kitchen. I don't know about that, because I can remember my sister talking on the phone for a good eight to ten hours back when she was in junior high.<br/><br/>I'm telling you, SBC is bending me over and delivering the biggest slushy-gushy hug of all TIME! But what else can I do? I can't comparison shop with PacBell for a better deal. Argh! I just have to lay here and take it... right in the phone hole! I'm so disgusted, I don't know what else to say... so I'm going to sing a song:<br/><br/><i>I'm in love with you Dr. Pepper, 'cause you're on my mind,<br/>you're the one I think about most every time.<br/>And when you pack some prunes in everything you do,<br/>don't you understand, Dr. Pepper, this love is true.<br/><br/>You're soft, succulent, so sweet and thin<br/>that's kind of like a pimple upon my skin.<br/>You lighten up my day, and that's oh so true.<br/>Together we're one, separated we're two.<br/><br/>To make you all mine, all mine is my desire.<br/>'Cause you contain caffeine, you that I admire.<br/>You're pretty plain and simple,<br/>you rule my world so try to understand.<br/><br/>I'm in love, Dr. Pepper,<br/>I'm so in love, Dr. Pepper.<br/>I'm just in love, Dr. Pepper, and this is true.<br/><br/>[CHORUS]<br/>Dr. Pepper, you know it's true.<br/>Ooh, Ooh, Ooh I love you.<br/>Yes, you know it's true.<br/>Ooh, Ooh, Ooh I love you.<br/>Dr. Pepper, you know it's true.<br/>My love is for you.<br/>Dr. Pepper, you know it's true.<br/>My love is for you.<br/><br/>This is some sort of thing, Dr. Pepper, I can't explain,<br/>my caffeine shakes start up when I hear your name.<br/>Maybe your sweet sweet taste would ring in my ear,<br/>then delay my system when you are near. (WTF?)<br/><br/>Come with your positive sugar content, Dr. Pepper, making enjoyin'<br/>that's for me to bust (?) it's like a can of pop and a boy.<br/>These feelings I get, I often wonder why,<br/>so I thought I might drink you, Dr. Pepper, just you and I.<br/><br/>Now where I buy you, I don't care, as I've said before,<br/>no reason that I like you, Dr. Pepper, just for what you are.<br/>If I said I'd think about it, you rule my world so try to understand.<br/><br/>I'm in love, Dr. Pepper,<br/>I'm so in love, Dr. Pepper.<br/>I'm just in love, Dr. Pepper, and this is true.<br/><br/>[CHORUS]<br/>Dr. Pepper, you know it's true.<br/>Ooh, Ooh, Ooh I love you.<br/>Yes, you know it's true.<br/>Ooh, Ooh, Ooh I love you.<br/>Dr. Pepper, you know it's true.<br/>My love is for you.<br/>Dr. Pepper, you know it's true.<br/>My love<br/>Dr. Pepper, you know it's true.<br/>Ooh, Ooh, Ooh I love you.<br/>Yes, you know it's true.<br/>Ooh, Ooh, Ooh I love you.</i><br/><br/><b>ALSO</b> - Kinda off the subject, but if you want to suggest a movie for us to play, you can do so over at <a href=\"http://www.moxiecinema.com/forum\" class=\"broken\">the Moxie Forum</a>. Woot w00t!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-06-09T03:06:23.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Aaron Scott",
      "body": "For some reason, my mom doesn't appreciate that I use the most basic telephone service, too. No caller ID, no call waiting, no long distance. On top of that, my cell phone is seven years old and the battery lasts for about three and a half minutes. So, Camdenton doesn't hear from me very often.<br/><br/>But hell, it works for me!",
      "created_at": "2005-06-09T03:23:41.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Is it impractical to do credit transactions over an Internet connection? I know it's possible, but maybe it's more involved than I understand for point-of-sale stuff.",
      "created_at": "2005-06-09T05:51:31.000Z"
    },
    {
      "author": "bjork24",
      "body": "Dave: It's possible, but not through our merchant account.",
      "created_at": "2005-06-09T05:54:52.000Z"
    },
    {
      "author": "Steve Kirks",
      "body": "Dan:<br/><br/>My day job is an engineer for NuVox Communications, a company that sells phone service and internet access to businesses.  The SBC prices you were quoted do not include their surcharges--extra fees they are allowed to charge to \"recover costs\".<br/><br/>A $34.25 line will likely have another $7 worth of surcharges, then taxes, too.<br/><br/>Call me at 877-4792 and I'll walk you through it.  Maybe we can pick you a couple of cool numbers to have...",
      "created_at": "2005-06-09T08:59:46.000Z"
    },
    {
      "author": "Allison",
      "body": "I understand your concern for doing things by the books, but can't you get a non-business account just by telling them your first name is Moxie and your last name is Cinema?",
      "created_at": "2005-06-09T09:16:24.000Z"
    },
    {
      "author": "nathan springer",
      "body": "lets blow sbc up, then pee on the ashes... whos with me, YA!",
      "created_at": "2005-06-09T10:20:29.000Z"
    },
    {
      "author": "DUG",
      "body": "I'm with ya nathan.  SBC can suck it, then shove it up there desperate tite ass!",
      "created_at": "2005-06-09T18:48:01.000Z"
    },
    {
      "author": "Caleb C.",
      "body": "I used to work for MCI selling their local phone service (yes I was an annoying telemarketer for about four months). They have a business plan with high speed internet too. Here's some stuff I found on their website:<br/><br/>For $59.99 a month you can get unlimited nationwide calling and all the features and add high speed internet for $50 and up to 14 additional phone lines for addtional costs (which I couldn't find the prices online for). You might be looking at a slightly cheaper price with them. <br/><br/>Just something to look into.",
      "created_at": "2005-06-09T18:50:21.000Z"
    },
    {
      "author": "Matt",
      "body": "The bells are balls.  All of them.",
      "created_at": "2005-06-09T20:47:30.000Z"
    },
    {
      "author": "ron",
      "body": "you should get Mediacom cable, then get Vonage, and process your debit/credit card purchases through a browser-based point of sale system.  I run a business in town here and have been using the Mediacom/Vonage combo for phone/highspeed Internet access for more than a year now and the service hasn't hiccupped once.  BofA handles my merchant account, and has a great browser-based POS system.  I gave up SBC because they pissed me off about the rates too, and didn't care when I threatened to switch to another carrier.  Then I realized that there weren't any others, so I gambled on Vonage.  It's worked like a champ ever since.  <br/>PS - No \"thank you\" for pointing out the 417 article last week?",
      "created_at": "2005-06-09T21:55:42.000Z"
    },
    {
      "author": "Nate",
      "body": "Please validate me too, while you're at it. ;)",
      "created_at": "2005-06-09T23:03:54.000Z"
    },
    {
      "author": "JED",
      "body": "I have a plan. OK, so we find Edward E. Whitacre Jr.(CEO of SBC) and punch him in the face. Then we break out....Thats about it. Not much else you can do when they monopolize the Ozarks like that. It will make you feel alot better though Dan, and isn't that what the Moxie is all about? Making people feel better, one punch at a time.",
      "created_at": "2005-06-10T01:48:37.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yes... that is what the Moxie is all about!",
      "created_at": "2005-06-10T03:06:33.000Z"
    },
    {
      "author": "jamie",
      "body": "yea.. dam the man (ed w.) Oh crap never mind... he pays my bills.  ",
      "created_at": "2005-06-10T04:18:56.000Z"
    },
    {
      "author": "open up and say AH",
      "body": "Let's face it, the communications industry is handcuffed by the government.  On every one of your phone/DSL/cell bills, you will see a high number of taxes and fees just to recoup the fees charged by the government.  These are the costs that drive the bill up.  However, if you want good quality service, SBC can provide that.  How many times have you picked up your landline and not had a dialtone?  DSL is still in its birth phase, it has a while to maturity so there are some outage issues still.  Cell phones are the same way.  Until the FCC gets their game in order, prices will be high for communications.  VOIP is still in its infancy, and you are definitely going to need 911 service in case of an emergency at your theater.  Don't hesitate to call if you need help setting things up, we have discussed different options in the past.  Keep hope alive, hope is on the horizon with all of the new technologies coming our way.",
      "created_at": "2005-06-10T06:41:46.000Z"
    },
    {
      "author": "nathan springer",
      "body": "we should start a moxie mob or gang and break peoples knee caps with baseball bats",
      "created_at": "2005-06-10T10:32:28.000Z"
    },
    {
      "author": "ron",
      "body": "Vonage has 911 service.  And it works.  Forget about DSL.  You need SBC to provide that, so it's kind of pointless to think about using DSL as a basis for Vonage, isn't it?  You need CABLE Internet service, not DSL.  DSL is slow, and since it's provided by SBC, it defeats the purpose of switching to Vonage.  Vonage is reliable (more dial tone reliability thatn SBC) and a heck of a lot less expensive than even the basic SBC service.  And you get a toll-free number.  And all your long distance (USA and Canad) is included in the basic fee. We make a lot of calls to Australia, Japan, and other Asian countries, and the rates are three to four cents per minute.  You can't beat that with a popcorn-mixing stick, and the service is so clear. ",
      "created_at": "2005-06-10T18:24:14.000Z"
    },
    {
      "author": "ron",
      "body": "I meant \"Canada,\" not \"Canad.\" And don't let those SBC guys tewll you that VOIP is still in a \"birthing phase.\" They're trying to get you to hold off until SBC has a VOIP service to provide.  Even SBC's land line services can't match the services included with Vonage's basic service.  3-way calling, conference calling, voicemail that works, and automatically sends the message to your email so you can archive the .wav voicemail message files instead of clogging up your voicemail, 911 service, call forwarding to your cell phone, and then back to your voicemail if you don't answer your cell phone, caller ID, call waiting, etc., etc.  AND... you can use your regular phones (even cordless ones) and you can use all of the phoine jacks in your office or home.",
      "created_at": "2005-06-10T18:33:09.000Z"
    },
    {
      "author": "ron",
      "body": "I meant \"tell,\" and not \"tewll.\" And Vonage works with my fax machine, both incoming and outgoing, so don't let anyone tell you data doesn't fly on Vonage.  It does.  Have I ever lied to you? ",
      "created_at": "2005-06-10T18:35:18.000Z"
    },
    {
      "author": "justin",
      "body": "My telephone protocol can beat up your telephone protocol.",
      "created_at": "2005-06-10T19:32:57.000Z"
    },
    {
      "author": "nicole",
      "body": "Ron - are you secretly an employee of Vonage?",
      "created_at": "2005-06-10T19:40:05.000Z"
    },
    {
      "author": "JED",
      "body": "Nathan, I am with you on the knee cap breaking thing. The Moxie Posse, Yeeeaaaahhhhh Boyyyeeeeee. <br/><br/>Nicole, Ron is secretly partnering with Vonage's p2p advertising group. You know those guys who go onto blogs and talk something up really big to make it seem like the thing to have. Like the \"Skip-it.\" It's makin a comeback kids and we can't stop it. So lets all go out and get one. It cures cancer and does your taxes (it cheats too) and will save you millions over the course of 3 years. It will get you that house in the hills and dates with gorgeous supermodel type ladies. Get one or be uncool forever. ",
      "created_at": "2005-06-10T22:21:25.000Z"
    },
    {
      "author": "ron",
      "body": "No.  I don't work for Vonage.  And I wasn't trying to sell anyone here on anything.  You all think I was addressing you?  I was offering Dan a little business advice based on my experience. I run a business here in Springburg and I found something better when SBC was trying to stick it to me with their business rates.  Just trying to help with a suggestion and a testimonial, and then trying to straighten people out who post uneducated comments like \"you are definitely going to need 911 service in case of an emergency at your theater.\"<br/>You all can stay with SBC and leave all the bandwidth/low rates to us mediacom/vonage users. ",
      "created_at": "2005-06-10T22:29:16.000Z"
    },
    {
      "author": "nicole",
      "body": "I know you don't work for Vonage, Ron. I was just kidding. But, as usual, my sarcasm doesn't really come through over the internet.<br/><br/>We'll definitely keep Vonage in mind when deciding on our telephone provider.",
      "created_at": "2005-06-10T23:01:38.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Tin cans. Tin cans and string.",
      "created_at": "2005-06-10T23:25:40.000Z"
    },
    {
      "author": "Nate",
      "body": "Bat signal and flare guns, and payment with a livestock barter system only.",
      "created_at": "2005-06-11T00:38:55.000Z"
    },
    {
      "author": "Jonathan",
      "body": "Haha I like Nate's idea.<br/><br/>Did you hear SBC's executive??<br/><br/>\"(Telecoms) and the cable companies have made an investment, and for a Google or Yahoo or Vonage or anybody to expect to use these pipes (for) free is nuts!\"<br/><br/>-- SBC Communications CEO Ed Whitacre<br/><br/>Hilarious. Great post!<br/><br/>Cheers! ",
      "created_at": "2006-04-07T01:17:34.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
