{
  "id": 231,
  "title": "Window coverings hurt my guts",
  "body": "It's been a long day. I've been working on the window coverings since early this morning. I'm happy to report that they are now at the custom vinyl place... having custom vinyl applied to them. Sweet! Beyond that, I don't have much to report. The electrician seems to be job hopping - one week our place, the next week another place. This week wasn't our week. I think they pulled a few wires on Monday, but I'm can't tell for sure. I hope they start up again on Monday, because... you know... it would be nice to actually OPEN the theater some time soon.<br/><br/>Other than that, it's a Friday, and we all know what that means... nothing. I'm going to go shower the soundboard stench off my body and, afterwards, find a good place to have a beer and watch the Cardinals beat up the Yankees. Woo hoo!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-06-11T00:55:59.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Stephanie",
      "body": "Even though our teams are in the same division, and yours is in first place while mine is in...third (at the moment), I'm always happy to see *anyone* beat the Yankees.",
      "created_at": "2005-06-11T02:09:51.000Z"
    },
    {
      "author": "Scott G",
      "body": "Are you getting some customization done to the window coverings, like a special design or something?  Or are they just getting redone?  Please tell.",
      "created_at": "2005-06-11T03:18:58.000Z"
    },
    {
      "author": "bjork24",
      "body": "All custom, Scott. There's a post about it a couple of weeks back. There will also be a phlog detailing the experience... probably some time next week.",
      "created_at": "2005-06-11T03:42:56.000Z"
    },
    {
      "author": "nicole",
      "body": "If lifting those window coverings was an Amazing Race task, I would have set Dan and me behind quite a bit. Those things were heavy!",
      "created_at": "2005-06-11T03:49:19.000Z"
    },
    {
      "author": "Tawny",
      "body": "Nicole, you and Dan would be so great on the Amazing Race!! Have you two thought about applying? We could start a bloggers fan club for you and watch you on the tv's at a sports bar!! <br/>Go Nicole and Dan!!!",
      "created_at": "2005-06-11T20:51:20.000Z"
    },
    {
      "author": "erin",
      "body": "so which design did you go with?",
      "created_at": "2005-06-12T04:56:44.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
