{
  "id": 232,
  "title": "Hey look, Part 11",
  "body": "I actually used the phrase \"as open as possible\" seven more times during the interview, but Eric chose NOT to use the <i>other</i> ones.\r\n\r\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\r\n\r\n<b>Business blogs missing in Springfield</b>\r\nBy Eric Olson\r\n<a href=\"http://www.sbj.net\" target=\"_blank\">Springfield Business Journal</a>, June 13, 2005\r\n\r\nThe blogs are coming.\r\n\r\nIt sounds like a late night horror flick. But blogs are nothing to be scared of. It's just that they are increasingly creeping into the business world.\r\n\r\nWhat is a blog? It's short for Web log, in which individuals express their thoughts - mostly unedited and in a journal format - for the whole World Wide Web to see.\r\n\r\nOnce reserved for Web geeks, politicos or gossip queens, blogs are everywhere - an estimated half a million exist - and the corporate world is not getting left behind. Some of the country's largest companies have embraced blogs.\r\n\r\nAt General Motors, for instance, executives write their own blogs, and car enthusiasts ask for mechanical advice on another.\r\n\r\nSun Microsystems President Jonathan Schwartz has been known to spout off on his personal blog, most recently against IBM CEO Sam Palmisano.\r\n\r\nI discovered this business blog boom on a flight to California in late May, reading a story in the airline publication American Way. Upon my return to Springfield, The Associated Press ran a similar article. It got me thinking, what business blogs exist in Springfield?\r\n\r\nBlogging does exist here, but it's not yet mainstream among businesses. No Bass Pro Shops blog, no John Q. Hammons blog, no City Utilites blog - but think of the possibilities.\r\n\r\nSure, there are blogs about attorney Aaron Sach's apparent makeover on the back cover of the new SBC phone books (2004 vs. 2005) and First Friday Art Walk happenings. And a group of bloggers meets monthly at Patton Alley Pub.\r\n\r\nBut the local blog scene is missing the meaty business blogs - those that talk about company products, pricing, service and, deeper yet, executive and employee posts covering everything from a company's upcoming plans to dialogue about its operations structure or culture. These offer customers a glimpse into the day-to-day business and allow them to post their own comments.\r\n\r\nIf anybody would be ahead of the curve in Springfield, it's be Jack Stack of SRC Holdings Corp., the man who invented complete openness among employees, right?\r\n\r\n\"We're not that far,\" Stack said when I asked if SRC had entered the blog age. \"I don't get it yet. My blog comes in an 8-by-10 folder, and it's called an employee job satisfaction review.\"\r\n\r\nIn my search for local business bloggers, I ran into Steve Kirks, a blog expert who lives in Springfield. Kirks works as a product manager for California-based UserLand Software, which develops Web log technology.\r\n\r\nHe, too, is unaware of any local business blogs, though, he admitted he's in conversation with some businesses for marketing-based blogs and one that is interest in starting a downtown activity blog.\r\n\r\n\"Locally, Web logs would make a tremendous impact, but probably not in a way people would expect,\" said Kirks, who writes his own blog, <b>www.houseofwarwick.com</b>.\r\n\r\nThe fear for businesses is that they would become vulnerable to public opinion. But, according to Kirks, \"It really just depends on how much you talk about.\"\r\n\r\nInterestingly, that sense of vulnerability can lead to a sense of respect among its customers and competitors.\r\n\r\n\"Most people will start a Web log at a business ... as a way to communicate with their customers better. But, what they'll find out is that what they say on their Web log isn't stuff that they wouldn't have already said, it will just be that unedited voice of a person,\" Kirks said. \"And it will build a strong personal relationship between a customer of any flavor and a business of any flavor.\"\r\n\r\nOne entrepreneur ahead of the local curve is Dan Chilton, the man behind downtown Springfield's yet-to-open Moxie Cinema. Chilton started <b>/moxie</b> in May 2004 to chronicle his steps in getting the cinema open. There were five readers a day - Chilton, his wife, Nicole, and their friends. One month later, the blog landed on Google's blogs of note.\r\n\r\n\"From that day on ... I was getting about 20,000 visitors per month,\" Chilton said. \"Now, it's dwindled down to 500 visitors per day.\"\r\n\r\nThrough it all, Chilton has stayed true to the blog's purpose of disseminating information. He even posts the cinema's operating budget and expenditures.\r\n\r\n\"I've just kept it a promise to myself and the readers to be as open as possible with every aspect of the theater,\" Chilton said. \"That's the whole idea behind the blog, to be as open as possible with my readers and offer a real inside view of what it is like to open a business.\"\r\n\r\n<b>Other Springfield blogs:</b>\r\n<b>• <a href=\"http://springfieldian.blogspot.com\" target=\"_blank\" class=\"broken\">www.springfieldian.blogspot.com</a></b> Has a listing of Springfield blogs.\r\n<b>• <a href=\"http://www.thebignoob.com\" target=\"_blank\" class=\"broken\">www.thebignoob.com</a></b> Neubix Studios staff mixes national news that affects the Web industry with personal posts.\r\n<b>• <a href=\"http://queencitydowntown.blogspot.com\" target=\"_blank\" class=\"broken\">www.queencitydowntown.blogspot.com</a></b> Serves as a calendar of downtown events and as a Web site directory.\r\n<b>• <a href=\"http://radishinfoshop.blogspot.com\" target=\"_blank\">www.radishinfoshop.blogspot.com</a></b> The blog of non-profit bookstore The Radish Infoshop on North Boonville in downtown Springfield. The bookstore's motto: \"We seek to educate and agitate for a world free from all forms of oppression and exploitation.\"\r\n<b>• <a href=\"http://www.sgfsoccer.com\" target=\"_blank\">www.sgfsoccer.com</a></b> Marketing and sales consultant Steve Olson set it up to advocate soccer in the Springfield region. The goal is to bring players, coaches and sports businesses together on the Web to help with recruiting, facility use, sales, etc.\r\n<b>• <a href=\"http://www.houseofwarwick.com\" target=\"_blank\" class=\"broken\">www.houseofwarwick.com</a></b> Blog software aficionado Steve Kirk's personal blog covers everything from business to his 35th birthday.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-06-13T18:56:27.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "As open as possible.  Good article.",
      "created_at": "2005-06-13T19:16:15.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Hey, he's an editor--he's gotta do what he's gotta do. Gotta do what it takes to make you sound less redundant.",
      "created_at": "2005-06-13T19:51:26.000Z"
    },
    {
      "author": "Steve Kirks",
      "body": "Thanks for the pointer to this--where did you find it online?\r\n\r\n",
      "created_at": "2005-06-13T23:14:07.000Z"
    },
    {
      "author": "bjork24",
      "body": "Steve: you're looking at it. I typed it in by hand... because I'm AWESOME!",
      "created_at": "2005-06-13T23:22:21.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Steve:: You'll find it online here before too long on our current site. We're launching the new SBJ site in several weeks so I figure it will be directed somewhere else when the new CMS for the archives is launched. I assume you are looking to link it up to your site.",
      "created_at": "2005-06-14T00:09:26.000Z"
    },
    {
      "author": "Aleah Marie",
      "body": "Wow, I made it on the Moxie blog!  What a treat.  Very interesting article, too.  The blogs are coming, like it or lump it.  They're a great tool.  I wish our public library had a blog.  Some libraries do, and they're very useful.  (I'm a librarian, btw, hence the apparently unconnected detour.)",
      "created_at": "2005-06-14T01:54:51.000Z"
    },
    {
      "author": "Jo",
      "body": "I thought \"as open as possible\" was a reference to the current state of the Moxie.",
      "created_at": "2005-06-14T03:06:19.000Z"
    },
    {
      "author": "bjork24",
      "body": "Oh, Jo ... *wipes away a tear* ... I wish!",
      "created_at": "2005-06-14T03:08:48.000Z"
    },
    {
      "author": "Nicki J",
      "body": "It's been oh-so-long since my last comment. I've let you down!",
      "created_at": "2005-06-14T09:51:08.000Z"
    },
    {
      "author": "JED",
      "body": "Dan I must start sending you pics of the \"adventures of Moxie shirt.\" I have some good ones. ",
      "created_at": "2005-06-14T23:19:47.000Z"
    },
    {
      "author": "Caleb",
      "body": "Yes?",
      "created_at": "2005-06-15T04:31:14.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
