{
  "id": 235,
  "title": "Moxie Shirt Adventures!",
  "body": "As suggested by my friend Jed, wouldn't it be cool to have a picture record of all the wild and crazy adventures the Moxie shirts got / get themselves into? The answer, my friends, is yes... it would be really cool. So, if you're one of the special few (I believe there's 40 of you right now) who have a Moxie shirt, why don't you jump in front of the camera and show us what kind of adventure <i>your</i> shirt has been on. I know there's at least 2 shirts floating around the UK, so I better see some Stonehenge shots, or Coldplay posing with the shirt, or something!<br/><br/>After I get a few shots, I'll start a special phlog and add a button to the sidebar for MOXIE SHIRT ADVENTURES! This could be huge... huger than the traveling gnome... huger than BENZO even! To get your creative juices flowing, here's a couple examples:<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/061605/beach.jpg\" width=\"425\" /><br/><br/>Here's a Moxie shirt chillin' and maxin' at a beach in Southern California, where the girl shirt ratio to guy shirt ratio is 4 to 1. Picture by <a href=\"http://www.geocities.com/abovedarim21/jed.html\" target=\"_blank\" class=\"broken\">Jed</a>.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/061605/justin.jpg\" width=\"425\" /><br/><br/>The Moxie shirt has been known to increase the growth of facial hair tenfold! Picture by <a href=\"http://justin.retroflux.com\" target=\"_blank\" class=\"broken\">Justin</a>.<br/><br/>So what has your shirt been up to? Moxie shirt in a strip club? Moxie shirt atop the PECO building in Philadelphia? Moxie shirt posing with Yeardley Smith? So many opportunities, so few shirts.<br/><br/>Send your pictures to me (dan **AT** moxiecinema **DOT** com) and I'll post them for all to see. Multiple submissions are cool, and, for you shy folk, face blurring is available upon request.<br/>",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-06-16T18:55:40.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "Wow, what a handsom devil he is!",
      "created_at": "2005-06-16T18:58:21.000Z"
    },
    {
      "author": "justin",
      "body": "Oh, and yes, I take full responsibility for taking one of those Internet-cliche-reflection-mirror-photographs.   Cut me some slack - I was home alone with no one to take a picture for me!",
      "created_at": "2005-06-16T18:59:46.000Z"
    },
    {
      "author": "nicole",
      "body": "That's ok, Justin. Even when other people (ahem, Dan) are home to take pictures of me in my creations, I still have to do the reflection in the mirror thing. Stupid computer. ",
      "created_at": "2005-06-16T19:09:51.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "I almost wore my Moxie shirt when I went to meet up with Dan and Nicole a weekend or so ago. That would have just been awkward.",
      "created_at": "2005-06-16T19:30:27.000Z"
    },
    {
      "author": "bjork24",
      "body": "The PECO building fascinates me, b/c it spoke to me. When I was flying out of Philly last December, I glanced towards downtown and the PECO building said \"GOODBYE DAN\" on the big 4 story marquee.",
      "created_at": "2005-06-16T20:46:51.000Z"
    },
    {
      "author": "DUG",
      "body": "Is it just me, or is that Moxie shirt about to save the girl in the background being strangled by that guy?  ",
      "created_at": "2005-06-16T19:37:49.000Z"
    },
    {
      "author": "Nate",
      "body": "I know there are some Philly readers of this blog...and if they have the shirt, I would just love them forever if they took pics of their shirt(s) at one of two places:<br/><br/>1 - At the corner of Pechin and Pensdale in Manayunk.<br/><br/>2 - in front of Old City Coffee on Arch St off of 3rd in Old City.<br/><br/>There are numerous other, more famous, places as well (in front of the Art Museum on the \"Rocky\" steps, facing back to Center City!) but these two have sentimental reasons.  I will send beer.<br/><br/>Why the top of the PECO building, I have no idea.  PECO still wants money from me.",
      "created_at": "2005-06-16T19:54:25.000Z"
    },
    {
      "author": "justin",
      "body": "Oh.. and I don't think I'd consider a trip to my bathroom an \"adventure\" for my Moxie shirt.",
      "created_at": "2005-06-16T20:47:10.000Z"
    },
    {
      "author": "Danny & Sandy",
      "body": "http://img282.echo.cx/img282/214/greasemoxie2hm.jpg",
      "created_at": "2005-06-16T20:50:08.000Z"
    },
    {
      "author": "JED",
      "body": "Moxie shirt's adventures is freakin awesome. I have more pics but they are not that good. I will send them anyway. Oh and Moxie shirt is auditioning hot chicks to pose in him. If Moxie shirt could somehow turn white, I'm sure a wet Moxie shirt contest could be arranged. <br/><br/>This project is going to be sweet.  ",
      "created_at": "2005-06-16T22:20:39.000Z"
    },
    {
      "author": "Nate",
      "body": "An adventure to MY bathroom, with the state it's in, could probably turn Moxie shirt white.  It has that effect on people at least.",
      "created_at": "2005-06-16T22:38:58.000Z"
    },
    {
      "author": "Yoda",
      "body": "If send me a shirt you would, photo on Dagobah I would take.  Some \"adventure\" this place could use.  Gets old, levitating rocks does.  Put shirt on R-2 unit, I will.  Amuse myself and shut him up it will.<br/><br/>Extra small, I will need.<br/>\"Size matters not\" jokes, I need not!",
      "created_at": "2005-06-16T22:45:44.000Z"
    },
    {
      "author": "nicki j",
      "body": "hahahaha. good one, yoda.",
      "created_at": "2005-06-17T02:16:22.000Z"
    },
    {
      "author": "Mark S",
      "body": "Top idea. I'm not sure about Stonehendge (there don't really let you near it) but I might have something 'special' for you next month.<br/><br/>Hmm, that sounded a bit odd.<br/><br/>M",
      "created_at": "2005-06-17T03:05:30.000Z"
    },
    {
      "author": "nathan springer",
      "body": "AMAZING",
      "created_at": "2005-06-17T04:58:01.000Z"
    },
    {
      "author": "Jamie",
      "body": "Oh dammit!  We just got back from Orlando yesterday and I had my shirt with me, but no pics with it.  I could have asked Mickey Mouse to wear it.  <br/><br/>We will make up for it in a few days when we go to Chicago.  Any requests?",
      "created_at": "2005-06-17T05:46:43.000Z"
    },
    {
      "author": "brian of moore",
      "body": "crap... wish i thought about this.. before i  left to bonnaroo in tennessee last weekend <br/>*moxie shirt surrouned by hippies*",
      "created_at": "2005-06-17T07:50:03.000Z"
    },
    {
      "author": "Ole",
      "body": "Jamie - at the site of the new Chicago Fire Soccer stadium in Bridgeview (or is it Bridgeport?) or at any restaurant/bar in Lincoln Square so I can feel homesick. ",
      "created_at": "2005-06-17T07:50:37.000Z"
    },
    {
      "author": "brian of moore",
      "body": "oh.. and i stood 5 feet from mike from phish (nobody cares)  moxie shirt with mike gordon! (nobody cares... still)",
      "created_at": "2005-06-17T07:51:37.000Z"
    },
    {
      "author": "Caleb C.",
      "body": "Moxie in technicolor?",
      "created_at": "2005-06-17T20:18:56.000Z"
    },
    {
      "author": "Caleb C.",
      "body": "This reminds me of the lawn gnome from Amelie. Poor old man. How could she do that to her poor father?!?<br/><br/>I bet you he worships that gnome every night now. But I bet he put a lot more concret on the ankles to keep him from wandering off again.<br/><br/>I hope someone who reads this is an Amelie fan, otherwise I sound like a rambling moron.",
      "created_at": "2005-06-17T20:20:59.000Z"
    },
    {
      "author": "Nate",
      "body": "I'd be willing to bet half the people that read this blog are huge Amelie fans.  I know The Danicole is.<br/>Plus, we've discussed Audrey T in the past.<br/><br/>Sadly, Travelocity completely frickin' co-opted the shtick for their commercials.  <br/><br/>It was the most blatant rip-off I've seen in a commercial until that recent one where the guy keeps calling a girl's answering machine over and over, because he's so nervous and rambles so much he keeps getting cut off before he can finish leaving his phone number.  <br/>Did Vince Vaughan and Jon Favreau get royalties for this thing?  <br/>Oh wait, the girl's name on the message is \"Vicky,\" not \"Nicki.\"  That makes it totally different!",
      "created_at": "2005-06-17T20:29:14.000Z"
    },
    {
      "author": "nicole",
      "body": "The gnome story was actually something that happened in real life before Amelie. It uh...happened to a friend of a friend of my sister's...<br/><br/>But I really have seen pictures in the past with the same concept.",
      "created_at": "2005-06-17T20:49:35.000Z"
    },
    {
      "author": "Nate",
      "body": "Okay, now that you mention it, I remember reading something about this a while back, and I went and found it:<br/><br/>http://www.slate.com/id/2095541<br/><br/>This is totally worth a read, except he calls Amelie \"maudlin\" (!)<br/><br/>So Travelocity is not guilty of being a plagiarist, just tired.<br/><br/>But I will take Moxie shirt anywhere!",
      "created_at": "2005-06-17T21:39:06.000Z"
    },
    {
      "author": "Nate",
      "body": "I can't do links.",
      "created_at": "2005-06-17T21:39:24.000Z"
    },
    {
      "author": "nicholas",
      "body": "Okay Nate... here's the secret.<br/><br/>&#60;a href=\"http://www.linkhere.com\"&#62;<span style=\"color: red;\">Link text</span>&#60;&#47;a&#62;",
      "created_at": "2005-06-18T02:57:10.000Z"
    },
    {
      "author": "Liz",
      "body": "My shirt sure showed its MOXIE when I started working at my multiplex theater again this week (we sadly are without an independet theater). I wore it until they got me a uniform and it wasn't intimidated at all by the <b>ten</b> projectors.  (<i>I</i> was, since I'm training to be a projectionist.)",
      "created_at": "2005-06-18T08:59:11.000Z"
    },
    {
      "author": "brian of moore",
      "body": "im sure at least 50% of the people here own amelie on dvd.... they should anyway... :-)",
      "created_at": "2005-06-18T09:42:29.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "I'm wearing my Moxie shirt in <a href=\"http://www.bendillon.com/blog/files/2005/06/portrait01.jpg\">this picture</a>, but you can't see the front of the shirt, so I suppose that doesn't work...",
      "created_at": "2005-06-20T06:58:48.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
