{
  "id": 238,
  "title": "One hundred and four weeks old",
  "body": "This post is for Nicki V. and her cute little smile.\r\n\r\nToday marks Nicole and my two year anniversary. On this day in 2003, I made the 2nd best decision of my life... and that was to not smash wedding cake in Nicole's face at the reception. The number one decision was, of course, asking Nicole to marry me, which would've been a lot more romantic had a certain <a href=\"http://www.cincodrive.com\" target=\"_blank\" class=\"broken\">someone</a> not ruined the surprise... accidentally. It's okay Stephy. I forgive you.\r\n\r\nIf you've been reading this blog since <a href=\"/posts/1\">the very first post</a>, then you already know how Nicole and I met, but since 99% of my current readership wasn't around back then, I'll take some time and refresh your memory. Following is the somewhat factual story of how Nicole and I met.\r\n\r\nEARLY MAY 2000\r\nDan arrives at the Springfield 8 movie theater for his first day of work. He strolls through the front door and is nearly blinded by the halo of light encircling the hott young thang working in the box office. It's Nicole!\r\n\r\n<b>DAN:</b> (covering eyes) You should really take down that mirror. (motions to mirror situated behind Nicole) It's reflecting the light from outside, and it nearly blinded me.\r\n<b>NICOLE:</b> Sorry. (pulls down mirror) Can I help you with something?\r\n<b>DAN:</b> Yeah. See that beamer out there? (points towards an older grayish-blue BMW)\r\n<b>NICOLE:</b> Uh huh.\r\n<b>DAN:</b> Yep. She's mine.\r\n<b>NICOLE:</b> (feigning interest) Really?\r\n<b>DAN:</b> No, not really. I'm just trying to turn you on, baby! (meows)\r\n<b>NICOLE:</b> Actually, that's my car, so I knew you were lying.\r\n<b>DAN:</b> Sure you did, hottness. Say, where's the manager around this place? I've got a job to do.\r\n<b>NICOLE:</b> (points to the office) Right in there.\r\n<b>DAN:</b> Later gator.\r\n\r\nAfter meeting with the manager, Dan is given an official Springfield 8 vest and a clapper board pin that says \"My name is DAN.\" He's then told to report to the concession area where he will be trained on the finer arts of concessionry by the lovely Nicole.\r\n\r\n<b>NICOLE:</b> This is the chili machine (caresses the top). If a customer wants chili on their nachos, this is how you squirt it out.\r\n\r\nNicole sticks her head under the spout and proceeds to squirt a good five to six pounds of steaming chili into her mouth.\r\n\r\n<b>NICOLE:</b> (mouth full) Fee. Jiff wike tha.\r\n<b>DAN:</b> You're the sexiest woman I've ever seen.\r\n<b>NICOLE:</b> (chili drips from her chin) Mmm fanks!\r\n<b>DAN:</b> I'm about 10 seconds away from throwing you onto that bag of raw popcorn and tickling you till chili squirts out of your nose.\r\n<b>NICOLE:</b> (chili squirts out of her nose) Mmm foo late!\r\n<b>DAN:</b> I'm going to marry you someday.\r\n<b>NICOLE:</b> (swallows) Sure you are. That's what all the guys I train in concession say.\r\n<b>DAN:</b> But by god, I mean it!\r\nNICOLE:</b> I bet you do.\r\n<b>DAN:</b> Check this out!\r\n\r\nDan, in hopes of impressing Nicole, grabs the kettle from the popper and tries to lift it above his head. Unfortunately for him, the kettle is a hair over 400 degrees hot.\r\n\r\n<b>DAN:</b> GGGAAAGGGGHHHHWWWW!!!!\r\n\r\nCUT TO: Dan being loaded onto an ambulance with bandages on both of his hands.\r\n\r\n<b>DAN:</b> Nicole! Nicole! (to the paramedics) Wait dammit! NICOLE!\r\n<b>NICOLE:</b> What?!\r\n<b>DAN:</b> I think I love you.\r\n<b>NICOLE:</b> No you don't. That's just the Demerol talking.\r\n<b>DAN:</b> No. Hey! Hey! Come here. (motions for Nicole to come closer) One day I'm going to marry you and we're going to start our own movie theater and then I can burn myself whenever I damn well please. You got that?\r\n<b>NICOLE:</b> I got it.\r\n<b>DAN:</b> Yeah?\r\n<b>NICOLE:</b> Yeah.\r\n<b>DAN:</b> (begins to weep) God, I love you so much. Don't forget about the Littles, Nicole! Don't forget the Littles!\r\n<b>NICOLE:</b> What \"Littles?\" The cartoon?\r\n<b>DAN:</b> Yeah, \"The Littles\" cartoon. They're run by the government, Nicole. It's all a ploy to get you to sell your unicorn! Don't listen to them, Nicole! NOOOOOO!\r\n\r\nThe paramedics begin pulling Dan into the ambulance.\r\n\r\n<b>DAN:</b> (bumps his hand on the gurney) OUCH! (to paramedics) Take it easy up there, dickweeds! (to Nicole) Bye sweetie! I love you! Bye! BYE!\r\n\r\nNicole waves as the ambulance drives away. <i>What if he's right?</i> she thinks. <i>Maybe \"The Littles\" are trying to get me to sell Penelope [unicorn].</i> Nicole shrugs her shoulders and heads back inside to sell more tickets to <i>Gladiator</i>.\r\n\r\nHappy Anniversary, Nicole! I love you! And I told you they'd make you get rid of Penelope... I TOLD YOU!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-06-21T23:01:54.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nicole",
      "body": "Pretty funny. I love you too!",
      "created_at": "2005-06-22T01:08:03.000Z"
    },
    {
      "author": "Justin",
      "body": "How cute.",
      "created_at": "2005-06-22T01:16:19.000Z"
    },
    {
      "author": "JED",
      "body": "Happy Anniversary!!!!! Thats about all the excitement you will get from me. Someone kill me......Please. ",
      "created_at": "2005-06-22T01:29:14.000Z"
    },
    {
      "author": "nicholas",
      "body": "Note that she does not deny nor challenge any of the story. I suspect it is entirely true...",
      "created_at": "2005-06-22T02:27:20.000Z"
    },
    {
      "author": "Izzy",
      "body": "Chili out the nose...that's gotta hurt.\r\n\r\n*taking notes*  I like your subtle approach with the ladies...",
      "created_at": "2005-06-22T03:05:35.000Z"
    },
    {
      "author": "Yoda",
      "body": "In order, congratulations are.  Large celebration scene, I envision.  Singing Ewoks, there will be.  Sing the original \"Yub-Nub\" song, they will, not the lousy remake.\r\n\r\nReminds me, your post does (funny it is) of when auditioned for Gladiator myself I did.  Yes!  It or not, Believe!  Oiled me up they did.  Threw the prop sword at Joaquin's double I did.\r\n\"Entertained are you not!\" I yelled.\r\n\"Entertained are you not!\"\r\n\r\nThe casting director - entertained he was not.",
      "created_at": "2005-06-22T03:15:57.000Z"
    },
    {
      "author": "Tawny",
      "body": "Damn the Littles.\r\n\r\nHappy Anniversary!",
      "created_at": "2005-06-22T03:20:55.000Z"
    },
    {
      "author": "Rachel",
      "body": "So first year is paper...second year is what? I hope it's popcorn, then you're both ready!",
      "created_at": "2005-06-22T03:25:48.000Z"
    },
    {
      "author": "Caleb",
      "body": "I think your story could be a movie. The scene where Nicole eats all that chili will have them rolling. \r\n\r\nHappy Anniversary to the both of you.",
      "created_at": "2005-06-22T04:57:32.000Z"
    },
    {
      "author": "Maddy",
      "body": "Damn happy couples...",
      "created_at": "2005-06-22T06:08:53.000Z"
    },
    {
      "author": "brian of moore",
      "body": "OH MY GOD!!  the littles!!!!\r\nnobody ever remembers that cartoon!\r\nor.. maybe too many of my friends are younger than me.. but i swear even the older friends think im crazy when i talk about that show... *sigh*  thank you dan and nicole... thank you for restoring my faith in the world\r\n\r\noh.. and happy anniversary",
      "created_at": "2005-06-22T06:33:55.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "I hope to one day meet a girl who can eat that much chili... (sigh) One day...\r\n\r\nHappy Anniversary!",
      "created_at": "2005-06-22T06:44:45.000Z"
    },
    {
      "author": "nicole",
      "body": "The 2-year is cotton, Rachel. I can eat a lot of chili. ",
      "created_at": "2005-06-22T08:16:49.000Z"
    },
    {
      "author": "Oz",
      "body": "I found that story a little disturbing.  But I'm glad it's worked out for you two crazy kids. :)",
      "created_at": "2005-06-22T17:22:26.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Hahaha, brilliant.\r\n\r\nHappy anniversary you two.",
      "created_at": "2005-06-22T19:49:00.000Z"
    },
    {
      "author": "DUG",
      "body": "You know, Dan did come home the first night he met Nicole and told me that he was going to marry her someday.  Happy anniversary!",
      "created_at": "2005-06-22T20:10:47.000Z"
    },
    {
      "author": "erin",
      "body": "now that is one darn good story to remember for the gandkids.",
      "created_at": "2005-06-22T20:29:02.000Z"
    },
    {
      "author": "JED",
      "body": "Another moxie shirt adventure in the books. Dan, you will get the shots no later than tonight. ",
      "created_at": "2005-06-23T00:32:50.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 14,
      "name": "Dialogue"
    }
  ]
}
