{
  "id": 239,
  "title": "A brief history of The Moxie, as told through this very blog over the past thirteen months - Part I",
  "body": "This blog is not a publicity stunt or a marketing scheme. Over the last few months it has been characterized as such by people who may have not taken the time to read through the archives. From the onset, this blog was designed to \"chronicle the process of developing, financing, starting, and maintaining a small, independently-owned, art-house theater,\" and that's exactly what's it done. Sure, the blog has gone through some ups and downs, much like The Moxie itself, but I've always made it a point to be completely honest with my readership about what's happening and why.<br/><br/>I'm not denying that The Moxie Blog has become an amazing publicity tool, nor am I disregarding its power as a potential market testing ground, but I'd by lying if I told you that was my intent from the beginning. People who believe otherwise are giving me far more credit than I deserve. The Moxie Blog has become what it has become for reasons beyond my careful direction and clever writing (wink wink nudge nudge). Springfield is ready for a theater like The Moxie, and the popularity of this blog proves that fact.<br/><br/>*steps down from soapbox*<br/><br/>I'm hoping this post will serve a multitude of purposes, but most notably to:<br/><br/><ol><li>illustrate the effectiveness of the blog in chronicling this entire process, step by wonderfully agonizing step</li><br/><li>serve as a \"catch up\" post for newer readers who think this blog is about little more than my hemorrhoids and Maura Tierney's wobbly bits</li><br/><li>give me a reason to wade through 110,000 of my own juicy words (believe it or not, I'm my own favorite writer)</li></ol><br/>So go grab a tall pint of beer, a warm mug of coffee, a half liter of Dr. Pepper, mix them all up, and sit back and enjoy a brief history of Moxie Cinema from its inception to present day.<br/><br/>Although the Moxie Blog officially began on May 24, 2004 (as Cinema 24 at http://www.urlblue.com), the project had already been in full swing since early March. Not wanting to leave anything out of the blog, my first five posts covered everything that had happened from the beginning of the project up to late May.<br/><br/>NOTE: Although few people were reading the blog in the beginning, I still had a very real fear that someone \"with more money than brains\" would stumble across it and steal our idea. To assuage my paranoia, I decided to keep Springfield, and any obviously identifying features or businesses, disguised behind a nom de plume: Midwestburg.<br/><br/><ul><li><a href=\"1\">Introduction, Part 1</a> - introduced myself, Nicole, Bogey, and gave a brief description of Springfield (Midwestburg).</li><br/><li><a href=\"2\">Introduction, Part 2</a> - explained why our idea was happening at the right time in the right place with the right people.</li><br/><li><a href=\"3\">Introduction, Part 3</a> - a brief recounting of how the idea for our theater began, or in this case, was rekindled.</li><br/><li><a href=\"4\">Introduction, Part 4</a>- goes into detail about what went on between early March and late May.</li><br/><li><a href=\"5\">Introduction, Part 5</a> - this was my attempt to justify the blog to myself, and, less noticeably, to make me feel better about the fact that no one would probably ever read it.</li></ul><br/>After the initial week of \"catching up,\" it was time to delve into the lesser known world of cinema operation and distribution. Having recently been in a position of complete befuddlement myself, I was primed and ready to share my findings with the world (or at least with <a href=\"http://justin.retroflux.com\" target=\"_blank\" class=\"broken\">Justin</a> and <a href=\"http://tapioca.retroflux.com\" target=\"_blank\" class=\"broken\">Nicole</a>, my only readers at the time). These, in my opinion, were some of my best posts.<br/><br/><ul><li><a href=\"6\">Where do you get films?</a> - answered one of the most common questions heard by theater owners.</li><br/><li><a href=\"8\">Distribution fees and the like</a> - disclosed the hidden losses inherent in the theater business.</li><br/><li><a href=\"9\">Concession is King</a> - revealed the real reason why popcorn was so freakin' expensive.</li><br/><li><a href=\"10\">Market survey results</a> - added further proof to our belief that Springfield was ready for an art-house theater by revealing the results of a market analysis survey we preformed in April. This post also marked the beginning of my trend of revealing EVERYTHING that was going on with the project.</li></ul><br/>During the second week of posts, someone in the upper echelons of the <a href=\"http://www.blogger.com\" target=\"_blank\">Blogger</a> universe was reading my blog. Who they were or how they found it, I don't know, but on June 6, 2004 - a mere 13 days after writing my very first post - Cinema 24 became one of Blogger's <a href=\"11\">Blogs of Note</a>. The pressure to provide bigger and better posts, every single day of the week (except on weekends) started to build.<br/><br/>As far as the theater went, nothing was \"set in stone\" back in those days. Yes, we had assurances from Andrew and Doug that they wanted to work with us, but we didn't have a business plan, any money, building plans, a lease, nothing! At this stage in the game, we were operating more on a theory basis, rather than a definite reality. It was a little nerve racking at times, but we trudged on with the belief that:<br/><br/>a) We were going to be located in a large building at 425 W. Walnut<br/>b) We wouldn't have problems securing financing (given that the business plan was solid)<br/>c) We'd be able to have two screens in the 425 building<br/>d) We'd need at least $250,000 to pull it off<br/><br/>With all the additional space that 425 offered us, I knew we'd have enough room to use a platter projection system for the theater. Even still, I didn't like the idea of losing intermissions (Ragtag style). I <a href=\"12\">posted my concerns</a> and was astonished by the end result: helpful comments. A switch went off in my head, and I came to the realization that having a drastic increase in readership might not be such a bad thing after all.<br/><br/>As I continued to <a href=\"14\">work tirelessly on the business plan</a>, I was still churning out more and more posts describing how we were planning on running our theater. As usual, the more input I received from my new readership, the more hyper I became. Eventually, I gave myself a concussion. Here are some of the highlights:<br/><br/><ul><li><a href=\"15\">Pre-show advertising</a> - discussed the pros and cons of everyone's favorite movie theater staple.</li><br/><li><a href=\"16\">Educating the masses</a> - delved into the finer details (too much perhaps) of movie showtime scheduling variations.</li><br/><li><a href=\"20\">Fears</a> - one of the first posts where I talked about some of the real stuff that was affecting Nicole and I.</li><br/><li><a href=\"21\">Hypotheticals</a> - this one still cracks me up. Why? Because I can see all of them coming to fruition.</li><br/><li><a href=\"22\">The tide has turned</a> - marks the first comment/question answer session.</li><br/><li><a href=\"24\">Invitation List</a> - went into detail about who I'd like to see drop by the theater for a visit.</li><br/><li><a href=\"25\">Necessary Equipment</a> - discussed the equipment we needed to properly run the theater.</li><br/><li><a href=\"26\">In the Booth</a> - pictorial account showing exactly how a projection booth runs.</li><br/><li><a href=\"29\">The other kind of projection</a> - probably the single most technical, yet informative post to date. Half of the people who contact me about starting their own theater are looking for this exact information.</li></ul><br/>Meanwhile, in the \"theater\" world, things were starting to take shape. We had blueprints from the architect, which were <a href=\"27\">called into question</a> by our first equipment dealer, and the business plan was nearing completion. Since we were still in St. Louis at the time, it was difficult to <a href=\"28\">maintain the rate of progress I was hoping for</a>, which was fast enough to have the theater open before the end of 2004 (ha ha ha ha ha ha ha ha ha). Still, there were BIG issues that needed our attention - like what we were going to name our theater. Nicole and I had discussed it for several months, and in early July we thought we had a winner: <b>Criterion Cinema</b>.<br/><br/>I <a href=\"31\">announced</a> the news on a Friday and immediately started to second guess our decision. On Monday, I took the vote to the readers and let them voice their opinions. <a href=\"32\">Was it going to be <b>Criterion</b> or <b>Moxie</b>?</a> To help everyone decide, I even cobbled together an <a href=\"34\">informative campaign ad</a>, starring loose artistic representations of Nicole and I (also featured on the \"Moxie loves fine art\" button).<br/><br/>In the end, <a href=\"35\">The Moxie won</a> (duh!), and I think it was all for the better... don't you?<br/><br/>Ok, I think we've learned enough for today. I'll be back later with even MORE Moxie history. Can you feel the excitement? Huzzah!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-06-22T20:40:36.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "holy moxie info.. batman<br/><br/>ive learned a heck of alot today...<br/>1- finally the results of that market survey i took oh so long ago (i was unaware of the blog at that time.. so i guess i missed when the results were posted)<br/>2- hah.. the hypotheticals.. was awesome.. too bad it would only be brad now.. since anniston is no longer in the picture<br/>3- dan can use flash! and well...<br/>i can do html.. but most websites i make .. i do in flash.. its just more fun<br/><br/>side note: one time i was in yahoo internet life magazine for weirdest site of the month... then a few months later..that magazine ceased to exist... the lesson: linking to my website isnt good for business  ... err but dont worry the link i use on here just goes to my xanga.. so that shouldnt spread any bad luck<br/>",
      "created_at": "2005-06-23T01:59:15.000Z"
    },
    {
      "author": "Steve Kirks",
      "body": "Outstanding, Dan!<br/><br/>Side note:  Is reading the weblog like \"Being John Malkovich\"?",
      "created_at": "2005-06-23T02:19:01.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Wow...it's only been a year?  It feels like I've been coming here for ages.",
      "created_at": "2005-06-23T02:20:44.000Z"
    },
    {
      "author": "JED",
      "body": "It's been a good year. Oh and speaking of hypothetical,Brad Pitt,Kathleen Turner, Don Johnson, John Goodman, all Springfield natives. We should work on them as well. Imagine Sonny Crocket coming to \"Miami Vice Night @ The Moxie.\" I would love to be there....So I could.... punch him in the face and break out.   ",
      "created_at": "2005-06-23T04:02:36.000Z"
    },
    {
      "author": "brian of moore",
      "body": ".. make sure we indicate that goodman is from st. louis... since i hold st. louis much more closely to my heart than springfield (sorry)  .. goodman just went to school here :-)",
      "created_at": "2005-06-23T06:23:10.000Z"
    },
    {
      "author": "JED",
      "body": "Well he has an association and a reason to not say \"no\" to the idea. That's all I was saying.  ",
      "created_at": "2005-06-23T11:31:52.000Z"
    },
    {
      "author": "Nate",
      "body": "'Murderball' featured on NPR's Fresh Air today, at 3 p.m., if anyone's interested.",
      "created_at": "2005-06-23T19:38:26.000Z"
    },
    {
      "author": "nicole",
      "body": "Yay for Murderball!<br/><br/>Dan - I'm glad you decided to break this up into parts.",
      "created_at": "2005-06-23T20:14:53.000Z"
    },
    {
      "author": "Mark",
      "body": "I've been reading this blog since it appeared in the Blogs of Note, which is probably about a year.<br/><br/>Dan & Nicole: good work. Thanks for keeping me entertained through my dull work day and teaching me things about cinema, construction and starting you own business that I probably would never of known.<br/><br/>To those who think the blog is a stunt or that the Moxie won't open: prepare to eat pie; humble pie!<br/><br/>M",
      "created_at": "2005-06-23T20:42:12.000Z"
    },
    {
      "author": "Caleb C.",
      "body": "Go ahead and announce it! Moxie's opening feature will be Murderball!<br/><br/>You know it's true...",
      "created_at": "2005-06-23T21:36:44.000Z"
    },
    {
      "author": "Karla",
      "body": "Great site!  I'm working on opening a community owned movie theatre in Northern Saskatchewan (that's in Canada everyone).  We have just kick started the project and are in the fundraising stage of the process.  I'm looking forward to reading more about the Moxie - really great example of a small operator making it happen    ",
      "created_at": "2005-06-23T21:58:40.000Z"
    },
    {
      "author": "Chris L.",
      "body": "Wish I'd found this post last week. All that reading for nothing!<br/><br/>I have alot of free time at work.",
      "created_at": "2006-03-28T02:26:11.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
