{
  "id": 240,
  "title": "A brief history of The Moxie, as told through this very blog over the past thirteen months - Part II",
  "body": "Yesterday's post covered everything from project inception up through the naming of the theater, and we're not even a quarter of the way through the archives yet! So, without further ado, explanation, or introduction, let's jump right back into the fray.\r\n\r\nThings were finally starting to take shape for The Moxie back in July of '04. Our architect had finished <a href=\"40\">the preliminary blueprints</a> and our business plan was all but finished. While my blog readers were busying themselves with lofty discussions about <a href=\"36\">soda vs. pop</a>, I was fiddling around in Photoshop trying to create a logo to fit our newly minted moniker. Disappointed with my piddly attempts at art, I decided to let my readers <a href=\"39\">take a swing at it</a>. The response was <a href=\"42\">amazing</a>. In the end, we chose one of <a href=\"47\">the logos designed by Aaron Scott</a>, who has since become our go-to-guy for design issues and local music relations (Aaron also happens to run <a href=\"http://www.morawk.com\" target=\"_blank\">MOrawk</a>, a website devoted to local music in Springfield). And just like that, our hypothetical theater suddenly had a face... a brand... a presence.\r\n\r\nAs the summer drew on, word about the Moxie started to spread like untamed fire... some may even say \"wildly.\" As more and more people dropped by the blog, I decided it would be a good idea to start posting monthly summaries to help the readership stay updated. That idea lasted for two months: <a href=\"38\">July</a> and <a href=\"45\">August</a> (and again in February of '05, but we'll discuss that later). As the summer wound on, I decided to <a href=\"77\">give the Moxie Blog a dedicated online home</a> (MoxieCinema.com), retire the old \"Cinema 24\" name, and finally <a href=\"49\">reveal the true location of Midwestburg</a> (but not in that particular order).\r\n\r\nOnce the location of the Moxie was revealed, I was finally able to show <a href=\"52\">pictures of 425 W. Walnut</a>. Woo hoo! Things were very good in Moxieland. We even had <a href=\"57\">a small blurb written about us in the local newspaper</a> and the business plan was finally, FINALLY finished. It seemed like it would only be a short matter of time before we were opening our doors to an adoring public... and then the bottom fell out.\r\n\r\nIn early September, Andrew informed us that the <a href=\"59\">renovation bids were coming in a bit high</a>, as in $300,000 or more. Then, the very next day, an article ran in the paper <a href=\"60\">announcing the construction of a brand new multiplex movie theater</a> right behind ours. I tried to make <a href=\"61\">the best of things</a>, but the stress was really starting to weigh on me. Would all of our hard work be for naught? Did this spell the end for the Moxie? Could I be any more dramatic? Where <i>IS</i> my hat???\r\n\r\nSoon after, Andrew and I had a discussion about whether we (Nicole and myself) were willing to continue with the project. I assured him that giving up wasn't an option at this point. I mean, I'd already bought the domain name and EVERYTHING! There was no way - NO WAY - I was going to let the $8.95 domain name registration fee go to waste. Andrew told me he'd see what he could do, and for the first time in roughly seven months <a href=\"62\">I took a break from the project</a>. I watched all 480 hours of HBO's <i>Band of Brothers</i>, I went to a couple baseball games, I played cards with Nicole, but most importantly, I renewed my determination to make The Moxie a reality.\r\n\r\nIn late September, Nicole and I made a trip to Springfield to discuss the practicality of continuing the project with Andrew and Doug. We came back with <a href=\"66\">a new building</a> and a <a href=\"68\">drastically altered business plan</a>. The meeting went quite well, to say the least. Sufficiently recharged from my two week hiatus, I immediately went to work <a href=\"69\">retooling our budget and business plan</a>. Thirteen days later, our business plan was finished and <a href=\"73\">successfully submitted to the SBA (Small Business Administration) and SFDC (Springfield Finance & Development Corporation)</a>.\r\n\r\nNow it was time to wait and wait and wait and wait (the first of many \"official\" waiting periods). While we were waiting to hear back from the banks, I busied myself with <a href=\"76\">the Cardinals</a> (damn you, Boston!), <a href=\"90\">my Slash costume</a>, and <a href=\"77\">redesigning the Moxie Blog</a> to what you see today. Even with all that fun stuff, I was still on pins and needles over our loans, which wasn't exactly OBVIOUS when looking back at the sheer amount of posts I dedicated to the matter. See:\r\n\r\n<ol><li><a href=\"80\">The Financial Play</a> - our loan problems begin.</li>\r\n<li><a href=\"82\">Laying the bait</a> - I unsuccessfully try to lure information out of our loan officer.</li>\r\n<li><a href=\"84\">Down to the wire</a> - I complain about my job at Elsevier and whine about not being able to quit since we don't have our loans yet.</li>\r\n<li><a href=\"85\">Speak of the devil</a> - our loan officer delivers bad news, we need guarantors.</li>\r\n<li><a href=\"86\">Chairman of the board</a> - Nicole and I ask our parents to co-sign on the loan, and begin <i>seriously</i> discussing when we're going to quit our jobs.</li>\r\n<li><a href=\"92\">Resignations proffered</a> - in an amazingly audacious move, Nicole and I offer our resignations BEFORE the loans are approved.</li>\r\n<li><a href=\"94\">Going all in...</a> - the bank asks for more money from us, we search our couches and give them everything we find, plus the rights to our unborn children.</li>\r\n<li><a href=\"96\">Scenario rhymes with Cheerio, which is good thing, especially considering my addict-like dependence upon those scrumptious little toasted O's.</a> - I start to wonder what would happen if the Moxie went bust. Clearly, judging by the title, I'm not in my right mind.</li>\r\n<li><a href=\"97\">Growing a beard</a> - the banks want even MORE money, but there's none to be found. The dwindling of the financing begins.</li>\r\n<li><a href=\"98\">SBA Oddity</a> - yes, I'm completely insane.</li>\r\n<li><a href=\"99\">Six LONG hours</a> - the bank takes pleasure in not replying to my myriad of e-mails.</li>\r\n<li><a href=\"100\">V-Day</a> - the loans have been starved to their dying point ($25K from the SBA and $25K from the SFDC).</li>\r\n<li><a href=\"103\">Here we go again</a> - more documentation is given to the SBA.</li>\r\n<li><a href=\"110\">Just flew in...</a> - our loans are approved, nearly 2 months after they were initially submitted.</li></ol>\r\nAnd so the financial war was finally over. Our loans had been secured, but for far less than we had originally budgeted. If ever there was a time to do something, it was now. Duh!\r\n\r\nAnd that, my dear readers, concludes Part II of The Moxie saga. Stay tuned for the third and final chapter tomorrow... or later.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-06-24T01:31:26.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Aaron Scott",
      "body": "Capital M, capital O, dude. These are style matters of utmost importance.",
      "created_at": "2005-06-24T01:41:35.000Z"
    },
    {
      "author": "bjork24",
      "body": "Woops... I'll fix it!",
      "created_at": "2005-06-24T01:42:21.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Lowercase r!",
      "created_at": "2005-06-24T02:01:53.000Z"
    },
    {
      "author": "brian of moore",
      "body": ".. ive spent more time on these two posts than any previous posts ive been witness too\r\nim giddy in anticipation for the next one\r\nhow will it end? have we reached the climax yet?... I MUST FIND OUT WHAT HAPPENS!",
      "created_at": "2005-06-24T04:38:34.000Z"
    },
    {
      "author": "justin",
      "body": "Yeah, loooong post! But good.  Good and long.",
      "created_at": "2005-06-24T18:18:39.000Z"
    },
    {
      "author": "Yoda",
      "body": "Size matters not, what part of, understand don't you!?",
      "created_at": "2005-06-24T18:58:42.000Z"
    },
    {
      "author": "Yoda",
      "body": "Told me this, many times, ex-girlfriends have!",
      "created_at": "2005-06-24T18:59:07.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Awesome stuff Dan, it's been great reading your progress. I've been here since the Blogs Of Note mention, and it's just fascinating watching it come together.",
      "created_at": "2005-06-24T19:30:31.000Z"
    },
    {
      "author": "JED",
      "body": "I had no Idea Aaron S. made the logo for you. Good work Aaron. I'm learning so much from these recent postings. Oh and Moxie shirt travels to the Roxy on Sunset (private show) and Newport this weekend. Just a heads up.    ",
      "created_at": "2005-06-24T21:19:48.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "I meant to reply to your comment on Playing with Matches, but it slipped my mind. My brother is the bassist for a band called Dear Augustine, and they have a show with Playing with Matches tonight in Wichita. I might introduce myself to your cousin, if it doesn't freak him out too much...",
      "created_at": "2005-06-25T20:54:08.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
