{
  "id": 241,
  "title": "Dan + Pistachios = Emergency Room",
  "body": "If you don't mind, I'm going to disrupt the continuity of the \"Brief History of The Moxie\" posts to bring you a harrowing tale of life and death that played out late Saturday night.\r\n\r\nAfter spending the day at the theater with Dad working on the floors, Nicole and I, and our friend Mora, headed over to a little get together at <a href=\"http://www.sgfsoccer.com\" target=\"_blank\">Steve's</a> house (for those of you who don't remember, Steve is the one who won the naming rights to the Cinebar). Over the course of roughly three hours, we sampled some great wines from Steve's vast collection and talked at length about The Moxie with the other guests. I also managed to engorge myself on whatever hors d'oeuvres were within arms length, which, for the majority of the evening, was a very large bowl of pistachios.\r\n\r\nNow, let me tell you a little bit about my history with pistachios: I have none. I've always wanted to try pistachios, but for whatever reason I'd never had the opportunity to do so over the last 25 years. After Saturday evening, my mom would remind me that she used to make pistachio pudding when I was younger, but she also noted that I'd never eat more than a bite or two. Nicole also chimed in with the fact that spumoni ice cream was made from pistachios, but again, I've never had more than one small bite of spumoni in my entire life. So there I was, face to face with a towering bowl of nuts and a willing disposition. I cracked open the first shell and chucked the pistachio into my mouth. <i>Mmmm, these things are GREAT!</i> I then proceeded to eat at LEAST 70 more over the course of the evening. I just couldn't stop myself! They were sooooo good.\r\n\r\nBy the time we left, my belly was chocked full with pistachios, three glasses of wine, and a glass of Guinness. The alcohol, I might add, was well within my tolerance for a three hour period. As much as I hate to admit it, I'm still a bit of a drinker. When I'm hanging out with my guy friends, I can easily finish off six or more cans of beer, in the same time span as Steve's party, and feel little more than a slight buzz at the end of the evening. If you remember back to your drivers education classes, I'm sure you can recall the class about drinking and driving - one beer = one glass of wine = one shot of 40% liquor. So, going by that age old maxim, I'd say my alcohol ingestion was roughly that of having 5.5 cans of beer (the glasses of wine were pretty tall, so I gave them a 1.5 beer value). So I hear you asking, why am I going to such lengths to explain the amount of alcohol I had? Here's why:\r\n\r\nAs soon as we left Steve's loft, I started to feel drunk... and I don't mean a <i>little</i> drunk. I'm talking 18 sheets to the wind drunk. Years ago when I was a young college stud, full of unearned bravado, I finished off a fifth of Captain Morgan's spiced rum by taking double shot after double shot in less than 45 minutes. I don't remember much of that particular evening, but whenever it's brought up amongst my friends the term \"alcohol poisoning\" always seems to be connected. That's pretty close to how I felt after leaving Steve's party, which should've been a clear sign that something <i>might</i> be wrong. How could the equivalent of 5.5 beers make me feel like I just downed a fifth of rum? With every step I took, my body was starting to act more and more strangely. I was slowly losing sensation in my arms and lower legs, my breathing was beginning to shorten, and my vision was blurring in an unusual way - my point of focus was clear, but everything around the edges was blurring and seemed to pulsate with my heartbeat.\r\n\r\nNeedless to say, Nicole and Mora thought I was drunk, and so did I at that point. But I couldn't make sense out of the severity of my condition. Mora and Nicole continued down to the Mudlounge to have another drink, but I had to excuse myself before I threw up all over the place and made a huge fool of myself. I staggered up and down Walnut Street, my condition worsening by the minute, trying to make my way down to the theater. During that short three block hike, I managed to drunk dial <a href=\"http://marnival.retroflux.com\" target=\"_blank\" class=\"broken\">Doug</a> (four times), <a href=\"http://justin.commonelectric.com\" target=\"\" class=\"broken\">Justin</a>, and <a href=\"http://www.sweetwaterabilene.com\" target=\"_blank\" class=\"broken\">J.R.</a>. Doug never picked up his phone, but I left several messages. After getting to hear two of them last night, it was startling obvious how sick I was. The first message was about 60% coherent, but the last one was nothing but moans and gurgling noises. My conditions were escalating without the aid of additional alcohol... not a good sign. Once I finally made it to the theater, I went inside and passed out on the floor of the projection booth.\r\n\r\nThe next thing I remember, Nicole is waking me up and telling me to get in the car. She scolded me all the way home for getting so drunk and making a fool of myself, but I was too busy trying to maintain consciousness to listen to her. When we got home, I stumbled into our backyard and passed out on the ground. Nicole eventually came out and helped me make my way into the bathroom... and I bet you can all guess what happened then. After 10 minutes of babbling and drooling, I latched onto the toilet and emptied every last ounce of wine-marinated pistachio cud into the toilet. Now, had I been drunk, the act of vomiting would've made me feel 150% better immediately, but it didn't. In fact, my conditions took a sudden and drastic turn for the worse. My sinus cavity completely closed up and it felt like someone was standing on my chest. I could exhale fine, but when I tried to inhale it was strained and choppy. My lack of breath was also making it extremely difficult for me to speak. Nicole started to flip out at this point and demanded we go to the emergency room. I tried to tell her I'd be okay, but she forced me into the car and off we sped to the ER.\r\n\r\nWhen we arrived, the waiting room was filled with all kinds of people in varying states of agony. I figured we'd be waiting for at least a good hour or four, which aggravated me and made my breathing problem even worse. Nicole told the nurse what was wrong with me and the next thing I know I'm laying on a gurney with an I.V. in my arm and oxygen up my nose. It was great! If you want the doctor to see you immediately, just tell them you're having problems breathing and you think it's due to a food allergy. I tried to talk the nurse out of giving me an I.V., but she told me it was the only way they could get the drugs into me fast enough. I explained to them that we had really crappy insurance, but they were more intent on giving me a chest x-ray and hooking me up to a respirator that delivered wonderfully cool anti-inflammatory gas down my lungs. At one point I even offered the doctor free movie tickets in exchange for his medical services. I'm not looking forward to the bill.\r\n\r\nThe doctor confirmed that what I was experiencing was most likely brought on by an allergic reaction to the pistachios, but I'd need to see an allergist to be completely sure. I shook my head and resolved to never eat pistachios again... despite their wonderfully salty, yet sweet flavor. Mmmm, pistachios. After we left the ER around 3:45 AM, I went straight home and slept like a baby. I'm still feeling the after effects from some of the drugs they gave me, but for the most part I'm as good as gold. And in case this story hasn't bored you enough, here are some cool pictures of me in the emergency room!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/062705/allergic1.jpg\" width=\"425\" />\r\n\r\nThis picture was taken after I'd been in the ER for about 30 minutes. Nicole was doing all she could not to pass out (she has a severe medical phobia), but I was able to talk her into taking a few pictures of me for the blog. That blue thing behind my head looks like a death ray that's about to fry my brains.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/062705/allergic2.jpg\" width=\"425\" />\r\n\r\nThis is a blurry shot of my vital signs. Can you tell that Nicole was a wee bit shaky when she took this picture?\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/062705/allergic3.jpg\" width=\"425\" />\r\n\r\nAnd here I am in all my allergic glory. I'm actually trying to smile in this shot, but the muscles in my face were a little sluggish. Check out the I.V. on my right arm and the oxygen tube shoved up into my brain! My left eye is a little swollen and reddish too. You can't see it because of the blanket, but there was quite a bit of blood on my robe, which Nicole thinks was mine, but I don't. I just think it was a reused robe.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/062705/allergic4.jpg\" width=\"425\" />\r\n\r\nHad I been thinking clearly, I would've come prepared with my Moxie shirt. It doesn't get much more adventurous than this!\r\n\r\nFinal closing thoughts:\r\n\r\n1. Pistachios mark the first food I've become allergic to, which is a shame because I really love nuts! Not those kind of nuts, you pervert! I'm talking peanuts, walnuts, hazel nuts, cashews, Brazil nuts, coconuts, lug nuts. I love 'em all!\r\n\r\n2. Nicole felt really bad for thinking I was drunk and letting me wander off into the night, but I don't blame her. I would've thought the same thing had I seen someone acting the way I did.\r\n\r\n3. Most of the time between leaving Steve's party and throwing up is a blur. The only reason I know that I called Doug, Justin, and J.R. is because I checked my outgoing calls the next day. I do, however, remember quite clearly climbing to the top of the fire escape in the alley east of Landers' Theatre. I think I was trying to get better phone reception.\r\n\r\nThat's it!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-06-27T20:15:09.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "Maybe someone slipped you a mickey?",
      "created_at": "2005-06-27T20:25:36.000Z"
    },
    {
      "author": "justin",
      "body": "Ah, yes.  When you called me, you said you just climbed up a bunch of stairs.  I asked what you were doing, and you were talking about how you put your feet up on the coffee table, and Nicole getting mad at you so you left.  You told me you were going to the car to sleep.  Then you talked to Kelley for a little while.",
      "created_at": "2005-06-27T20:26:55.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'm surprised I didn't fall to my death climbing up that fire escape.",
      "created_at": "2005-06-27T20:27:57.000Z"
    },
    {
      "author": "nicole",
      "body": "When I found Dan he said, \"Kelley was happy to hear from me.\" I said \"You did NOT drunk dial Kelley!\" And he said again, \"She was happy to hear from me!\" Happy...more like amused, probably.\r\n\r\nOh Dan. He failed to mention that I almost kept him outside all night (I have a small tolerance for drunk people).",
      "created_at": "2005-06-27T20:30:52.000Z"
    },
    {
      "author": "bjork24",
      "body": "Kelly <i>WAS</i> happy to hear from me!",
      "created_at": "2005-06-27T20:32:01.000Z"
    },
    {
      "author": "JED",
      "body": "That was an awesome blog post. I say that because it is easy for me to relate to. The fact that you climbed up a fire escape to get better reception says it all. You are a rockstar... I hope Doug dies. ",
      "created_at": "2005-06-27T20:42:25.000Z"
    },
    {
      "author": "justin",
      "body": "I bet you shouted \"This is my fire escape, NOT yours!\" when you got to the top, didn't you?",
      "created_at": "2005-06-27T20:59:00.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "You know, when I throw up, everything feels sooooo much better.",
      "created_at": "2005-06-27T21:02:47.000Z"
    },
    {
      "author": "Ole",
      "body": "My oh my Daniel.  I thought you were awfully 'happy' when you left Saturday night.  I figured it was the wine but I stand corrected.  I won't have to impose a house limit on your next visit, except for pistachios of course.  Get well and post more!",
      "created_at": "2005-06-27T21:03:24.000Z"
    },
    {
      "author": "Karla",
      "body": "I experienced a bad sushi induced drunked stuper one night on my honeymoon in Costa Rica ... then the next day I had to take a 10 hour trip across country on grid roads in a packed van with no air conditioning ... ah, memories",
      "created_at": "2005-06-27T21:10:16.000Z"
    },
    {
      "author": "nicholas",
      "body": "Justin: I like to imagine he did just that, and then proceeded to punch while kick.",
      "created_at": "2005-06-27T21:16:44.000Z"
    },
    {
      "author": "bjork24",
      "body": "Nicholas: I didn't you were down with the Ill Mitch style.",
      "created_at": "2005-06-27T21:54:35.000Z"
    },
    {
      "author": "Stephanie",
      "body": "I'm so sorry you had to go through that, and I'm equally sorry it had to be pistachios. Yummy.\r\n\r\nAnd I'm also quite happy we came away with a split against the Cards.",
      "created_at": "2005-06-27T22:38:57.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Stephanie::\r\n\r\nAnd I'm glad to have seen Chris Carpenter pitch a complete game shutout against your Bucs instead of watch Dan pistacio himself to near-death.",
      "created_at": "2005-06-27T23:19:35.000Z"
    },
    {
      "author": "Nate",
      "body": "Mmmmmm....wine-marinated pistachio cud.",
      "created_at": "2005-06-27T23:42:46.000Z"
    },
    {
      "author": "Izzy",
      "body": "Wow.  You're actually lucky that your allergic reaction progressed so slowly.  Usually the breathing problems hit pretty hard and people need to get to the ER a lot sooner than what you did.  \r\n\r\nDefinitely make sure that you follow up with an immunologist to find out the extent of your allergy.  The next time this happens you may not have this much time to waste.  Anaphylaxis is no joke, and there are a lot of us out here that want to see The Moxie Theater open.",
      "created_at": "2005-06-28T01:19:02.000Z"
    },
    {
      "author": "DUG",
      "body": "I wish I could leave the audio for everyone to listen to.  Dan says :\"awwe yaa ya yabber wibble weeeeeeeee!\"  It was loud, but at least you sounded like you were very happy.",
      "created_at": "2005-06-28T01:46:51.000Z"
    },
    {
      "author": "DUG",
      "body": "What if it wasn't the pistachios, what if you have suddenly became allergic to guinness?\r\n",
      "created_at": "2005-06-28T01:48:25.000Z"
    },
    {
      "author": "JED",
      "body": "Dan would then have to kill himself. Quite like the way I am going to kill you, DUG. With a hammer and caulk gun. But yes the audio must somehow be displayed for all to hear.  ",
      "created_at": "2005-06-28T01:54:10.000Z"
    },
    {
      "author": "bjork24",
      "body": "Being allergic to Guinness would be very, very bad, but not quite as bad as being allergic to Dr. Pepper.",
      "created_at": "2005-06-28T01:55:24.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Aaron: that may have been a slam.  But when your team hasn't reach the post-season in twelve years, you tend to latch on to each, and any, victory!  \r\n\r\nWe lost two?  Sure.  That's nothing new.  But we also won TWO!",
      "created_at": "2005-06-28T02:31:49.000Z"
    },
    {
      "author": "brian of moore",
      "body": "wow... thanks for not dying\r\ni find it hilarious that in such a drug induced state.. you requested that pictures be taken for the blog.. nice\r\nanywho.. its true what was previously said.. the next time could be much worse.. be careful\r\ni myself havnt ever had pistachios.. this makes me weary.. but at the same time you made them sound so delicious",
      "created_at": "2005-06-28T05:15:57.000Z"
    },
    {
      "author": "Dave",
      "body": "see, now nichole knows how to rub you out and make it look like an accident if you ever become a nuisance.\r\n\r\ntread lightly my friend.",
      "created_at": "2005-06-28T05:19:05.000Z"
    },
    {
      "author": "erin",
      "body": "did you know that if your really allergic to poison ivy you shouldnt eat cashews?!\r\n\r\nnuts are just all around evil. peanuts. cashews. pistachios. all trying to kill people off.\r\n\r\nit was really a nut disguised as an apple that eve got introuble for eating. she could have resisted an apple. but no one. NO ONE can resist a nut...",
      "created_at": "2005-06-28T08:51:21.000Z"
    },
    {
      "author": "erin",
      "body": "oh. and.... glad your still alive  : )",
      "created_at": "2005-06-28T08:52:14.000Z"
    },
    {
      "author": "Grey Hodge",
      "body": "Dan. You're very lucky you had that much booze, or your stomach may not have been smart enough to vomit up the undigested pistachios in it. Second, you need to give your wife a huge hug, a big kiss, and thank her profusely for getting you there when she did, and being nice enough to humor your photographic whims. :). She has nothing to feel guilty about, given the circumstances. Food allergies can kill ya, doncha know. I have a few I never knew I had until they were diagnosed, actually. They're odd things. Glad to hear you're ok. If I ever pass through Springfeild, I know where to see a good movie. :)",
      "created_at": "2005-06-28T10:13:24.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "I'm allergic to mosquitoes... I can only eat a few before I get sick.\r\n\r\nI'm sorry to hear that you're allergic to pistachios—they're quite delectable nuts. Get well, get well soon, we want you to get well!",
      "created_at": "2005-06-28T10:30:12.000Z"
    },
    {
      "author": "Mark",
      "body": "Oh Man! Moxie drama! I'm glad you're OK now.\r\n\r\nI had a habbit or getting v.drunk in my youth and staggering off on my own to throw-up and sleep in door ways. Fortunately, nothing bad ever happened to me.\r\n\r\nGood luck for when the medical bill comes in.\r\n\r\nM\r\n\r\np.s. Why does Doug have to die?\r\n",
      "created_at": "2005-06-28T16:06:24.000Z"
    },
    {
      "author": "nicole",
      "body": "I'm upset because there's a very pretty cake I wanted to make with pistachios. Not like Dan would eat cake anyways...",
      "created_at": "2005-06-28T17:29:52.000Z"
    },
    {
      "author": "Steve Kirks",
      "body": "Dan:\r\n\r\nThat was a frightening read for sure.  Only because I could recognize your writing style did I know how it ended.  Thank goodness Nicole could see things were bad and stuff you in a car.  I'm guessing you went to the three letter hospital and not the \"nun\" one...",
      "created_at": "2005-06-28T19:25:50.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Wow, great (yet tragic) post Dan. I'm glad you're feeling better.\r\n\r\nI'll eat some pistachio's in your honor ;)",
      "created_at": "2005-06-28T20:28:01.000Z"
    },
    {
      "author": "JED",
      "body": "Mark: Doug must die because he is Doug. It's just a part of who he is, it's what he does. He'll tell you. ",
      "created_at": "2005-06-28T20:36:40.000Z"
    },
    {
      "author": "Liz",
      "body": "I'm so glad you're not dead!  Also, all is not lost on the pistachio pudding front.  You can have <a href=\"http://www.albinoblacksheep.com/video/pistachio.php\">this</a> risk free.\r\n",
      "created_at": "2005-06-28T20:56:30.000Z"
    },
    {
      "author": "DUG",
      "body": "Yeah, I do have to die!\r\n",
      "created_at": "2005-06-29T00:09:03.000Z"
    },
    {
      "author": "J.R.",
      "body": "I enjoyed the dial...",
      "created_at": "2005-06-29T10:21:32.000Z"
    },
    {
      "author": "Mark",
      "body": "Doug: It may not be your time?\r\n\r\n<a href=\"http://www.deathclock.com/\">www.deathclock.com/</a>",
      "created_at": "2005-06-29T17:02:11.000Z"
    },
    {
      "author": "Fyse",
      "body": "My only allergy so far is kiwi fruit, and I'm not entirely sure about that one. My brother has the whole nut allergy thing going on though. The merest trace is liable to reappear minutes later along with whatever food went down with it, followed by anything he tries to eat for hours later. He'd have to be eating damn quickly to get through a bowl full! Still, even his is relatively mild in absolute terms. I was reading the other day about a girl who went into anaphylactic shock when someone opened a packet of peanuts two tables away in a bar. Now THAT is a proper allergy.",
      "created_at": "2005-06-30T01:10:38.000Z"
    },
    {
      "author": "Linda Schott",
      "body": "See, I knew math would be a part of your real life.  You can equate drinks!\r\nLinda Schott",
      "created_at": "2005-07-08T20:02:16.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
