{
  "id": 242,
  "title": "A brief history of The Moxie, as told through this very blog over the past thirteen months - Part III",
  "body": "The final installment in the trilogy... until I come back and write the prequels. Let's begin!\r\n\r\nA few days after receiving our loan approval, we were hit with a new round of <a href=\"112\">bad news</a>. Andrew had just spoken with a pair of entrepreneurs who were looking to buy a building and open an art-house theater in the next THREE MONTHS (as if it could be done that fast)! What were we going to do?! If we wanted to win the race to become Springfield's newest indie microcinema, we had to <a href=\"113\">start spreading The Moxie gospel</a>. Within two days of learning about our wannabe competitors, every press outlet in Springfield had been notified of <a href=\"114\">our imminent arrival</a>, sparking a barrage of <a href=\"116\">blurbs</a> and <a href=\"117\">interviews</a> that lasted from December to May. In the end, our press release worked and <a href=\"119\">the competition</a> dropped out of the picture.\r\n\r\nReleasing our initial press release at such an early stage of development was both a blessing and a curse. Sure, it scared off some potential competition, which is exactly what it was meant to do, but it also prematurely raised the hopes of a lot of film fans in and around the Springfield area. I guess you have to take the good with the bad... and then you have, the Facts of Life. I'm not going to waste time making a list of the articles that were written about The Moxie during this period, but if you really want to see them, check out the \"<a href=\"/categories/15\">Press</a>\" pigeonhole.\r\n\r\nAs 2004 drew to a close, Nicole and I said <a href=\"123\">goodbye to St. Louis</a> (stable employment) and relocated back to Springfield (virtual unemployment). As many of you may remember, it took us quite a long time to get settled in, but once the home renovation was through, it was time to focus solely on the theater. Hot blog topics during those early heady days included:\r\n\r\n<ul><li><a href=\"127\">Credit cards and hard work</a> - to accept plastic or not to accept plastic?</li>\r\n<li><a href=\"129\">Moxie Phlog</a> - the introduction of everyone's favorite blog feature... besides Benzo.</li>\r\n<li><a href=\"130\">The Man-CHAIR-ian Candidate</a> - the domination of theater chairs over couches.</li>\r\n<li><a href=\"132\">We still breathe</a> - discussion on which \"pop(s)\" we should carry at the Cinebar.</li>\r\n<li><a href=\"133\">My big, fat, gleek post</a> - a gigantic post detailing two weeks in the life of a art-house theater opener.</li></ul>\r\nBack in the \"real world,\" the developer who was planning on opening a multiplex right behind The Moxie was <a href=\"134\">bonked over the head with a steel pipe and shot in the leg with a revolver</a> in the library by Col. Mustard. The developer is still around (and fully recovered), but I haven't heard much else about his theater development. Hmmm... not much more to say about that.\r\n\r\nAfter moving back to Springfield, Nicole and I <a href=\"136\">quickly burned through what was left of our life savings</a>, which meant it was time for me to get a job. I signed up to <a href=\"145\">work as a telemarketer</a>, but <a href=\"154\">quit after two weeks</a>. Why? Because I hated the job... simple as that. I also <a href=\"150\">threw out one of my vertebrae</a> during a Super Bowl couch tackle gone terribly awry. That was great FUN! My back still hurts!!! My posts started to lose focus around this time, so I initiated another <a href=\"147\">Q&A session</a>... oh yeah, I also introduced the <a href=\"budget.php\" class=\"broken\">Moxie Budget</a> around this time. Wee!\r\n\r\nASIDE: Man, re-reading all this stuff is really giving me a stress headache. It's like I'm reliving it all over again. If you don't mind, I'm going to skim through the rest in a little less detail. I mean, after all, this is part III in the trilogy, and we all know what happened with <i>The Godfather, Part III</i> and <i>Return of the Jedi</i>. Just be glad I don't throw in Andy Garcia dressed as an Ewok... \"Yub yub!\"\r\n\r\nSo, in late January, everyone (Andrew, our architect, and our GC) thought it would be a good idea to get a building permit - something we didn't think we'd even need. This excruciating process took over two months and lead to the discovery of several code-related problems with the building.\r\n\r\n<ol><li>Electrical - the building only had a 200 amp service, and we needed 400 or more.</li>\r\n<li>HVAC - the auditorium didn't meet a code required \"fresh air\" percentage, which would mean more duct work and a heat exchanger.</li>\r\n<li>Plumbing - we need to fix a major plumbing problem in the back of the building.</li></ol>\r\nInitially, the cost to bring the building up to code was estimated at close to $60,000. At that price, there was no way we could open the theater without more financing... so we auctioned off the naming rights to our Cinebar on eBay. I'm sure a lot of people thought this was a well-timed publicity stunt, but I can assure you it wasn't. At the time of the auction, we were in desperate need for money, and giving away the naming rights to the Cinebar seemed like the \"Moxiesque\" thing to do. Luckily, when the auction was nearly finished, we received a second round of quotes that reduced our upgrade cost to somewhere in the ballpark of $40,000 - which is where it still stands today. In the end, <a href=\"http://www.sgfsoccer.com\" target=\"_blank\">SGFsoccer.com</a> won exclusive naming rights to the Cinebar for our first year of operation and our budget was back on track.\r\n\r\nAll throughout this process, we were busy registering ourself as an LLC, securing all the appropriate business and tax licenses (retail, sales, state, liquor, etc.), affiliating ourselves with the major independent (oxymoron) distribution companies, and doing small repairs on the building. Structural work began in early May, but the pace was maddeningly slow.\r\n\r\nWhich brings me up to today... I know, I know, I skipped over a lot of stuff, but COME ON! I have important news to share, and I can't hold it back anymore.\r\n\r\nRight now, as I type these very words, sheetrock is going up on the walls at the theater. Yesterday, insulation. Today, sheetrock. Tomorrow, GRAND OPENING! Well, not quite... but things are going to be moving a hell of a lot faster than they were. Can you feel the excitement?! I can... I can really FEEL it!!! I have to go to the bathroom now.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-06-28T22:19:39.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Justin",
      "body": "I sure as hell can feel it.",
      "created_at": "2005-06-28T22:28:11.000Z"
    },
    {
      "author": "whitty",
      "body": "I felt something, but I think it was the quesadilla I had for lunch. ",
      "created_at": "2005-06-28T22:49:18.000Z"
    },
    {
      "author": "Nate",
      "body": "No, no.  That was me.",
      "created_at": "2005-06-28T22:53:13.000Z"
    },
    {
      "author": "Caleb",
      "body": "For, uh, \"comedy\" sake, would you say there is ANY small small chance the Moxie might open in July? Any answer you give would not be a for sure quoted opening date, but if it's not July then for sure August, right?\r\n\r\nI know you hate that question. But your discussions of sheetrock make my liver quiver!",
      "created_at": "2005-06-28T23:03:28.000Z"
    },
    {
      "author": "JED",
      "body": "I may have to make a special trip back this summer just to check it out. I honestly can't wait to see it.  Can we punch holes in the walls like at Dollison, or even better throw DUG though a wall? You should make a pseudo wall that DUG can be easily thrown through. ",
      "created_at": "2005-06-28T23:15:13.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Congratulations on the sheetrock!  I know that's been one of the big hang-ups for you guys.",
      "created_at": "2005-06-28T23:33:50.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "Does sheetrock = completed electrical?\r\n\r\nI know, I ask too many electrical questions. Son of a voltage hound, I tells ya. It's in the blood.",
      "created_at": "2005-06-29T00:05:03.000Z"
    },
    {
      "author": "DUG",
      "body": "I didn't even make it to the bathroom.  Happy pee!\r\n",
      "created_at": "2005-06-29T00:12:48.000Z"
    },
    {
      "author": "Tawny",
      "body": "What!? Sheetrock!? Does this call for another Phlog???",
      "created_at": "2005-06-29T03:52:40.000Z"
    },
    {
      "author": "erin",
      "body": "...slow the progress down! i guessed august 12 (or was it 19th?... hum.) anyway. slow it down dan and nicole. take a breather. relax. and let me win the opening date contest!! : )",
      "created_at": "2005-06-29T07:59:30.000Z"
    },
    {
      "author": "Caleb",
      "body": "I disagree. Keep it moving fast! July 15 is calling your name!!",
      "created_at": "2005-06-29T08:39:35.000Z"
    },
    {
      "author": "J.R.",
      "body": "My bowels have moved...\r\n\r\n\r\nIn delight.",
      "created_at": "2005-06-29T10:17:04.000Z"
    },
    {
      "author": "Ole",
      "body": "Maybe there's a <a href=\"/view.php?id=32\">birthday</a> opening after all? ",
      "created_at": "2005-06-29T10:32:44.000Z"
    },
    {
      "author": "brian of moore",
      "body": "WOOHOO! SHEETROCK!\r\n\r\nbtw.. i was just talking about scott tillman with my manager at work tonight\r\napparently he used to come into pizza inn all the time.. and was always a huge dick to everyone... also my manager always thought he was on coke.. hah... hmm.. maybe he owed his dealer some money?   err....  \r\n(opinions represented in this comment are the sole opinions of the author)\r\nSHEETROCK!",
      "created_at": "2005-06-29T11:49:24.000Z"
    },
    {
      "author": "JED",
      "body": "I think you should try to get David Blaine at your opening. We could put him in a church for 48 hours and see if he comes out \"the devil.\"",
      "created_at": "2005-06-30T23:00:26.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "Nothing says \"bad marketing ploy\" like David Blaine.\r\n\r\nEspecially the mouth part of David Blaine.",
      "created_at": "2005-07-01T00:11:29.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "Although if we froze DB in carbonite, that would achieve two goals: (1) a really cool piece of art for the front of the Moxie (and movie related art, no less) and (2) rid the world of one more schlocky magician.",
      "created_at": "2005-07-01T00:13:09.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
