{
  "id": 243,
  "title": "I'm going to take a break for awhile",
  "body": "A little more than 13 years ago, I brought home a tiny black puppy without my parent's permission or knowledge. The little pup had been given away with all his brothers and sisters at the Spring Fling, our school's version of an early Spring fair held inside the school. When I found the box full of puppies, there was only one left. He was sleeping in the corner.\r\n\r\n\"I think that one's sick,\" the owner told me. \"His nose is dry.\"\r\n\r\n\"Can I take him anyways?\"\r\n\r\n\"Sure.\"\r\n\r\nSo I took the little black ball of fur into the gymnasium and let him lick all the condensation of my can of Dr. Pepper. As it just so happened, a \"built in Shop Class\" auction was also going on at that very moment, so I grabbed the pup and made my way to the front of the auction block.\r\n\r\n\"Sold! One medium dog house for $7.00 to the young man holding the black puppy.\"\r\n\r\nBy the time my mom and dad found out that I had spent all my money on a doghouse AND brought home a puppy without their permission, they were pretty ticked off.\r\n\r\n\"We don't need another dog, Daniel. I can't believe you brought him home! We're taking him back over to the owner's house right now. We don't need more than one dog! What were you thinking?\"\r\n\r\nI was heartbroken, to say the least, but as it turns out, while mom and dad were delivering the little bundle of fur back to his owner, they fell in love with him too. And so, from that day on, big ol' Shade became a part of our family unit. Two parents, two kids, and two dogs.\r\n\r\nAlthough everyone took care of him, he was always referred to as \"Daniel's dog.\" Even when I moved away to Columbia and then on to St. Louis, Shade was still \"my dog.\" He whiled away his days laying on my parent's front porch, woofing at any car that happened to drive too far up the hill. He was a giant bear of a dog (150 lbs at his biggest) with a heart bigger than his whole.\r\n\r\nOver the past year, Shade slowly lost the ability to stand on his own. Like most labs, hip dysplasia had ravaged his back legs and his massive size only compounded the issue. For the last two weeks, Shade couldn't even get up to relieve himself, so my mom called and asked me to help her take him to the vet.\r\n\r\nI went out to my parent's house around 2:30 today and found Shade laying in a dark corner towards the back of the barn. When he saw me, he tried to get up, but just couldn't do it. I brought him some water and laid with him until my mom came home about an hour later. We used towels and sheets to lift him into the trailer, and gave him a couple pain killers to help soften the ride into town. I sat in the trailer with him to make sure he wouldn't try to jump out or fall against the sides and hurt himself. Shade stood up the whole way, smiling as he let the wind cool him down.\r\n\r\nAlthough I emotionally prepared myself to say goodbye this afternoon, the veterinarian had taken the day off, so nothing could be done until tomorrow. I politely asked the nurse to call me before the doctor administered the tranquilizer tomorrow. She agreed. Shade has been with us for the last thirteen years - the least I could do was be with him for the last few minutes. I had a hard enough time sleeping last night, and now that I have to wait another day... it's going to be rough. Shade's lying in a big air conditioned cage right now, probably asleep with pain killers.\r\n\r\nIt's a sad coincidence, but both of my family dogs - Sheba, and now Shade - were put to sleep within a week of my birthday. Owning a dog is a big responsibility, and as much as it hurts, and as much as I don't want to, we owe it them to help them out of their misery. Here are a few pictures of Shade. The first two were taken shortly after we got him, and the last one is how I'll always remember him... a big lump of fur asleep on the front porch.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/063005/shade1.jpg\" width=\"425\" />\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/063005/shade2.jpg\" width=\"425\" />\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/063005/shade3.jpg\" width=\"425\" />\r\n\r\nI love you, Shade.",
  "author_id": 1,
  "allow_comments": 0,
  "created_at": "2005-07-01T01:39:24.000Z",
  "author": "Dan",
  "comments": [],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    }
  ]
}
