{
  "id": 244,
  "title": "New blog / new post / rye bread / wheat toast",
  "body": "As you can see, the entire Moxie Cinema website has changed. I didn't like the idea of having the blog's design differ so drastically from the main website. My goal was to incorporate the two, and I think I did a pretty good job. I realize this design is a bit more graphics-laden than the last, but hopefully the majority of you are using broadband so it shouldn't amount to much of a difference in load time. You'll notice a few bugs here and there (like the old menu at the top of the forum page), but they'll be ironed out as new pages become available. As with everything Moxie-related, patience is key.\r\n\r\nAs for the theater, it's still coming along. I'm getting ready to head over there in the next hour to finish mudding and sanding the Cinebar wall. I was hoping the auditorium walls would be mudded by last Friday, but that wasn't the case. If we're lucky, they'll have their first coat of mud today. Keep your fingers crossed.\r\n\r\nOn another front, the Moxie telephone crisis has been solved, but more on that later... I haven't eaten at all today, and my stomach is rolling. A large bean burrito awaits.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-05T23:41:37.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Luke",
      "body": "Wow.  Great changes.  Lots of them too.",
      "created_at": "2005-07-05T23:50:49.000Z"
    },
    {
      "author": "Justin",
      "body": "Looks good'n.",
      "created_at": "2005-07-05T23:52:45.000Z"
    },
    {
      "author": "bjork24",
      "body": "Gracias.",
      "created_at": "2005-07-05T23:53:07.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "Good work, my friend. I'll have some Moxie shirt adventure photos for you soon.",
      "created_at": "2005-07-06T00:30:21.000Z"
    },
    {
      "author": "nicole",
      "body": "Yay! The new blog looks good. ",
      "created_at": "2005-07-06T00:44:38.000Z"
    },
    {
      "author": "JED",
      "body": "The site looks awesome. I have a few more moxie shirt pics. I wanted to take some yesterday down in Newport but I was so drunk all day, I forgot to bring the shirt with me.... I am worthless. 250,000 of my closest friends and I didn't even take a camera. How ridiculous am I? ",
      "created_at": "2005-07-06T00:48:13.000Z"
    },
    {
      "author": "erin",
      "body": "oh my! the site looks 8,578 billion times more sexy than before.\r\ntwo tumbs way up.",
      "created_at": "2005-07-06T01:56:12.000Z"
    },
    {
      "author": "Nicki J",
      "body": "very sexy!\r\n\r\n\r\nand the blog, too! ;)\r\n\r\nhaha",
      "created_at": "2005-07-06T02:00:54.000Z"
    },
    {
      "author": "Maddy",
      "body": "Five stars!  (out of 6.5 possible)",
      "created_at": "2005-07-06T02:20:39.000Z"
    },
    {
      "author": "Rachel",
      "body": "Where are my links at? I need the endless lists of other enjoyable blogs!",
      "created_at": "2005-07-06T03:12:12.000Z"
    },
    {
      "author": "Caleb",
      "body": "You got skillz.\r\n\r\nWith a capital J.",
      "created_at": "2005-07-06T06:22:54.000Z"
    },
    {
      "author": "Mark",
      "body": "Welcome back.\r\n\r\nBlack on red for the comments box? GAH! Please be kind on those of us who are colour restricted eyes.\r\n\r\nM",
      "created_at": "2005-07-06T14:33:51.000Z"
    },
    {
      "author": "brian of moore",
      "body": "snazzy... i likey\r\n\r\nin honor of this occasion.. \r\ni made you a 3D <a href=\"http://www.uselessvoid.com/bored/3d/drp.jpg\">drpepper can</a>\r\n\r\nsimilar to the <a href=\"http://www.uselessvoid.com/bored/3d/dew3.jpg\">mtdew can</a> i had already made :-)\r\n\r\n(im a show off)",
      "created_at": "2005-07-06T14:34:22.000Z"
    },
    {
      "author": "Fyse",
      "body": "Very nice indeed. Blooming gorgeous, in fact.",
      "created_at": "2005-07-06T15:09:01.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "Sorry about Shade. \r\n\r\nWebsite looks good.",
      "created_at": "2005-07-06T17:04:23.000Z"
    },
    {
      "author": "Caleb",
      "body": "There is no 'I' in TEAM!",
      "created_at": "2005-07-06T18:32:52.000Z"
    },
    {
      "author": "Caleb",
      "body": "A quote from a review of the film Murderball:\r\n\r\n\"The movie's best special effect is the players' own moxie.\"\r\n-Steve Schneider of the Orlando Weekly",
      "created_at": "2005-07-06T18:38:56.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Please fix your RSS feed. It currently only sports the headline and no content :(\r\n\r\nBut aesthetically, site-wise? Frickin sweet. </Peter_Griffin>",
      "created_at": "2005-07-06T21:27:30.000Z"
    },
    {
      "author": "bjork24",
      "body": "Evan: the content-lacking RSS feed is intentional. It forces people to come to the site, which is typically much more exciting than reading an RSS feed.",
      "created_at": "2005-07-06T21:33:00.000Z"
    },
    {
      "author": "Maddy",
      "body": "Ok, so for those of us who don't know (me), what is an RSS feed?  When I click on that button, I just get a bunch of type.  Purpose?  \r\n\r\nI always thought it might be a webcam set so we could spy on the Moxie as it was being set up.  Or maybe that is what I just wanted it to be.  How freaking cool woule that be!",
      "created_at": "2005-07-07T02:38:26.000Z"
    },
    {
      "author": "bjork24",
      "body": "RSS stands for Really Simple Syndication. Users can subscribe to a particular RSS feed (like the one up top) and have new posts automatically sent to them via their RSS reader. Most blogs include content in their RSS feed. I, however, do not.",
      "created_at": "2005-07-07T02:42:36.000Z"
    },
    {
      "author": "Steve",
      "body": "Looks great! More importantly, glad to have you back, Mr. Dan...",
      "created_at": "2005-07-08T02:03:09.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
