{
  "id": 245,
  "title": "Hunker down and get to work",
  "body": "I started this blog as a young, bright-eyed 23 year old, but today I'm writing my first post as a withered, old crusty 25 year old. I can't believe the difference 14 months has had on my life. I was so naive back then... so full of optimism... so unable to use word contractions. What would happen if I, wise old Dan, took a journey back to speak with my 23 year old youngling? Let's give it a shot!<br/><br/><b>Dan25:</b> Hello, Dan23.<br/><b>Dan23:</b> Hello, old me.<br/><b>Dan25:</b> How are things?<br/><b>Dan23:</b> Good. I am going to open an independent movie theater.<br/><b>Dan25:</b> I know.<br/><b>Dan23:</b> Do you? Do you <i>really</i> know.<br/><b>Dan25:</b> Okay, here's the deal... when the World Series rolls around, I want you to put all your money on the Red Sox.<br/><b>Dan23:</b> The BOSTON Red Sox?<br/><b>Dan25:</b> Yes, the Boston Red Sox. I want you to make a huge wager that they'll not only win, but SWEEP the World Series.<br/><b>Dan23:</b> Against who?<br/><b>Dan25:</b> The Cardinals.<br/><b>Dan23:</b> NO WAY!<br/><b>Dan25:</b> Dan, listen to me. I know you love the Cardinals, but if you want your theater to get open, you HAVE to get more money.<br/><b>Dan23:</b> No I will not! I will have no problem acquiring at LEAST $250,000 for the theater. Have you seen my business plan?<br/><b>Dan25:</b> Yes.<br/><b>Dan23:</b> Well, then you know exactly how amazing our plan <i>really</i> is, and that we'll have no problem getting the money we need to be open by October... maybe November, 2004 at the absolute latest.<br/><b>Dan25:</b> (<i>contains laughter</i>) Just don't go spreading that opening date to the press.<br/><b>Dan23:</b> Why not?<br/><b>Dan25:</b> You're really boring, Dan23.<br/><b>Dan23:</b> Yeah? Well, you are very old, Dan25.<br/><b>Dan25:</b> Yeah? Well, how about this! (<i>knees Dan23 in groin</i>)<br/><b>Dan23:</b> Noooooooooooooooooo!<br/><br/>That dialogue didn't quite work out the way I wanted it to, which is why I had to end it the way I did. A swift knee to the groin is a writer's best tool to end fruitless storylines. Trust me.<br/><br/>Let's see, as for the theater:<br/><br/><ol><li>We're still waiting for the sheetrock crew to mud the auditorium walls.</li><br/><li>The HVAC is nearly 100% complete (they're in there working right now), which makes me think the sheetrock crew may be waiting for the HVAC to be finished so they can have a working AC unit that will properly move moisture out of the auditorium... thus making their job a little quicker.</li><br/><li>Dad and I have finished mudding and sanding the Cinebar area and both bathrooms.</li><br/><li>Once the sheetrock is finished, it will time to paint, paint, paint, paint, paint, paint, paint, paint, paint, PAINT!</li><br/><li>I think there's going to be a story about the theater / blog in the News-Leader tomorrow. If so, I'll dutifully post it here.</li><br/><li>We need to get our hands on some large amounts of thick black fabric (for sound absorption inside the auditorium). Anyone know where we can find some?</li></ol><br/>Other than that... it's the same old same old. Except, now I'm twenty-five. Growing up, I always reserved the age of 24 as something special. I promised myself that if I were going to do something important with my life, I'd have done it by the time I was twenty-four. Of course, that's a very twenty-three year old way of thinking. Still, looking back, I'm happy with how my magical twenty-fourth year played out. It's not every year that you get to throw out your back, nearly die from pistachios, lose your hat, quit your job, move to another city, and, of course, try your damnedest to open a microcinema.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-06T21:53:01.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Dave",
      "body": "what is 'mudding'? i keep picturing a bunch of drunk guys throwing buckets of mud at a wall. ",
      "created_at": "2005-07-06T22:19:50.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "We had a huge Halloween party at my apartment at Drury a couple years ago and bought a bunch of cheap black fabric from Hobby Lobby or Wal-Mart or something. It wasn't very thick, but it was pretty damn cheap. Maybe some black canvas would work.<br/><br/>Just don't be too earnest and think about dying a bunch of white sheets or something. It'll be a mess and it probably won't come out right.",
      "created_at": "2005-07-06T22:20:13.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Also, if you go the Halloween party route, I would also suggest buying some fluorescent tape and marking off a pentagram in the middle of the floor. Add one part rum and three parts dance music (GOOD dance music, not that lame crappy hipster junk – we're talking Li'l Mikey and the J5, Blondie, et al) and you'll have people coming into the theater all night long.",
      "created_at": "2005-07-06T22:22:35.000Z"
    },
    {
      "author": "bjork24",
      "body": "Dave: whenever you hang sheetrock, you have to fill the cracks and screw holes with sheetrock mud... it's kind of like a thick plaster. You have to sand down the rough spots after each application until the wall is ready to be painted over. It usually takes 2 or 3 mud applications. It helps if you're drunk.",
      "created_at": "2005-07-06T22:23:36.000Z"
    },
    {
      "author": "brian of moore",
      "body": "ahh to be young again<br/>my 25th year is halfway over<br/>i cant think of anything good thats really happened yet.... actually id say 23 was one of my best years... i used to get dates back then... hmm.. whatever happened with that",
      "created_at": "2005-07-06T22:58:58.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "Can you give a few more details on what sort of fabric you're looking for? I'm picturing something from an old Cream song: <br/><br/>In the white room/with black curtains/at the station<br/><br/>I guess I can't visualize it beyond black curtains on the wall.",
      "created_at": "2005-07-06T23:25:34.000Z"
    },
    {
      "author": "bjork24",
      "body": "Sam: that's really about it. Heavy black fabric... think along the lines of a big velvet curtain. We've considered black canvas, but Nicole is afraid it won't drape properly. I don't know. The only fabrics I know are denim and satin... some silk.",
      "created_at": "2005-07-06T23:42:56.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Considering it's going to be dark 90% of the time in there, I doubt having something that looks super-spectacular will matter all that much. Be sure to buy quite a bit extra if you plan on doing something with draping or folding or whatever.",
      "created_at": "2005-07-07T00:36:34.000Z"
    },
    {
      "author": "Present Nate",
      "body": "Hey, 5-Minutes-Later-Nate, are you there?",
      "created_at": "2005-07-07T01:27:46.000Z"
    },
    {
      "author": "5-Minutes-Later-Nate",
      "body": "Sorry, sorry guys...I just got here.  Whew!<br/>Hey.  Where did Present Nate go?",
      "created_at": "2005-07-07T01:29:16.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Maybe you could affix black felt to some sort of board?  ",
      "created_at": "2005-07-07T02:44:56.000Z"
    },
    {
      "author": "Caleb",
      "body": "My step-dad is a high-upper at a luggage company that uses very durable (and thus thick) black fabric for their bags. I don't know how much they would charge. If you needed exact dimensions he could probably get some people to sew some together to fit perfectly. Let me know if you're interested.<br/><br/>And happy birthday, old man. ",
      "created_at": "2005-07-07T06:43:27.000Z"
    },
    {
      "author": "erin",
      "body": "happy birthday!",
      "created_at": "2005-07-07T07:47:50.000Z"
    },
    {
      "author": "Jay",
      "body": "I work at a high school in the area and I know that the curtains from the stage are about 50 years old and may get replaced in the near future.  Maybe you could contact some high schools or community theaters and get actual, heavy black drapes.  What are they gonna do with them, anyway?",
      "created_at": "2005-07-07T07:55:14.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Luggage company? Sounds like a foreign film series sponsorship.",
      "created_at": "2005-07-07T21:58:03.000Z"
    },
    {
      "author": "Steve",
      "body": "Ahhh...25. I remember 25...the last positive age milestone of life; your car insurance gets cheaper (did your car insurance get cheaper Dan?) From here on out they get gradually more depressing. Next up Dan, is 30...need I say more?",
      "created_at": "2005-07-08T02:15:46.000Z"
    },
    {
      "author": "Steve Kirks",
      "body": "1.  Reading this blog's comments is always a hoot.  They never fail to make me smile.<br/><br/>2.  Dan, the amount of fabric you need will be large, so try contacting some upholstery shops and see if you can get some backstock that they don't need or buy a large order from their supplier.  Give them free movie tickets for their trouble...<br/><br/>3.  If you get a dollar amount, consider another auction.  If not for the walls, at least for the curtain.  Imagine:  a red curtain for the screen made of velvet fabric with logos embossed all over it, alternating between \"Coca Cola\" and \"The Moxie\".  Think of the backdrops at a sporting event press conference.  Subtle at a distance, but the message is clear.<br/><br/>4.  Buy scrap fabric and sew it together for form the pieces that you need while playing the Dolly Parton rendition of \"Coat of Many Colors\" in the background.  Make sure to have liberal amounts of Jack Daniels around.  Best if sewn on an old machine by the light of a bare bulb while crying.<br/><br/>5.  Happy Birthday!",
      "created_at": "2005-07-08T20:32:17.000Z"
    },
    {
      "author": "tommy",
      "body": "haha...  I can attest to him almost dying from nuts.  That should teach us all a very valuable lesson..  \"never put nuts in your mouth\"  <br/><br/>Danny boy, the lessons learned from you and the lessons ahead.  We do have a beautiful relationship coming our way!<br/><br/>PS... to all those wondering what this is about, I happened to run into Dan the night he got nut poisioning and I thought he was just as drunk as one could be without passing out!  Left him to go to bed and found out later that he was rushed to the hospital for putting some of deez nutz in his mouth...  what a life",
      "created_at": "2005-07-12T01:25:20.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    }
  ]
}
