{
  "id": 246,
  "title": "Hey look, Part 12",
  "body": "Mike Brothers has written a nice article about the Moxie Blog for the Springfield News-Leader, which you can read here: <a href=\"http://www.news-leader.com/apps/pbcs.dll/article?AID=/20050707/ENTERTAINMENT/507070344/1005\" target=\"_blank\" class=\"broken\">Blogging Boom</a>. In case you're wondering, I'm wearing my \"<a href=\"http://www.bustedtees.com/images/missouri.20.gallery_normal.jpg\" target=\"_blank\" class=\"broken\">Missouri Loves Company</a>\" shirt in the article photo, and yes... I have an enormous widow's peak. Of course, I should've been sporting my Moxie shirt, but it was dirty.\r\n\r\nTo all the new people who may or may not be stopping by: HELLO! Please feel free to check out the pictures in the <a href=\"/phlogs/\">phlog</a> (which I will be updating soon), glance at <a href=\"/posts/budget.php\" class=\"broken\">our budget</a>, join the <a href=\"http://www.moxiecinema.com/mail.php\" class=\"broken\">Moxie Mailing List</a>, buy one of the last <a href=\"/posts/store.php\" class=\"broken\"><strike>two</strike> ONE remaining Moxie shirts</a>, or simply <a href=\"http://www.amazon.com/paypage/PFNKBJKXGXI0R\" class=\"broken\">donate money</a>! Woo hoo!\r\n\r\n<b>Blogging boom</b>\r\nBy Michael A. Brothers\r\n<a href=\"http://www.news-leader.com\" target=\"_blank\">Springfield News-Leader</a>, July 7, 2005\r\n\r\n<i>Ozarkers share their lives, interests with global community.</i>\r\n\r\nHundreds of people visit the Moxie Cinema every day, yet the independent movie theater in downtown Springfield hasn't sold a single ticket or tub of popcorn — or even opened its doors for business.\r\n\r\nThat's because the theater's loyal customer base is online, following the slow but steady progress owners Dan and Nicole Chilton are making via Dan's Web log, commonly known as a blog.\r\n\r\n\"My goal in the beginning was just to kind of chronicle the steps my wife Nicole and I were taking to open the theater,\" says Dan, 25. \"... I thought maybe one or two people would be interested.\"\r\n\r\nWhen he began the cyber chronicle a year ago, only a handful were. Then Chilton's blog — which discusses everything from whether or not to hold intermissions to a step-by-step guide to soundproofing an old window — was chosen as a \"Blog of Note\" on the Web site Blogger.com.\r\n\r\nChilton says he still has no idea how or why his blog was highlighted, but the project has taken on a new life since. Occasional posts turned into a daily routine, and the once text-only site now features an extensive photo log of the renovation process.\r\n\r\nThe blogging phenomenon has been around for a few years now, but Chilton is one of at least 30 Ozarks bloggers who are using the worldwide medium of the Internet to publish local content. One might think only area residents would be interested in following the progress of a tiny Springfield movie theater, but Chilton and others like him are proving that local blogs can have global appeal.\r\n\r\nA blog is as unique as the person who writes it, says Andrew Cline, an assistant professor of journalism at Southwest Missouri State University who writes a blog about press and political rhetoric. He's also compiled links to every local blogger he could find, whether their content is local or not.\r\n\r\n\"It's everything from a personal online diary to very serious commentary about our world to helping people to sell more widgets,\" Cline says.\r\n\r\nBlogs have a few defining characteristics: a unifying theme, regular and frequent content updates, personal voice and links to interesting or related Web sites and blogs.\r\n\r\nLocal blogs run the gamut from entertainment listings to rants about life in the Ozarks to exploring weird places to starting movie theaters.\r\n\r\nAfter the Blogger.com spotlight, readership of the Moxie blog peaked at more than 1,200 people a day, but it has since leveled off to about 500 regular readers, about 30 percent to 40 percent of whom are local, Chilton says.\r\n\r\n\"In the beginning people really liked reading the posts of behind-the-scenes stuff like where you get movies, how much of the ticket price goes back to the theater and why concessions are so expensive,\" Chilton says.\r\n\r\n\"Then when people started to get more invested in the theater, they started to get more into the picture blogs.\"\r\n\r\nChilton compares finding a good local blog to meeting a person from your hometown in some far-flung corner of the world: there's an undeniable connection no matter what the circumstance.\r\n\r\n\"It just opens up your eyes to so many different views of the same community,\" he says.\r\n\r\nThat's what happened to John Stone, a retired biologist and local blogger who discovered the Moxie online.\r\n\r\n\"It's a way for me to learn about what's going on in Springfield,\" says Stone, 61. \"I knew nothing about the Moxie theater and I live within six blocks of it. I knew nothing about it until I read it in the Springfieldian.\"\r\n\r\nThe Springfieldian is an often humorous blog about local life, and one of about 15 that Stone reads daily. Others are about the sciences, but they aren't merely cut-and-dried academic journals.\r\n\r\n\"Blogs have personality, and it's really more creative writing than it is technical writing,\" Stone says. \"... That's the joy of blogging. If you find somebody you like to read, you get to know them.\"\r\n\r\nStone, 61, started writing his own blog, Curbstone Critic, as a diversion. The title is taken from a column that appeared decades ago in this newspaper. He admits it has little purpose other than to amuse its author, but more than 1,000 people have logged on to read his personal profile.\r\n\r\n\"There is absolutely no reason for my little blog to be in existence,\" he says, \"but I'm surprised as to how much it's read.\"\r\n\r\nOther local blogs have more gravity.\r\n\r\nThe Turner Report, written by former journalist and Joplin middle school teacher Randy Turner, is frequently updated with Missouri news and the author's analysis. Cline's Rhetorica Network has a largely academic tone and draws 2,500 to 5,000 daily hits from across the country.\r\n\r\nSome blogs are more varied. Chatter, by Ron Davis, is one of the most closely followed among the local online community and cuts a wide swath between oddball news items, liberal politics and sometimes very personal topics like the death of a parent.\r\n\r\nStarting your own blog is easy, bloggers say. There are a number of sites like Blogspot.com that allow users to simply fill out some information about themselves, choose a format and go. The only requirement is computer access.\r\n\r\nOne well-known blogger, Kevin Barbieux, wrote about being homeless via free Internet access at a Nashville public library.\r\n\r\n\"Don't be surprised if it becomes something you never, ever thought it would be,\" says Daniel \"Buck\" Evinger, a Branson businessman who runs a blog called Laugh At Liberals with a handful of friends.\r\n\r\nThey started it last year as a way to poke fun at the left during the presidential election, and as a way to feel more involved with the national political process.\r\n\r\nBut the blog of original humor attracted even more liberals than conservatives, and soon an active community of readers trading posts and opinions began to revolve around it.\r\n\r\n\"I'm just amazed at how it started out as a way for us to have an Internet site where we could post our little topics, our little commentary and funny little jokes, and how people just started finding it and doing the same thing,\" says Evinger, 41.\r\n\r\nSMS' Cline believes blogging, whether local or national, will change the way people communicate and gather news and information, eventually shifting the model of mass media from one-way lecture into group discussion. More and more news outlets will adopt the practice in the future, he believes, because interactivity attracts an audience.\r\n\r\n\"The Internet is teaching people they can talk back to power,\" Cline says.\r\n\r\nYet Evinger, who works in the advertising industry, says local blogs often still need a boost from traditional media like TV and newspapers to be noticed by local audiences.\r\n\r\n\"That hasn't changed, and I don't see that changing anytime real soon,\" he says.\r\n\r\n###",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-07T20:39:29.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Aaron Scott",
      "body": "Red will pop off of the newsprint better. You'll be eyecatching!",
      "created_at": "2005-07-07T21:55:57.000Z"
    },
    {
      "author": "bjork24",
      "body": "What, exactly, are you talking about, Aaron?",
      "created_at": "2005-07-07T22:00:26.000Z"
    },
    {
      "author": "Nate",
      "body": "Your shirt.  It's red.  The Moxie shirt is black.  Red will be more eye-catching in newsprint.  Next!",
      "created_at": "2005-07-07T22:13:15.000Z"
    },
    {
      "author": "bjork24",
      "body": "Oh... I feel stupid now.",
      "created_at": "2005-07-07T22:18:00.000Z"
    },
    {
      "author": "Caleb C.",
      "body": "The next Moxie shirt should be red.",
      "created_at": "2005-07-07T22:22:55.000Z"
    },
    {
      "author": "JED",
      "body": "The next Moxie shirts should be white. Wet Moxie shirt contests must be considered when the next shirt printing comes around. It will make for great \"Moxie Shirt Adventures\" pics. Oh and yes Dan you do have the most enormous widow's peak ever....ever.",
      "created_at": "2005-07-07T23:51:03.000Z"
    },
    {
      "author": "whitty",
      "body": "I think I poked my eye out on your widow's peak just looking at it.\r\n\r\nI would like to purchase the first Moxie eye patch.\r\n\r\nOh, and yeah, nice article.",
      "created_at": "2005-07-08T00:39:05.000Z"
    },
    {
      "author": "DUG",
      "body": "Dan, you look as if you have little bread stick arms.  How did they get your parapalegic ass up that high to get the moxie windows in the picture.  Man oh man when I see you next I'm bringing some meat sauce for those freakishly amazing breadstick arm stubbs!\r\n",
      "created_at": "2005-07-08T01:55:54.000Z"
    },
    {
      "author": "bjork24",
      "body": "I was scratching my butt when that photo was taken.",
      "created_at": "2005-07-08T01:57:00.000Z"
    },
    {
      "author": "Scott G.",
      "body": "Dan and Nicole, are you gonna have tshirts and stickers for sale at the Cinema when you are open?",
      "created_at": "2005-07-08T06:27:01.000Z"
    },
    {
      "author": "nicholas",
      "body": "Whoah. Holy re-design Batman! POW!",
      "created_at": "2005-07-08T07:17:02.000Z"
    },
    {
      "author": "erin",
      "body": "no, no your not scratching your butt! youre hidding a cookie from your mommy.\r\nlook at that grin! all youre missing is smeared chocolate on your face.\r\ndan.. did you get into the cookies?!\r\n\r\nits precious\r\n: P",
      "created_at": "2005-07-08T07:31:15.000Z"
    },
    {
      "author": "nicole",
      "body": "I think it's a good picture of Dan. It makes his eyes look really blue.\r\n\r\nWe'll most likely be selling stickers and such once we open, Steve!",
      "created_at": "2005-07-08T07:40:52.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i still havnt picked up my sticker\r\ni should look into that",
      "created_at": "2005-07-08T09:53:19.000Z"
    },
    {
      "author": "Linda Schott",
      "body": "Dan,\r\nGood morning.  No, it's not a nightmare, and you don't have a math assignment missing!  Just me, saying hello.  It will be fun keeping up with your blog.\r\nLinda Schott",
      "created_at": "2005-07-08T18:27:45.000Z"
    },
    {
      "author": "XR4Ti",
      "body": "Maybe you should work on getting the theater open instead of writing about it.",
      "created_at": "2005-07-08T19:42:29.000Z"
    },
    {
      "author": "bjork24",
      "body": "XR4Ti: that's the funniest thing I've heard all day. Thanks!",
      "created_at": "2005-07-08T19:48:44.000Z"
    },
    {
      "author": "nicholas",
      "body": "<span style=\"color: red;\">XR4Ti says:</span><br />&nbsp;<br />I have nothing in which to take pride in my own life, so I have to denigrate others... I am also jealous of your imminent success.",
      "created_at": "2005-07-08T20:27:06.000Z"
    },
    {
      "author": "brian of moore",
      "body": "oh.. that guy is SO not getting extra butter on his popcorn...just one pump for him",
      "created_at": "2005-07-08T20:37:56.000Z"
    },
    {
      "author": "Caleb C.",
      "body": "Dan,\r\n\r\nApparently you are supposed to work on the Moxie 24/7. No stopping for food, no sleep, no bathroom breaks, and ESPECIALLY no stopping to give updates to your dedicated blog readers. Your blog has turned into a great marketing outlet and because of it you will have a strong force of people coming to your theater at its grand opening and then on. \r\n\r\n...why are people such idiots?!?",
      "created_at": "2005-07-08T21:45:06.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
