{
  "id": 247,
  "title": "This is a post about telephones",
  "body": "Remember when I said that I solved our phone crisis, and that I'd be telling you about it soon? No? Well I do, so here we go:\r\n\r\nAs I mentioned in my <a href=\"/post/230\">last post about phones</a>, The Moxie will require at least three lines to run smoothly: one for the Moxie Cinema anytime movie line, one for our standard business line, and one for our credit card transactions. Now, if these lines were being installed into a house the cost would be nominal, but since it's being used for a business we have to shell out some major cash to make things happen. According to SBC, we would have to pay between $130 and $160 PER MONTH for three lines. Do you even know how much Dr. Pepper I could buy with $130 per month? No! You do not know how much Dr. Pepper I could buy for $130 per month, Matt. And why don't you know? Because you're glib, Matt. I've studied Dr. Pepper, and you haven't. Simple as that.\r\n\r\nBut what about Vonage? They offer a basic small business package for $39.99 per month, and each additional line receives a $5 discount. So if we went with Vonage, we'd be looking at roughly $110 per month. Yes it's a savings of at least $20 per month, but do you even know how much cashew chicken I could buy for $110 per month? I could buy enough to drown myself in thick brown gravy twice over! And, even if we wanted to use Vonage, it wouldn't work with our credit card machine. According to the Vonage sales associate, you MUST have a standard landline to process credit cards correctly. And just like that, our $20 in monthly savings is gone. Poof!\r\n\r\nSo where does leave us? After briefly considering a network of strategically placed walkie-talkies throughout the city, I had an epiphany - <i>you can keep the chicken crispier if you ask for the cashew sauce on THE SIDE!</i> Amazing! Why hadn't I thought of that before?! Then, on my way to pick up cashew chicken from The Noodle House at 1406 West Sunshine (417.865.6664), I had another flash of inspiration: <i>why don't I use <a href=\"http://www.skype.com\" target=\"_blank\">Skype</a> for the movie and business lines?</i> By utilizing Skype's new SkypeIn feature, I can buy an incoming phone line for $36 per YEAR... that's only $3 per month. The movie line has built-in voicemail for weekly showtimes, and the business line will be forwarded directly to my computer at the theater. We'll still have to get a standard landline for our credit card machine, but that's a lot cheaper than getting THREE of them... I think. I better recheck my math. Hold on.\r\n\r\n<b><u>MONTHLY CHARGES</u></b>\r\n\r\n1. Movie Line = $3.00\r\n2. Business Line = $3.00\r\n3. Credit Card Line = $45.00\r\n\r\n<b>Monthly Total:</b> $52.00\r\n\r\nWoo hoo! That's a monthly savings of at least $50! Do you know how many boxes of Cheerios I can buy for $50 per month? Ten or more!\r\n\r\nOf course, Skype isn't all unicorns and jelly beans... it has a dark side as well. Most notably, not being able to call OUT without incurring a smallish per minute charge. But fear not, for we have a standard landline in case of emergencies! Huzzah! <i>But what if you need to call someone from the theater and it's not an emergency?</i> That, my friends, is the exact reason why the Mongolians invented mobile phones (typically pronounced mo•BULL, but can also be pronounced mo•BILE if you're trying to be funny or sound British). And then guess what we get to do with our cell phone bills? Write them off as business expenditures! Woo hoo! So what was originally a personal expenditure has  morphed into a business one. Amazing. Simply amazing.\r\n\r\nI bet many of you will shoot my system full of holes, but you know what? You're glib. I've researched this and you haven't, Matt. You think you might know about The Moxie phone system because you read about it on some blog, but you don't. I do, Matt. I do.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-09T02:16:41.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "Who's Matt?\r\n\r\nAnd...Skype is nice.",
      "created_at": "2005-07-09T03:11:22.000Z"
    },
    {
      "author": "Sara Reisenbichler",
      "body": "Hi, Dan.  This is Sara Schott, currenly known as Sara Reisenbichler.  My sister told me (long ago) about your grand business plans.  I can't wait until it happens.  Springfield needs some culture, right?  Contgats on everything.  I'm enjoying your blog.",
      "created_at": "2005-07-09T03:16:26.000Z"
    },
    {
      "author": "erin",
      "body": "where in the world is... matt lauer",
      "created_at": "2005-07-09T03:32:43.000Z"
    },
    {
      "author": "JED",
      "body": "Dan, you are being bombarded by the Schott family. It's a bit scary. Lil Sarah is now married? What is going on with this world. I'm going to send Mrs. Schott disturbing e-mails now. That have nothing to do with anything. Ha ha ha",
      "created_at": "2005-07-09T03:43:02.000Z"
    },
    {
      "author": "Fyse",
      "body": "Yes, who is this Matt? Does he by any chance have your hat?\r\n\r\nOh, and it is definitely pronounced moBILE. Bile, as in the alkaline liquid produced by the liver which aids in the digestion of fats. Surely you don't pronounce THAT as 'bull'. Please tell me you don't...",
      "created_at": "2005-07-09T05:00:10.000Z"
    },
    {
      "author": "bjork24",
      "body": "Erin got it... Matt = Matt Lauer. It's a reference to his Tom Cruise interview.",
      "created_at": "2005-07-09T06:11:46.000Z"
    },
    {
      "author": "Dave",
      "body": "phones.\r\n\r\nwhatever happened to plain old shouting out of opened windows?",
      "created_at": "2005-07-09T06:14:59.000Z"
    },
    {
      "author": "Pat",
      "body": "Does SkypeIn have 417 numbers?",
      "created_at": "2005-07-09T06:45:40.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i decided to do some of my own research\r\nyou can go <a href=\"http://www.olddocs.com/product.aspx?id=145&up1=0&up2=0&up3=0&cat=Drinks&subcat1=Dr%20Pepper&subcat2=\">here</a> and buy 10 cases for $125 that includes shipping and everything!\r\n.. 10 cases.. 24 cans per case.. 12 oz per can... 2,880 ounces... converts to 748.8 gallons\r\n\r\nmmm.. im thirsty",
      "created_at": "2005-07-09T07:09:31.000Z"
    },
    {
      "author": "brian of moore",
      "body": "you can probably get it cheaper at the grocery store.. but then you actually have to go out and buy it.. and lift it.. and all that...  see this way you can just stay home",
      "created_at": "2005-07-09T07:11:13.000Z"
    },
    {
      "author": "Pat",
      "body": "OK I went and did my own research and by gum they do have 417 numbers.I just assumed when it said available in major cities across the US that it didn't mean Springfield. First we get local channels on Dish Satellite, then we get local Skype numbers. What next? independent cinema?",
      "created_at": "2005-07-09T07:44:55.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Ok...I was starting to think you were picking a fight with my husband...",
      "created_at": "2005-07-09T09:47:59.000Z"
    },
    {
      "author": "Derek the local college student",
      "body": "Hmm.....fascinating.....I see absolutely no flaws in that, but then again, I saw no flaws in the idea of releasing Star Wars prequels, so you really can't trust my foresight.",
      "created_at": "2005-07-09T21:31:16.000Z"
    },
    {
      "author": "michelle",
      "body": "ahh...sitting at mudhouse writing to something down the street. community is good...\r\n\r\njust gave some money to you guys, well a measly amount out of my measly paycheck. i really really really believe in what you're doing. we need to help out springfield's (lack of) culture. So thanks for the vision, hard work, and time... can't wait to be part of seeing you all opening. \r\n\r\nps-can we get ahold of \"Me You And Everyone We Know\" by Miranda July and/or can you tell me where to go and find this movie?.....",
      "created_at": "2005-07-10T02:39:47.000Z"
    },
    {
      "author": "Al",
      "body": "I think if you're worried about the cost of 3 landlines, deep trouble is ahead.",
      "created_at": "2005-07-10T08:55:51.000Z"
    },
    {
      "author": "Caleb",
      "body": "Al,\r\n\r\nIf you actually stopped to THINK about it you would realize Dan and Nicole are running on empty trying to get this thing opened and saving money on car insurance with Geico...I mean saving money on the phone bill right now is just a small stepping stone to get where they want to be. When they open and become a huge success then I doubt they're going to be worrying as much. It's called entrepreneurship (look it up) and it's a tough road, so cut them some slack.",
      "created_at": "2005-07-10T09:46:15.000Z"
    },
    {
      "author": "mikr",
      "body": "When I was reading the begining of your post - I was thinking, \"I should suggest Skype to Dan... no, he would never go for that... but maybe...\"\r\n\r\nI'm glad you're using Skype - it's a kick ass idea. And since you're spending wisely, it's like you're getting free Dr. Pepper & Cashew Chicken on the side. It's win, win!",
      "created_at": "2005-07-11T00:03:26.000Z"
    },
    {
      "author": "mike",
      "body": "By the way... \"mikr\" means \"mike\" when translated from \"I-can't-type-worth-a-damn\"...\r\n\r\n\r\nOh, one more thing, Dan. Are you going to set it up where people can IM you through Skype? Maybe that seems like too much work...",
      "created_at": "2005-07-11T00:05:40.000Z"
    },
    {
      "author": "Mark",
      "body": "Al - I would be more worried if they WEREN'T worried about a $130 a month phone bill.\r\n\r\nAnd it is moBILE, we should know it's our bloody language.\r\n\r\nM",
      "created_at": "2005-07-11T15:01:36.000Z"
    },
    {
      "author": "Jessica",
      "body": "After traveling the world for the last few years and living in some places for an extended time (places include: South Africa, Amsterdan, London, Nepal, Bangkok, and France) the most commonly used pronounication of mobile is mo-BILE, but that does not mean it is the correct way.  The only place I have heard mobile pronounced mo-BULL is here in the lovely United States.  ",
      "created_at": "2005-07-12T18:55:38.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
