{
  "id": 25,
  "title": "Necessary Equipment",
  "body": "A lot of people are unfamiliar with the equipment needed to run a movie theater. So much so, that patrons have been known to ask theater managers if they could \"rewind\" the film or adjust the tracking, as if the projector were a giant VCR. If you don't believe that theater patrons can be so stupid, do yourself a favor and check out this <a href=\"http://www.film-tech.com/cgi-bin/ubb/ultimatebb.cgi?ubb=get_topic;f=5;t=000931\" target=\"_blank\">post</a> over at <a href=\"http://www.film-tech.com\" target=\"_blank\">Film-Tech</a> that's dedicated entirely to stupid customer comments. It's quite entertaining. In hopes of clearing some of the fog that surrounds theater operation, today's post will focus on some of the major pieces of equipment that every theater <i>should</i> have.<br/><br/><b>Projector</b> - Duh. This is the single most important piece of equipment that a theater will own. Without it, you don't have a theater - you have a lecture hall with a big screen in it. A handful of theaters have fancy-shmancy digital projectors, and a few smaller venues still have 16mm, but since the prevalent medium of film is currently 35mm, the majority of projectors in today's theaters are made to accommodate it.<br/><br/>For those of you who haven't seen a 35mm projector in real life, I highly recommend sneaking into the projection booth at your local theater and taking a peek. They're really a sight to behold. The whirring sound of film zipping from the platter to the projector, the rhythmic ticking of the gears, the heat from the lamphouse... it's enough to make a film geek like me pass out! Perhaps I've said too much. The projector is every theater's mainstay, its bread and butter, its anchor, its Olsen twins on <i>Full House</i>, if you will - if you treat it well, you'll be treated well in return.<br/><br/>A well-maintained projector can last for many years. In fact, I've been to several theaters where the projectors are actually older than me! Can you believe that? That's old! I mean, that's almost a quarter of a century! [ read sarcasm ] All age comparisons aside, a projector is an investment in time and money, but they're not as expensive as some people might lead you to believe.<br/><br/><b>Some People</b> - \"Projectors are expensive.\"<br/><br/>A good used projector can be had for around $7,000, which, in comparison to other things, like a new car or a <a href=\"\" onclick=\"alert('I took this link down because it was dead. You can always do a search for it on good ol\\' eBay!'); return false;\">lunch with Avril Lavigne</a>, isn't that expensive. Of course, the projector is only the tip of the iceburg. You still have to purchase a platter, sound equipment, automation equipment, a screen, seats, and lots of additional booth equipment like a make-up table, splicer, film clamps, and much, much more. But the point was that regardless of what some people say, projectors aren't that expensive, and, as you can see, they aren't... it's just all the other stuff that takes a toll on your start-up budget.<br/><br/>It would take me forever if I went through and explained, piece by piece, what all the equipment in the projection booth does, so that will just have to wait until my next post. Now, let's move on to the concession area.<br/><br/><b>Popcorn Popper</b> - Believe it or not, a good popcorn popper could end up costing you as much as a projector. The cost depends on the size of the kettle and whether the popper has been set-up to administer popping oil automatically or manually. Since our seating capacity isn't anywhere near that of a conventional multiplex, we should be able to get by with a kettle size somewhere between 16 to 18 ounces. Good used poppers are actually pretty hard to come by, so we'll most likely end up buying a new one, which will cost us somewhere in the neighborhood of two to three thousand smackeroos.<br/><br/>Along with the requisite popper, we're also looking at buying a curved, glass-front, refrigerated display case ($3,000 to $5,000), a medium-sized ice maker for our fountain drinks ($3,000), a small capacity dishwasher for dirty beer and wine glasses ($500), and a whole slew of other small-end items (i.e. storage shelving, double-sided sink, beverage containers). Nicole has compiled an incredibly detailed list of everything we'll need in the concession department, and as much as I'd love to list it all here, it will have to wait for another post.<br/><br/><b>Ticketing Software</b> - This could be contested as not being completely necessary for a small outfit such as ours, but when you consider the amount of paperwork and tedious hours of accounting and inventory checking it will save, it's hard to deny its necessity. The system we're currently considering will run on both the box office and Cinebar's POS stations, enabling us to view realtime statistics on percap (total concession sales divided by total attendance), occupancy percentage trends, and box office revenue. The most important feature of the system is its ability to compile daily B.O.R. (Box Office Revenue) reports, which is what the distribution companies use to charge their fees.<br/><br/>On top of the B.O.R. reports, we'll also need to retain all of our ticket stubs for at least 7 years in case we ever get audited or a distributor contests one of our reports. We had initially considered using tickets that had the movie poster on one side and all the information on the other, but that led to an interesting problem - all of the ticket stubs have to have distinguishable features that allow you to determine what type of admission was charged (i.e. adult, senior, student, matinee, etc.). If we stick with our original plan, we'd have to print out 65 tickets for each type of admission for each showing, which would mean printing out roughly 1,500 tickets per weekday. That's a lot of printing, which would ultimately end up causing a lot of waste. Right now, unless I can think of a better solution, it looks like we're going to have to stick with the boring, old, thermal printed tickets that you see at every other theater in the world.<br/><br/>So, in the end, I guess all you really need to start your own pseudo-theater is a projector, a screen, and a popcorn machine. Everything else is just icing on the cake, with the caveat being that the best cake wins. Pretty philosophical, eh? I'm rambling. My next post will take a more in-depth look into the projection booth to see how it works, and what we plan to do with ours, so until then... be careful, and if you can't be careful, be safe.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-06-24T22:42:46.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "James",
      "body": "So, you're going to serve your beer and wine is glasses?  At our theatre we serve them in clear plastic cups.  We aren't allowed to have glass in the auditorium, I don't know if that's a law, or something set forth by the owner, but I think reusable cups would save a lot of money in the long run.  For ticketing software we use RTS, and our projectors are from the '50s!",
      "created_at": "2004-06-25T00:00:24.000Z"
    },
    {
      "author": "bjork24",
      "body": "James, you're right on target... we're looking at RTS for our ticketing system AND our projectors will most likely be from the '50s as well. I don't think we have the any legal issues regarding glass containers in our state, as Ragtag uses all glass, but it's worth looking into. It seems that glassware would lend a certain bit of class... we'll see.",
      "created_at": "2004-06-25T00:14:04.000Z"
    },
    {
      "author": "Oz",
      "body": "I tell you, I've learned more about theaters from your blog than I ever wanted to know LOL.  Seriously, you're a very good writer--good at explaining things.  I'm actually looking forward to the detailed post on the projector booth.",
      "created_at": "2004-06-25T00:26:09.000Z"
    },
    {
      "author": "bjork24",
      "body": "Oz, you're too kind.",
      "created_at": "2004-06-25T00:36:08.000Z"
    },
    {
      "author": "david",
      "body": "Ive been reading your post and there is alot more to the movie theater business than i thought.Where is this theater located?<a href=\"http://theworldaroundtheworld.blogspot.com\">Here Check Out This Link</a>",
      "created_at": "2004-06-25T01:04:04.000Z"
    },
    {
      "author": "bjork24",
      "body": "David (alleycat) - I usually frown on continual comment spamming and quickly delete offending posts, but you always seem to throw in words of support or say something nice. You're a strange one... and the theater's located in Midwestburg.",
      "created_at": "2004-06-25T01:09:11.000Z"
    },
    {
      "author": "Newell",
      "body": "This was a pretty interesting post, but I'm really looking forward to the projection booth post. I'm interested to see exactly what it takes to replace the projectionists of old and keep that stuff automated.",
      "created_at": "2004-06-25T04:07:38.000Z"
    },
    {
      "author": "anonymous",
      "body": "had you considered looking into the available equipment in midwestburg from the other theatres that have closed there in the last coupld of decades? i can think of at least five places with extra equipment..and some people who ended up with some of those pieces.",
      "created_at": "2004-06-25T05:13:52.000Z"
    },
    {
      "author": "bjork24",
      "body": "Anonymous - I was under the assumption that all of that equipment had been dispersed back to the head office. I've been in contact with ex-managers at two of the old locations and they told me it had all been sold off. If, however, you know different, please let me know.",
      "created_at": "2004-06-25T05:32:27.000Z"
    },
    {
      "author": "Shodan",
      "body": "maybe you could build your own projector out of a 21\" high resolution LCD , a cluster of highpower pure white lights and good fresnel and focus lens ? like these guys did http://allinbox.free.fr/ (but using smaller lcd for a salon sized projector)",
      "created_at": "2004-06-25T06:17:47.000Z"
    },
    {
      "author": "James",
      "body": "I just finished reading that thread about stupid customer questions.  My best(this isn't so much theatre as espresso) was when I woman asked me to make her a cappucino with no foam.  I said, \"all right, maam,\" and promply made her a latte.",
      "created_at": "2004-06-25T12:11:12.000Z"
    },
    {
      "author": "justin",
      "body": "Les Bourgious (sp?) charges you a deposit for the wine glasses they let you use when out on their deck, but the glasses have their logo on them, and some customers like to keep them.  Maybe you could do the same?  Have your logo on the glasses, and charge a $3 deposit on the glasses, so if people want to keep them they can.",
      "created_at": "2004-06-25T20:35:29.000Z"
    },
    {
      "author": "hamed",
      "body": "i want to find a girl friend.what should i do?",
      "created_at": "2004-07-05T15:41:32.000Z"
    },
    {
      "author": "justin",
      "body": "you should first fuck a girl",
      "created_at": "2004-07-05T15:43:59.000Z"
    },
    {
      "author": "hamed",
      "body": "how?",
      "created_at": "2004-07-05T15:44:37.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
