{
  "id": 250,
  "title": "30 Days in the life of the Moxie",
  "body": "Ok, so here's the deal - starting today, and lasting until August 10th, I'm going to chronicle every Moxie-related detail that transpires during the course of my day. Up until now, my posts had a bad tendency of fluttering to and fro between relevancy and distraction. For the next 30 days, there's a new boss in town, and his name is Mr. Culpability. I can no longer hide an inactive day's work behind an ambigous post about Sugar Smack scented pee pee (as pertinent an issue as that may be). When the day is over and done, I'll post my progress here. Seven days a week. Simple as that.\r\n\r\nWhere will The Moxie be in 30 days? I hope it will be incredibly close to opening. Fall classes begin on August 22 at MSU, and I'd like to be open by then. Can we do it?! The next 30 days will tell the tale.\r\n\r\nBy the way, have any of you seen Morgan Spurlock's new show on FX called \"<a href=\"http://www.fxnetworks.com/shows/originals/30days/main.html\" target=\"_blank\" class=\"broken\">30 Days</a>?\" It's pretty good. My 30 day post writing marathon is nothing like his show... although <a href=\"http://tapioca.retroflux.com/?p=144\" target=\"_blank\" class=\"broken\">Nicole thinks we sorta look alike</a>. Whatever.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-11T23:19:17.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nicole",
      "body": "Make sure \"scanning Highway Distribution Application\" is one of the tasks for today. I'd do it, but your computer skills are flippin'.\r\n\r\nThanks!",
      "created_at": "2005-07-11T23:32:33.000Z"
    },
    {
      "author": "Justin",
      "body": "Cool, more posts to read.  I'm fine with that.",
      "created_at": "2005-07-11T23:40:49.000Z"
    },
    {
      "author": "Nate",
      "body": "For the next 30 days I am going to eat nothing but thumbtacks and hire three doctors to monitor my health.  \r\n\r\nAfterwards I will make a documentary villifying the thumbtack industry for what they are doing to all of us.\r\n\r\nMy vegan girlfriend will hate the thumbtacks - but come across as quite endearing.",
      "created_at": "2005-07-11T23:47:04.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "xoxI'll believe it when I see it!xox Oh, and it's still SMSU until August 28.",
      "created_at": "2005-07-12T01:23:23.000Z"
    },
    {
      "author": "Justin",
      "body": "Nate:  If there was a restaraunt passing off thumbtacks as food, it'd be a great idea!",
      "created_at": "2005-07-12T01:24:04.000Z"
    },
    {
      "author": "Carl",
      "body": "now if you really want to look like Spurlock, you will need to grow that mustach.",
      "created_at": "2005-07-12T01:43:42.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
