{
  "id": 251,
  "title": "Day 1: Off to a slow start",
  "body": "Today wasn't nearly as productive as Saturday or Sunday, but since those days don't fall within the \"30 day\" spectrum, I guess I can't use them comparatively. So, here's what went down today:\r\n\r\n<ol><li><b>Website work</b> - I'm still ramping up to the big POS programming phase, in which I will baracade myself in the computer room for hours and hours on end. <i>What's new?</i>, Nicole says.</li>\r\n<li><b>Thank you card to Budweiser rep</b> - Our Budweiser rep gave me some killer tickets to last Thursday's Springfield Cardinals game, so, in return, I gave him two Moxie stickers and a thank you note. I'm sure a few free tickets will land on his desk in the near future as well. I've learned that vendor relations are a very good thing, especially when they're the world's largest brewery.</li>\r\n<li><b>Mail this!</b> - For the last 3 months or so, mail that has been sent to the theater has only enjoyed a 10% rate of successful delivery. Our mailbox is located INSIDE the building, which makes it difficult for the mailman to deliver our mail when no one's around. I've tried to have our mail redirected on numerous occasions (I even spoke with the 65806 carrier supervisor!), but to no avail. Having mail returned as undeliverable is a very bad thing, especially when it's a loan repayment bill from the bank! Anyways, I wrote to Andrew today and asked permission to buy a new mailbox and put it on the OUTSIDE of the building. Permission granted. Feel free to resume sending your fan mail.</li>\r\n<li><b>Install that projector, Lanny</b> - Our projector installer, Lanny, was supposed to let me know a week ago when he will be coming down to install our stuff. I told him that the last week of July or the first week of August would be good for us. When I called today to check on his status, I was told that he will be down either <i>the last week in July or the first week in August</i>. *shocked look on face* Didn't I just say that? I was looking for something a little more specific... like an actual date. When I said \"the last week of July or the first week of August,\" I was giving him a window in which to choose a specific date. No luck. I'll find out soon enough, I suppose. Apparently he's tooling around down in Florida with his family. He's on something known as a \"V-A-C-A-T-I-O-N\"... I have no idea.</li>\r\n<li><b>Little things</b> - A bought a few small items for the theater at Lowe's and Wal-Mart. I'm waiting until tomorrow to buy the BIG stuff, like a couple...</li>\r\n<li><b>Refrigerators</b> - I went to Sear's to make sure they still had the 17 cubic foot all-fridge that I bought about a month ago. I think we're going to need one more PLUS a smaller fridge to keep the popular items handy to whoever is working concession. I decided to hold off on buying them until Nicole was with me, which will be tomorrow.</li>\r\n<li><b>Plumber Needed</b> - It's time to start propositioning plumbers for the horrid drain upgrade in the prep area. I went through the Penny Power and circled all the ads that said \"Licensed and Insured.\" I'm glad I didn't decide to circle all the ads that said \"No job too small!\" or else I would've ran out of ink. Seriously. I bet I saw 30+ ads use that adage. I'd like to run an ad that says \"Most jobs too small. Ask your lazy husband to get off his ass!\"</li>\r\n<li><b>More mudding</b> - I met Dad at the theater around 4:00 and immediately started working on the crappy mudding job I did on the speakerboxx. After a long bout of sanding, I slapped on a second coat that looked slightly better than the first. Meanwhile, Dad finished drilling the sheetrock to the West wall and applied the first coat of mud. <a href=\"http://www.sgfsoccer.com\" target=\"_blank\">Ole</a> dropped by for a bit to see the latest progress. Apparently I was adamant that he do so when I left his party a few weekends ago... you remember, the one where I almost died from pistachios. Ah, the memories.</li>\r\n<li><b>Inaugural artists</b> - A bit later, our inaugural local artists (Olof and <a href=\"http://www.goodgirlartgallery.com/artist-detail.asp?UserID=55\" target=\"_blank\">Jennifer Manning Pierson</a>) stopped by to check out the gallery space. It was the first time we'd met, so I, of course, had mud all over my hands and arms... and a dust mask on my head. Quite the GQ man, I must say. Quite. I'm very pleased to have Olof and Jennifer on board. I'm a big fan of their work and I know it will go over well at the theater.</li></ol>\r\nAfter we met with the Piersons, the sanding crew showed up and forced us away with large billowing clouds of joint compound dust. A pox on them and their infernal chicaneries! All in all, a pretty low key day, but I'm hoping tomorrow will be better. We're going to spend oodles of money, and that's always a good time. And by \"good time\" I mean \"stress-inducing, guilt-ridden, anxiety-producing ride through HELL!\"\r\n\r\n<b>Today's total financial output:</b> $13.00 for a new hammer drill bit, a c-clamp, and a bucket of mixed screw bits. I paid for everything out of my pocket, so as not to further endanger our budget. See you tomorrow!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-12T08:10:26.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "comment for previous post: \r\nsince classes start august 22nd.. \r\nyou should open on the 23rd.. \r\nwhich just happens to be the day that I had guessed! yay!\r\n\r\nhah!..this jennifer manning pierson drew <a href=\"http://www.goodgirlartgallery.com/project-detail.asp?ArtworkID=468&UserID=55\">the shoe!</a>  i dont know how many times ive drawn that.... actually i could go find my drawings.. and count them.. but im not going too.... sorry\r\n\r\n30 bucks?... hmm.. ill sell you all of my shoe drawings for 20... good deal.. eh?\r\n",
      "created_at": "2005-07-12T08:55:06.000Z"
    },
    {
      "author": "brian of moore",
      "body": "ohhh.. shes one of the teachers.. i get it... \r\nnot mine... \r\nalthough my teacher was in a band called 'the flaming balls'  \r\n",
      "created_at": "2005-07-12T08:59:28.000Z"
    },
    {
      "author": "justin",
      "body": "So when does the new mail box get put up?  If you  haven't bought one yet, I think you should get <a href=\"http://www.idigtoys.com/toys_toys-by-brand_mailbox-ranch_dog-mailboxes_mr-cavalier.html\" target=\"_new\">this one</a>",
      "created_at": "2005-07-12T17:25:17.000Z"
    },
    {
      "author": "erin",
      "body": "yay! im so pleased you picked them. jennifer was my drawing teacher. and after taking her class i decided... \"woah! i want to be a drawing major!\" she was an insanely awsome teacher. it will be GREAT to see some of her other work.\r\nyay!",
      "created_at": "2005-07-12T21:07:44.000Z"
    },
    {
      "author": "matt",
      "body": "Does POS in your post mean \"Point of Sale\" or \"Piece of Shit\"?  Cause it's kind of funnier with the latter.  :)",
      "created_at": "2005-07-13T07:03:51.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
