{
  "id": 252,
  "title": "Day 2: Big spender",
  "body": "Today was a day of money spending. Like the old adage goes, \"you have to spend money to make money\"... right? I hope so, because we spent a buttload today.\r\n\r\nWe bought, in order:\r\n\r\n<ol><li>Another 17 cubic foot all-fridge from Sear's ($475)</li>\r\n<li>A smaller 10 cubic foot fridge from Lowe's ($275)</li>\r\n<li>A security mailbox for the theater ($30)</li>\r\n<li>14 1/4 yards of black denim for the auditorium ($78)</li>\r\n<li>Two posters for our poster collage ($15)... 16 more to go!</li></ol>\r\nAs you can see by the post time, it's very late, so I'm going to make this a short one. At the theater, all the sheetrock has been mudded and sanded (in the auditorium). I applied the third and final coat of mud to the speakerboxx, as well as a second coat to the west wall. Dad and I also installed the first piece of trim board that separates the faux wainscoting from the rest of the wall. I had every intention of including pictures, but we're housesitting for Nicole's dad, so I don't have a way to transfer pictures. I'll do that sometime tomorrow. Nicole and I have a long day of cleaning ahead of us. The sheetrock crew left a gigantic mess!\r\n\r\nAgain, I apologize for the short post, but them's the brakes. Until tomorrow!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-13T10:10:17.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "What's this about the poster collage?",
      "created_at": "2005-07-13T17:03:33.000Z"
    },
    {
      "author": "Caleb",
      "body": "Yes, what is this about a poster collage? I can donate a Sideways poster if it's movie posters you're talking about. ",
      "created_at": "2005-07-13T17:30:02.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "I hate being this way, but I'm overcome by an uncontrollable urge to point out that it's \"Sears\" with no apostrophe!\r\n\r\nPhew.\r\n\r\nI'm loving the daily updates, Dan.",
      "created_at": "2005-07-13T17:53:52.000Z"
    },
    {
      "author": "nicole",
      "body": "We're making a collage out of detail shots of movie posters - 12\" x 12\" squares. Any donations would be appreciated! Or hints on where we can find them for under $8.",
      "created_at": "2005-07-13T18:30:24.000Z"
    },
    {
      "author": "Caleb",
      "body": "Well I got a Sideways one for you if you want it then. I'll drop it by sometime. I have others but I don't think I can depart from them. I work at Movie Gallery so I get free movie posters. I can get you one from The Chorus if you want, but most of the others are silly Hollywood flicks not worthy of the Moxie.",
      "created_at": "2005-07-13T21:02:16.000Z"
    },
    {
      "author": "JED",
      "body": "I may know a way of getting some posters to you guys. Should I just send them to the theater? Oh, one thing, they would be all FOX film posters. Is that cool? ",
      "created_at": "2005-07-13T21:05:45.000Z"
    },
    {
      "author": "J.R.",
      "body": "Come to showcase, we give away all of our posters, you could steal them off the walls!",
      "created_at": "2005-07-14T01:31:45.000Z"
    },
    {
      "author": "JED",
      "body": "OK, I talked to my friend at FOX and he says he can hook up actual showcase posters, but mainly newer films. Some older ones too, but mainly newer ones. You can even get some from movies that aren't even out yet. OOOOOHHH AAAAAAAHHHHHH. FOX Searchlight is available as well, so if you have any ideas on any films they may have, e-mail me. I let them know it would be about 25 different posters and he said it was cool. OH and also available, foreign films. Yippppeeeeeeee.",
      "created_at": "2005-07-14T03:28:27.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
