{
  "id": 253,
  "title": "Day 3: Clean as a whistle",
  "body": "I can summarize today's events with one word: cleaning-and-building-with-lunch-at-Taco-Bell.<br/><br/>From 10:00 am until 5:30 pm, Nicole and I did nothing but clean, then my dad showed up and the cleaning turned into building, which lasted until 8:00 pm. It was a very long and productive day. Here's a quick rundown of what was done:<br/><br/><ul><li>I sanded the speakerboxx for the third and final time.</li><br/><li>Nicole cleaned one of the bathrooms.</li><br/><li>I mudded the west wall for the third and final time.</li><br/><li>Nicole swept the entire theater, removing massive amounts of sheetrock dust.</li><br/><li>I dumped all kinds of trash into the dumpster across the street.</li><br/><li>I fixed the popper (it was scraping on one side of the kettle, so I used pieces of scrap aluminum to increase the space between the heating element and the kernal mover).</li><br/><li>I moved all the lumber into the main auditorium.</li><br/><li>I reswept what Nicole swept.</li><br/><li>Nicole reswept what I reswept.</li><br/><li>Dad and I put up the final board along the west wall.</li><br/><li>Dad and I built the floor for the little stage at the front of the auditorium.</li></ul><br/>It may not seem like much when you read it, but you don't understand how much cleaning we did. I mean, there was just soooooooo much sheetrock dust... I broke down and cried at one point. It was a very sad, and sharp, point. Got me right in the eye.<br/><br/>For lunch, I had one of those new Taco Bell wraps... you know, the ones that are \"good to go.\" It was alright. I think the best thing about it is that they use a tostada shell, which means it's only a matter of time until my all-time favorite Taco Bell dish makes its way back onto the menu... TOSTADAS!!! But enough about me, here's some pictures from the last two days:<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071305/fridge1_a.jpg\" width=\"425\" /><br/><br/>This is the gigantic 17 cubic foot all-fridge that we bought at Sears yesterday. This is the second one we've purchased. One will stay in the prep area, while the other will reside closer to the Cinebar. Both will be stocked with enough beer to kill me thrice.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071305/fridge1_b.jpg\" width=\"425\" /><br/><br/>There are two features I insisted our refrigerator have before I would consider buying it: 1) wire shelves (more customizable) and 2) simple design (no fancy half-shelves, or can slides, or egg holders). The interior of this refrigerator is the epitome of simplistic elegance. I love this appliance. It is absolutely stunning, isn't it?! Who needs a freezer anyway! Like you were ever going to eat those frozen waffles...<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071305/fridge2_a.jpg\" width=\"425\" /><br/><br/>This is our little fridge, the one that will be IN the Cinebar. For convenience, the most popular drinks will be stored in this little beauty. We'll restock it from one of the big fridges between rushes. The stainless steel model to the left, which was identical in every way to our fridge, was $115 more. Stupid steel. Stupid stains. My god, I want that refrigerator SO BAD!!!<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071305/fridge2_b.jpg\" width=\"425\" /><br/><br/>Here's the inside. Not quite as elegant as the all-fridge, but it'll do. Nothing says classy like pulling a customer's beer out of the crisper!<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071305/fridge2_c.jpg\" width=\"425\" /><br/><br/>Here's Nicole demonstrating how short the refrigerator is. For those of you who don't know, Nicole is a dwarf. That's a mini-fridge she's standing next to.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071305/wall.jpg\" width=\"425\" /><br/><br/>West wall + faux wainscoting + wood = a much tidier wall. Check out the duct tape letter \"R\" on the back of the window covering. Have you ever seen such a beautiful \"R?\" I think not. That's a duct tape coconut tree to the left of the \"R.\"<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071305/cleaning1.jpg\" width=\"425\" /><br/><br/>Here's Nicole sweeping up shitrock dust.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071305/cleaning2.jpg\" width=\"425\" /><br/><br/>Aw! How sweet! Nicole drew this with the end of her broom handle... while she should've been sweeping... so I taught her a lesson she won't soon forget... how to throw a curve ball. Look at all that DUST!<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071305/stage1.jpg\" width=\"425\" /><br/><br/>Check out how clean the auditorium is now! The material you see here will soon become the stage. And look! It's my Mom!<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071305/stage2.jpg\" width=\"425\" /><br/><br/>Here's Dad drilling the baseboard into the terrazzo. We decided to go with treated lumber so the wood wouldn't rot when someone inevitably spills their drink and it oozes down the auditorium floor and pools up at the base of the stage. Nice thinking.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071305/stage3.jpg\" width=\"425\" /><br/><br/>And this is pretty much where we left off this evening, with the stage floor built and secured to the wall.<br/><br/>More fun stuff tomorrow! *pause* Man, I'm mondo mega tired. I'm going to go read some \"Freakanomics\" and hit the hay. Adios!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-14T08:56:59.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Al",
      "body": "1. Remember, folks like their beer ice cold. Keep that fridge at 10, even if it costs you a tad more in 'tricity.  <br/><br/>2. Nicole + skirt = nice calves.<br/><br/>3. Stainless steel is cool, and I'm not sure why.    ",
      "created_at": "2005-07-14T09:52:30.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i dont like beer<br/>but i like my white russians ICE cold!<br/>:-)<br/><br/>wow! i feel like im in the phlog area<br/><br/>that stainless steel fridge is rather beautiful.. but it doesnt have that spooky alien handprint.. like the white one does<br/><br/>anywho.. very nice.. looking great... im getting excited.. and antsy ... or fleasy... which is my new cats fault... dang cat",
      "created_at": "2005-07-14T11:45:16.000Z"
    },
    {
      "author": "justin",
      "body": "Wow, I didn't know there'd be a raised stage!",
      "created_at": "2005-07-14T17:21:15.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "Shitrock? A subtle dig at the wallboard industry perhaps?",
      "created_at": "2005-07-14T18:16:46.000Z"
    },
    {
      "author": "Caleb",
      "body": "Lemme guess, the raised stage is for you do do a little jig before each show, right?",
      "created_at": "2005-07-14T19:22:10.000Z"
    },
    {
      "author": "Maddy",
      "body": "Will you be serving pistachios in the Cinebar?  Ice cold pistachios?",
      "created_at": "2005-07-14T19:25:06.000Z"
    },
    {
      "author": "bjork24",
      "body": "Nicole's calves - good<br/>Shitrock - subtle dig<br/>Little jig - yes<br/>Ice cole pistachios - no",
      "created_at": "2005-07-14T19:44:42.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "I didn't take logic class, but I think I can infer that:<br/>if Nicole + skirt = nice calves, and prize bull + herd of heifers = nice calves, then Nicole + skirt = Beef farm?<br/><br/>Right?",
      "created_at": "2005-07-14T20:09:11.000Z"
    },
    {
      "author": "bjork24",
      "body": "Way to go Aaron. You just made Nicole cry!",
      "created_at": "2005-07-14T21:20:38.000Z"
    },
    {
      "author": "J.R.",
      "body": "I think Spinal Tap wrote a song similar to that.  YEAH PROGRESS!!!",
      "created_at": "2005-07-14T23:32:49.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "Beauty, Aaron. It's not like she doesn't have enough self-esteem when she towers over the dorm fridges.<br/><br/>On a completely different tack (ouch!), what's your father's take on this whole theater idea? We get regular reports from you and Nicole, but your dad is like Chief from \"One Flew Over The Cuckoo's Nest.\" Minus the water fountain tossing, of course. <br/><br/>Is he just a silent drone with a vast knowledge of carpentry? Is he a product of Disney animatronics? Is he, in fact, Benzo?",
      "created_at": "2005-07-15T01:08:49.000Z"
    },
    {
      "author": "Maddy",
      "body": "I thought he was your bookie, keeping an eye on you and your expenditures.",
      "created_at": "2005-07-15T07:58:55.000Z"
    },
    {
      "author": "Marcus",
      "body": "I know how you feel about the Stainless steel fridge. Ours recently went out & I was faced with the same dilemna--choosing between the same white one you purchased and its next door neighbor. Eventually I bit the bullet and go the stainless one (after pacing the store for like an hour). Love it!<br/><br/>Great blog btw. ",
      "created_at": "2005-07-18T02:27:49.000Z"
    },
    {
      "author": "PC",
      "body": "Nice blog! Looking forward to your opening day.",
      "created_at": "2005-07-23T20:22:04.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
