{
  "id": 254,
  "title": "Day 4: Moxie Incorporated",
  "body": "Today was another good day. We didn't get much done at the theater, but we made lots of progress on other fronts. Here's what went down:\r\n\r\n<ol><li>We returned the mailbox that we purchased on Tuesday. As it turns out, we already have a mailbox along side the tenants who live above us. It didn't have a \"408 W. Walnut\" marked on it, so the mailman never knew to put our mail there. Either way, Chris (our GC) is going to switch the locks and give us the key. Woo hoo! $28 saved!</li>\r\n<li>Paul, our mentor-slash-booking-agent called us today to talk about all the progess we've made. He's incredibly excited and proud of all we've acomplished thus far. It always feels good when someone you look up to is proud of your work. Thanks Paul!</li>\r\n<li>I did a price check at Lowe's on all the pipe we'd need to create a hanging wire system for the artwork in the gallery hallway. It'll be expensive, but well worth it.</li>\r\n<li>Our poster collage project is still coming along. Nicole bought two posters yesterday (<i>Fight Club</i> and <i>Napoleon Dynamite</i>), and I posted <a href=\"http://ask.metafilter.com/mefi/21204\" target=\"_blank\">a question on Ask MetaFilter</a> on how to best mount the details on MDF board. Movie posters are damn expensive, I tell you what!</li>\r\n<li>Nicole met with our interior decorator today to discuss our paint colors and carpet choices. Everything looks good so far, which is a very good thing since we don't particularly like it when things look bad. Duh!</li>\r\n<li>When we went home today, I had a message on our Skype voicemail from the editor of <a href=\"http://www.inc.com\" target=\"_blank\">Inc.com</a>, the online home of one of our favorite magazines. She'd been reading the blog and wanted me to write a column for the online version called \"Diary of a Start-Up.\" Seeing as I'm so busy, I asked if Nicole could contribute too... not only because I'm short on time, but also so everyone could see the couple-makes-good aspect of the business. The editor loved the idea, so we'll be working on our first post this weekend. The deadline is Wednesday, but I'll be sure to post whatever we send to the magazine here.</li>\r\n<li>We went to a mixer for the <a href=\"http://www.missourifilm.com\" target=\"_blank\">MFAS</a> (Missouri Film Alliance of Springfield), of which we're honorary members, at 5:00 this evening. We networked with lots of great people, including the head of MSU's film department, who we'll be meeting with next week to discuss future collaborations between The Moxie and MSU. Exciting!</li></ol>\r\nOther than that, it was a pretty tame day. Dad had to go to a birthady party for an old friend, so we didn't get to go to the theater this evening. Nicole and I will be heading down to The Moxie tomorrow to prepare the walls for priming, which we'll hopefully be starting this weekend. It's been a productive four days and I hope we can keep up the pace! My meeting with Andrew (discussing how much the renovation and HVAC costs were) is coming up soon. I hope it's not too far off from the estimates. As always, I'll keep you updated as progress warrants.\r\n\r\nSee you tommorrow!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-15T08:32:11.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Stephanie",
      "body": "That's fantastic!  Things are really coming along...\r\n\r\nAnd yes, movie posters *are* expensive.  ",
      "created_at": "2005-07-15T08:57:05.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i really like the picture showing where you guys got the idea from.. looks very cool\r\nand if you found some really hi rez pictures (which is surely possible) im sure some graphic design kid could help you out\r\nhell i could do it\r\nthe only problem is finding a really nice printer... my ex roommate had an extremely nice/huge/enormous/fancy/super rad printer... but thats no longer around... does aaron have one? \r\ndoes that cause copywrite issues?\r\ni wont tell.. i promise",
      "created_at": "2005-07-15T10:05:18.000Z"
    },
    {
      "author": "brian of moore",
      "body": "oh.. and make sure you get the amelie movie poster :-)  cause shes cute",
      "created_at": "2005-07-15T10:09:17.000Z"
    },
    {
      "author": "Joshua",
      "body": "I just noticed that you're going to screen Tarnation in January. For that, I love you.\r\n\r\n<3",
      "created_at": "2005-07-15T10:13:50.000Z"
    },
    {
      "author": "nicole",
      "body": "Tarnation's already out on Netflix, I noticed.",
      "created_at": "2005-07-15T17:14:26.000Z"
    },
    {
      "author": "justin",
      "body": "Congrats on the Inc.com deal, that's quite awesome!",
      "created_at": "2005-07-15T17:17:13.000Z"
    },
    {
      "author": "erin",
      "body": "wait one moment... how does joshua know that you will be screening tarnation in january?",
      "created_at": "2005-07-15T17:39:26.000Z"
    },
    {
      "author": "Caleb",
      "body": "Meeting with Karen Buzzard, eh? I'm a member of the MSU Film Society and I'm really hoping The Moxie will help move us out of \"dormant\" status. Erin & I were the only ones to show up at the last two meetings in fall '04. \r\n\r\nI will try to bring the Sideways poster by soon.",
      "created_at": "2005-07-15T18:12:21.000Z"
    },
    {
      "author": "bjork24",
      "body": "Brian: In the end, I think printing a high res image would be just as costly as buying a poster (~$12). And of course we'll have Amelie!\r\n\r\nErin: I think Joshua is talking about our listing on the Tarnation website, where it said we'd be showing the film LAST January.\r\n\r\nCaleb: We're actually meeting with Mark Biggs, who isn't the head of the Film Department at MSU, but he's something big... although his bio just says assistant professor.",
      "created_at": "2005-07-15T18:30:52.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Birthady paryts are teh best!\r\n\r\nSorry, I couldn't help myself. Congrats on the Inc.com column and your progress. Rock on Dan & Nicole!",
      "created_at": "2005-07-15T19:11:47.000Z"
    },
    {
      "author": "Caleb",
      "body": "Wooh! Mark Biggs! He is the head of the Electronic Arts department, which is what I'm majoring in. Hope it goes well!",
      "created_at": "2005-07-15T19:41:09.000Z"
    },
    {
      "author": "Ole",
      "body": "<a href=\"http://www.pier1.com/store/productdetail.asp?catalog%5Fname=Pier1&strStoreNavDept=DEPT+13+Home+Accents&strStoreNavClass=CLASS+66008+Frames+and+Photo+Holders&category_name=GROUP+2354+Walnut+Floating+Frames&intPageNumber=6&intSetNumber=2\">wooden frame</a>",
      "created_at": "2005-07-27T07:17:19.000Z"
    },
    {
      "author": "4YJEldNjBS",
      "body": "zKliMCFL4ad pVPPHb4s9Y5 P633hI6V8uuE",
      "created_at": "2006-02-02T14:44:47.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
