{
  "id": 255,
  "title": "Day 5: Inset witty title for daily activity",
  "body": "Man, today was long and tiring. Nicole and I went to the theater this morning and spent most of the day knocking sheetrock dust off the walls so we could start painting tomorrow. I also cleaned up all the bricks that the HVAC guys left lying around outside the building. You know - the ones that fell out when they cut those huge holes in the side of the building for the heat exchange system. Yeah. Those holes. <br/><br/>Around 2:00 pm I took a break from theater work and drove over to my ex-employer's office to perform some techie work (setting up a VNC server, configuring a printer, etc.). It was barely more enjoyable than throwing bricks into the dumpster, but it sure pays better!<br/><br/>I spoke with a woman from the Springfield Audubon Society today who wanted to know if we were going to be showing \"<a href=\"http://www.imdb.com/title/tt0428803/\" target=\"_blank\">March of the Penguins</a>.\" My answer was \"yes,\" her response was \"yay!\" Dad showed up around 6:00, and we worked on the stage for roughly two hours. I'm hoping it will be completed tomorrow. I would post some pictures, but I left my camera at home today. I've been very absent-minded as of late.<br/><br/>We just got back from a midnight Harry Potter party at <a href=\"http://www.wellfedhead.com\" target=\"_blank\" class=\"broken\">Well Fed Head</a>, our neighbors across Walnut Street. Nicole pre-ordered her book about a month ago. If I were less tired, I'd probably try to say something funny... but I'm pooped. We're going to have to learn to stay up later. I'm hoping it won't be this difficult once the theater opens since I doubt we'll be doing tedious, back-breaking, manual labor for 10 hours each day. Shoveling popcorn, tearing tickets, and splicing film is hardly what I'd consider a workout.<br/><br/>Well, the bed calls me... Hey look! <a href=\"http://2005.sxsw.com/film/news_reel/\" target=\"_blank\" class=\"broken\">Two</a> <a href=\"http://www.lifehack.org/articles/lifehack/blog-on-real-entrepreneurship.html\" target=\"_blank\">links</a> to the Moxie Blog! Woo hoo!<br/><br/>Tonight I sleep. Tomorrow we paint. The day after tomorrow I regret writing such a boring post.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-16T09:50:28.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "today i was listening to npr.. as i tend to do.. and heard something or other about about a bill being passed today.. that would make it easier for up and coming businesses to get money in downtown springfield... hmm? sorry i didnt catch it all.. i was busy delivering pizzas... woops<br/>searching through the newsleader online.. as well as <a href=\"http://www.gov.mo.gov/la2005list.htm\">here</a> .. i still came up with nothing.. but maybe tomorrow after they are updated a bit.. eh its probably nothing... dont mind me<br/><br/>have you sat on the couch or chair in well fed head? they are very springy.. and i want them",
      "created_at": "2005-07-16T10:43:58.000Z"
    },
    {
      "author": "erin",
      "body": "yay! march of the penguins! i really hope you remember your camera the day you paint...",
      "created_at": "2005-07-16T23:05:17.000Z"
    },
    {
      "author": "brian of moore",
      "body": "whats with the lack of people commenting lately?  why must summer be so boring... ",
      "created_at": "2005-07-17T05:27:07.000Z"
    },
    {
      "author": "bjork24",
      "body": "It's the weekend.",
      "created_at": "2005-07-17T05:32:09.000Z"
    },
    {
      "author": "Caleb",
      "body": "I, too, am very excited about the penguins marching their way into the Moxie. I hope the constant gardener with the unfinished life will plant a few broken flowers to save this green planet from the grizzly man by the last days of the year 2046. <br/><br/>[how many movie titles can you count in that sentence?]",
      "created_at": "2005-07-17T08:19:40.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
