{
  "id": 256,
  "title": "Day 6: Primed and ready",
  "body": "That title would be even more pefect had we actually finished priming today. But, alas, we did not. Why? Because there's a LOT of wall to cover. We bought a 5 gallon bucket of primer this morning, which was barely enough to cover the projection booth and the outside of the auditorium. It looks like we may need another 5 gallons to finish the inside of the auditorium and the Cinebar. Either way, that's what we did today. Primed, primed, primed! My friend <a href=\"http://marnival.retroflux.com\" target=\"_blank\" class=\"broken\">Doug</a> even stopped by to prime a few walls (thanks Doug!).<br/><br/>While Nicole and I were priming the walls, Dad finished the stage and my mom started priming the Cinebar shelves. Also, I received an e-mail from Andrew discussing several key issues - most importantly: what they're willing to pay for, what we still need to pay for, and when our first rent payment will be due. Sadly, with all the monetary slicing and dicing I've done, it still looks like we're over budget - such is the life of The Moxie, I suppose - but I still know of a few revenue opportunities that we've yet to engage. More on that later.<br/><br/>For the time being, we need to continue moving ahead as if we were $20,000 over budget. Slowing the progress is not an option at this point, because <a href=\"http://www.morawk.com/board/viewtopic.php?t=2017\" target=\"_blank\" class=\"broken\">people are starting to get frustrated</a> with our \"delayed opening.\"<br/><br/>I really need to apply for some more credit cards.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071705/upload1.jpg\" width=\"425\" /><br/><br/>Here's a shot inside the projection booth after I primed it.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071705/upload5.jpg\" width=\"425\" /><br/><br/>Here's the ceiling of the projection booth, newly primed.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071705/upload2.jpg\" width=\"425\" /><br/><br/>The art hallway - half primed, half unprimed, all Optimus Primed!<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071705/upload3.jpg\" width=\"425\" /><br/><br/>Speakerboxx wall. Primed. There's nothing funny about that.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071705/upload4.jpg\" width=\"425\" /><br/><br/>Here's Nicole testing out the stage. She's doing the \"*click* *click* *click* Is this thing on?\" bit. The improvised microphone is the roller I was using to prime the walls.<br/><br/>Tomorrow will be more primimg, and maybe some painting too... if there's time. My uncle Larry is going to drop by in the morning and lend me his power sprayer so I can start working on the ceilings in the lobby. We still need to prime the inside of the auditorium and the Cinebar... I already said that earlier, didn't I? Sorry. We have two 10% off coupons from Sherwin Williams that expire tomorrow, which means we either use 'em or lose 'em... maybe even booze 'em... or bruise 'em. In all liklihood, I'll probably just end up flushing one down the toilet on accident... again. We'll see.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-17T09:40:59.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "that stage is sexy<br/>so is optimus prime",
      "created_at": "2005-07-17T10:36:37.000Z"
    },
    {
      "author": "Rachel",
      "body": "heh heh you spelled priming \"primimg\" in the last paragraph. you must be so embarassed.",
      "created_at": "2005-07-17T18:31:50.000Z"
    },
    {
      "author": "Rachel",
      "body": "AND \"liklihood\" instead of likelihood. you're inhaling fumes aren't you daniel? nicole would be ashamed of your errors.",
      "created_at": "2005-07-17T18:33:05.000Z"
    },
    {
      "author": "michelle",
      "body": "i love seeing the progress. priming sucks. ",
      "created_at": "2005-07-17T20:37:23.000Z"
    },
    {
      "author": "erin",
      "body": "you guys are amazing!",
      "created_at": "2005-07-17T22:47:34.000Z"
    },
    {
      "author": "James Sheldon",
      "body": "Dan the Man and Sweet Nicole:<br/><br/>Where could I send a little donation to you guys?<br/><br/>James Sheldon",
      "created_at": "2005-07-18T02:17:34.000Z"
    },
    {
      "author": "Caleb",
      "body": "I, too, am very excited about the penguins marching their way into the Moxie. I hope the constant gardener with the unfinished life will plant a few broken flowers to save this green planet from the grizzly man by the last days of the year 2046.<br/><br/>[I put it on this post so more people could see my \"cleverness\"]",
      "created_at": "2005-07-18T02:27:26.000Z"
    },
    {
      "author": "Allison",
      "body": "the place is really starting to shape up!   Have you already told us what colors (on the walls) you're going to use where?",
      "created_at": "2005-07-18T03:53:38.000Z"
    },
    {
      "author": "Sandra",
      "body": "Looks great! What's the poster collage? I can send you a one-sheet or two.",
      "created_at": "2005-07-18T07:02:00.000Z"
    },
    {
      "author": "Nate",
      "body": "Mmmmm, Optimus Prime.<br/><br/>Few may remember, but he held the key to the Matrix long before Neo.",
      "created_at": "2005-07-18T18:59:53.000Z"
    },
    {
      "author": "Darin Codon",
      "body": "Nice",
      "created_at": "2005-07-26T02:06:28.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
