{
  "id": 257,
  "title": "Day 7: One week in",
  "body": "The \"30 Days\" campaign is officially one week old and I'm quite proud of all we've accomplished. We've primed 90% of the sheetrock, bought a large majority of our paint, finished the stage, and discovered that we're completely out of money.<br/><br/>Do any of you have experience with car title loans? What's the interest rate on those things? Although, the more I think about it, the more appealing applying for a bunch of credit cards sounds. It lends a sort of \"indie cred\" to the project. Didn't Kevin Smith bankroll <i>Clerks</i> with only credit cards? Still, for every filmmaker who chooses that path, I bet there are a quite a few who end up filing for bankruptcy with little more than a lot of debt and a crappy unfinished movie.<br/><br/>Damn money.<br/><br/>Anywho, here's some pictures to show today's progress:<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071805/upload1.jpg\" width=\"425\" /><br/><br/>Here I am... doing something. The real purpose of this picture is to show the primed wall behind me. We only have a few more sections to hit before we can start painting.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071805/upload2.jpg\" width=\"425\" /><br/><br/>Here's my uncle and I maneuvering the scaffolding this morning. We painted the front half of the ceiling black with my uncle's power sprayer. I should be finishing the rest later this week.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071805/upload3.jpg\" width=\"425\" /><br/><br/>This is a good shot of what we finished this morning. The paint looks shiny in this picture, but it's actually flat black, so it looked much better after it dried. Power sprayers are the greatest invention of all time... right behind the original NES system.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071805/upload4.jpg\" width=\"425\" /><br/><br/>Here I am touching up the ducts inside the auditorium. The sheetrock crew threw mud and dust all over the place... psh. Professionals indeed!<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071805/upload5.jpg\" width=\"425\" /><br/><br/>This is the paint we bought from Sherwin Williams. I have a feeling we'll be going back to buy more before the \"buy one, get one half off\" sale ends. Paint is expensive.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071805/upload6.jpg\" width=\"425\" /><br/><br/>The next three pictures are poorly lit, but you can at least get an idea of what colors we're using. This is the color that will encase the outer shell of the auditorium (along the hallway). When we first opened the can, the paint looked like a weird shade of pink and purple, which made Nicole break down since she'd worked so hard to coordinate the colors. Of course, after we painted a test square on the wall and allowed it to dry, it ended up being the right color... a deep wine red. Hooray for paint that goes on one color and dries another!<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071805/upload7.jpg\" width=\"425\" /><br/><br/>This is the color inside the auditorium. It's a purplish gray... kind of hard to explain. I guess you'll just have to see it.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/071805/upload8.jpg\" width=\"425\" /><br/><br/>This is the projection booth paint. I chose it myself. It doesn't match the other colors, but that's fine since the general public won't be seeing it. I wanted something light and relaxing. It's a mix between robin's egg and sky blue. Very nice.<br/><br/>We're going to be fishing for funds tomorrow, so wish us luck! Yesterday's post was a little misleading (and poorly edited) due to my extreme tiredness. We are NOT under budget. We are, in fact, over budget. BOO! But fear not, dear readers, for we shall prevail... we always do... I hope. Isn't it funny how every obstacle that comes along is worse, and more stressful, than the last. I can easily say that this is the most stressed I've ever been in my whole entire life. It will take a traumatic event beyond imagination to top the stress I've felt over the last six months of my life.<br/><br/>Geesh. My head hurts just thinking about it.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-18T10:48:35.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Joe Netzer",
      "body": "Hang in there dan your labor of love is almost done. I personaly can't wait to see the finshed project. Your really setting a great example for others who want to follow thier dreams. Take care.<br/>Joe",
      "created_at": "2005-07-18T11:31:05.000Z"
    },
    {
      "author": "brian of moore",
      "body": "indeed to above comment<br/>and indeed.. damn money<br/>i too recall kevin smith talking about the credit card thing.. and id say if you can.. do it... after this beauty is open.. youll have to build one of those huge towers to hold all your gold.. just like scrooge mcduck... so i dont figure it will be too bad paying back what you put on credit<br/>no seriously.. i promise<br/><br/>very nice colors... yay nicole<br/>deep wine red always looks good<br/>and will go great with those huge stockpiles of dr pepper",
      "created_at": "2005-07-18T12:11:13.000Z"
    },
    {
      "author": "mike",
      "body": "Dan, have you given any more thought to the possibility of a \"MoFo Log\"? It's genius... and great for eating up server bandwidth!",
      "created_at": "2005-07-18T15:03:58.000Z"
    },
    {
      "author": "Steve Kirks",
      "body": "Dan:<br/><br/>Please consider selling advance passes like \"season tickets\".  I'm ready to hand you money today for one.<br/><br/>Steve",
      "created_at": "2005-07-18T16:53:02.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Yeah, nothing says indie like predatory lending.",
      "created_at": "2005-07-18T17:29:17.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "Looks good. I can't wait to see it soon.",
      "created_at": "2005-07-18T17:39:10.000Z"
    },
    {
      "author": "bjork24",
      "body": "Mike: I don't have a video camera... just the video function on my digital camera. I still might do it though.<br/><br/>Steve: That's a good idea. We're considering something along those lines.",
      "created_at": "2005-07-18T18:30:08.000Z"
    },
    {
      "author": "Maddy",
      "body": "Dan:  Sorry that money has turned out to be such a bummer.  I can't do much, but I went and donated \"toilet paper\" for the moxie (it was all I can afford!).  Think of me when you wipe.<br/><br/>",
      "created_at": "2005-07-18T22:33:57.000Z"
    },
    {
      "author": "Jessica",
      "body": "To yesterday or the day before comment about people growing impatient about the Moxie opening...why don't they donate money to ensure the speediness of the Moxie opening...maybe you should post that...Quicker opening with more donations...",
      "created_at": "2005-07-18T22:36:24.000Z"
    },
    {
      "author": "Ole",
      "body": "Dan - my camcorder is around the corner and on call anytime your ready to do a MoFo.  I don't understand what I just wrote but it seems to work in the context of the earlier comments.  We can do QT streaming or it will shoot straight to MPEG on Sony Memory Sticks like your digital camera.  Consider it a practice run for the grand opening, check out lighting, et al.",
      "created_at": "2005-07-19T02:02:24.000Z"
    },
    {
      "author": "--",
      "body": "Is it really donating when you give money to a for-profit venture? ",
      "created_at": "2005-07-19T02:09:08.000Z"
    },
    {
      "author": "JED",
      "body": "Does anyone notice in the pics that everything else show up crystal clear, except Dan? Is the theater already haunted? Is Dan really a dead microcinema entrepeneaur coming back to finish what he started 30 yrs. ago. Is he a vampire or some other supernatural being? Or does his camera just plain suck? Either way, the place looks to be coming along great. Despite Dougs intervention. I hope he dies. Then I will punch his blurry pictured ghost ass in the face.",
      "created_at": "2005-07-19T02:58:32.000Z"
    },
    {
      "author": "Maddy",
      "body": "I don't really think Dan gives a rat's ass what it is called-- \"donating\" or otherwise.  I just thought I would pitch in.  Next time I feel like giving some cash to a worthy cause, I'll be sure do do a little more research...<br/><br/>Oh wait, no I won't..",
      "created_at": "2005-07-19T08:44:56.000Z"
    },
    {
      "author": "nicole",
      "body": "We've appreciated everyone's \"contributions\" to The Moxie. They've been extremely helpful and won't be forgotten.",
      "created_at": "2005-07-19T15:36:12.000Z"
    },
    {
      "author": "Ben P.",
      "body": "If you are looking for some help/info you may want to contact the Cameo Theater in Downtown Fayetteville, NC  They have been operating a similar business to yours for several years now.",
      "created_at": "2005-07-26T16:20:03.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
