{
  "id": 258,
  "title": "Day 8: Mental breakdown",
  "body": "Not really. I just wanted the title to be more dramatic than \"Day 8: Phone calls and more priming,\" which, in reality, is pretty much all we did today. We took a few hours out this afternoon to help my friend Justin and his girl Kelley unpack their moving van and settle into their new apartment (they just moved from Columbia). Working at the theater was rough tonight. My Dad was sick, which put him in a terrible mood. My mom was there too. You could cut the tension with a stick. I think we're all looking forward to not having to work on the theater anymore.\r\n\r\nHere's what's on the agenda for tomorrow:\r\n\r\n<ol><li>Nicole and I will be meeting with one of the heads of the MSU film department in the morning to discuss possible Moxie collaborations.</li>\r\n<li>We'll start painting during the day.</li>\r\n<li>We have a meeting with the director of the Springfield Arts Patronage to discuss how to get more money for the theater in the early afternoon.</li>\r\n<li>And then we're painting for the rest of eternity.</li></ol>\r\nLuckily, <a href=\"http://www.sweetwaterabilene.com\" target=\"_blank\" class=\"broken\">J.R.</a>, one of our Moxie employees-to-be, will be swinging by to lend a hand...  with a paint roller in it.\r\n\r\nIt's been a long, extremely stressful day, so I'm off to bed. Hopefully our luck will change tomorrow.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-19T07:07:36.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Andy",
      "body": "Gah... If I had any money I would give it you guys.\r\n\r\nYou ought to have Moxie Tupperware Parties.  That would bring in some serious green.",
      "created_at": "2005-07-19T09:44:34.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "Have a bake sale. Or sit Nicole outside with Bogey and make them look helpless with a jar and a sign around Bogey's neck saying \"Will fetch for money\"",
      "created_at": "2005-07-19T17:06:14.000Z"
    },
    {
      "author": "Caleb",
      "body": "March of the Penguins is going to be playing at Campbell 16 starting Friday. Just thought some of you might be interested. \r\n\r\nOf course when the Moxie opens we won't need the crappy ole Campbell 16 anymore!",
      "created_at": "2005-07-19T18:26:12.000Z"
    },
    {
      "author": "nicole",
      "body": "Gargh. I wish we were open! Then WE could show March of the Penguins.\r\n\r\nAnd thanks JR for helping! Woohoo! That means I could spend a few extra hours catching up on taking stuff to the recycling center, Goodwill, and help my Dad pack up his house.",
      "created_at": "2005-07-19T21:33:17.000Z"
    },
    {
      "author": "Nate",
      "body": "March of the Penguins sounds quite ominous.",
      "created_at": "2005-07-19T21:55:23.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "It's not March of the Linux Penguins, Nate. ",
      "created_at": "2005-07-20T00:25:31.000Z"
    },
    {
      "author": "Tim",
      "body": "Dang, lookin' good though...the hard work is paying off sir!",
      "created_at": "2005-07-20T02:05:17.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
