{
  "id": 259,
  "title": "Day 9: Come on! Feel the Moxie!",
  "body": "The inside of the auditorium has been painted! Not completely, but enough so that when most people see it they'll be duly impressed. Or at least they should be. Thanks be to <a href=\"http://www.sweetwaterabilene.com\" target=\"_blank\" class=\"broken\">J.R.</a> for helping us finish in a quick, yet evenly paced manner. <a href=\"http://justin.commonelectric.com\" target=\"_blank\" class=\"broken\">Justin</a> and Kelley (yes, that's really their names) will be helping us do even more painting tomorrow. Hooray! Here's some nice pictures of today's visible progress:\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/071905/upload1.jpg\" width=\"425\" />\r\n\r\nHere's J.R. applying the first coat of ultra-expensive, super-thick, terrible-tasting Kilz Premium primer to the nasty West wall.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/071905/upload2.jpg\" width=\"425\" />\r\n\r\nThis is what the screen wall looked like when I was 85% of the way done. Quite a descriptive caption, eh?\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/071905/upload3.jpg\" width=\"425\" />\r\n\r\nJ.R. and Nicole begin applying the purple / gray / taupe paint to the back wall of the auditorium.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/071905/upload4.jpg\" width=\"425\" />\r\n\r\nIs that the same ugly West wall? Why yes. Yes it is. Amazing!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/071905/upload5.jpg\" width=\"425\" />\r\n\r\nThe auditorium is nearly complete!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/071905/upload6.jpg\" width=\"425\" />\r\n\r\nThe purple / gray / taupe color goes quite well with the black... even more so when we don't have to look at it under crappy fluorescent lights.\r\n\r\n<a href=\"http://moxie.danchilton.com/pix/grum/071905/poster_big.jpg\" target=\"_blank\"><img src=\"http://moxie.danchilton.com/pix/grum/071905/poster_small.jpg\" width=\"425\" /></a>\r\n\r\nAnd for those of you who were curious about our poster collage, this is what we're aiming for. Click on the picture above to enlarge the collage. As you can see, we're using details from much larger posters. I really like the way it looks... in PhotoShop. I hope we can replicate it in the really real world. Nicole wanted me to point out that this isn't the final placement of the posters, and I concur. I want the <i>Jaws</i> poster to be directly below the <i>Garden State</i> one.\r\n\r\n<b>Other big news</b>\r\n\r\nNicole and I met with Mark Biggs today, the head of the Electronic Arts department at MSU, to discuss future collaborations. We have a lot of cool ideas, such as: screening student short films before regular movies, creating an advanced film class and business class to be taught at the theater (by none other than myself and Nicole), hosting MSU-sponsored alumni presentations, etc., etc., etc.. It was a nice meeting. Mark's a really nice guy... smart as a whip too. I look forward to working with him in the near future.\r\n\r\nLet's see... what else happened? Oh yeah! How could I forget! We met with Bucky Bowman, the director of the Springfield Arts Patronage, to discuss our current \"broke as a joke\" problem. Nicole and I had been batting around the idea of doing an \"adopt a chair\" fundraiser, but Bucky wanted us to take it a bit further. Here's what we're going to do:\r\n\r\nBecome a Moxie Founding Member Today! By becoming a founding member, you will be treated to a year's worth of free movies. Whenever you want to see a movie within our first year of operation, simply stop by and flash your Moxie Founding Member card... the movie's on us. After the first year, you'll receive $2.00 off regular ticket prices and a free movie ticket on your birthday. Need some popcorn? That's free too! What's that? You want more? How about one free pre-show ad per year that will run on the day of your choice... AND your name on one of the Moxie's seats... AND your name on the Founding Members plaque... AND an invitation to the Founding Member party the night before our grand opening. Can it get any better? Sound too good to be true? Well, it isn't. It's real, and Moxie Founding Memberships will be going on sale soon.\r\n\r\nNow, how much would you expect to pay for a membership like that? $10,000? $5,000? $1,000? For a limited time only, all Founding Memberships are going for the low, low price of just $_______! Can you believe that?! How can we even make a profit? Remember, we only have a limited amount of these memberships, so it's first come, first served.\r\n\r\n*END INFOMERCIAL*\r\n\r\nSeriously, that's what we're going to do. We have 70 seats, which means we can have 70 founding members. Members will receive free movies for our first year of operation (one per day), and $2.00 off standard admission each year afterwards. They'll also receive free popcorn, one free ad per year, their name on a chair and plaque, and a swanky pre-opening party thrown in their honor. Does that sound appealing to anyone out there? Seriously, if we were to sell a membership with all those perks for $500, how many of you would buy one?\r\n\r\nThink about it this way: if you were to go to the theater three times a month ($8 per ticket), and buy a popcorn and drink each time ($6 per visit) you'd be spending $504 over the course of a year. The membership has already paid for itself! So, what do you guys think?",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-19T09:43:40.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "i was bored so i decided to put the moxie <a href=\"http://www.uselessvoid.com/bored/3d/themoxie.jpg\">on a pedistal</a>\r\n\r\nthe paint is looking nice.. need more help? im off work saturday with not a thing to do.. \r\n\r\nloving the collage choices...  david bowie.. definately nice... you remind me of the boy..  the boy with the power... the power of VooDoo!\r\nthen i started looking around for the neverending story or dark crystal.. but their not there... oh well i suppose one great jim henson movie will do.. (okay he didnt do neverending story but yeah)\r\n\r\nas for the fundraising idea\r\npart of me likes it part of me doesnt\r\nfor one.. you need money... this could get you money.. which could get the moxie open quicker.. and give you less stress.... all great things\r\non the other hand.. i cant afford 500 dollars... because my car has a 300 dollar attitude problem that has to be dealt with... which deplets my current funds... and oh how i would love to attend the first showing/party at the moxie....  ie: im jealous and selfish\r\nhow about 250 for 6 months? :-)\r\n\r\nlong comments are rad! woo!\r\n",
      "created_at": "2005-07-20T10:47:25.000Z"
    },
    {
      "author": "Whimsy Chick",
      "body": "If I lived near Springfield, I'd be a founding member.",
      "created_at": "2005-07-20T16:21:41.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "Me too. Me too.",
      "created_at": "2005-07-20T16:52:31.000Z"
    },
    {
      "author": "Nate",
      "body": "Your figures for justifying the $500 expenditure on my part work out quite nicely, so hell yes, I could see myself paying for that.\r\nI seem to remember several long posts a few months ago, though, detailing your various versions of membership levels.  I thought you were already cutting it fairly close to the quick as far as leaving enough revenue for operating expenses.  Did ANY of those membership levels offer unlimited FREE movies for a YEAR?  And they sure cost a lot more than $500 if they did.\r\nYou know the business model better than I do, Dan, (of course) but I'm just curious how this can work now.",
      "created_at": "2005-07-20T17:33:50.000Z"
    },
    {
      "author": "Pat",
      "body": "Count me in for one, maybe two founding memberships. I assume that Moxie staff are required to genuflect before all founding members upon their arrival. ",
      "created_at": "2005-07-20T18:21:58.000Z"
    },
    {
      "author": "hmmm....",
      "body": "I'm not sure this is a good idea.  Is it worth getting the money up front even though you'll be missing out on revenue from the most loyal part of your customer base for a whole year? \r\n\r\nThis sort of thing works in general because (like gift certficates) most people won't use the entire value and you get to keep the extra.  Plus, they will bring their friends with them, who will pay full price. However, 500 is a hefty sum to pay and then not show up, and I would imagine that your buyers are going to be the same people who would have come several times a month anyway...now you just don't make money when they do. \r\n\r\nYou could sell more than 70 if you don't do the plaques (an added expense anyway) because they won't all show up for the same show.  I doubt you can sell more than 70 but whatever. Maybe just do one plaque in the lobby or something...\r\n\r\nOne more negative thought--what do you do if you go out of business?  Presumably that would only happen if you have a cash flow problem so severe that you can't recover.  Most small businesses succumb to this very problem.  I would sure as heck want my money back and you wouldn't have it available to give me, would you?  \r\n\r\nI would sell a yearly membership with discounts or have a frequent movie-goer program before I would do this.  It might solve your more immediate problem regarding capital, but I think it might really hurt your cash flow in the long run. ",
      "created_at": "2005-07-20T18:39:03.000Z"
    },
    {
      "author": "Caleb",
      "body": "Whoa, I didn't know you'd want a Big Lebowski poster. Do you have it already? I have that one I will donate too if you want.That poster collage is mesmerizing.\r\n\r\nThe paint is nice too.",
      "created_at": "2005-07-20T18:53:08.000Z"
    },
    {
      "author": "Caleb",
      "body": "Oh, and I would be interested in that membership, but I do see one or two small points that \"hmmm\" points out. I think it could still work though. You would just have to have your bases covered. As for your most loyal base getting in free for a year - you're going to have a LOT more business than just 70 people on a regular basis, so you should be fine on that.",
      "created_at": "2005-07-20T19:01:15.000Z"
    },
    {
      "author": "nicole",
      "body": "Noooo! I just ordered the poster last night. Oh well. If you have any other posters you'd ever like to get rid of, Caleb, let us know. We'll probably extend the collage throughout the theater eventually.",
      "created_at": "2005-07-20T19:03:35.000Z"
    },
    {
      "author": "Caleb",
      "body": "I won't depart with my Kill Bill posters, but other than that I should be a good resource for posters. I get them free from where I work (Movie Gallery). I have one for The Chorus and one for Kinsey and one for A Very Long Engagement. ",
      "created_at": "2005-07-20T19:09:27.000Z"
    },
    {
      "author": "Ryan",
      "body": "$500 is very reasonable.",
      "created_at": "2005-07-20T19:10:14.000Z"
    },
    {
      "author": "Kent",
      "body": "Heck, I live in San Antonio, but I'd be more than willing to pony up $500 for a founding membership.  My grandparents used to live in Springfield, and I spent many, many holidays there.  And my father got his PhD from SMS.\r\n\r\nNice to see the arts community really growing.",
      "created_at": "2005-07-20T20:24:32.000Z"
    },
    {
      "author": "Mark S",
      "body": "I like the poster collage. I recognise all the films except the one to the right of Jaws??\r\nWhere will it go in the cinema? And what scale are you thinking?\r\n\r\nM",
      "created_at": "2005-07-21T03:38:50.000Z"
    },
    {
      "author": "nicole",
      "body": "The one to the right of Jaws is Rushmore, one of our favorite movies. We'll be putting the collage in the front entrance so people who drive by can see it from the street. Each image is 12 inches x 12 inches.",
      "created_at": "2005-07-21T05:28:15.000Z"
    },
    {
      "author": "Cousin Steph",
      "body": "A most excellent collage selection.",
      "created_at": "2005-07-21T06:44:01.000Z"
    },
    {
      "author": "Patrick in NC",
      "body": "I love the founder member idea, and even as a low-budget guy would get one if I lived anywhere near there.\r\n\r\nMaybe do a two level thing... founding members with a plaque in the lobby ($500, as many as you can sell) and then \"seat on the floor\" members who also get a chair plaque ($750, limited to 70). Business and civic-leader types will be far more likely to give $500 (not that much, really) if their name is visible to everyone who enters (i.e. not on a chair).\r\n\r\nThis is a great idea, just think it out well before committing and keep it simple.      ",
      "created_at": "2005-07-23T21:26:16.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
