{
  "id": 26,
  "title": "In the Booth",
  "body": "As promised, today's post will give you a behind the scenes look at a standard projection booth, and, in so doing, hopefully shed some light on the black magic that goes on beyond the little window at the back of the auditorium. Before I begin, I'd like to point out that none of the pictures used to illustrate this post are my own. Some day, in the not-so-distant future, I'll be able to provide my <i>own</i> pictures of my <i>own</i> booth, but until that day arrives, these generic photos will have to do. So, with that being said, let's begin.\r\n\r\nProjection booths come in all shapes and sizes. From the long dark corridors of the giant <a href=\"http://moxie.danchilton.com/pix/grum/multiplex.jpg\" target=\"_blank\">multiplexes</a> to the relatively cozy / cramped quarters of the <a href=\"http://moxie.danchilton.com/pix/grum/cozy.jpg\" target=\"_blank\">smaller breeds</a> like ours. Regardless of their size, the first thing you'll notice upon entering a projection booth is that they're fairly dark. This is necessary so that light from the booth won't flood through the <a href=\"http://moxie.danchilton.com/pix/grum/port.jpg\" target=\"_blank\">port</a> into the auditorium and tick off your audience. Most projection booths have small lamps above each projector that can be flipped on and off so the projectionist can have light when they need it, like when he or she is threading the film.\r\n\r\nOur projection booth will consist of two 35mm projectors, each facing the same direction, that will be fed by a single <a href=\"http://moxie.danchilton.com/pix/grum/fiveDeckPlatter.jpg\" target=\"_blank\">5 deck platter</a> situated in the middle. A typical 35mm projector looks something like <a href=\"http://moxie.danchilton.com/pix/grum/projector.jpg\" target=\"_blank\">this</a>. The big box on the back of the projector is the <a href=\"http://moxie.danchilton.com/pix/grum/lamphouse.jpg\" target=\"_blank\">lamphouse</a>, which is where the light source comes from. The lamphouse contains a <a href=\"http://moxie.danchilton.com/pix/grum/xenonbulb.jpg\" target=\"_blank\">Xenon bulb</a> that is bright enough to melt the skin right off your face, just like in the end of <i>Indiana Jones and the Raiders of the Lost Ark</i>. Well, maybe not that extreme, but I can assure you, Xenon bulbs are very bright, very hot, and very expensive. The portion on the front of the lamphouse that looks like a modified machine gun with golden barrels is the actual projector.\r\n\r\nThe <a href=\"http://moxie.danchilton.com/pix/grum/projector_inner.jpg\" target=\"_blank\">inside of the projector</a> is made up of several different parts. At the top, you've got the <a href=\"http://moxie.danchilton.com/pix/grum/soundhead.jpg\" target=\"_blank\">soundhead</a>, which reads the sound strip located on the side of the film; below that you have the shutter, which spins around and keeps the picture from flickering on the screen; then you have a slew of intermittent gears and sprockets that provide just the right amount of tension as the film flies by at 24 frames per second; and finally you have the sound pickup, which is related to the soundhead. The film enters at the top, through the soundhead, and exits at the bottom, just past the sound pick-up.\r\n\r\nThe soundtrack is read directly from the film and sent to the <a href=\"http://moxie.danchilton.com/pix/grum/amps.jpg\" target=\"_blank\">sound processing rack</a>, which processes the data and sends it out to the appropriate speakers in the auditorium. The whole time this is going on, film is being simultaneously <a href=\"http://moxie.danchilton.com/pix/grum/platter1.jpg\" target=\"_blank\">pulled from one deck on the platter</a> and <a href=\"http://moxie.danchilton.com/pix/grum/platter2.jpg\" target=\"_blank\">taken up on another</a>. The film gets from the projector to the platter through a series of <a href=\"http://moxie.danchilton.com/pix/grum/pulleys.jpg\" target=\"_blank\">pulleys</a> and <a href=\"http://moxie.danchilton.com/pix/grum/interlocking.jpg\" target=\"_blank\">interlocks</a>. Pretty cool, huh? Well, guess what? That's only half of the story! To really understand how a projection booth works, you need to see the progression of a film from delivery to premiere.\r\n\r\n<b>Delivery</b> - The film arrives in two to three (depending on the length of the film) <a href=\"http://moxie.danchilton.com/pix/grum/cans2.jpg\" target=\"_blank\">heavy metal containers</a>. No matter how strong you \r\nare, your shins will get the crap banged out of them by these spiteful mothers.\r\n\r\n<b>Unpacking</b> - Once you open the containers, you'll see that the film has been <a href=\"http://moxie.danchilton.com/pix/grum/cans.jpg\" target=\"_blank\">broken into several pieces</a> that you will have to put together. At this point, you'll want to pray that the last projectionist who handled the film put the reels in the right way, or else you'll be rewinding each and every one of them until they're ready for assembly.\r\n\r\n<b>Building the Print</b> - To build the print, you'll need to take each reel and <a href=\"http://moxie.danchilton.com/pix/grum/build1.jpg\" target=\"_blank\">feed it onto a big make-up reel</a>. Once the first reel is done, you'll need to <a href=\"http://moxie.danchilton.com/pix/grum/splice2.jpg\" target=\"_blank\">splice</a> its tail onto the head of the second reel, and continue this process until you've filled the big make-up wheel. Once you've reached this point, you'll need to <a href=\"http://moxie.danchilton.com/pix/grum/makeup2.jpg\" target=\"_blank\">rewind the big make-up wheel</a>, because the film has to be <a href=\"http://moxie.danchilton.com/pix/grum/makeup.jpg\" target=\"_blank\">fed onto the platter</a> in sequential order. Once you've spliced together all the reels and fed them onto the platter, it's time to start threading.\r\n\r\n<b>Threading</b> - Starting from the inside of the platter, take the film and <a href=\"http://moxie.danchilton.com/pix/grum/platter1.jpg\" target=\"_blank\">thread it through the head</a> on that deck, then <a href=\"http://moxie.danchilton.com/pix/grum/pulleys.jpg\" target=\"_blank\">through the platter pulleys</a>, then <a href=\"http://moxie.danchilton.com/pix/grum/interlocking.jpg\" target=\"_blank\">the interlocking pulleys</a>, and then carefully <a href=\"http://moxie.danchilton.com/pix/grum/threading.jpg\" target=\"_blank\">thread it through the projector</a>, making sure the film is securely placed into the appropriate sprockets. After the projector has been correctly threaded, pull the film out through the bottom, thread it through another series of interlocking pulleys, and attach it to the <a href=\"http://moxie.danchilton.com/pix/grum/platter2.jpg\" target=\"_blank\">take-up deck on the same platter</a>. Now the film is ready to be shown.\r\n\r\nThe entire film building process can take anywhere between one to two hours, but a good projectionist should be able to thread a film in about two minutes, which is a necessity if they're responsible for running a multiplex booth where you can have 3 to 4 films starting within a 10 minute period of each other. Once the film's engagement is finished, the projectionist has to break down the print, which is essentially like doing everything listed above, only in reverse order. After the print has been broken down into individual reels, they're repacked into the film cans, and sent back to the distributor... at the cost of the theater, of course.\r\n\r\nAnd that, my friends, is the long and short of the projection booth. There are lots of little details that were intentionally left out, mainly because their inclusion would have made this post more of a manual rather than a simple illustration. So when you go see <i>Fahrenheit 9/11</i> tonight, take a moment to turn around in your seat, glance up towards the projector port, and wave at the friendly projectionist who is trying their hardest to thread the film before the 7:15 showtime. Good luck, buddy.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-06-26T00:32:18.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "B",
      "body": "30fps? I thought films were projected at 24fps.",
      "created_at": "2004-06-26T02:20:51.000Z"
    },
    {
      "author": "bjork24",
      "body": "B, you're absolutely right. Video is 30 fps... I don't know what I was thinking. Good eye.",
      "created_at": "2004-06-26T02:23:55.000Z"
    },
    {
      "author": "Newell",
      "body": "Nifty-keen post! The visual aids were quite helpful too!",
      "created_at": "2004-06-26T04:35:33.000Z"
    },
    {
      "author": "Oz",
      "body": "Honestly, I thought that movies were easier to show.  You'd think that by now, they would have come up with an easier system than all this.  Remind me never to get a job as a projectionist.",
      "created_at": "2004-06-26T06:02:16.000Z"
    },
    {
      "author": "James",
      "body": "I think to most people, and even myself, the projection booth has a bit of mystique to it.  Not many people are allowed up there, and even when one does go up there, it's like an alien world.  There's a bunch of clicking and a soft hum.  I think projectionists get very comfortable with their booths though, and treat them like a second home.",
      "created_at": "2004-06-26T12:48:57.000Z"
    },
    {
      "author": "Larry",
      "body": "I loved the pictures.. brought back a lot of memories to me. I have never seen a 5 deck platter before all the ones I ever used were just 3. My time as a projectionist was the best time of my life. I wish I could of made a living off of it, but in this day of large corporations running all the cineplex's, the true projectionist is an all-but-dead vocation.",
      "created_at": "2004-06-26T16:56:40.000Z"
    },
    {
      "author": "CHris",
      "body": "I learned a lot about films\r\nGreat informations!!\r\n\r\nmy blog: \r\nhttp://blog.wizwe.com/chris",
      "created_at": "2004-06-28T13:19:14.000Z"
    },
    {
      "author": "Sandra",
      "body": "Cool post! I'm learning how to project.  We don't have platters -- we have two projectors. In these parts the projection booths used to be Union. No longer. One of these days I'm going to make a short film of what you wrote so that people can see the process...sped up so that it's no longer than 3 minutes on film.",
      "created_at": "2004-06-29T04:29:39.000Z"
    },
    {
      "author": "anonymous",
      "body": "The film is run through at 24fps, but because of the shutter spinning (to reduce flicker, as you said) it is *displayed* at 48fps. This means that every frame (individual picture of the film) is shown twice, at 1/48th of a second in length. Kind of neat to think about...when you go to the movies, you actually see the film *twice*. :)",
      "created_at": "2004-06-30T03:17:40.000Z"
    },
    {
      "author": "Thomas",
      "body": "Heh, I always wondered what they did with the films after I lugged them upstairs and never saw them again until I needed to get stock for concession. Very good job.",
      "created_at": "2005-06-23T05:48:28.000Z"
    },
    {
      "author": "elise",
      "body": "Hey Dan...Love your site! I'm thinking about starting a small theater in Mexico myself. My question is... What would I do if I wanted to run the theater without hiring a projectionist? Is there some sort of certification process I could go through? ",
      "created_at": "2005-07-09T07:14:18.000Z"
    },
    {
      "author": "Andrew Swann",
      "body": "Fantastic article about film projection. \r\n\r\nCan I ask a couple of (probably very stupid) questions which maybe someone knows the answers to (or can point me in the direction of the answers)... It'll help clear up a discussion I was having with a friend of mine regarding multi-screen film projecting...\r\n\r\nRegrding the film platters...\r\n\r\n1) Does the film feed out from the *centre* of the first platter, and re-spool onto the 2nd in the traditional way from the centre outwards?\r\n\r\n2) If I presume the above is correct, does this mean you can start projecting the same film from Deck 2 on another projector (eg: showing the same film before it has finished in the original screen?)\r\n\r\n3) If this is not the case, would multi-screen cinemas use several prints to show the same film shortly after one another? For instance I went to see King Kong yesterday which had screenings at 17:00, 19:00, 20:00 and 21:00. It has a running time of around 3hrs so they would (presumably) have to have three prints to do this - Is that economically viable?\r\n\r\n4) For a booth with two projectors, why do you have a 5 deck platter? Presumably Deck 1 is feeding to Deck 2 via Projector 1, and Deck 3 is feeding to Deck 4 via Projector 2 - what is the 5th deck for?\r\n\r\nThanks in advance\r\n\r\nAndrew",
      "created_at": "2005-12-19T04:08:55.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
