{
  "id": 260,
  "title": "Quick addendum on the founding membership",
  "body": "A couple of you have voiced concerns about the Founding Membership program, so I'm going to try to assuage them. First, let's look at the cost of giving away a year's worth of free movies. Since we're a single screen theater, we're only going to be showing about 5 or 6 new movies each month (not counting the late night weekend shows or the local filmmaker series, both of which are exhibited at deeply discounted rates). Unless a founding member wants to continually go back and see the same movie again and again, they'll probably only be seeing each new movie once. So let's assume that each founding members sees 65 movies per year, at $6.50 a ticket (special member price)... that's $422.50.<br/><br/>Popcorn has a ridiculous mark-up, so giving it away free to a select group of founding members isn't going to hurt us. And besides, most people will want a beverage with their popcorn, so we'll be making some revenue there. Also, I'm sure a large percentage of the founding members will be bringing someone with them, which brings in even more business. The free ad has no cost associated with it, so that's a given. The plaque might be an additional cost, albeit a small one, but I want to recognize the group of supporters that carried us through the final stretch.<br/><br/>You can also look at the founding member program as an advertising campaign. The more people we get to see our movies, the more word of mouth we generate. Take, for instance, Mr. Doe, a big movie fan with a large family. Without a founding membership, Mr. Doe would probably make it down to the theater maybe two or three times a month. Remember, he's a busy man and movies cost money that might be better spent elsewhere. However, with a founding membership, Mr. Doe might be more motivated to sneak down to The Moxie three or four times per month. Suddenly he has an excuse to take Mrs. Doe out more often. He can use his free ad to display an \"I love you Mrs. Doe!\" message to his wife on their anniversary. Then they'll go home, have more kids, and tell all their friends what a great time they had at The Moxie. Getting the word out about the theater is paramount in our first year of operations. The more people we can get in the doors, the more people we can impress with our one-of-a-kind movie experience.<br/><br/>Instead of seeing the membership as an operating loss, I view it more as a short term loan. We're repaying the founding members over our first year of business, but we're also capitalizing on the opportunity to bring more people into The Moxie. Now I'm off to the theater to do some more work. Please feel free to continue discussing the pros and cons of the membership, because everyone's opinion helps. I'll check back in later this evening.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-20T19:47:21.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Maddy",
      "body": "The key to this idea, in my opinion, is to sell to people who might not be the college kids/movie-lovers/moxie fans regulars.  I bet there are quite a few people in Springfield who would LOVE to get their name on a chair.  They want prestige, something to chat about over golf.  Let's give it to them.<br/><br/>You could also give these memberships to a company.  Take that guy who owns Trolly's.  He can get his restaurant's name on a chair and on a plaque.  He can advertise once a year.  And he can take his dates to a cinema and show her his name.  Might help him get laid.<br/><br/>There are lots of people who just want to see their name on crap, and then they could use the free movies as something to give the \"little people\" that help them along the way.<br/><br/>The only drawback is that you would need a card that could be used by a corporation instead of a single person--the owner of the club, restaraunt, bank, etc. would just have to hold on to it.",
      "created_at": "2005-07-20T19:59:29.000Z"
    },
    {
      "author": "Luke",
      "body": "I think it's a great idea.  If I didn't live 700 miles away, I'd totally pull together some cash to buy a membership.",
      "created_at": "2005-07-20T20:11:09.000Z"
    },
    {
      "author": "Nate",
      "body": "Ok, ok.  It sounds like you got it figured out then.  I would like to come up with the $500 (the plaque is cool, but at 3 movies or so a month, it's just a practical expense for me), but with a new house and all, I'm going to have a lot of expenses over the next six months.  Let's just say I hope to do it if you decide to go forward.",
      "created_at": "2005-07-20T20:16:12.000Z"
    },
    {
      "author": "Caleb",
      "body": "Maddy made some excellent points. Question though - will the plaque on the chairs be there forever or will they come down after our yearly membership deal. Also, will you plan on giving a slight discount for another year membership to these founding members? Say I joined this thing and a year from now I wanted to renew it, will I get any special renewal price deals or anything? I think it's important to look at the future details as well as the present ones. I am definitely interested in this though. The plaque and the free ad are quite intriguing.",
      "created_at": "2005-07-20T20:29:20.000Z"
    },
    {
      "author": "erin",
      "body": "its a wonderful idea. and i would love to do it. there is just no possible way i could come up with that much money. maddy had it right...\"The key to this idea, in my opinion, is to sell to people who might not be the college kids/movie-lovers/moxie fans regulars.\" i think local businesses would eat it up. could you get a little blurb on the news about it?",
      "created_at": "2005-07-20T21:34:16.000Z"
    },
    {
      "author": "Stephanie",
      "body": "I think it's a fantastic idea.  People like to feel that they're special.  And it gets bodies in the chairs.  People will tell others...free advertising!  ",
      "created_at": "2005-07-20T22:54:54.000Z"
    },
    {
      "author": "Nate",
      "body": "Bodies in chairs?  There will be a body in my chair?!?",
      "created_at": "2005-07-20T23:04:45.000Z"
    },
    {
      "author": "brian of moore",
      "body": "only thing i wonder.. is can you sell this to 70 people within a month or two?  <br/>ie: god i hope your open within a month or two... <br/>or is it simply impossible to open without the money gained from this?  .. <br/>seems to me that it would be hard to sell 70 seats at 500 dollars within a month (or two) not trying to be a glass half empty person.. but i guess i am<br/>the goal is to get the place open.. right?<br/>can you open with just 5000 more dollars? thats just 10 seats ... or would you need 10 thousand? ... you could probably sell them quicker if they were just 250 for 6 months... then youd need 40 seats for 10 grand.. but they would probably sell quicker<br/>maybe not.. i dunno.. <br/>but as previously stated.. i would by one for 250 :-)   ..i could swing that much easier than 500... ",
      "created_at": "2005-07-20T23:44:28.000Z"
    },
    {
      "author": "Steve Kirks",
      "body": "Not to be a big dork, but the dollar amount for the membership isn't in the previous post--just an underline.  Where's the $500 number coming from?<br/><br/>Dan:  with the right words to the right people, this will happen quick.  $500 is cheap to a company looking to get exposure.  Call 417 Magazine and talk to Gary Whittaker about his new downtown tabloid and get him to buy a couple of seats.  Sell a couple to the DDEC and let them use the pass as a promo or give away.  Call the Springfield Convention and Visitor's Bureau with the same idea--they went in on a box at Hammons Field.<br/><br/>Kirk Elmquist (sp?) of the Cardinals has stated numerous times that corporate and groups sales has been their big win.  In your situation, the $500 seat price is good for a corporate sponsor, similar to the exposure they would get from golf tourney.<br/><br/>Hope to see you at the weblog meeting at Patton Alley tonight...<br/><br/>Steve",
      "created_at": "2005-07-21T01:03:25.000Z"
    },
    {
      "author": "hmmm....",
      "body": "I thought that this whole theater thing was supposed to be cool and edgy and make me feel like I was a part of an exciting undergroundish community of intellectuals and movie-lovers...not exactly a \"take me out to the ballgame\" kind of atmosphere...was I wrong?  <br/>",
      "created_at": "2005-07-21T01:46:12.000Z"
    },
    {
      "author": "brian of moore",
      "body": "\"if we were to sell a membership with all those perks for $500\"<br/><br/>i was getting the 500 from that<br/>i guess i just took it and ran with it",
      "created_at": "2005-07-21T01:47:37.000Z"
    },
    {
      "author": "Mark S",
      "body": "I'd be tempted, but as I'm OS I'd never get my moneys worth. I could be tempted by a half-price option Like Brian suggested) - 6-months free films (which I'd never use or possibly donate), name on the bottom of plaque but no seat dedication?<br/>Also, I'm a movie fan but seeing 5-6 films in a month is still alot. I guess that just means the Moxie gets to keep more of the membership money, Yah!<br/><br/>M",
      "created_at": "2005-07-21T03:47:55.000Z"
    },
    {
      "author": "Zach",
      "body": "Always a good idea to take care of the people that take care of you. Best of luck on the founders program.",
      "created_at": "2005-07-21T06:36:37.000Z"
    },
    {
      "author": "Cousin Steph",
      "body": "How about giving us out-of-towners a discount or limited founding membership.  You know we won't be able to stop in as often, but we don't want to miss out on all the fun.  Maybe us out of towners could have our plaques all on one chair.  I mean what are the odds that more than one of use will be there at any given showing, right?  Just a thought.",
      "created_at": "2005-07-21T06:39:29.000Z"
    },
    {
      "author": "Jay",
      "body": "In response to Hmmmmmmm's fear of the Moxie losing its edge...maybe we can convert a few of those \"take me out to the ballgame\" folks once they get inside the doors.  If not, maybe we can just scare 'em away early and keep their money!  It's a win-win deal.",
      "created_at": "2005-07-21T07:04:18.000Z"
    },
    {
      "author": "Al",
      "body": "Very few students are going to have $300+ to spend on a membership all at once.  <br/><br/>I'd also consider a cheaper membership that would not be able to see Fri/Sat \"prime shows\", as that's the only shows likely to sell out. I got an exercise club deal like this once, only paid 1/2 price, just couldn't go between 4 & 7 at night.   ",
      "created_at": "2005-07-21T07:04:56.000Z"
    },
    {
      "author": "DUG",
      "body": "I think that you should up the price a little and include two passes for every movie.  This way the businesses will definately want the add space and they could give tickets to clients or employees.  Just one ticket wouldn't do cause not everyone wants to see a movie alone.  Plus the five hundred is nothing to a business owner, you could get way more out of that, especially through the ads.  Hike up the price, amount of tickets and anyone could use them and I bet you'll see better results.<br/><br/>This is not for Moxie Lovers like everyone says, five hundred is a lot to people like you and me, but not to a business owner!<br/>",
      "created_at": "2005-07-21T23:56:57.000Z"
    },
    {
      "author": "Laura",
      "body": "I think Dug has a good idea about business clients.  So, why not set up a tiered system?  Keep the $500 level as is but say there is $1,000 level that gets 2 tickets and maybe a $2,000 level that gets more tickets and more ads.  You could even give the levels cute names like  Production Assistant, Art Director and Executive Producer.  It's just like PBS!  I for one would definitely love to see Moxie totebags.  I'm just sayin'...",
      "created_at": "2005-07-22T00:09:43.000Z"
    },
    {
      "author": "ron",
      "body": "What if you sell 70 memberships, and only half of them come every week, but they bring a date.  Wouldn't your theater be full?  How could you sell tickets to the public then? The first month or so is the time your founding members would most likely come to the Moxie every chance they get.  That first month or so is also the ime you will want new customers coming to check the place out.  If the theater is sold out every Friday and Saturday night, (and half of those people would be seeing the movie for free), you'd lose a lot of that \"new\" novelty that would continue to build your customer base.  Don't sell unlimited free movies for a year, or you'll never pay back that loan.",
      "created_at": "2005-07-26T00:57:05.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
