{
  "id": 261,
  "title": "Day 10: One third of the way there",
  "body": "Not much to announce today... just more painting (thanks be to <a href=\"http://justin.commonelectric.com\" target=\"_blank\" class=\"broken\">Justin</a> and Kelley for all their help today) and discussing of founding memberships. I also attended a monthly meeting of <a href=\"http://rhetorica.net/archives/004116.html\" target=\"_blank\">Springfield bloggers</a>. Here are a few pictures of the painting progress:<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/072005/upload1.jpg\" width=\"425\" /><br/><br/>Look at the pretty red! Unfortunately it will need two coats to cover the light spots. In the end it will be a deep wine red. Very nice choice, Nicole.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/072005/upload2.jpg\" width=\"425\" /><br/><br/>Here's the art hallway... all rouged up and ready for a night out on the town.<br/><br/>Not much else to say. The Inc.com post will run tomorrow, so I'll be sure to post that here (the edited AND unedited versions). Woo hoo! As for the founding memberships... well, you'll just have to wait and see.<br/><br/>",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-21T07:56:19.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "Beautiful walls you got there. I agree - great choice Nicole. Can't wait to see more.",
      "created_at": "2005-07-21T08:03:15.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i like how you still have paint on your shirt at the bloggers meeting<br/>unless thats not paint... .. blood?<br/>is the bloggers meeting kind of like fightclub? <br/>lovin the wine red",
      "created_at": "2005-07-21T09:33:33.000Z"
    },
    {
      "author": "justin",
      "body": "I still have paint in my hair.",
      "created_at": "2005-07-21T16:51:57.000Z"
    },
    {
      "author": "nicole",
      "body": "Any suggestions on what color to do opposite the red wall? We're finding that the red reflects a lot, so I don't want anything turning pink...",
      "created_at": "2005-07-21T17:06:42.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Yeah, that red is sexxy. As for secondary color, maybe a deep green (complimentary) or a rich gold (analagous)? I'm trying to think of something grand, something cinematic. Maybe a dark-medium gray? Darker than your purple taupe auditorium color.",
      "created_at": "2005-07-21T17:16:50.000Z"
    },
    {
      "author": "sam",
      "body": "I'm thinking the dark-medium gray is the best idea - Gold would make it look like McDonald's and green would make it look like Christmas. Gray would be really nice though.",
      "created_at": "2005-07-21T17:27:42.000Z"
    },
    {
      "author": "Jessica",
      "body": "http://www.colorschemer.com/online.html This site might be helpful and I stress might.  ",
      "created_at": "2005-07-21T18:40:36.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i have this <a href=\"http://www.amazon.com/exec/obidos/tg/detail/-/1581802366/ref=pd_sxp_f/002-2404032-0284805?v=glance&s=books\">cool book</a> (mostly for design students but design students are usually too hip to ever own something like this) but it shows what colors work well together<br/>you could probably just go to one of the art stores in town.. and look through it to help you decide<br/>after looking through it myself there are some shades of brown that look pretty good with that color<br/>everyone will probably dissagree.. ahh well",
      "created_at": "2005-07-21T19:46:04.000Z"
    },
    {
      "author": "Caleb",
      "body": "I like brian's idea of a shade of brown the best. Green is a big no-no and gold is cheesy. The dark gray idea is nice too.<br/><br/>But then again...whoever said the Moxie SHOULDN'T be pink?? (just kidding...)",
      "created_at": "2005-07-21T20:19:50.000Z"
    },
    {
      "author": "Ole",
      "body": "How are you going to light the artwork in the hallway?  Will it hang on both walls or just the Eastern wall?  If the latter, maybe the gray works better so it doesn't distract from the art?",
      "created_at": "2005-07-21T20:55:17.000Z"
    },
    {
      "author": "erin",
      "body": "im with ole. less distraction. go gray.",
      "created_at": "2005-07-21T21:20:54.000Z"
    },
    {
      "author": "nicole",
      "body": "Thanks for the tips. I have a dark silvery-gray picked out, but Dan's against it. It's pretty expensive. I'm just worried about it looking too dreary.",
      "created_at": "2005-07-21T21:25:23.000Z"
    },
    {
      "author": "Master Yoda",
      "body": "Big no-no, green is!?  Hmmph!<br/><br/>What know you of color schemes?  For nine hundred years has green done just fine for me, very much, thank you!",
      "created_at": "2005-07-21T23:20:08.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Wow, Brian, that book looks oddly familiar. Oh yeah, it's the same exact book that the ideas for green, gold, and gray came from. And I never was that hip as a design student.<br/><br/>Another idea: does the whole wall have to be one color? Remember the painting ideas in ish 3 or 4 of ReadyMade? I think you could have some fun with the red and a well-chosen secondary color and not use it all over. That might make some of the more bolder and brighter suggestions a little more appealing.",
      "created_at": "2005-07-21T23:49:51.000Z"
    },
    {
      "author": "DUG",
      "body": "mmmmmmmmmmmmmmm...wine!",
      "created_at": "2005-07-22T00:05:52.000Z"
    },
    {
      "author": "Caleb",
      "body": "Master Yoda,<br/><br/>No offense little man. I merely meant green mixed with red. Christmas colors don't belong in a theater.",
      "created_at": "2005-07-22T01:31:09.000Z"
    },
    {
      "author": "JED",
      "body": "I think either grey or go with a nice shade of taupe. They say taupe is very soothing. Other than that, there is going to be a huge going away party for me on Sat. Aug 6th starting at noon, in Hermosa Beach. You are all invited. Moxie shirt will be making regular appearances throughout the day. So come out and bring your friends. OH and DUG.... SHUT IT.      ",
      "created_at": "2005-07-22T01:59:30.000Z"
    },
    {
      "author": "Mark",
      "body": "Gah, choosing colours is not my thing.<br/><br/>M",
      "created_at": "2005-07-22T02:40:36.000Z"
    },
    {
      "author": "brian of moore",
      "body": "aaron: hah... nice.. yeah it was my last roommate (design student) who had scoffed at me for buying the book.. she, unlike us, was very hip",
      "created_at": "2005-07-22T04:08:20.000Z"
    },
    {
      "author": "pat bridd",
      "body": "JED,<br/><br/>Nice Ocean's 11 remake reference.",
      "created_at": "2006-07-28T18:33:34.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
