{
  "id": 262,
  "title": "Day 11: Boring administrative stuff",
  "body": "Not much went down today. We took a break from the manual labor and focused on administrative stuff... like balancing our budget sheets, designing mock tickets, creating pamphlets for the August First Friday Artwalk, and building an information packet for businesses that might want to advertise with us. We're also considering whether or not we should start selling bulk tickets along with the founding memberships. What do you guys think? Should we just focus on the founding memberships for now, or should we expand our offering and begin selling block tickets?<br/><br/>Other than that, it was an incredibly hot and muggy day... tomorrow won't be any better, unfortunately. Oh well. Hot or not, the work must go on.<br/><br/>PS - the Inc.com article will post tomorrow, not today as I had mentioned earlier. Woo hoo!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-22T08:01:11.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "What exactly do you mean by bulk tickets along with the memberships? Sorry, it's been a long day.<br/><br/>Good luck painting in this nearly 100 degree weather! Gotta love life in Misery.",
      "created_at": "2005-07-22T09:26:11.000Z"
    },
    {
      "author": "matt",
      "body": "i'd focus on the memberships first, then when the period to get in on that is over, offer the bulk tickets so that one campaign doesn't cannibalize the other.",
      "created_at": "2005-07-22T13:29:37.000Z"
    },
    {
      "author": "Ole",
      "body": "on the other hand, offering the customer the choice might bring in revenue you would otherwise miss out on.  For example, all the poor college kids who read/comment/link to the site might be willing to give up a night of drinking/movie renting/et al to purchase a five pack of tickets now to help cover the funding shortfall.  Rather then cannabalize, they would be complementary campaigns.",
      "created_at": "2005-07-22T17:21:19.000Z"
    },
    {
      "author": "bjork24",
      "body": "That's how I saw it too, Ole.",
      "created_at": "2005-07-22T19:03:52.000Z"
    },
    {
      "author": "erin",
      "body": "that would be great for us poor folk.",
      "created_at": "2005-07-22T19:49:11.000Z"
    },
    {
      "author": "JED",
      "body": "Bulk tickets are a great idea but you should limit them to certain show dates or times. You don't want to lose revenues from \"walk-ups\". You want your theater to be accessible to people who come spur of the moment. If a majority of your seats are filled with discount tickets(or worse free tickets) you will drop revenues quite extensively. I hope to God you dont do a years worth of free movies. If you do, I think you should not have 70 founding memberships. Remember accessability is key. try like 30 founding memberships. Seriously if more than half of your seats are filled with free ticket holders and the theater is full, and you have to turn \"paying\" people away because of the limited seating you are going to be kicking yourself. People hate being turned away. Thats a form of marketing you can do without.   ",
      "created_at": "2005-07-22T21:28:58.000Z"
    },
    {
      "author": "hmmm....",
      "body": "Amen to that. I know you need money now, but you're going to shoot yourself in the foot sacrificing future profits like this...",
      "created_at": "2005-07-22T22:08:37.000Z"
    },
    {
      "author": "Al",
      "body": "Bulk tickets are just an interest free loan from them to you.  They should get a discount (50c -$1) per tik, but it's then yours.  Some will lose them, or move away, and you'll \"win\" both ways.",
      "created_at": "2005-07-22T23:58:40.000Z"
    },
    {
      "author": "hmmm....",
      "body": "Yeah, that's how gift certificates work and it's a great thing...problem is, this isn't the start of a bulk ticket cycle that constantly goes into revenues/cash flow.  This money would be used for capital purchases. <br/><br/>Bulk tickets in general = good. <br/>Bulk tickets to make up for capital shortfall = not good.<br/>",
      "created_at": "2005-07-23T00:41:16.000Z"
    },
    {
      "author": "Andy",
      "body": "I would absolutely, without a doubt purchase bulk tickets.  No way I could afford a Founding Member slot.<br/><br/>The two options are aimed at two very different groups of people.  Founding Members would be the older, more wealthy people.  The bulk ticket buyers would college kids like myself looking to either 1) save few bucks, the most likely reason, or 2) help you guys out.<br/><br/>I would fall into both reasons 1) and 2).",
      "created_at": "2005-07-23T00:53:25.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
