{
  "id": 263,
  "title": "Day 12: More painting",
  "body": "\"More painting\" - that will most likely be the title for the next seven days. When we weren't flinging latex pigment on our walls, we were swinging by Bucky's office to get his opinion on the Founding Member benefits. So pleased with the outcome was he, that he pulled out his checkbook right then and there and became Founding Member numero uno. Nicole's parents soon became members number 2 and 3. Three down, sixty-seven to go. And we haven't even officially announced them yet!<br/><br/>As I mentioned yesterday, the post I wrote for Inc.com's blog finally went live today. You can read it <a href=\"http://blog.inc.com/archives/2005/07/22/diary_of_a_startup_moxie.html\" target=\"_blank\" class=\"broken\">here</a>, or you can read it below:<br/><br/><i>As published on the Inc.com website on 07.22.05</i><br/><br/><b>Diary of a Start-Up: Moxie</b><br/><br/>For well over the last year, my wife Nicole and I have struggled against many, if not ALL odds to open our very own independent art-house movie theater, Moxie Cinema, in Springfield, Missouri (you know, Brad Pitt's hometown). Our mission is simple: \"to create a unique and inviting venue for the exhibition of smaller, lesser-known films that have traditionally been unattainable in the Springfield market. By providing intriguing film series and offering a cinematic experience that differentiates itself from the typical multiplex affair, we hope to create a one-of-a-kind service that will benefit the downtown community along with the rest of the metropolitan area.\"<br/><br/>We have worked tirelessly to open The Moxie, which only seats about 70 people, in an old bank in the heart of Springfield's historic downtown district. In that span of time we've had to change buildings, downgrade our plans from two screens to one, spend nearly 80% of our budget on unforeseen building renovations, push back our original opening date from March to September, and auction off the naming rights to our concession bar (affectionately known as the Cinebar) on eBay in a desperate attempt to raise more start-up capital. It hasn't been easy, but we quickly learned that if you can't roll with the punches -- or in our case, sledgehammers to the abdomen -- then you shouldn't get into the ring in the first place.<br/><br/>Of course, opening The Moxie hasn't been all dark clouds and poorly chosen analogies. We've had the opportunity to meet a lot of great people and become part of Springfield's growing arts community. <a href=”/” class=\"broken\">The Moxie Blog</a> has also played a crucial role in our progress by allowing us to interact in a variety of ways with our potential customer base, but I'll touch on that issue at a later time...<br/><br/>So where does The Moxie stand today? Well, we're nearly one month away from our tentative opening date on September 2 (extreme emphasis on tentative) and we're completely out of money. We still have a lot of work to finish between then and now, including a crazy plan to raise a sizable chunk of funding to see us through to opening day. Will it work? Will I ever tell you what it is? The answer to both of these questions is \"yes.\" I hope.<br/><br/>###<br/><br/>That was the edited version of the post. Here's the piece I sent in:<br/><br/><b>The Moxie and Its Incredibly Shrinking Budget</b><br/><br/>Very few fledgling entrepreneurs can boast a business degree from Stanford (summa cum laude), a seat on the board of directors at Google, and a business lineage that traces all the way back to both John Paul Getty and Cornelius Vanderbilt.... myself included. However, I did stay at a Holiday Inn Express last night. For whatever that's worth.<br/><br/>Hello Inc.com blog readers. My name is Dan and this is a short recount of how my wife Nicole and I have struggled against many, if not ALL odds to open our very own independent art-house movie theater, Moxie Cinema, in Springfield, Missouri (you know, Brad Pitt's hometown). Our mission is simple: “to create a unique and inviting venue for the exhibition of smaller, lesser-known films that have traditionally been unattainable in the Springfield market. By providing intriguing film series and offering a cinematic experience that differentiates itself from the typical multiplex affair, we hope to create a one-of-a-kind service that will benefit the downtown community along with the rest of the metropolitan area.”<br/><br/>For well over the last year, we have worked tirelessly to open The Moxie, which only seats about 70 people, in an old bank in the heart of Springfield's historic downtown district. In that span of time we've had to change buildings, downgrade our plans from two screens to one, spend nearly 80% of our budget on unforeseen building renovations, push back our original opening date from March to September, and auction off the naming rights to our concession bar (affectionately known as the Cinebar) on eBay in a desperate attempt to raise more start-up capital. It hasn't been easy, but we quickly learned that if you can't roll with the punches – or in our case, sledgehammers to the abdomen – then you shouldn't get into the ring in the first place.<br/><br/>Of course, opening The Moxie hasn't been all dark clouds and poorly chosen analogies. We've had the opportunity to meet a lot of great people and become part of Springfield's growing arts community. <a href=”/” class=\"broken\">The Moxie Blog</a> has also played a crucial role in our progress by allowing us to interact in a variety of ways with our potential customer base, but I'll touch on that issue at a later time... doesn't the phrase “touch on that” sound strange? I'll touch on this, and I'll touch on that. It's enough to make me feel slightly aroused.<br/><br/>So where does The Moxie stand today? Well, we're nearly one month away from our tentative opening date and we're completely out of money. We still have a lot of work to finish between then and now, including a crazy plan to raise a sizable chunk of funding to see us through to opening day. Will it work? Will I ever tell you what it is? The answer to both of these questions is “yes.” I hope.<br/><br/>###<br/><br/>Believe it or not, I think I like the edited version better. I should hire an editor to read all my posts... think about how much shorter and to the point they'd be! Although, that bit about \"touch on that\" and \"touch on this\"... you have to admit, that was pretty good. They even let some of my trademark ellipses slide! All in all, I'm happy with the post. Thanks Inc.com!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-23T07:01:12.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "i thought elipses were my trade mark...<br/>i dont quite understand why they edited it to begin with.. its not like it was some long two page story... odd<br/>but cool that you were on there.. kudos<br/><br/>so now that you have hashed out the details.. and have 3 founding members could you so kindly tell us exaclty what being a founding member entails",
      "created_at": "2005-07-23T10:06:12.000Z"
    },
    {
      "author": "bjork24",
      "body": "All in good time, Brian. All in good time.",
      "created_at": "2005-07-23T17:34:53.000Z"
    },
    {
      "author": "something_a_miss",
      "body": "not to be a/the douche, have you decided what movies you will be showing? besides art films and local work will you be presenting revival and/or repertory films? are there specific formats you can and can not play? Have you looked into getting arts council grants from the state? have you started selling your blood yet? have you thought about having a cake walk? or if these questions are to annoying, What are you showing september 2nd!?!? ",
      "created_at": "2005-07-23T17:39:59.000Z"
    },
    {
      "author": "Rachel",
      "body": "I understand there touch on this touch on that edit. They want to give the readers time to warm up before they know how easily you become arroused.",
      "created_at": "2005-07-23T17:47:26.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Hey, it looks like you're opening around the time of my birthday.  Now, if I can only convince Matt a fabulous birthday present would be a trip to Springfield...",
      "created_at": "2005-07-23T19:23:39.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
