{
  "id": 265,
  "title": "Day 14: Wowee! Two weeks in!",
  "body": "Two weeks in and the progress looks good. I'm hoping to launch the Founding Membership drive tomorrow, but we still have to finish building the brochure. Nicole's written the copy, but I still need to turn it into a flyer. That's on the top of my list for tomorrow. Here's some pictures from the last two days:\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/072405/upload1.jpg\" width=\"425\" />\r\n\r\nThe painting of the ceiling continued in full force yesterday. Everyone (myself, my dad, and my uncle Larry) took turns using the awesome spray gun. It's so fun that no one wanted to stop spraying!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/072405/upload2.jpg\" width=\"425\" />\r\n\r\nHere I am awaiting my turn with the spray gun.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/072405/upload3.jpg\" width=\"425\" />\r\n\r\nAnd again, here's uncle Larry and I patiently awaiting our turn to paint the ceiling. Dad turned out to be a spray gun hog.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/072405/upload4.jpg\" width=\"425\" />\r\n\r\nIn the end, as evidenced by the next few shots, the ceiling ended up looking pretty darn good.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/072405/upload5.jpg\" width=\"425\" />\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/072405/upload6.jpg\" width=\"425\" />\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/072405/upload7.jpg\" width=\"425\" />\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/072405/upload8.jpg\" width=\"425\" />\r\n\r\nOnce we were finished painting, we'd clean our brushes and rollers in the bathtub... yuck. Anyone want to take a bath in here?!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/072405/upload9.jpg\" width=\"425\" />\r\n\r\nMy job today was to recover the overspray with primer. This is what it looked like before I started...\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/072405/upload10.jpg\" width=\"425\" />\r\n\r\n... and this is what it looked like afterwards.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/072405/upload11.jpg\" width=\"425\" />\r\n\r\nThe auditorium is completely painted (two coats), except for the boards on the west wall.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/072405/upload12.jpg\" width=\"425\" />\r\n\r\nI even took the time to autograph the ceiling with my roller!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/072405/upload13.jpg\" width=\"425\" />\r\n\r\nNothing completes a hard day's worth of painting like a cold bottle of beer. As you can see, all the men in my family like wearing hats.\r\n\r\nWell, that about does it. More painting tomorrow...\r\n\r\nI'm going to die from excess fume inhalation, aren't I?",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-25T08:46:10.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "is bathtub usage included in the founding membership?\r\nmovie and a wash?\r\n\r\nnice ceiling",
      "created_at": "2005-07-25T09:21:33.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "It would be a shame for you to die from excess fume inhalation when you're so close to opening! Nicole will have to carry on without you...",
      "created_at": "2005-07-25T09:45:44.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "That's about what my bathtub looks like after a screenprinting run.\r\n\r\nAnd we need to talk.",
      "created_at": "2005-07-25T17:14:37.000Z"
    },
    {
      "author": "JED",
      "body": "Dan I truly enjoyed the blog today. \r\nKeep up the good work. I was involved in a shooting on Friday. I didn't get shot... well, no one got shot.....That seems to happen often. Criminals should be trained on the finer art of shooting. I swear everytime I try to shoot someone, I hit them. \"Thugs\" these days. They should throw rocks instead. Good work on the painting. ",
      "created_at": "2005-07-25T21:14:11.000Z"
    },
    {
      "author": "Oz",
      "body": "I've got a ceiling that needs to be painted.  In your spare time, do you think you could swing by Philadelphia with your spray gun and knock it out for me?  I'll give you a beer when you're done...",
      "created_at": "2005-07-25T22:22:34.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
