{
  "id": 266,
  "title": "Day 15: Prime this!",
  "body": "More priming. Not much more to report. I primed all the overspray, with help from <a href=\"http://justin.commonelectric.com\" target=\"_blank\" class=\"broken\">Justin</a> and <a href=\"http://www.sweetwaterabilene.com\" target=\"_blank\" class=\"broken\">J.R.</a>. I also meant to send out the official Founding Membership e-mail today, but I couldn't come up with a good handout. Enter Mr. <a href=\"http://www.morawk.com\" target=\"_blank\" class=\"broken\">Aaron Scott</a> (our logo designer). He took all the copy and built a great little flyer that we're going to pass out during the First Friday Artwalk on August 5th. Thanks Aaron! I hope to send out the official e-mail tomorrow.\r\n\r\nNot much else to report. More tomorrow.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-26T10:33:00.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "oh boy!\r\n.. have my long lost sticker handy too\r\ni asked off work.. for artwalk\r\nso ill definately be stopping by",
      "created_at": "2005-07-26T10:48:22.000Z"
    },
    {
      "author": "bjork24",
      "body": "Will do",
      "created_at": "2005-07-26T20:32:02.000Z"
    },
    {
      "author": "Godard",
      "body": "I have been eagerly awaiting the opening for some time now.  I applaud your efforts.  A buddy and I tried to start a Springfield area arts review bi-monthly magazine, but after the planning meeting and a couple of bottles of vino we decided it would be too much work.  All that to say, I am pleased that someone around here has the capacity to chase their ambition with action.",
      "created_at": "2005-07-27T00:36:23.000Z"
    },
    {
      "author": "Fyse",
      "body": "Seems like ages since I was last here, and I've missed out on SOOO much. I've only got a short time at a computer, so I've had to skim read. The 'Founding Members' scheme sounds very exciting. So typical that I'm without a computer just when things start moving so quickly. Keep up the good work, and I hope to pop in again soon!",
      "created_at": "2005-07-27T02:14:19.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
