{
  "id": 267,
  "title": "Day 16: I bet you can't guess what we did today",
  "body": "WE PAINTED LIKE THE WIND! Yes, it's true. The painting will never end. Never ever ever. <a href=\"http://justin.commonelectric.com\" target=\"_blank\" class=\"broken\">Justin</a> and I finished the first coat of red paint on the outer shell of the auditorium while the electricians busied themselves with fixture installments (woo hoo!). I also met with the ceiling guy (Bob) and told him we were finally ready to install the grid for the drop ceiling. He said \"okay\" and I said \"when can you do it?\" and he said \"Thursday\" and I said \"okay\" and he said \"see you then\" and I said \"yep.\" It was a very lively conversation.<br/><br/>After the meeting with the ceiling guy (Bob) was over, it was time for more painting. The only thing that's worse than trimming the top of a 13 foot wall while standing on a wobbly ladder is trimming the top of a 13 foot wall while standing on top of a wobbly ladder with hemorrhoids. The ladder had hemorrhoids, not me. It was complaining all night long!<br/><br/>We also met with <a href=\"http://www.morawk.com\" target=\"_blank\" class=\"broken\">Aaron</a> tonight to discuss the Founding Membership flier. He finished it last night and it looks great! We'll be printing out a few copies tomorrow to give to certain people (mainly Bucky), although the majority of them will be handed out during the upcoming First Friday Artwalk. I also found time to finish the membership portion of the website today. You can check it out here: <a href=\"http://members.moxiecinema.com\" class=\"broken\">http://members.moxiecinema.com</a>, but try to keep it on the down-low until it goes public tomorrow in our newsletter.<br/><br/>We have another exciting day ahead of us tomorrow. We're meeting with our insurance agent in the morning to make sure everything is still in order with our insurance package. Then more PAINTING! Followed by even more painting! And finished off with a nice cold can of paint. Ah, refreshing!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-27T08:14:17.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "ering",
      "body": "someone want to lend me $500.00 ?<br/>:P<br/><br/>happy painting!",
      "created_at": "2005-07-27T09:07:36.000Z"
    },
    {
      "author": "erin",
      "body": "whoops. NO 'g' is suppost to be in my name. im not a gangster. is that even what 'g' stands for?",
      "created_at": "2005-07-27T09:08:47.000Z"
    },
    {
      "author": "Tom",
      "body": "Painting is definitely underrated as a physical activity.  It is up there with running a marathon.",
      "created_at": "2005-07-27T17:04:30.000Z"
    },
    {
      "author": "Godard",
      "body": "Asa Nisi Masa.",
      "created_at": "2005-07-27T18:56:46.000Z"
    },
    {
      "author": "Nate",
      "body": "That last was almost a palindrome, but not quite.  This post is though.  Hguoht sit sops ihteti uq ton tube, mord nila pats omlasawt salt aht.",
      "created_at": "2005-07-27T22:02:50.000Z"
    },
    {
      "author": "Maddy",
      "body": "racecar<br/><br/>I love that word.",
      "created_at": "2005-07-27T22:07:01.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "My brother's band (Dear Augustine) will be playing a show with Playing with Matches in Springfield tonight. The show will be at Nathan P. Murphy's, I believe. Springfield is the first stop on their two week tour. I would have gone along but I'm supposed to be getting ready to move...",
      "created_at": "2005-07-27T22:19:16.000Z"
    },
    {
      "author": "Godard",
      "body": "Asa Nisi Masa ... from Fellini's 8 1/2.",
      "created_at": "2005-07-27T23:00:19.000Z"
    },
    {
      "author": "Nate",
      "body": "Mecca Lecca Hi Mecca Hiney Ho.<br/><br/>From Pee Wee's Playhouse.",
      "created_at": "2005-07-28T00:34:38.000Z"
    },
    {
      "author": "Yoda",
      "body": "\"Wars not make one great.\"<br/><br/>Mine, that is.<br/><br/>The day, back in, profound I could be.",
      "created_at": "2005-07-28T00:38:03.000Z"
    },
    {
      "author": "JED",
      "body": "Nate, that brought back so many memories. Thank you for that.lmao",
      "created_at": "2005-07-28T00:42:55.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
