{
  "id": 268,
  "title": "Day 17: Paint and pain",
  "body": "Today was, in most instances, no different than yesterday. More painting. A few notable differences:<br/><br/><ol><li>I met with our insurance agent. Everything's still good to go.</li><br/><li>Nicole's friend Melissa made a surprise vist from St. Louis. Nicole's happy meter is off the charts!</li><br/><li>The Founding Membership fliers are completely finished. Thanks Aaron!</li><br/><li>I just finished my second article for Inc.com, and I think it's pretty dang good.</li></ol><br/>Tomorrow should be a bit more eventful. The drop ceiling grid is being installed in the morning, and I'd like to finish the second coat of red on the outside of the auditorium. I'll remember to take my camera with me tomorrow so I can show you the progress. Other events to look forward to this weekend: installing the screen, picking up our third and final refrigerator, and buying more paint! Woo hoo!<br/><br/>I'm so tired.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-28T08:53:32.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "woo fun!<br/>thats alot of fridges..<br/>i built a refridgerator today... <br/>as well as a stove..  <br/>both of course in the 3d land inside my computer.. soley because materials cost less there",
      "created_at": "2005-07-28T08:57:42.000Z"
    },
    {
      "author": "matt",
      "body": "where's the pain?",
      "created_at": "2005-07-28T09:30:24.000Z"
    },
    {
      "author": "whittler",
      "body": "<b>drop ceiling grid</b> would be a cool name for a bar; or a band; or my room. I'm doing up the sign right now.",
      "created_at": "2005-07-28T16:32:04.000Z"
    },
    {
      "author": "Caleb",
      "body": "Will you be at the Moxie this evening painting? If so, I was going to drop by and give you the poster. ",
      "created_at": "2005-07-28T19:26:13.000Z"
    },
    {
      "author": "nicole",
      "body": "Dan will be there until about 6:30 or 7pm, Caleb. I just left. Painting ceilings is the worst thing. Ever.",
      "created_at": "2005-07-29T02:12:22.000Z"
    },
    {
      "author": "Caleb",
      "body": "Do you know where liars go?<br/><br/>Cause I do. Cause I'm one of them! Sorry for not coming by today. Car trouble. I swear I will get  there sometime soon!",
      "created_at": "2005-07-29T03:31:24.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "I love the founding member program. But are you guys still going to have the Friends of the Moxie or whatever it was membership thing as well?",
      "created_at": "2005-07-29T04:44:42.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
