{
  "id": 27,
  "title": "Close call",
  "body": "The project hit a stumbling block over the weekend... or so it seemed. I sent the theater's floorplan to our equipment dealer on Friday in hopes of getting some feedback from him regarding how deep we needed to make the wall that the screen would be displayed on. After viewing the layout, our dealer replied that our auditoriums were too narrow. Uh oh. \"What do you mean too narrow?\" I asked. Way too narrow, it turns out.<br/><br/><i>Most</i> theaters follow a golden rule when laying out their auditoriums, which is to always make sure that the width is in proportion to the depth of your theater. At the very least, your theater width to depth ratio cannot be skinnier than 1:1.5 - ours was somewhere around 1:2.5, and according to our dealer, no one would want to see movies in a theater like that, especially if we were only going to have a 10 foot screen. Ouch.<br/><br/>I was crushed. Why hadn't I thought of this before? I'll tell you why - because our dealer was reading the schematic incorrectly. He was assuming that our auditoriums were only 13 feet wide, which, after allowing room for the exit door, would only give us a screen width of 10 feet, maximum. In reality, the auditoriums are roughly 17 feet wide, giving us 13 feet for our screen. Phew. That was a close call.<br/><br/>Still, even though our screens will be wide enough for an enjoyable movie-watching experience, could they be wider? My imagination had been sparked. Just how wide could our screens be? Well, if we move our exit doors to the side wall, as opposed to beside the screen, we could add on an additional 3 to 4 feet, giving us a maximum screen size of 17 feet... that's more like it. I relayed this information to Andrew, who will relay it to the architect, who will hopefully be able to reconfigure the current layout to accommodate a couple 17 foot screens.<br/><br/>The moral of today's post: bigger screens are always better, unless you have low ceilings, like us. Hmmm, maybe 13 feet is the big enough after all. The saga will continue.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-06-29T02:59:21.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Sandra",
      "body": "I don't think bigger is always better. I went to see Harry Potter (the first time in a commercial theater since LOTR3) and the screen was sooooooo huge, I found that i was only looking at Harry's button. I couldn't see the entire picture.  It was bizarre!  I've also  been to a basement cinema with 50 seats and the screen was no larger than some TVs.  If people got up to get more popcorn, their silhouette was in the picture. It was a cozy adventure. There's no right or wrong as long as the presentation is the best that it can be given what you have to work with.",
      "created_at": "2004-06-29T04:34:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yeah, we're going more for the whole \"small and cozy adventure.\"",
      "created_at": "2004-06-29T05:42:41.000Z"
    },
    {
      "author": "barrie",
      "body": "This is just to let you know that Cinema 24 was nominated via write-in ballot for The Pink Bee Best Blog 2004 (summer) contest.<br/><br/>People may visit www.thepinkbee.com and follow the link at the top to vote.<br/><br/>Congratulations and good luck!<br/><br/>Winners will be announced on 5/7/04",
      "created_at": "2004-06-29T05:54:41.000Z"
    },
    {
      "author": "bjork24",
      "body": "Cool.",
      "created_at": "2004-06-29T06:03:51.000Z"
    },
    {
      "author": "Newell",
      "body": "I think a big screen only truly becomes too big when you sit too close to it. I don't know the dimensions of the screens at my local cinema, but I've noticed that the best place to watch them (to me at least) is toward the front-middle of the theater, going front to back. If you sit way back in the last rows, it seems like you're too far way and there's way too much extra stuff in my peripheral vision. If you sit too near the screen, you can't even fit the whole thing into your view, and if you're right up front, you can see up the actors' noses. Not a good thing.",
      "created_at": "2004-06-29T06:33:30.000Z"
    },
    {
      "author": "FisherKingKQJ",
      "body": "The specs misreading is a common thing.  Sometimes the specs readings are so bad the chance to innovate goes spare.  Ie, analogue HDTV in the 70's which should've coincided nicely with the drop in theatre going and the rise in multiplexes.",
      "created_at": "2004-06-29T07:03:38.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "I agree with Newell, if you have to sit very close to the screen, bigger is not so great. There must be some formula to figure out the optimal distance the front row should  from a screen that's X feet wide.",
      "created_at": "2004-06-29T07:04:07.000Z"
    },
    {
      "author": "shiju",
      "body": "hi,<br/><br/>first visit to your page and i must say this is inspirational stuff. am not sure i can help much with finance but if i can help with writing a b plan or fund flow and such kind of silly stuff, i would love to help.. but i think you would have done all of that already!<br/><br/>all the best!",
      "created_at": "2004-06-29T10:56:09.000Z"
    },
    {
      "author": "John",
      "body": "I gotta say, while I enjoy going to smaller independent theatres, one thing that I really hate is a small screen. I say make it as big as you can without ruining the auditorium aesthetic.",
      "created_at": "2004-06-29T11:07:50.000Z"
    },
    {
      "author": "James",
      "body": "I remember when I went to the sneak preview of The Matrix Reloaded, I was forced to sit in the front row and was horrified for 2 hours by Laurence Fishbourne's lunaresque face.  I did not enjoy that at all...",
      "created_at": "2004-06-29T12:57:56.000Z"
    },
    {
      "author": "Oz",
      "body": "What are you doing to get all that cash you need?  Did the building owner or whoever decide to become partners with you and Nicole?",
      "created_at": "2004-06-29T17:32:19.000Z"
    },
    {
      "author": "bjork24",
      "body": "Lots of good points, guys. Thanks.<br/><br/>Oz - Yes, the building owners will act as silent partners for the theater. They're going to roll our start-up costs into the construction loan for the building.",
      "created_at": "2004-06-29T18:39:28.000Z"
    },
    {
      "author": "justin",
      "body": "Rolldogs.",
      "created_at": "2004-06-29T19:46:45.000Z"
    },
    {
      "author": "david",
      "body": "im glad it fit.It would cost a pretty penny to make your veiwing rooms bigger.Well i hope u dont run in to anymore poblems.I have a ? i was wondering how many seats are in the auditoriums. good luck with the theater<br/><a href=\"http://theworldaroundtheworld.blogspot.com\">Here Check Out This Link</a>",
      "created_at": "2004-06-29T20:00:21.000Z"
    },
    {
      "author": "bjork24",
      "body": "Sixty-five seats per auditorium.",
      "created_at": "2004-06-29T20:10:09.000Z"
    },
    {
      "author": "Stefan",
      "body": "One of the local arthouses here has a room they call the \"Screening Room,\" which causes us to groan if we get put in there.  Part of that is expectations -- I would much rather see a movie on a much bigger screen.  But since you don't have another option, I would just do what you can to expand the screen size...",
      "created_at": "2004-06-29T21:34:19.000Z"
    },
    {
      "author": "Oz",
      "body": "Wow!  That means that this is actually going to happen!  I don't know where I missed it, but I thought you were still working on the money along with everything else.  Great news.  Now I will have to plan on visiting Midwestburg (wherever that is).",
      "created_at": "2004-06-29T22:34:36.000Z"
    },
    {
      "author": "bjork24",
      "body": "The reason I hadn't talked about our new financial agreement is because nothing's been signed yet, and until I put my John Hancock on the line, everything's still up in the air.",
      "created_at": "2004-06-29T22:41:49.000Z"
    },
    {
      "author": "anonymous",
      "body": "Yes, never announce until the signature is dry. And until the check clears the bank. :) Have learned that the hard way.<br/><br/>As far as screen size, the Screening Room in NYC has very narrow auditoriums. It isn't that big of a deal. You see, they also allow for bench seating (so you can snuggle with your honey) and they show films you can't see anywhere else. It's a quesiton of aesthetics...people will get used to it. And maybe come to love it.",
      "created_at": "2004-06-30T03:23:23.000Z"
    },
    {
      "author": "Sandra",
      "body": "The Screening Room on Varick St. closed :(<br/><br/>Do I have this right? (i'm a tad tired) Your population is 400,000, four colleges near by and you're the only indie house in town?",
      "created_at": "2004-06-30T09:29:12.000Z"
    },
    {
      "author": "bjork24",
      "body": "You are correct, Sandra.",
      "created_at": "2004-06-30T17:26:14.000Z"
    },
    {
      "author": "Bill",
      "body": "Yes, there is a formula and it's in relation to the height of the screen, not the width as that's always variable, dependent on the film format/aspect ratio of each title shown. Generally, 1 1/2 to 2 times the height is the preverable seating area and never to exceed four times the height, otherwise, ya may as well be watching TV, dontcha know. If a theatre has a 15 ft. high screen, any seats from the screen to 15 ft. out are  there to increase seat count and really are much to uncomfortable to watch anything. Newer theatres respect this ratio and that's why you see such a large, empty area in front of the screen. It might seem like a waste of valuable space, but it's not. I'd think it particularly important to follow this formula, especially in an art house. There's gonna be some really fincky, presentation gurus attending, more than one might imagine.",
      "created_at": "2004-07-04T07:46:03.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
