{
  "id": 270,
  "title": "Day 19: Almost 2/3 of the way there",
  "body": "Today = more painting. We finally chose the color for the art wall - it's a light gray with a slight hint of purple. Sounds pretty nasty, huh. You have to remember that I'm terrible at describing colors. I guess you'll just have to see it for yourself. Small sentences are great. Anyways, long story short, lots of painting was finished today. I'm hoping ALL the painting will be done be early next week so I can start looking for a plumber. I lost mine.\r\n\r\nOn the plate for tomorrow: my uncles Larry and Sonny are going to put up the screen frame. It requires a bit of steel manipulation, so Sonny (who happens to be a master welder) is going to bring over his power tools and set things right... once and for all. Dad is going to finish trimming out the stage and build a couple faux columns in the art hall, while my mom straightens all the stuff we mess up. Nicole and I will (you guessed it) paint, paint, PAINT! Another big thanks to Justin and Kelley for helping us paint today.\r\n\r\nOnly one week until First Friday! Are you psyched? Do you think the theater will be presentable by then? I hope so. I'm tired. The physical act of painting is worse than most, if not all, contact sports... even worse than that American Gladiators game where they threw balls at each other.\r\n\r\nOh yeah, my new Inc.com post is up. Read it <a href=\"http://blog.inc.com/archives/2005/07/29/diary_of_a_startup_fundraising_tactics.html\" target=\"_blank\" class=\"broken\">here</a>!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-07-30T07:46:58.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "Still no comments? Hmmph! I just wanted to say that your founding member logo is quite swell. However, please tell me the brightness is just extremely high on that picture and that the seats aren't pink. Heh heh.",
      "created_at": "2005-07-31T03:21:39.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
