{
  "id": 272,
  "title": "Day 21: Weekend posts suck",
  "body": "Writing a post every single day is really starting to take a toll on me. $1.20 to be exact.\r\n\r\nLet's see... what happened over the weekend? More painting (obviously), the screen frame was assembled and immediately modified (to allow room for the stage), shielded speaker wire was run throughout the auditorium, Dad built some faux columns on the art wall, Mom cleaned the bathrooms, we started installing the drop ceiling behind the Cinebar, etc., etc., etc.. To tell you the truth, all the work is starting to kind of blend together. Good thing I brought a camera!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/073105/upload1.jpg\" width=\"425\" />\r\n\r\nThis is our third and final refrigerator. We picked it up on Saturday, and now it's resting peacefully in the lady's restroom.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/073105/upload2.jpg\" width=\"425\" />\r\n\r\nHere's the screen frame. It doesn't look like much now, but wait until we stick the screen on it... and lift it off the ground!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/073105/upload3.jpg\" width=\"425\" />\r\n\r\nHere's Dad threading some speaker wire.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/073105/upload4.jpg\" width=\"425\" />\r\n\r\nThis is a nice shot of the back of my Uncle Larry's head as he's telling me where I need to run the wire for the side speakers.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/073105/upload5.jpg\" width=\"425\" />\r\n\r\nLook! The speakerboxx is actually holding a speaker!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/073105/upload6.jpg\" width=\"425\" />\r\n\r\nThese are the columns that Dad built out of a spare sheet of 5/8 inch sheetrock, some discount wood trim, and old wads of chewing gum.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/073105/upload7.jpg\" width=\"425\" />\r\n\r\nHere's a detail of the top of the column. If you look to either side of the column, you can catch a glimpse of the paint color we used for the art wall.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/073105/upload8.jpg\" width=\"425\" />\r\n\r\nEven my little cousin Nicole got in on the cleaning action! Here she is scrubbing away in the restroom.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/073105/upload9.jpg\" width=\"425\" />\r\n\r\nAnd this is what it looked like after Mom and Little Nicole finished. You could eat spaghetti off that toilet bowl... and I should know!\r\n\r\nWoo hoo! I'm going to bed.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-08-01T08:14:49.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Zach",
      "body": "Is this a sweat shop? Did your cousin sew some soccer balls together as well? Ha.\r\n\r\nThanks for the updates...",
      "created_at": "2005-08-01T08:41:32.000Z"
    },
    {
      "author": "JED",
      "body": "I love the new post. Oh and I'm throwing a party at Hermosa Beac if anyone wants to come. There is going to be a wet Moxie Shirt contest. Thats it. ",
      "created_at": "2005-08-01T09:18:07.000Z"
    },
    {
      "author": "brian of moore",
      "body": "hah.. aww.. poor kid\r\ni fear the back of my head may some day look like your uncle's... tis sad\r\nmay be a while.. but i know its coming\r\nanywho.. very nice columns your dad made\r\nand im also enjoying the art wall color\r\nthree cheers! hip hip... hooray!!\r\n(someone else can do the other two.. im exhausted as well... gnight)",
      "created_at": "2005-08-01T09:23:20.000Z"
    },
    {
      "author": "erin",
      "body": "2. hip hip hooray!!\r\n3. hip hip hooray!!\r\n\r\ncant wait to see it all on friday!",
      "created_at": "2005-08-01T09:54:53.000Z"
    },
    {
      "author": "Dave",
      "body": "you gonna put tile down on that bathroom floor? i ask because i just retiled my bathroom floor so I've got tile on the brain.",
      "created_at": "2005-08-01T16:03:23.000Z"
    },
    {
      "author": "Nate",
      "body": "Again, I am rendered speechless.",
      "created_at": "2005-08-01T16:50:05.000Z"
    },
    {
      "author": "Tom",
      "body": "The Moxie Train is charging to the station.  Way to go.",
      "created_at": "2005-08-01T17:09:12.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "The columns look great. Was that the solution to cover up that one spot on the art wall where the plaster was removed?",
      "created_at": "2005-08-01T17:17:22.000Z"
    },
    {
      "author": "bjork24",
      "body": "The bathrooms will probably have vinyl laminate... the floors aren't level enough for tiles.\r\n\r\nYes, the columns were built to hide the junky parts on the art wall.",
      "created_at": "2005-08-01T18:07:50.000Z"
    },
    {
      "author": "ron",
      "body": "If I'm a founding member, will I be entitled to a once-a-year ad every year? Forever? Also, If my name is on a chair, will it be put on any new chairs that subsequently replace the old chairs? ",
      "created_at": "2005-08-01T19:33:47.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ron: that's right. You'd be entitled to an ad that would run for one day for as many years as you'd like to run them. Of course, as mentioned on the member site, the ads would be subject to approval.\r\n\r\nIf we upgraded to new chairs, I doubt the names would be transferred... mainly because the chair count would probably differ. If that situation arose, we'd offer the original chairs to the members and remind them that their name will remain on our Founding Member plaque in the lobby.",
      "created_at": "2005-08-01T19:43:14.000Z"
    },
    {
      "author": "Tim",
      "body": "Wow, your dad did a great job on those columns!",
      "created_at": "2005-08-02T02:34:24.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
