{
  "id": 274,
  "title": "Day 22: It's finally looking like a theater",
  "body": "The theater really started to take shape today. It's amazing what dramatic lighting and additional coats of paint can do to an old bank. Tomorrow will be one of the most important days in the life of the Moxie - the projector installer will be down. He's not actually installing anything tomorrow (it's just a site review), but he will be passing judgment on all the work we've done thus far. What will I do if he steps into the projection booth and says, \"Nope. This is far too small. It's not going to work.\" I'd probably blurt out some random word and then stick my finger into the power panel.\r\n\r\nHUSKER DU! *sticks finger in panel* Bzzzzzt\r\n\r\nI hope it doesn't come to that.\r\n\r\nEither way, dead or not, I'm still nervous. My face is breaking out like Clint Eastwood with a papier-mache dummy head. It's terrible. I won't even talk about the fire down below... you know, that movie with Steven Segal.\r\n\r\nSo, I met with some plumbers today. The first crew was a little shady - as in, they threatened to shoot me if I didn't hire them - but the second plumber was perfect. If I had a dream plumber, the second guy would be it. His quote was half the price of the first dude's bid, AND he didn't smell like stale funnel cakes. As it turns out, the dream plumber had already done work in our building... back when Andrew and Doug bought it in 2001. He's already familiar with our pipes (insert dirty joke here). The first plumber is going to kill me, isn't he.\r\n\r\nSo, here are today's pictures:\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/080105/upload1.jpg\" width=\"425\" />\r\n\r\nSee what I mean?! The lighting really pulls things together!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/080105/upload2.jpg\" width=\"425\" />\r\n\r\nCheck out the art hall! Don't you think the red wall would look good with some BIG vintage posters on it? Each one with it's own spot light! That would be AWESOME!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/080105/upload3.jpg\" width=\"425\" />\r\n\r\nHere's Dad installing the drop ceiling behind the Cinebar.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/080105/upload4.jpg\" width=\"425\" />\r\n\r\nMore Cinebar drop ceiling.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/080105/upload5.jpg\" width=\"425\" />\r\n\r\nAnd this is what the men's restroom will look like. The right wall will have a giant collage of actresses on it, but I haven't gotten around to making that yet. There will also be a pee pee guard that sits behind the toilet, thus the large square of unfinished wall.\r\n\r\nBig thanks to Justin (as per usual) and Mom and Dad's friend John, who both helped paint today. Nicole spent the day doing administrative stuff like contacting food suppliers, e-mailing film distributors, working out our schedule with Paul, and eating bon bons on the couch. My Mom and Dad have been helping nearly every single night (especially Dad, who's been helping nearly every single night since JANUARY), so a HUGE thanks goes out to them as well. It's really starting to come along, folks. Can you feel the excitement?!!!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-08-02T07:17:51.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "i can feel it\r\nwould it have been better or worse if the dream plumber was dressed up like mario (or luigi)\r\nif he was dressed like toadstool that would be odd\r\n\r\nahem .. snazzy lighting.. i dig it\r\nvintage posters sounds fun\r\na pee pee gaurd behind the toilet?\r\nhow will he fit?  i apprieciate the offer.. but ive been doing fine without a gaurd for 25 years.. (golly im witty/lame)  speaking of breaking out.. i have a big zit on my nose... i dont think ive even owned any sort of zit cream in like 5 years... so where did this come from?  i mean sure my car is broke down and its around 700 altogether to fix it.. and without my car i cant work.. and without work i cant afford 700 dollars... but does stress really cause acne? hmm\r\n",
      "created_at": "2005-08-02T10:23:19.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "Looks good! I can't wait to come and see it.",
      "created_at": "2005-08-02T17:00:37.000Z"
    },
    {
      "author": "Stephanie",
      "body": "It looks...wonderful.  Really, it does.",
      "created_at": "2005-08-02T19:32:40.000Z"
    },
    {
      "author": "Caleb",
      "body": "Ooh, I like the lights! And that pee-guard will really be something!",
      "created_at": "2005-08-02T20:18:42.000Z"
    },
    {
      "author": "Caleb",
      "body": "And yes, stress is a known cause of acne and breakouts. I blame it on the chlorophyll though. I dropped $700 on my car last week, and so I've had a run of zittery lately too. ",
      "created_at": "2005-08-02T20:21:16.000Z"
    },
    {
      "author": "erin",
      "body": "the moxie is drama. drama is the moxie.\r\n\r\nLOVE the red walls.\r\nim super glad you went with a light grayish color for a art wall.\r\n\r\npeople WILL get to walk around and look inside the moxie on friday yes? or do we just get to peak in?",
      "created_at": "2005-08-02T20:26:49.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Plumbing? Now you guys can stop pissing in the alleyway.",
      "created_at": "2005-08-02T22:57:08.000Z"
    },
    {
      "author": "cr",
      "body": "Once I was a dedicated lurker on the moxie blog. I'm ashamed to admit it's been a few months since I last checked in. Just wanted you both to know I'm suitably guilty for being so distant and will never stray again (grovel grovel). That said: Things are truly looking fabulous! Especially dig those columns, very classy. Wish MY dad was that handy with old chewing gum and sheet rock. ",
      "created_at": "2005-08-03T05:49:41.000Z"
    },
    {
      "author": "nathan springer",
      "body": "looking amazing, the pee pee guard is great but i think i am more worried about the poeple looking at me as i face that large window. maybe some shades are coming?",
      "created_at": "2005-08-03T22:37:55.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
