{
  "id": 275,
  "title": "Day 23: Site review = success",
  "body": "The site review went better than expected. Our projector installer was quite impressed with our little theater. He set my mind at ease by telling me that our projection booth was not the smallest he'd installed in. I told you it wasn't THAT small! He'll be back in exactly two weeks to do the installation. In that time, we have to install the chairs, the soundproofing curtain, and the carpet. Aye! The rest of the day was spent painting and setting up our film schedule for September (!!!).\r\n\r\nThe plumber will be dropping by tomorrow, and he's supposed to be done by Friday... we shall see. I'm tired.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-08-03T08:01:14.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "Oh come on! You can't tease us by saying you were setting up a film schedule and then not tell us what is on it! It's torture!!!\r\n\r\nOh, and if you got some little signs made about your grand opening I would gladly post them around the MSU campus for you. I don't know if there are rules about advertising businesses or not, but it would get the word out.",
      "created_at": "2005-08-03T08:43:13.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "I guarantee business ads are all over the place on public bulletin boards at SMS, so have at it. I may be able to do some of this as well. Moxie Street Team represent!",
      "created_at": "2005-08-03T09:12:32.000Z"
    },
    {
      "author": "Zach",
      "body": "Great news on the nod from the installer. I believe the Moxie is at ramming speed!",
      "created_at": "2005-08-03T10:30:41.000Z"
    },
    {
      "author": "Mark",
      "body": "Is the screen up? I wanna see the screen!\r\n\r\nM",
      "created_at": "2005-08-03T13:31:45.000Z"
    },
    {
      "author": "Nate",
      "body": "Excellent.  Now all you need is a proper R2 unit to lock the stabilizers down!",
      "created_at": "2005-08-03T17:09:06.000Z"
    },
    {
      "author": "nicole",
      "body": "Caleb - we have a tentative schedule of films lined up. But it's going to be a secret until the calendar comes out. We don't want the competition to pick up on what we're showing!",
      "created_at": "2005-08-03T17:18:03.000Z"
    },
    {
      "author": "hmmm....",
      "body": "I bet we'll all be surprised to see Campbell 16 start showing more and more indie flicks starting this fall...",
      "created_at": "2005-08-03T18:12:15.000Z"
    },
    {
      "author": "Caleb",
      "body": "Even if Campbell did pick up more indie flicks, who would pick them over the Moxie? I understand though, Nicole. Campbell has a rough time getting limited releases anyway, especially once they have competition from you. The studios prefer art-house!\r\n\r\nOh and question about tickets: will you be able to buy them in advance? I am worried you guys will be sold out all the time (or at least Fridays and Saturdays) and was wondering if there will be a way to guarantee a seat online.",
      "created_at": "2005-08-03T18:27:28.000Z"
    },
    {
      "author": "Nate",
      "body": "Actually, I was surprised to see the penguin movie at Campbell 16...top billing even, over Stealth and what not.  I would LIKE to think this is because they feel The Moxie breathing down its corporate scrubbed neck, and that this represents a growing diversity in not just the local market, but the national market as well, as we move into this new age where everything is available to everybody, all the time, via globalization and media fragmentation.\r\n\r\nBut probably it's because the penguin movie is the big baller right now.",
      "created_at": "2005-08-03T20:03:08.000Z"
    },
    {
      "author": "DUG",
      "body": "Theater looks amazing man!  I can allready smell the sweet taste of victory...well for you.  I'll stop by tonight and see what's the haps!",
      "created_at": "2005-08-03T20:07:33.000Z"
    },
    {
      "author": "Baptiste",
      "body": "Loved the pictures. Congrats for your blog. Hello from Paris, France (a group of french filmmakers)",
      "created_at": "2005-08-03T20:25:08.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "I just got a new pair of Nikes!",
      "created_at": "2005-08-03T21:58:07.000Z"
    },
    {
      "author": "Paradox",
      "body": "First time commenter here. Just found your site last week -- I spent my lunch hours catching up with your earlier posts (whew!). You're a true inspiration, Dan, and I see you are backed up by loyal, good-hearted supporters. Just by reading your comments, I feel like you're all one big family.\r\n\r\nThe Ragtag may have sparked inspiration for the Moxie, but it's the Moxie who sparks the inspiration for my new theater. \r\n\r\nI'll be checking your site regularly, and keep rooting for your success.  ",
      "created_at": "2005-08-03T20:34:10.000Z"
    },
    {
      "author": "Caleb",
      "body": "Maybe not family, I would say \"cult\" is a more proper term. We're just waiting for a good comet to come along...",
      "created_at": "2005-08-03T20:43:25.000Z"
    },
    {
      "author": "J.R.",
      "body": "Pathetic...\r\n\r\n\r\nIS IT?!",
      "created_at": "2005-08-03T23:08:48.000Z"
    },
    {
      "author": "Mark",
      "body": "Oh yeah, did you get the poster?\r\n\r\nM",
      "created_at": "2005-08-04T02:45:01.000Z"
    },
    {
      "author": "hmmm....",
      "body": "I would choose Campbell because it's cheaper. ",
      "created_at": "2005-08-04T03:37:25.000Z"
    },
    {
      "author": "Nate",
      "body": "Please do!",
      "created_at": "2005-08-04T03:39:33.000Z"
    },
    {
      "author": "nicki",
      "body": "oh man.. those pictures... did things to me that are not appropriate to discuss around polite company. haha. i can't wait!! ",
      "created_at": "2005-08-04T04:59:37.000Z"
    },
    {
      "author": "nicole",
      "body": "Mark - we got the poster. Thanks! I love stamps that say \"par avion.\" \r\n\r\nIs Campbell cheaper? Last time I checked, they were about the same price as we plan to be. ",
      "created_at": "2005-08-04T07:53:23.000Z"
    },
    {
      "author": "Caleb",
      "body": "But Campbell 16 doesn't have Dan & Nicole. And better yet, Campbell 16 doesn't have BEER! ;-)",
      "created_at": "2005-08-04T23:39:05.000Z"
    },
    {
      "author": "hmmm....",
      "body": "No, but they are OPEN...",
      "created_at": "2005-08-04T23:49:42.000Z"
    },
    {
      "author": "Scott",
      "body": "Yeah, but the Moxie won't have stupid jerks.\r\n\r\nOh, and The Shitxteen ran Hussle and Flow for at least a week a few weeks ago. Didn't expect that.",
      "created_at": "2005-08-05T07:03:45.000Z"
    },
    {
      "author": "Mark",
      "body": "Nicole - In that case, I'll find something else to send you.\r\n\r\nM",
      "created_at": "2005-08-04T13:23:29.000Z"
    },
    {
      "author": "nicole",
      "body": "I can't believe it's gone already! Well, I can, but still.",
      "created_at": "2005-08-05T15:56:07.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
