{
  "id": 277,
  "title": "Day 25: Five more days to go",
  "body": "Do any of you ever wish you'd bite into a syringe every time you eat a bean burrito from Taco Bell? I do. That's all I hope for these days. A syringe, a rat, a finger, ANYTHING! Taco Bell has much deeper pockets than me. That's a shame.\r\n\r\nToday was a bad day. It seemed like everything went wrong. Our plumber showed up, but our hand sink was wrong (it's a counter sink, not the kind you can mount on the wall), and our three compartment sink was missing two legs. What the funk, man! Can it get any worse? I hope not. Oh yeah, I also slit my finger open while pulling the tub out of the prep room. Yay for that! I would have pictures, but I was too stupid to remember to bring my camera.\r\n\r\nMan, today wasn't a good day. Good thing I finished it off by riding a mechanical bull for 10+ seconds. I'm AWESOME!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-08-05T09:17:51.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "I have pictures to prove it.  Dan, on a mechanical bull.  I'll post them tomorrow.",
      "created_at": "2005-08-05T09:35:48.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "Sweet! Maybe that's something to consider adding to the lobby.",
      "created_at": "2005-08-05T15:48:22.000Z"
    },
    {
      "author": "Jennifer",
      "body": "Hey - a mechanical bull, huh?  Sorry about the plumbing problems.  We have a babysitter lined up for this evening, and we are planning on swinging by the Moxie.  We're looking forward to seeing it and you.\r\n",
      "created_at": "2005-08-05T16:43:01.000Z"
    },
    {
      "author": "Nate",
      "body": "You guys are being included on CFP's regular First Friday map, aren't you?  I haven't seen this week's so I was just wondering...\r\nAlso, see about getting interviewed on KSMU's local Arts News feature at 10 a.m. on Fridays.  I don't think I've heard the Moxie mentioned once, but you/they just may be waiting until opening.\r\nSorry - you may have your thumb on all this, but I am a terrible backseat driver/theatre owner!",
      "created_at": "2005-08-05T19:14:10.000Z"
    },
    {
      "author": "justin",
      "body": "<a href=\"http://justin.commonelectric.com/?p=274\" target=_new>Photographic evidence of Dan riding a mechanical bull last night.</a>",
      "created_at": "2005-08-05T19:28:32.000Z"
    },
    {
      "author": "Nate",
      "body": "If that's \"evidence\" I have a blurry shot of bigfoot and some smudged lights that are UFO's to show you.  :)\r\n\r\nI kid, I kid.",
      "created_at": "2005-08-05T19:54:14.000Z"
    },
    {
      "author": "nicole",
      "body": "We're not officially part of the First Friday Art Walk, so our name won't be on any of the maps. When we open we may join.",
      "created_at": "2005-08-05T20:49:42.000Z"
    },
    {
      "author": "Zach",
      "body": "I guess this is a sign that the first movie the Moxie is going to feature will be \"Urban Cowboy.\"",
      "created_at": "2005-08-06T00:24:38.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Dan, to read your recent posts, one would think this 30 day thing was wearing you down.\r\n\r\nSTAND STRONG! When you open the theatre and both your workload and the complaints double, it will all be worth it!",
      "created_at": "2005-08-06T01:44:02.000Z"
    },
    {
      "author": "Dave",
      "body": "how much do you think you could make with adsense ads on the site? it's not as lucrative as suing TB, but it might generate some flow.",
      "created_at": "2005-08-06T03:00:44.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
