{
  "id": 278,
  "title": "Day 26: First Friday",
  "body": "Tonight's First Friday open house went spectacularly well. I think we may have had more people than we did last week! Of course, my entire day hasn't been all happy rainbows and pink jelly beans. Let me tell you how it started:<br/><br/>Our plumber said he'd be at the theater around 9:00, but he didn't show up until 9:45. I spent the down time building temporary wooden legs for our three compartment sink... you know, the one that was shipped with only TWO legs. After he finally showed up, I drove to Discount Lumber and bought an unfinished wall unit cabinet to hold our hand sink... you know, the one that was supposed to be bolted to the wall, but looked like it needed to be set in a countertop. I spent TWO hours modifying the cabinet - I cut off the top with a jig-saw, cored out the second shelf to make room for the p-drain, used treated lumber to raise the entire unit an extra 5 inches off the ground, nailed steel strips to the top to protect the unfinished lumber from any errant water, and tacked a piece of trim to the front to make it look purdy.<br/><br/>No sooner did I finish building the hacked sink base, we found the special arms to bolt the sink to the wall. *bites lip to contain profanity*<br/><br/>Does anyone have a need for a hollowed out, unfinished, wall cabinet? It doubles as a combination hooka and coffee maker... AND it makes Julian fries! Will not break! Will not - it broke.<br/><br/>Blah, blah, blah, blah. The rest of my day was filled with running errands, buying popcorn, buying bags for the popcorn, cleaning the theater, etc., etc., etc.. I was afraid First Friday was going to get rained out, thanks to a giant storm that blew into Springfield around 6:30. Luckily, the storm split up and avoided us altogether. Woo hoo for that! We were relying on a big turnout so we could pass out lots and lots of Founding Member fliers... which, we did. I'm not sure how many were picked up total, but if I were to take a guess, I'd say close to 4.3 million.<br/><br/>Let's see... what else happened? <a href=\"http://www.calebcopeland.com/blog/\" target=\"_blank\" class=\"broken\">Caleb</a> donated his <i>Sideways</i>poster to the Moxie poster collage, and Nate donated a couple of 700 mile range walkie-talkies. Thanks guys! Tomorrow will be filled with speaker installing, screen stretching, and lamb tackling.<br/><br/>Thanks again to everyone who stopped by tonight!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-08-06T09:26:27.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "Thanks for the link! And it was no problem. Stephanie got me a nice Pulp Fiction poster to replace it. The place looks awesome, can't wait for opening night!<br/><br/>And 4.3 million fliers, eh? Are you counting the \"cloaked\" people that no one else can see but you? I thought so.",
      "created_at": "2005-08-06T09:39:03.000Z"
    },
    {
      "author": "erin",
      "body": "the place looks spectacular. and i really dont know how to spell spectacular...<br/>anyhoo.<br/>you guys are AWWWWsome!",
      "created_at": "2005-08-06T10:04:11.000Z"
    },
    {
      "author": "brian of moore",
      "body": "jeepers.. thats alot of fliers<br/>thanks for remembering my sticker :-)<br/>as soon as the 1000 dollar problem with my car is fixed (wasnt it just 500 a few weeks ago?) and i finally get the car back.... i will proudly display the sticker on the back windshield as i deliver pizzas <br/>ie: free advertising!<br/>and as i said.. the place is looking great",
      "created_at": "2005-08-06T13:20:36.000Z"
    },
    {
      "author": "nicole",
      "body": "AND a special thanks to Justin and Kelley for being our popcorn scoopers and crowd controllers. ",
      "created_at": "2005-08-06T17:48:21.000Z"
    },
    {
      "author": "Jay",
      "body": "Yeah, the theater looks very cool.  Much bigger than it seemed in the photos.  Great to meet you, Dan and Nicole.  My babies munched your popcorn all the way home (that's not a euphimism...and I really don't know how to spell euphimism)",
      "created_at": "2005-08-06T21:15:57.000Z"
    },
    {
      "author": "Zach",
      "body": "Good to hear things went well. I was at Brew Co. last night and I think I came around just after doors closed. I wish I could have been a little faster and caught a look.",
      "created_at": "2005-08-06T21:31:41.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
