{
  "id": 279,
  "title": "Day 27: Inhaling Paint Thinner and Acetone",
  "body": "Let me tell you how great Nicole is. She never complains about painting, she cleans the floors by licking up the dirt, climbs really tall ladders to trim the top of the walls, works temp jobs during the day, and then goes home to do laundry, dishes, vacuum, and cook coconut chicken fingers. Simply amazing, she is.<br/><br/>But truth be told, this is actually Nicole writing this post. Poor Dan inhaled way too many fumes from paint thinner and acetone while cleaning the auditorium floors. He's currently passed out in the bathroom with a can of Natural Light in his right hand, and a bowl of cashew chicken in his left. I'm sure he's fine.<br/><br/>This is also my first post ever on Dan's beloved blog. The only reason I'm even on here is because Dan's in a coma and he told me how to post to his blog readers if he ever died. Hello Moxie Blog Readers!<br/><br/>As for our progress, the floor is looking nice and clean, and we purchased some gray carpet for the auditorium stage. Dan, his Dad, and his uncles worked on installing speakers, finishing the columns, and buffing the floor, while I walked around with a paint brush in my hand complaining about the smell. The plumbing was also finished, and if Dan wakes up before tomorrow evening, he'll post some pictures.<br/><br/>Wow. I've never had such a captive audience before. I feel like I should say something important... Free Tibet!",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2005-08-07T06:32:30.000Z",
  "author": "Nicole",
  "comments": [
    {
      "author": "Ole",
      "body": "Well done Nicole. If you hadn't disclosed I wouldn't have known the difference.  ",
      "created_at": "2005-08-07T06:42:06.000Z"
    },
    {
      "author": "erin",
      "body": "three cheers for nicole!<br/>hip hip hooray<br/>hip hip hooray<br/>hip hip.... hooooooorrrrrrrrrayyyyy!",
      "created_at": "2005-08-07T07:07:10.000Z"
    },
    {
      "author": "nathan",
      "body": "one time i licked a floor... it was tile...and dirty... true story, i know i am gross but hey i will do a lot for a laugh.",
      "created_at": "2005-08-07T08:00:38.000Z"
    },
    {
      "author": "Allison",
      "body": "Yay, Nicole!  I'm your biggest fan -- Super Fan #1!",
      "created_at": "2005-08-07T08:58:45.000Z"
    },
    {
      "author": "Jimmy",
      "body": "Hey, this is absolutely brilliant whether (a) it's Nicole or (b) Dan pretending to be Nicole.  So which is it?  Inquiring minds and all that....",
      "created_at": "2005-08-07T23:19:26.000Z"
    },
    {
      "author": "Oz",
      "body": "You never complain about painting?  That is special.  Painting is a pain in the ass.  Seems like it would be easy.  \"Oh, I'm just going to paint this door.\"  But then you spend umpteen hours caulking and spackling and taping before you can even open a can of paint, and all of a sudden, it's not such a little project anymore.  And that's just a door!",
      "created_at": "2005-08-08T04:29:24.000Z"
    },
    {
      "author": "brian of moore",
      "body": "the voice that i use for dan changed rather abruptly... ... that was a very good disguise... you had me going<br/>oddly the voice i use for nicole sounds just like nicole... and the voice i use for dan sounds more like billy crystal<br/>hmm.. not sure why that is",
      "created_at": "2005-08-08T05:56:13.000Z"
    },
    {
      "author": "Yoda",
      "body": "Always imitating, my voice people are!  An improvement this is, since most of the time speak backwards people do.",
      "created_at": "2005-08-08T17:35:39.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
