{
  "id": 28,
  "title": "Downtime",
  "body": "While Andrew and Doug, the building's owners, hash out the final details of our LLC / lease agreement, Nicole and I find ourselves with a lot of free time on our hands. We're finding various ways to occupy ourselves - Nicole has been building templates for our newsletters, while I tinker away on our website - but the sudden change of pace has been a bit unsettling. Up until the film forum on the 14th of this month, Nicole and I had been working at break-neck speed trying to make sure all of our financial projections were accurate, that our business plan was watertight (it wasn't, we found a typo on page 2), and that we had suitable vendors lined up for anything and everything we could think of... projectors, concession equipment, soda, beer, wine.\r\n\r\nAlthough the stress worked a number on my complexion, the pace of it was exhilarating. You may not be able to tell it by that last sentence, but I love to work. I'm a workaholic, which is why this temporary lull in the march of progress has thrown me off kilter. I need to get the ball rolling again, or else I'm going to fall asleep and die. Nicole, on the other hand, is a bit more flexible. She can work hard when she's motivated, yet she has no trouble relaxing when there's a quell in the workflow. In fact, I think she's taking a nap right now on the couch. I haven't taken a nap since kindergarten! I wish I could take naps... sometimes. No I don't. What am I saying? I'm delusional... do you see what this downtime is doing to me!\r\n\r\nSince we're on the subject of Nicole and her work ethic, I should note that we are very aware of the inherent dangers that face married couples who choose to run a business together. We've read about the fighting, and the kicking, and the drawing of the boundary line on the office desk, but none of it phases us. We're level-minded kids, so hopefully we can tackle the majority of the obstacles that come our way, and if we can't, we'll just have to gleefully repress them and hash it out once we reach retirement age. When push comes to shove, I think we both realize how lucky we are that we've been given an opportunity to realize our life-long dream... together. Can you feel the sap? That was a bit sappy... the keys on my keyboard are starting to stick together.\r\n\r\nUp to this point, the entire theater project has been pretty much a one-man show - literally. Since I'm the one who's in charge of all the technical stuff (i.e. projection, ticketing software, business logistics, legal issues, website creation, vendor relations), I've been saddled with the bulk of the workload, and happily so. Nicole won't be able to shine until we get closer to opening day, upon which time she'll be able to start creating relationships with potential advertisers, working with the interior decorator to come up with a theme for the theater's decor, writing press releases that coincide with our progress, and ordering our first shipment of inventory. It's been hard for me to remember that her role has yet to play out, which has caused a couple tiffs along the way, but after she reminds me of this, all is well. I think we'll be a great team. We just celebrated our one year anniversary on the 21st, by the way. Yippee! Now, if you'll excuse me, I'm off to go find something to do with myself. Idle hands are the something's something... I forget.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-06-30T02:55:08.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Newell",
      "body": "Naps are a wonderful thing.",
      "created_at": "2004-06-30T06:06:02.000Z"
    },
    {
      "author": "Nicole",
      "body": "I was napping. And it was nice.",
      "created_at": "2004-06-30T06:47:25.000Z"
    },
    {
      "author": "Sandra",
      "body": "three snaps for naps\r\n\r\nneed to get me some of that",
      "created_at": "2004-06-30T09:20:03.000Z"
    },
    {
      "author": "Oz",
      "body": "Idle hands are the devil's playground, my friend.\r\n\r\nAs for running a business together, I've seen it work, and I've seen it not work.  Seems like small towns often have little shops or diners run by couples that have been doing it for 30 years and are happy.  Then again, my aunt and uncle run a business together, and they're miserable.  I doubt that's because of the business, but you never know.  Good luck to you two!",
      "created_at": "2004-06-30T16:05:00.000Z"
    },
    {
      "author": "bjork24",
      "body": "Please, don't encourage Nicole's napping... it's bad enough as is.",
      "created_at": "2004-06-30T17:27:33.000Z"
    },
    {
      "author": "said",
      "body": "bonjour.\r\nje ne peut pas ecrire en anglais mais j'etais tenter par le nom de ton blog car je suis dingue de cinema et c'est pour cela je t'invite de viter mon blogue et de voir les nouveautés des films.\r\nj'attent ton comment.\r\nmerci.",
      "created_at": "2004-06-30T18:28:35.000Z"
    },
    {
      "author": "bjork24",
      "body": "Said - Nicole parle le francais....elle ne parle pas le francais tres bien, mais elle a etudie a Paris pendent deux mois et elle a suivi les courses de francais il y a pres dix ans.",
      "created_at": "2004-06-30T18:45:36.000Z"
    },
    {
      "author": "Oz",
      "body": "Dan, so you allow blatant advertisements for blogs as long as they're written in a foreign language?",
      "created_at": "2004-06-30T19:40:21.000Z"
    },
    {
      "author": "bjork24",
      "body": "Is it a blatant advertisement? I thought it just said, \"I can't speak English, but I found your blog b/c I'm a film nut. Please stop by and leave a comment.\" I've seen a lot worse. I usually get spammed once a week by a Brazilian blog, in Portuguese, but this one seemed pretty tame.",
      "created_at": "2004-06-30T19:44:51.000Z"
    },
    {
      "author": "Oz",
      "body": "Seems like a blatant advert to me, but it's your blog, your call.  I do not question your judgement.  Okay, well I did, but I won't anymore. [Oz bows and exits the room walking backwards]  ;)",
      "created_at": "2004-06-30T20:53:34.000Z"
    },
    {
      "author": "vadergrrrl",
      "body": "You a workaholic!  Cant tell, just joshing.  Its pretty obvious by your site here that you have one amazing, and fast moving brain.",
      "created_at": "2004-06-30T21:04:46.000Z"
    },
    {
      "author": "Nukerito",
      "body": "&lt;script&gt;alert('Hacked by Nukerito')</script>",
      "created_at": "2004-07-01T03:09:33.000Z"
    },
    {
      "author": "bjork24",
      "body": "Uh oh, we were hacked by Nukerito! Nice try, Burrito.",
      "created_at": "2004-07-01T03:59:52.000Z"
    },
    {
      "author": "Stacy",
      "body": "hey dan do u no how 2 speak french? gosh thats so kool! well, what did he or she say? :) oh, and by the way... u look like u live a very tiring life! lol",
      "created_at": "2004-07-01T04:04:02.000Z"
    },
    {
      "author": "Nicole",
      "body": "I'm actually the one who 'speaks' French. But not very well. Dan speaks a little Spanish and a lot of Pig Latin. Said said s/he was crazy about films and would like Dan to visit his/her blog.",
      "created_at": "2004-07-01T07:51:43.000Z"
    },
    {
      "author": "TK",
      "body": "June 21st was my one year anniversary also.  What did you do to celebrate?",
      "created_at": "2004-07-03T08:12:40.000Z"
    },
    {
      "author": "CVB",
      "body": "NAPS are great",
      "created_at": "2004-07-04T04:41:29.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
