{
  "id": 280,
  "title": "Day 28: Two more days to go!",
  "body": "After this 30 day blogging marathon is over I might take a few days off from the blog. What do you think? I deserve it, don't I? Maybe I'll have Nicole write a post or two, seeing as how she did such a great job with last night's blog. She's quite the clever girl, isn't she. If you don't already, start reading her blog(s) obsessively. <a href=\"http://tapioca.retroflux.com\" target=\"\" class=\"broken\">Tapioca Dance</a> and <a href=\"http://fresh.retroflux.com\" target=\"\" class=\"broken\">Fresh as Paint</a> are amazing! I read them every day. Nicole is so great! She is the greatest person on the planet! Dan is okay, but nowhere near as cool as Nicole.\r\n\r\nNow I bet you don't know who's writing this post, do you?! Ha ha! I'll never tell! I'm AWESOME!\r\n\r\nHere are some pictures:\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/080705/upload1.gif\" width=\"425\" />\r\n\r\nBogey helped me search through the yellow pages to find a good plumber. Check out how my finger magically makes the pages turn... amazing!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/080705/upload2.jpg\" width=\"425\" />\r\n\r\nThis is the end result of the plumber's handy work. I didn't take pictures of the other side of the wall, which is where most of the work (read: cost) took place. Why didn't I take pictures, you ask? I don't know. Why didn't you brush your teeth last night?\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/080705/upload3.jpg\" width=\"425\" />\r\n\r\nHere's the hand sink, which I call baby bear, and the service (mop) sink - affectionately known as momma bear. Can you guess what the big sink's name is?\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/080705/upload4.jpg\" width=\"425\" />\r\n\r\nThis is Dr. Steely Steelerton, the big three compartment sink. What did you think I'd call it? I still need to connect the drain board before Dr. Steelerton can start seeing patients.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/080705/upload5.jpg\" width=\"425\" />\r\n\r\nCheck out these sweet temporary legs I made for Dr. Steelerton out of an old 2x4 and some cheap duct tape. The real legs should be in on Tuesday or Wednesday.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/080705/upload6.jpg\" width=\"425\" />\r\n\r\nThis is the custom sink cabinet I built to hold baby bear. It took me two freakin' hours! Look at the craftsmanship. LOOK AT IT! Of course, baby bear didn't need my craftsmanship and told me exactly where I could shove it.\r\n\r\nI'll never forgive you baby bear. Never ever.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/080705/upload7.jpg\" width=\"425\" />\r\n\r\nThis is the floor being buffed. By the time we mop it, buff it again, and apply a layer of epoxy sealant, you won't even recognize it. I think we're going to forget about laying carpet and just clean the terrazzo floors. I'll keep you updated.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/080705/upload8.jpg\" width=\"425\" />\r\n\r\nMy uncle Larry installed our 6 channel surround system. The speakers don't look that big in the picture, but take my word for it... they're huge. Even Dr. Steely Steelerton was put to shame by their size.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/080705/upload9.jpg\" width=\"425\" />\r\n\r\nSee what I mean? They're globnormous! If I really wanted to, I could crank up the volume to 11 and immediately cause everyone's head within a 32 mile radius to explode. That was a poorly constructed sentence. I guess I'm still stinging from baby bear's comment about where I could shove my craftsmanship.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/080705/upload10.jpg\" width=\"425\" />\r\n\r\nHere's Dad and I laying carpet. As usual, Dad's working while I'm staring at the back of his head.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/080705/upload11.jpg\" width=\"425\" />\r\n\r\nHere I am dancing with an invisible person.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/080705/upload12.jpg\" width=\"425\" />\r\n\r\nMore Chilton's... drinking beer... watching my Dad work. From left to right: me, Yo, Sonny, and Larry (hiding his beer behind his back). Check out my arms! I only have one question for you: \"do you have tickets to the BB gun show?!\"\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/080705/upload13.jpg\" width=\"425\" />\r\n\r\nHere's my Dad, not drinking beer. According to him: \"This is a one-man-job!\" He says that a lot. What do you think of the carpet color?\r\n\r\nWell, that's all for tonight.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-08-08T07:48:22.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "i often stare at the back of my dad's head... asking why ... why does he have a full head of flowing hair.. as mine seems to be thinning.. at the young age of 25.... whats that?  you get it from your mom's side of the family?  crap!\r\nim apathetic on the carpet... it will be dark in there anyway.. right?  right",
      "created_at": "2005-08-08T09:19:54.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "So Dan, basically what your saying is, with that whole post, that the exposure to paint remover fumes hasn't worn off. Bravo!",
      "created_at": "2005-08-08T17:17:53.000Z"
    },
    {
      "author": "erin",
      "body": "because i never have anything clever or whitty to say........\r\nthe theater is looking great.\r\n:*(\r\ni feel so lame.",
      "created_at": "2005-08-08T18:17:33.000Z"
    },
    {
      "author": "Caleb",
      "body": "It looks like Dr. Steely Steelerton and Momma Bear are ignoring Baby Bear. They're all scrunched together while Baby Bear is all lonely. \r\n\r\nWho knew that sinks could be so neglectful?",
      "created_at": "2005-08-08T20:33:32.000Z"
    },
    {
      "author": "Maddy",
      "body": "Come on!  Give Baby Bear the independence that he needs.  Maybe it is time for him to go and face the big, bad world alone.  His parents are giving him his much needed space, but don't worry--they will still send money and swedish fish if he needs it.",
      "created_at": "2005-08-08T22:47:25.000Z"
    },
    {
      "author": "Caleb",
      "body": "But he's still so small and young! Even Dan must think so as he tried to build a shelter for him. Maybe the parents should give Baby Bear his space, but hopefully they will still be there for him when his drain gets clogged.",
      "created_at": "2005-08-09T03:43:23.000Z"
    },
    {
      "author": "Rachel",
      "body": "okay...if the sink legs for Dr. Steelerton are coming in, why did you go to the trouble of wrapping duct tape neatly around the 2 x 4? my tax dollars aren't for you to be artistic. they're for back-breaking labor!",
      "created_at": "2005-08-09T05:39:45.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
