{
  "id": 281,
  "title": "Day 29: Almost done",
  "body": "It looks like I might have to push the 35mm projector installation back a few days. Here's why:\r\n\r\n<ul><li>The installer can't properly install the projector until we have the chairs bolted in, the curtain on the wall, and the ceiling tiles in place. Once all those components are ready, he can do a proper EQ test to make sure the sound in the auditorium is as optimum as it is ear-shattering.</li>\r\n<li>We can't install the seats until the ceiling tiles are put into place. Otherwise, the ceiling guys would be forced to balance their scaffolding between the rows, which means they'd scuff up the seats and probably plummet to their deaths in the soft, springy folds of our vintage chairs.</li>\r\n<li>Even if the chairs weren't an issue, the ceiling tiles can't be put into place until the final electrical inspection has been completed. Once they've inspected above the drop ceiling, all the tiles can be installed.</li>\r\n<li>Of course, the electrical inspection can't be done until the electricians are finished... but they can't install the last 4 sconces until we put up the curtain on the West wall.</li>\r\n<li>We can't put up the curtain until we have the fabric. Where's the fabric, you ask? It's in Fort Smith with my Uncle, who won't be coming back until Friday.</li></ul>\r\nSo, as you can plainly see, it's a domino effect. I tried to bypass a few dominoes by begging the electricians to install the sconces without the curtain being up, but I don't think it worked. Instead of bending to my will, they stripped a few live wires and poked my forehead. Luckily, the wires landed on one of my pimples and made it magically disappear! As a result, I've been electrocuting my face all evening.\r\n\r\nCan you believe tomorrow is the last day of my 30 day blogging marathon? I sure can't.\r\n\r\n*ABRUPT ENDING*",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-08-09T07:05:51.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "You say \"domino effect\" so casually. Poor dominos and their association with either accomplishing so much in one swoop or devestating so much in one swoop. \r\n\r\nDOMINO RIGHTS NOW!\r\n\r\n(Sorry, couldn't come up with anything else)",
      "created_at": "2005-08-09T08:18:38.000Z"
    },
    {
      "author": "whitty",
      "body": "whoa, that is exactly how I ended all my short stories in college!\r\n\r\nBetter a domino effect than a Butterfly Effect - that movie sucked it!",
      "created_at": "2005-08-09T08:44:18.000Z"
    },
    {
      "author": "erin",
      "body": "caleb copeland i love you for defending all of \"gods creatures.\" but have you forgot our cause of the DIMES???!! please dont take on too many causes at once. one step at a time. one single step at a time.\r\n\r\nthis comment would probably have fit better on caleb's blog hu...?\r\n\r\nyep.\r\n\r\n: )",
      "created_at": "2005-08-09T08:57:33.000Z"
    },
    {
      "author": "brian of moore",
      "body": "not that i dont like being kept up on whats going on... but i think day thirty should be nothing more than 'TA DA!'",
      "created_at": "2005-08-09T09:46:51.000Z"
    },
    {
      "author": "Jamie",
      "body": "I completely agree with brian.  Dan, you deserve a break, or is it Nicole?  We will never know!",
      "created_at": "2005-08-09T15:59:10.000Z"
    },
    {
      "author": "Caleb",
      "body": "The dimes are in rehab. It's time to move on!\r\n\r\nAnd I too agree with Brian about Day 30's post...",
      "created_at": "2005-08-09T17:09:49.000Z"
    },
    {
      "author": "Caleb",
      "body": "Plus, if any coinage should be cared for right now it's 2005 nickels! Have you seen those poor things? Thomas Jefferson wasn't ready for <i>his</i> close-up. ",
      "created_at": "2005-08-09T17:12:57.000Z"
    },
    {
      "author": "Nate",
      "body": "Awesome looking.\r\n\r\nThe Domino Effect is also good for describing the foreign intervention policy of 1960's era sideburned right-wingers, and for that craving I get for deep dish and garlic butter.\r\n\r\nMmmmmmm....sideburns.\r\n\r\nHas Nicole made any progress on the initial movie schedule?  Is she keeping that close to the apron, so to speak?  Is she sick of answering this question?\r\n\r\nThe Penguin Movie was all that.  I've been waddling around all day balancing an egg on my feet.",
      "created_at": "2005-08-09T19:12:21.000Z"
    },
    {
      "author": "ben sonner",
      "body": "Dan I am sorry, please forgive me for using your website's likeness and link to the the aforementioned without proper written consent.  I am not sure how you found out.  If legal actions do need to take place please remember I am nothing more than a mere incredibly wealthy bigshot hollywood movie actor and i do not have that much that could be attained in a lawsuit of some sort.  Except my millions of dollars.",
      "created_at": "2005-08-09T20:39:46.000Z"
    },
    {
      "author": "Maddy",
      "body": "explanation needed, please!",
      "created_at": "2005-08-09T21:50:47.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
