{
  "id": 282,
  "title": "Day 30: The End",
  "body": "A lot has transpired over the last 30 days. When I began this crazy post-writing spurt, the theater looked quite a bit different than it does today. There was no stage, no primer, no paint on the walls, no sinks, no clean bathrooms, no lights, no drop ceiling, no magnetic paint for the Cinebar menu (applied this afternoon), no money, and no idea when our opening day would be. Man, how pathetic were we! If I could go back in time, I'd totally kick July 11 Dan up and down the art hall.<br/><br/>But enough about my unhealthy desire to go back in time and assault myself... let's talk about what we did today: we ran errands! Sherwin Williams still hasn't come through with our magnetic paint, so we had to go to four different places until we found some (at Michael's Arts and Crafts). We bought their entire selection (3 pints) and headed back to the theater to paint the Cinebar menu. I'm telling you, magnetic paint is weird. As soon as I opened the can, it was all jumping around and kissing its knees and pretending it had bricks for shoes. \"Stupid paint,\" I said.<br/><br/>\"FUNK YOU, MAN!\" Said the paint to me.<br/><br/>\"Why... I never!\"<br/><br/>It was great! Nicole and I also laid self-adhesive tile over the old asbestos tile in the prep room. That task took quite a bit of time since we had to (a) cut the tile to fit, (b) work around eight sink legs, and (c) did I mention NOTHING in that building is square? Also, today is my mom's birthday (Happy Birthday, Ma!), so we left the theater early to have a small dinner in her honor at my sister's house.<br/><br/>I forgot to mention this yesterday, but the new Inc.com article (written by Nicole) is now live. You can read it <a href=\"http://blog.inc.com/archives/2005/08/08/diary_of_a_startup_trimming_the_fat.html\" target=\"_blank\">here</a>.<br/><br/>So that's it, folks. Thirty freakin' days! Does it seem like it's been that long to you guys? It does for me. Every day that we're not open seems like 9 days. But that one day, last Friday, when we opened our doors to the public... that seemed like one day. Then your mother came to vist, and that seemed like 6 days. OPEN, DAMN YOU! OPEN! (That was me screaming at The Moxie sign) <br/><br/>I'm going to take a break from the ol' blogerino for a few days, but I'll be back soon. Until then, be careful... and if you can't be careful, drink Dr. Pepper. I should be getting paid by Dr. Pepper for all the endorsing I do on their behalf. Maybe I should call them.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-08-10T06:44:42.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "matt",
      "body": "it does NOT seem like 30 days have passed!  speed back to the blogoverse dan, we need you.",
      "created_at": "2005-08-10T07:34:01.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "It's great to know that there is asbestos in your food prep room.",
      "created_at": "2005-08-10T10:01:29.000Z"
    },
    {
      "author": "brian of moore",
      "body": "TA DA!",
      "created_at": "2005-08-10T12:08:44.000Z"
    },
    {
      "author": "duanekeys",
      "body": "I enjoyed the post-a-thon.  Best of luck to you and yours and I hope the theater is a big  success!",
      "created_at": "2005-08-10T17:35:25.000Z"
    },
    {
      "author": "Mark",
      "body": "Good work and enjoy your blog break.<br/><br/>M<br/><br/>p.s. This is not permission to stop working on the cinema. I want to see that screen.",
      "created_at": "2005-08-10T17:55:23.000Z"
    },
    {
      "author": "Caleb",
      "body": "Well whenever you do post next, you need progress pictures in it! <br/><br/>And I greatly enjoyed your 30 day blogging adventure. ",
      "created_at": "2005-08-10T18:04:43.000Z"
    },
    {
      "author": "erin",
      "body": "dito.",
      "created_at": "2005-08-10T18:49:56.000Z"
    },
    {
      "author": "Lori",
      "body": "I've totally enjoyed reading your blog and will greatly miss my daily dose of Moxie mania! Please reconsider. Take a break and then continue a daily post! Pretty please!",
      "created_at": "2005-08-10T19:12:39.000Z"
    },
    {
      "author": "nathan",
      "body": "well that was a lot of fun, lets do it again sometime.",
      "created_at": "2005-08-11T02:46:27.000Z"
    },
    {
      "author": "Robby Lansaw",
      "body": "I didn't want to send an email, because I thought others who follow your blog may have some input on this comment.<br/><br/>I've grown up in the Spfd/Joplin area. It's been a while since I've been back, living in Australia makes it a little difficult. :)<br/><br/>However, I came across your blog by chance and I've been following it since.  <br/><br/>Since your market technically can be considered to entertain two gendres (older art friendly, young college) I was going to suggest an idea. Just something to consider.<br/><br/>Reserve two or three seats out of the membership drive for nonprofits. Considering I'd never actually get up there to use my membership, it may be an idea for those not in the area.<br/><br/>Say if you had one seat for Red Cross, The Salvation Army, and.. Meals on Wheels (insert other nonprofit here). Now, if donations can be made on those seats in the name (and plaque) for those  charities I would personally donate some of the funds to make them a member.<br/><br/>Of course the rules could be a little different for charities. Anyone in the charity of choice can use it, rather than one person. Of course it would be one person at a time, but I don't think that will cause any discourse. <br/><br/>To me, the idea feels pretty sound. As long as you don't lean on it too hard (attract backlash), you should get some positive PR. You're getting a market that I've found to be really receptive to community, culture based projects. I would assume that you're going to get couples instead of loners coming in. Well, no more loners than what you'd have with the targeted generations. <br/><br/>It also gives the readers a reason to add to the membership, without dedicating all of the funds for one seat, knowing that they won't be in the area to entertain the idea of actually using it. <br/><br/>Since part of the plan is to embrace the community, it stands to hold some value on that front as well. By tradition, volunteers tend to be vocal in the community, so you're getting some word of mouth business. It also attends to some social value, that is largely missing in the cinema industry, and something you're active in confronting.<br/><br/>Since this is a year based program, it may be worthwhile to invoke the charity portion on a yearly basis. Possibly donating the funds to the charities at hand, or even sponsoring a charity night where they all can come down and watch a marathon. <br/><br/>May even make a decent Inc. article as well. <br/><br/><br/>Just a thought, <br/>Robby <br/><br/>Disclaimer: A long with my job, I also head a nonprofit, so I'm a little biased - though my nonprofit doesn't actually reside within Spfd, or even the US! (I manage a volunteer-based orchard that supplies fruit and veg to hard hit families.)<br/><br/>Side Note: I've been debating/researching (hense, how I came across this blog) on rebuilding a retired drive in, so if you can and have a free post, can you break out some contact info for cinema based companies that you've had to work with in the course of this adventure? Parts to the films. Obviously it's going to be different, since we're different countries, but it allows a solid starting point. (Others may enjoy it as well)<br/><br/>Sorry so long, I'm trying to avoid doing some actual work!",
      "created_at": "2005-08-11T04:10:34.000Z"
    },
    {
      "author": "Maddy",
      "body": "goodness gracious great balls of fire!",
      "created_at": "2005-08-11T04:20:51.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Everyone loves the BCFO. Or Ozarks Food Harvest. Or the Aaron Scott Living Endowment.",
      "created_at": "2005-08-11T05:53:04.000Z"
    },
    {
      "author": "Caleb",
      "body": "I don't know what I was thinking. Usually around this time you have posted the latest daily update. And so I click on my link to the Moxie to see what adventures Dan and Nicole have in store for me this evening. And a frown crossed my forgetful face when I realized the daily adventures are over. What was I thinking? Day 31?<br/><br/>I think I'll cry myself to sleep tonight.",
      "created_at": "2005-08-11T07:28:12.000Z"
    },
    {
      "author": "Nate",
      "body": "Oh, if I waited only for nights when both my girlfriend and I had the night off, AND when weren't doing anything else, AND when we didn't just feel like crashing, we might get to the Moxie once every, say, 3 months...and I'll be damned if I wait that long to catch the latest Bill Murray take on a sad and lonely aging man...or something.<br/><br/>So, yes, I'll be buying many mid-week tickets for one please.  And I don't wanna catch any grief from anybody about it.  And you single girls?  Hands off!",
      "created_at": "2005-08-11T17:32:38.000Z"
    },
    {
      "author": "Maddy",
      "body": "Damn it, Nate.  Why tempt us if you can't deliever?",
      "created_at": "2005-08-12T00:13:07.000Z"
    },
    {
      "author": "Maddy",
      "body": "Did I just misspell dammit?  ",
      "created_at": "2005-08-12T00:13:46.000Z"
    },
    {
      "author": "erin",
      "body": "moxie updates. oh moxie updates...<br/><br/>: (",
      "created_at": "2005-08-13T08:05:24.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
