{
  "id": 283,
  "title": "I'm drinking Dr. Pepper right now",
  "body": "Hello again. I'm back from my blog-atus and ready to fill you up with gobs of Moxie goodness. Here's what went down over the last week:\r\n\r\n<ul><li>The three pints of magnetic paint we bought last week wasn't enough, so we had to buy three more pints for $20.00 per unit. That's $160 per gallon, which is almost as much as I paid at the pump today. Stupid oil.</li>\r\n<li>We installed the screen and the sound-absorbing curtain along the west wall this weekend. The drop ceiling is <i>supposed</i> to be installed today (they haven't made it down to the theater yet), and the chairs are going to start magically appearing tomorrow. By the end of this week, the auditorium will actually look like a *gasp* movie theater!</li>\r\n<li>Our local NPR affiliate ran a blurb about our <a href=\"http://members.moxiecinema.com\" class=\"broken\">Founding Membership program</a> on Friday. I'm not sure how they received information about the memberships, but I bet Mr. Bucky Bowman had a hand in it. Thanks Bucky!</li>\r\n<li>My Dad is kind of down and out right now. He's suffering from a medical problem that I won't mention here, because unlike me, my Dad still has a few ounces of integrity left. I'm just plain shameless. Either way, here's hoping he gets well soon!</li>\r\n<li>All the speakers are installed and working, thanks to my Uncle Larry, who has traveled all the way up from Fort Smith, Arkansas for the last three weekends in a row just to lend a hand. My aunt Diane also helped out this weekend by sewing the curtains together for us, and her husband, Uncle Jerry, will be helping install seats tomorrow. If I could just get my grandparents to start helping out, we could rename the theater to the Chilton Family Diner... or something equally cozy.</li>\r\n<li>The great floor debate is still raging. Do we carpet it or do we clean it up and leave the terrazzo? Both options would cost pretty much the same, but it would take 3 to 4 times as long to clean and refinish the terrazzo as it would to lay carpet over it. BUT the terrazzo would be much easier to maintain than the carpet. ARGH! It's driving us crazy. What do we do? What do we do?!</li></ul>\r\nA big thanks goes out to everyone who has lent a hand these past few weeks... including the rarely acknowledged triplet: Nicole, Dad, and Mom. All your help means a lot.\r\n\r\nUh oh, I'm out of time. I need to run back down to the theater. I have lots of great pictures to share with you guys, so stay tuned. Woo hoo!\r\n\r\nPS - Here's last week's <a href=\"http://blog.inc.com/archives/2005/08/12/diary_of_a_startup_decisions_decisions.html\" target=\"_blank\" class=\"broken\">Inc.com article</a>.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-08-15T23:56:13.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Jo",
      "body": "Hurrah, the Screen is in. Very exciting! Also - get well soon Dan's Dad.",
      "created_at": "2005-08-16T00:13:55.000Z"
    },
    {
      "author": "Matt",
      "body": "terrazo!",
      "created_at": "2005-08-16T00:28:11.000Z"
    },
    {
      "author": "Nate",
      "body": "Terrazo.  You refinish once.  You  maintain for years.  The extra time will be more than worth it.\r\n\r\nPlus, terrazo is more fun to say than carpet, even sounding a bit like something you call out when you win an as-yet-to-be-invented game.\r\n\r\nTerrazo!",
      "created_at": "2005-08-16T00:42:34.000Z"
    },
    {
      "author": "Steve",
      "body": "Yeah, probably terrazo. If you put in the carpet, the first time someone spills a soda or glass of wine on it, you'll pull out your hair. Plus it might add a certain amount of excess sound absorbtion. Maybe. Just guessing. Nevermind, I don't have a CLUE what I'm talking about.\r\n\r\nBTW, I wore my Moxie T for the first time last night at Ned Reynolds Bobblehead (I STILL can't say that without giggling) Night at the ballpark, and a concession girl asked me when you were going to open. I told her that according to the blog, progess has been brisk lately, and I would guesstimate a September opening. Oh, @*#&%! Did I just put my foot in my mouth again? Geez...someone PLEASE stuff a sock in my mouth...Pretty freakin' bold of me, considering this is my first post in weeks...\r\n\r\nCan't wait to see the pix.",
      "created_at": "2005-08-16T03:30:52.000Z"
    },
    {
      "author": "Caleb",
      "body": "While I personally think carpet would be more attractive, I think terrazzo is the way to go. I mean once the lights go off nobody's going to notice the floor. But having a much easier cleaning surface would be worth it, wouldn't it?\r\n\r\nI honestly was going to become a founding member but I just can't boot the $500. Sorry boss. You can blame MSU.",
      "created_at": "2005-08-16T05:11:29.000Z"
    },
    {
      "author": "erin",
      "body": "terrazzo 100%\r\n",
      "created_at": "2005-08-16T07:17:13.000Z"
    },
    {
      "author": "erin",
      "body": "zz. there is a highway that leads to Clever called ZZ. and someone wrote on one of the road signs. zz top. it made me happy. : )",
      "created_at": "2005-08-16T07:18:59.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i dissagree with all previous commentors\r\nmostly because im not exactly sure what terrazzo is.. even though ive stood on your floor at least twice....\r\nterrazzo.. didnt he play for the mets?\r\n\r\nso in my *mind* im picturing how most movie theaters are.. and how they dont have carpet.. and how people spill things on them.. and how throughout the movie my feet are sticking too the floor...driving me mad... is that terrazzo? if so.. i dont like it.. yes it would suck to have people spilling things on a nice new carpet.. but it seems that a sticky carpet sticks to my feet much less than stickey mets players\r\ntherefore giving me a much more pleasant moviegoing experience\r\n\r\n(note: i dont watch sports.. sorry)",
      "created_at": "2005-08-16T08:22:28.000Z"
    },
    {
      "author": "Brandon",
      "body": "Terrazzo, once again.",
      "created_at": "2005-08-16T09:02:57.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i vote for carpet twice\r\nif i have too.. ill use different screennames\r\nseriously",
      "created_at": "2005-08-16T12:15:38.000Z"
    },
    {
      "author": "jimmy",
      "body": "oh boy, my name is jimmy and im 9 years old\r\ni just LOVE carpet.. carpet is the greatest thing ever\r\n\r\nterrazzo ran my daddy out of a job\r\nand ran away with my mommy\r\nnow its just me and daddy, trying to make ends meet.... i play the drums on the street corner for spare change.. i dont really have drums though.. just a dirty bucket i found.. and a tree branch\r\ni wish terrazzo never existed at all!\r\n\r\nlove, jimmy",
      "created_at": "2005-08-16T12:18:24.000Z"
    },
    {
      "author": "Kirsten",
      "body": "Carpet will eventually be a mess.  It's expensive to maintain and will start to smell funky over time.  It will have to be vacuumed all the time and believe me, people DO NOT like to vacuum!  Of course if you anticipate NO traffic in your theater, by all means, go with carpet.  Keep the terrazzo it will last forever, clean up beautifully and never smell weird.  You guys are getting closer....",
      "created_at": "2005-08-16T16:52:33.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "Carpet is nasty. Think of all the spilled soda and juju's.",
      "created_at": "2005-08-16T16:53:26.000Z"
    },
    {
      "author": "DUG",
      "body": "Leave the floor, get some midgets!",
      "created_at": "2005-08-16T20:00:29.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "I would carpet everything but the actual theater itself (i.e. the part directly under the seats). It cuts down on time (carpet installation vs. refinished floors) and makes spill control much easier to deal with. Later on when you become an all-powerful media mogul who pines away for his lost sled of childhood, you can get the terrazzo refinished throughout.",
      "created_at": "2005-08-16T22:41:00.000Z"
    },
    {
      "author": "Citizen Yoda",
      "body": "Rosebud, my Imperial Battle Sled...\r\n\r\nthere is...another...Sky...Walk...",
      "created_at": "2005-08-16T22:51:32.000Z"
    },
    {
      "author": "duanekeys",
      "body": "How about just a polished concrete floor?",
      "created_at": "2005-08-16T23:46:03.000Z"
    },
    {
      "author": "Jennifer Neil",
      "body": "Dan,\r\n\r\nI also vote for refinishing the terrazzo, for the same reasons as everyone else does.  Here's a tip, don't use a Swiffer Wet or Wet Jet to clean it.  Constant and consistent use of their cleaning solutions will strip flooring of its finishes, and then you'll have to refinish it all over again.\r\n\r\nJennifer Neil",
      "created_at": "2005-08-17T01:53:42.000Z"
    },
    {
      "author": "Jessica",
      "body": "Oh ol' ZZ street...I use to live by it but then I came to my new home today...Beaumont, TX...what was I thinking??  Dan I hope that you have the theater up and running soon (like everybody else) but I will be back up in that area the end of Sept. and would love to see a movie at the Moxie...",
      "created_at": "2005-08-17T03:43:17.000Z"
    },
    {
      "author": "Ole",
      "body": "What does your audio guy think?  will the floor covering change how i experience my Moxie?  if so, who cares how much work you have to clean up after me!",
      "created_at": "2005-08-17T23:11:29.000Z"
    },
    {
      "author": "smgundlach",
      "body": "Terrazzo all the way.  Well worth the investment to restore, has a nice substantial feel to it, so retro its modern, was actaully a craftsmen's pride back in the day.  Yep, terrazzo is miles ahead of carpet in the \"cool factor\".",
      "created_at": "2005-08-18T05:56:30.000Z"
    },
    {
      "author": "smgundlach",
      "body": "http://www.ntma.com/\r\n\r\nCheck this out...maybe it will help you make up your mind :)",
      "created_at": "2005-08-18T05:58:52.000Z"
    },
    {
      "author": "Jeff",
      "body": "I vote terrazzo.  You won't want the theatre to smell like old stale beer, which will happen the day after opening with carpet.",
      "created_at": "2005-08-18T20:00:22.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
