{
  "id": 286,
  "title": "I've been really busy",
  "body": "I know... I know. I promised new phlogs, and I've yet to deliver. I have FOUR (count them, FOUR) new phlogs loaded and ready to go. All they're waiting on are a few witty captions. Actually, I can't <i>promise</i> they'll be witty, but I'll try. You know how it goes.\r\n\r\nI've been working 80 hour weeks for the last month, which is why I haven't been posting as much as usual. I hope you'll forgive me and stay tuned for some seriously kick ass phlogs TOMORROW (night, most likely). I tell you, the worst thing about doing EVERYTHING on your own is that you can't do stuff simultaneously. If we had all the money in the world, I'd have the painters working along side the floor refinishers working along side the trim guys working along side the projector installers, etcetera ad infinitum. Unfortunately, we have to do everything step by step by step...\r\n\r\n<i>Step by step,\r\nDay by day,\r\nA new something something,\r\nA different hand to play.\r\n\r\nThe people we meet,\r\nThe places we something.\r\nWe'll make it better,\r\nThe next time around.</i>\r\n\r\nMore tomorrow. Word to your mother!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-08-21T07:35:35.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "You could probably post a picture of a paintbrush and we would be oohing and ahhing over it. I hope I speak for us all when I say the less time spent blogging on here (as much as we love it) and more time spent polishing up the Moxie is all good. Can't wait for opening night! Is Sept. 2 still a possibility or do you think you might have to push it back a week or two?",
      "created_at": "2005-08-21T09:05:12.000Z"
    },
    {
      "author": "erin",
      "body": "i already lost the opening date guessing game thing.... :*(\r\n\r\ni dont think the people who sing that jingle or song or whatever have any idea what they are singing either..",
      "created_at": "2005-08-21T09:11:36.000Z"
    },
    {
      "author": "bjork24",
      "body": "It's the theme song to \"Step by Step\" with Patrick Duffy and Suzanne Sommers.",
      "created_at": "2005-08-21T16:47:45.000Z"
    },
    {
      "author": "erin",
      "body": "The dream, wide broken seemed like all was lost.\r\nWhat would be the future?  Could you pay the cost?\r\nYou wonder, will there ever be a second time around?\r\n\r\nWoah-a, woah-a\r\nWhen the tears are over and the moment has come\r\nSay \"My lord, I think I found someone.\"\r\nAnd no one would be better to be putting it together for the second time around.\r\n\r\nWe got the woman and man.  We got the kids in a clan.\r\nOnly time will tell if all these dreams fit under one umbrella.\r\n\r\nStep by step.  Day by day.\r\nA fresh start over.  A different hand to play.\r\nThe deeper we fall, the stronger we stay\r\nAnd we'll be better the second time around.\r\n\r\nStep by step.  Day by day (Day by day)\r\nA fresh start over a different hand to play.\r\nOnly time will tell but you know what they say\r\nWe'll make it better the second time around\r\n\r\n\r\n: )",
      "created_at": "2005-08-21T19:07:39.000Z"
    },
    {
      "author": "JED",
      "body": "OK, so the first day of business is going to be in Sept. but when is the grand opening? I want to be there for it. I can't freakin wait. Oh and I'm going to kill DUG this weekend. Technically, I'm going to bury him alive out in the Nevada desert. The end result is all the same. ",
      "created_at": "2005-08-22T01:30:56.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
