{
  "id": 287,
  "title": "Four new phlogs",
  "body": "EXTRA! EXTRA! Read all about it! Dan and Nicole have an incredibly long day! What's new?! Wait, I know! There's FOUR new phlogs! Holy Toledo! Loud statement! It's really hot in here! I'm going to go turn up the air conditioner! Good night!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-08-22T08:31:39.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "erin",
      "body": "as my dear dear dear friend paris hilton would say...<br/>thats hot.",
      "created_at": "2005-08-22T09:06:40.000Z"
    },
    {
      "author": "brian of moore",
      "body": "holy crap! you have your very own movie theater!<br/><br/>its real!.. not just sketches of what a movie theater might look like.. if you were to make one<br/><br/>nifty<br/><br/>so.. can i hide magnets in my secret pocket and throw them on the wall when nobody is looking? <br/>if so... ill get some of that magnetic paper and print out pictures of mr. belvedere",
      "created_at": "2005-08-22T09:36:29.000Z"
    },
    {
      "author": "whitty",
      "body": "whoa, the opening is so close I can taste it.<br/><br/>Mmmm, chalky.",
      "created_at": "2005-08-22T17:23:18.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "HOLY TOLEDO!",
      "created_at": "2005-08-22T18:20:45.000Z"
    },
    {
      "author": "Caleb",
      "body": "I sense a secret loyal blog reader party coming soon...Heh heh.<br/><br/>The theater is looking really, really awesome. I can't wait!!",
      "created_at": "2005-08-22T20:02:38.000Z"
    },
    {
      "author": "Mark",
      "body": "I see a cinema! I SEE A CINEMA!<br/><br/>WOO-HOO!<br/><br/>M",
      "created_at": "2005-08-23T22:56:19.000Z"
    },
    {
      "author": "erin",
      "body": "first friday is coming up. just a little over a week. you plan on opening the ol' moxie doors? surely so.... just thought i would check. : )",
      "created_at": "2005-08-24T00:24:57.000Z"
    },
    {
      "author": "Nate",
      "body": "The internets are restless.",
      "created_at": "2005-08-24T00:30:03.000Z"
    },
    {
      "author": "Caleb",
      "body": "Just wanted to let you know that Go Magazine had this to say on it's Hypes & Gripes section about The Moxie:<br/><br/>\"A two-way Hype to the people responsible for 1984 and The Moxie, which will fill gaps in the Springfield entertainment scene with unique, locally owned endeavors. If buzz is any indicator, we can expect great things.\"",
      "created_at": "2005-08-24T00:59:37.000Z"
    },
    {
      "author": "Nate",
      "body": "Well, here's to Go - I always thought 417 needed a spin-off.  By \"spin-off\"  I mean a Springfield life mag that did not devote 6 pages in the back to static, aristocratic, pointless pictures of people at fundraisers.  <br/><br/>But that sushi ad?  You know the one every month where it looks like the woman is having an orgasm while the man feeds her the sushi with chopsticks from above?  Like a mamma bird to a baby bird?<br/><br/>Hot.  <br/>Cheesy. As. Hell.  But kinda hot.",
      "created_at": "2005-08-24T01:59:45.000Z"
    },
    {
      "author": "Nate",
      "body": "Chopsticks from Above.<br/><br/>Tonight at the Rockwell.  Doors at 7.",
      "created_at": "2005-08-24T02:00:16.000Z"
    },
    {
      "author": "Nate",
      "body": "Hey - The Doors...when they started out at small venues in SoCal, like back when they were together, do you think it confused people when the fliers said:<br/><br/>TONIGHT ONLY! <br/>The Doors.<br/>8 p.m.<br/>(Doors at 7).<br/><br/><br/>I bet more than one pot-addled hippie was scratching his headband over that one!<br/><br/>I should work now.",
      "created_at": "2005-08-24T02:03:31.000Z"
    },
    {
      "author": "Caleb",
      "body": "FAYI (For All Ya'll's Info):<br/><br/>1984 opens this weekend (that's the new old-school arcade downtown).",
      "created_at": "2005-08-24T06:22:15.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "1984 has been open for well over a month now. They're just having a grand opening celebration this weekend.<br/><br/>Ima gonna get that high score on Black Knight 2K. I'll do it blindfolded and you can call me Tommy.",
      "created_at": "2005-08-24T06:47:37.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    }
  ]
}
