{
  "id": 288,
  "title": "Take this projector and shove it",
  "body": "The projector installer arrived today. After assembling most of the pieces, he ran across a huge problem. As it turns out, our projection booth isn't big enough. I'm sorry guys, but that's the final nail in The Moxie's coffin. We've had a good run. Thanks for the memories.<br/><br/>NOT!!!!!!!<br/><br/>Actually, the projector installation is going great! The top reel fits perfectly into the vault we built into the ceiling; the big wooden base we built to lift the projector high enough (<a href=\"/posts/221\">you</a> <a href=\"/posts/222\">remember</a>) is the perfect height; and there's still enough room to lay down on the nice plush carpet! As it is with most installations of used projection equipment, we're missing a few pieces here and there, but they'll be shipped down to us tomorrow. It's very exciting... having a gigantic piece of machinery shoved into a room no bigger than a typical bathroom. It's like bathing with Benzo. Hott!<br/><br/>This is the part where I'd usually insert some amazing pictures, but I left my camera at the theater. Sorry! I'll post them tomorrow... word!<br/><br/>Oh yeah, we also decided on an EXACT DATE for our grand opening. Good night!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-08-24T06:58:51.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Dave Adams",
      "body": "You are a horrible tease!",
      "created_at": "2005-08-24T07:09:20.000Z"
    },
    {
      "author": "Rachel",
      "body": "no wonder all the boys love you",
      "created_at": "2005-08-24T07:15:24.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "Tomorrow night, eh?",
      "created_at": "2005-08-24T08:25:43.000Z"
    },
    {
      "author": "Jay",
      "body": "You are a bad, bad man.",
      "created_at": "2005-08-24T08:49:41.000Z"
    },
    {
      "author": "Carl",
      "body": "OK when do we get to know the date????",
      "created_at": "2005-08-24T15:20:27.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "I know the date. Advantages of being the twin sister, eh?<br/><br/>I'm keeping my mouth shut though. Don't you worry.",
      "created_at": "2005-08-24T16:34:56.000Z"
    },
    {
      "author": "Steve",
      "body": "My heart just literally jumped out of my chest. Give me a minute whilst I recover it...<br/><br/>DON'T DO THAT! Geez. I'm older than most of you guys (45). Don't think I can take much more of that...<br/><br/>Keep us posted Big D...",
      "created_at": "2005-08-25T03:06:30.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
