{
  "id": 289,
  "title": "So you want to know when the Moxie's going to open...",
  "body": "You know how TV shows end certain episodes with a cliffhanger? Well, that's the effect I was going for with last night's post. Don't you worry, I'll let everyone on the blog know the date before anyone else. We're planning on writing a press release to be sent out on the first, but I'll let the cat out of the bag in a few days. We still have a few details to iron out to make sure we can meet the date.<br/><br/>Now, I'm off to the theater to help our installer work on the projector.<br/><br/>PS - I'll give you a hint on the date: <i>it's in September</i>.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-08-24T16:59:22.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "Gosh darn you. I bet it's either the 16 or the 23! Of course you didn't say September of 2005... Heh heh.",
      "created_at": "2005-08-24T17:11:26.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "I know when it is. I'll take bids for the real answer.",
      "created_at": "2005-08-24T17:18:54.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Hooray!  <br/><br/>I'm so excited for you guys...an open Moxie would make a neat, if completely useless-to-me birthday present.  How about the 7th?",
      "created_at": "2005-08-24T19:03:10.000Z"
    },
    {
      "author": "Derek the local college student",
      "body": "I'm waiting on the edge of my seat. I hope it's not the 23rd, because I have a concert to go to that night, and I want to be at opening night. Not that you care or anything, but I felt compelled to share that. I'm hoping for the 9th, because that would be the perfect ending to a long week. Do it. You know you want to. You've never met me, but you'd make my month, haha. Okay, I'm gonna stop rambling now.",
      "created_at": "2005-08-24T19:23:04.000Z"
    },
    {
      "author": "whitty",
      "body": "I think I just crapped myself a little.  From excitement, that is.  <br/><br/>Man, I am going out of town three out of four weekend in September.  Here's hoping I choose the right one to stay home!",
      "created_at": "2005-08-24T20:16:34.000Z"
    },
    {
      "author": "Nate",
      "body": "Same here.  But a Moxie/Coldplay hybrid weekend would be suh-weet indeedy.",
      "created_at": "2005-08-24T21:08:32.000Z"
    },
    {
      "author": "nicole",
      "body": "Another small tidbit: we're staying true to our unconventionality. Who says opening night is a weekend? It could be a Monday morning at 6 am.",
      "created_at": "2005-08-24T21:24:24.000Z"
    },
    {
      "author": "erin",
      "body": "why not make it five am nicole?!<br/>early bird gets the best moxie seat.",
      "created_at": "2005-08-24T21:53:21.000Z"
    },
    {
      "author": "Rachel",
      "body": "Sept. 15th is the first day of National Hispanic Heritage Month...I know how much you two love Qdoba.",
      "created_at": "2005-08-24T22:03:46.000Z"
    },
    {
      "author": "Craig",
      "body": "You're killing me. How am I supposed to get a decently-priced plane ticket if I don't know at least a month in advance?",
      "created_at": "2005-08-24T22:04:04.000Z"
    },
    {
      "author": "Ole",
      "body": "Nicole is sounding awfully cocky about that date.  A good sign!  Oh and Aaron, will the sign be ready by then?",
      "created_at": "2005-08-24T23:33:54.000Z"
    },
    {
      "author": "brian of moore",
      "body": "so people that comment the most get a chance to buy tickets first...  right?...<br/>...  thats right.... right?...<br/>... please...<br/>PLLEEEAAAASSSEE! I LOVE YOU! .... err",
      "created_at": "2005-08-25T01:19:48.000Z"
    },
    {
      "author": "Nate",
      "body": "What!",
      "created_at": "2005-08-25T01:30:48.000Z"
    },
    {
      "author": "Nate",
      "body": "A!",
      "created_at": "2005-08-25T01:30:53.000Z"
    },
    {
      "author": "Nate",
      "body": "Great!",
      "created_at": "2005-08-25T01:30:59.000Z"
    },
    {
      "author": "Nate",
      "body": "Idea!",
      "created_at": "2005-08-25T01:31:06.000Z"
    },
    {
      "author": "Andy",
      "body": "I predict an opening on September 16 with screenings of Thumbsucker.",
      "created_at": "2005-08-25T02:29:05.000Z"
    },
    {
      "author": "Mark",
      "body": "My money is on the 9th!<br/><br/>Any update on the founding members program?<br/><br/>M",
      "created_at": "2005-08-25T03:01:55.000Z"
    },
    {
      "author": "Steve",
      "body": "My chair is moist with anticipation...",
      "created_at": "2005-08-25T03:01:59.000Z"
    },
    {
      "author": "Caleb",
      "body": "Sept. 16 would be a great date to open! And I hope you do get that movie.",
      "created_at": "2005-08-25T03:11:21.000Z"
    },
    {
      "author": "nicholas",
      "body": "I'm so happy for you two! I've been lurking lately, but always here...",
      "created_at": "2005-08-25T19:35:56.000Z"
    },
    {
      "author": "Jennifer",
      "body": "Founding members first?  What?  Doesn't money talk anymore?",
      "created_at": "2005-08-25T20:38:52.000Z"
    },
    {
      "author": "GO Magazine",
      "body": "A FREE copy of GO to whoever guesses the right date. We'll have the scoop (and a sweet feature) in our Aug. 31 issue.",
      "created_at": "2005-08-25T23:59:33.000Z"
    },
    {
      "author": "Jay",
      "body": "Well, Nicole, if you want a Monday morning opening, the 5th is not only a treasured national holiday, it's also my birthday.  Perhaps a Moxie opening would blunt the crushing blows of time that are pummeling my rapidly aging body.<br/>Yeah.",
      "created_at": "2005-08-26T00:14:28.000Z"
    },
    {
      "author": "Matt",
      "body": "I'll put my money on Friday 2nd :) ",
      "created_at": "2005-08-26T00:15:21.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
