{
  "id": 29,
  "title": "The other kind of projection",
  "body": "Forecasting the profitability for a theater that hasn't opened yet is a little like cutting diamonds - it's hard as hell, unless you have the right tools. Wow, I'm an analogy master... I just made that up! Seriously. Ok, moving on. \"How much money will your theater make, Dan?\" This is a question I hear often in my head.<br/><br/>\"Lots,\" I say. \"Lots.\"<br/><br/>\"How much is 'lots'?\"<br/><br/>\"Oh, you know. Like more than none.\"<br/><br/>\"No, I don't know, would you care to elabora...\"<br/><br/>WHAM! Quick jab to the celiac plexus, and I'm away! WHISK!<br/><br/>\"Dagnabbit, Dan... [ out of breath - panting ] I'll get YOU!\"<br/><br/>To forecast our theater's financial potential, I developed a simple formula which I culled from various maxims that were commonly accepted across the industry. So if you were planning on starting a theater of your own, but could never figure out how to gauge its profitability, today is your lucky day. I'm feeling mighty generous, which can only mean one of two things: either I'm about ready to donate money to myself through the donation link at the bottom of the sidebar, or I'm going to share my formula with you. That's right. I just donated money to myself.<br/><br/>See you tomorrow!<br/><br/>Hmm, on second thoughts, this post is looking a bit thin. I better fluff it out a bit, or else people will begin to think that I'm losing my touch, which I most certainly am not. Ok, here's my formula... I should name it first, don't you think? I can't keep saying \"my formula\" this, and \"my formula\" that. How about, Dan's Awesome Formula for Theaters (DAFT)? Ok, now that we've properly named it, we're ready to begin.<br/><br/>The first thing we'll to need to do is declare some variables.<br/><br/><b><u>DAFT VARIABLES</u></b><br/><br/><b>Total Seating Capacity</b> (<i>s</i>) - The total of all the seats in your theater.<br/><br/><b>Total Showings</b> (<I>t</I>) - How many showings you'll have in one week on one screen, assuming that all screens will show the same number of films. If you're a small theater, you'll be doing well to have 3 or 4 showings during the weekday, and 5 to 6 during the busier weekend days (i.e. Friday night, Saturday, and Sunday).<br/><br/><b>Average Occupancy Rate</b> (<I>o</I>) - This is the single most important variable in the formula... er, in DAFT. After you factor in the sold out shows on Saturday night and the no show shows on Tuesday afternoon, what will your average rate of occupancy be? Smaller theaters have a higher occupancy rate because they're, DUH, smaller. If ten people come to a show in a 100 seat auditorium, you have an occupancy rate of 10%, but if those same ten people catch a show in the local multiplex's 500 seat \"BIG ROOM,\" then the rate drops to 2%. This average should encompass all your auditoriums, big or small.<br/><br/><b>Average Ticket Cost</b> (<I>a</I>) - After you figure in a month's worth of admissions, what will the estimated average be? Remember, you'll most likely sell more full-priced tickets than discounted ones.<br/><br/><b>Average Percap</b> (<I>p</I>) - You can estimate your percap by dividing the concession profit by the total number of admissions for any given period of time. For instance, if you sell $1,000 worth of concessions and 450 admissions over a two day period, then your percap would be $2.22. The industry percap average is between $1.00 and $3.00.<br/><br/><b>Average Distribution Fee</b> (<I>d</I>) - This is the average amount that the distributors take from your Box Office Revenue (BOR). Art-house theaters usually average around 40 to 50 percent, while first-run theaters run as high as 70 to 90 percent.<br/><br/><b>Average Concession Cost Percentage</b> (<I>c</I>) - This is the percentage of concession sales that go back into restocking your inventory. For instance, if the $1,000 worth of concession sales cost you $350 in inventory cost, then your percentage is 35%.<br/><br/>Okay, now that the variables are set, let's start building the formula... er, DAFT.<br/><br/><br/><b><u>BUILDING THE DAFT FORMULA</u></b><br/><br/>The first thing we'll need to do is determine what time scale we're working with. In this case we'll be calculating the formula... er, DAFT on a weekly basis. We can always multiple it by four to get a rough monthly estimate, or by 52 to get an annual estimation.<br/><br/><I>How many people showed up?</I><br/><br/>Total Admissions (<I>TA</I>) = (s*t)*o<br/>Example Theater (ET) = (200*25)*35%<br/>TA = 1,750 tickets sold in one week<br/><br/><I>How much money was made on admissions?</I><br/><br/>Box Office Revenue (<I>BOR</I>) = ta*a<br/>ET = 1,750*$6.75<br/>BOR = $11,812.50 in ticket sales<br/><br/><I>How much money was made in concessions?</I><br/>Concession Sales (<I>CS</I>) = ta*p<br/>ET = 1,750*$2.15<br/>CS = $3,762.50 in concession sales<br/><br/><I>So, how much have you made?</I><br/><br/>Gross Profitability (<I>GP</I>) = (BOR-(BOR*d))+(CS-(CS*c))<br/>ET = ($11,812.50 - ($11,812.50*50%)) + ($3,762.50 - ($3,762.50*30%))<br/>GP = $8,540 per week<br/><br/>... or roughly $34,160 per month, or $444,080 per year.<br/><br/>Not too bad, eh? Don't forget, this is a very rough estimate. You also have to figure in local and state taxes, payroll, rent, loan repayment, utilities, advertising / marketing costs, and anything else that pops up along the way. In the end, if you keep tight control over your costs, you should be able to get by with a nice salary.<br/><br/>So, in review:<br/><br/><b>DAFT</b><br/>((((s*t)*o)*a) - ((((s*t)*o)*a)*d)) + ((((s*t)*o)*p) - ((((s*t)*o)*p)*c))<br/><br/>Got it? Good, because there will be a test on it later in the semester.<br/><br/>\"Hey Dan!\"<br/><br/>Uh oh, I'm gone! WHISK!<br/><br/>\"I'll get you for this... [ still out of breath ] and your little formula... er, DAFT too!\"",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-07-01T03:47:10.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "will you sell pi at the concession stand?",
      "created_at": "2004-07-01T04:46:35.000Z"
    },
    {
      "author": "Newell",
      "body": "Ewww... algebra. At least you didn't get into any calculus. That there is the Devil's Arithmetic (so evil that it garners capitals!). That's a pretty nifty formula though. They don't teach you that in college!",
      "created_at": "2004-07-01T05:57:15.000Z"
    },
    {
      "author": "Oz",
      "body": "Yikes.  I'm always scared of math equations that don't involve any numbers.",
      "created_at": "2004-07-01T06:27:29.000Z"
    },
    {
      "author": "bjork24",
      "body": "Justin - Yes, we will sell pi in addition to multiple other treats. Of course, we don't want to subtract from the movie-going experience by dividing the customer's attention, so we'll most likely INSERT MATH TERM HERE. That's the cleverest thing I could think of, isn't that sad?<br/><br/>Newell - Believe it or not, I hate math. I only took one course in college (Algebra I), and that was only because it was required for me to get my beautiful English degree.<br/><br/>Oz - U + I = n8... that's the second cleverest thing I could think of, isn't that sad?",
      "created_at": "2004-07-01T08:06:38.000Z"
    },
    {
      "author": "Chuck",
      "body": "T & A... hee hee",
      "created_at": "2004-07-01T11:54:51.000Z"
    },
    {
      "author": "bjork24",
      "body": "Chuck, you're a perv.",
      "created_at": "2004-07-01T19:51:55.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 14,
      "name": "Dialogue"
    }
  ]
}
