{
  "id": 290,
  "title": "Let's play ketchup",
  "body": "The floors are being cleaned and sealed today, which means I get half a day off from working at the theater! Yay! So what do I decide to do with my few sacred hours of free time? You're looking at it. I'm going to sit right here and pound out a post that catches everyone up on the latest Moxie happenings. Ready? Here we go!<br/><br/>* The <b>35mm projector</b> is 75% installed. Unfortunately, as is the case with most used equipment installs, we're missing a few vital pieces. Fear not, Lanny (our projector installer) will be back one week from this Tuesday, which would be September 6th, to complete the job. Anyone who guessed we'd be open BEFORE then... sorry. Either way, we'll have a nice projector to show folks when they stop by next week for First Friday.<br/><br/>* We've actually made it to the point where it's time to set our <b>September film schedule</b> in stone. Paul, our booking agent / Ragtag co-founder / mentor / friend, will be booking the films for us next week. We have a lot of good movies to choose from, the majority of which are documentaries. It seems that the high concept / low cost documentary (ala <i>Super Size Me</i>) has taken over the art-house circuit, which is fine by me... I LOVE DOCUMENTARIES! Even still, we're conscious of the fact that not everyone hearts documentaries the way I do, so we'll be peppering the docs with some top notch fictional films too. I can't wait to start handing out our calendars!<br/><br/>* <b>Panic hardware</b> is expensive! Since we have an occupancy of greater than 100 people (a full theater PLUS a lobby full of people waiting for the next movie), all of our doors must be equipped with panic hardware. What's panic hardware, you ask? It's those bars and paddles you see on commercial exit doors that say PUSH or EXIT. You wouldn't think they cost much, but we'll be spending upwards of $500 to have them installed. I tell you... it's always something, isn't it! I wish I could make my own.<br/><br/>* I'm debating on whether or not we should replace our <b>vintage arm rests</b> with longer models that include a cup holder. I hate to mar the vintage elegance of our lumpy, reddish-orange, aluminum low-backs, but they were made in a less litigious time. Spills equal slippery floors, or even worse, broken glass. The last thing I want is for some flip-flop wearing customer to slice open their foot on a shard of glass, sue our lights out, win custody of the business, and rename the place \"Anti Dr. Pepper Cinema.\" That would be very, VERY bad.<br/><br/>* We're thinking about extending the <b>Founding Membership drive</b> into mid-September, mainly because I haven't been able to get our fliers around to enough people. The August First Friday (which we're not officially a part of, by the way) was a great opportunity to start spreading the word, but we still have some work to do before I feel our marketing effort has paid off. Also, in relation to our finances, Nicole and I decided to take the 10% penalty and cash out our 401(k) retirement funds. My portion went to the theater, and Nicole's went to the \"keep Dan and Nicole alive\" fund. Now, if that's not going ALL IN, I don't know what is. Woo hoo!<br/><br/>Let's see, what else? I really need to direct my attention to the main website soon. I'd hate to be open and not have a functioning website. What would that say about my computer programming skills? Not much.<br/><br/>Ok, I've jabbered on enough. I have an Inc.com post to write.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-08-26T01:40:54.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "Your 401 k's, huh? Well nobody can ever say you guys weren't serious about this. I wish you both the best of luck with your survival skills. As for the theater, WOOHOO! I say go for the cup holders. They would be nice to have, though I can understand not wanting to mess up the vintage seats. <br/><br/>Question though. Or perhaps a suggestion. You have shown us beautiful pictures of inside the theater and caused us restless nights because of it, but what about the rest of the joint? How's the Cinebar coming along? And the box office? Are they close to being finished? Just curious. ",
      "created_at": "2005-08-26T01:49:06.000Z"
    },
    {
      "author": "bjork24",
      "body": "The Cinebar will be the last thing we finish. It's kind of messy right now (we store all of our tools on it), which is why they're not featured as much in the pictures.<br/><br/>Don't worry though, the Cinebar will have it's time in the sun soon enough... soon enough. So will the bathrooms.",
      "created_at": "2005-08-26T01:52:25.000Z"
    },
    {
      "author": "Nate",
      "body": "I bring my own cup holders with me.  Everywhere I go.  I am double self cup-holding.  ",
      "created_at": "2005-08-26T02:37:53.000Z"
    },
    {
      "author": "Maddy",
      "body": "I vote for cup holders.  In the end, just how often are people going to be thinking, \"gosh, these chairs are freaking awesome... I am so impressed with the authenticity of the vintage chairs...\"?<br/><br/>Whereas, someone might think, \"gosh, these chairs are freaking awesome... I am so impressed with the cupholders...\"",
      "created_at": "2005-08-26T03:53:14.000Z"
    },
    {
      "author": "Invisitor",
      "body": "I would hope that many, many people would be impressed with vintage chairs, even lumpy orange ones, because they're vintage and quirky and not the same chairs you sit in at every multiplex. Cup holders are only useful for holding supersized fountain drinks and anything else (including Dr. Pepper cans and Hanson's Sodas) practically fall out of them anyway. If you change them out, I doubt you'll cut down on the breakage, but you will cut down on the decor.",
      "created_at": "2005-08-26T04:59:39.000Z"
    },
    {
      "author": "Rachel",
      "body": "hey what about those cup holders that go behind the seat. for example my cup would be nestled in between the crack of the two seats in front of me? i think i first saw that at a hockey or baseball game. there a little marvelous.",
      "created_at": "2005-08-26T05:33:52.000Z"
    },
    {
      "author": "erin",
      "body": "i dont know what rachel is talking about. but i like it.",
      "created_at": "2005-08-26T06:06:44.000Z"
    },
    {
      "author": "brian of moore",
      "body": "cant say im overly interested in a cupholder... i like the chairs the way they are :-)  .. but if it helps you sleep better at night.. so be it",
      "created_at": "2005-08-26T13:03:42.000Z"
    },
    {
      "author": "brian of moore",
      "body": "btw.. i cant flippin wait to click on 'films' and see a listing... woo!!",
      "created_at": "2005-08-26T13:04:33.000Z"
    },
    {
      "author": "Sam Spade",
      "body": "I try to run a search on \"cup holders movie theater\" and Dan's metafile search is number three on the list! Sweet!<br/><br/>I agree with some of the members there. A cup holder like this would work (sorry folks, I know nothing about making it an active link):<br/> http://www.happcontrols.com/amusement/acesor/27142200.htm<br/><br/>A cheaper fix would be to use electrical conduit clamps (http://www.lowes.com/lowes/lkn?action=productDetail&productId=115983-223-E977JC-CTN&lpage=none) screwed to the backs of the seats.",
      "created_at": "2005-08-26T16:01:33.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Wow, committed really isn't the word at this point :) I've read for over a year's worth of commitment. This is downright branding.<br/><br/>Moxie or Bust!<br/><br/>You guys are going to make it, and one day this will go into a book.",
      "created_at": "2005-08-26T18:01:53.000Z"
    },
    {
      "author": "Jeff",
      "body": "I'm so excited, and I just can't hide it.  I agree that the seats should be left vintage.  I think it will add to the overall experience of The Moxie.  I think that visiting this theatre should be an entirely different experience from a multiplex, from the time you step through the doors until you leave.  Ultimately, though, if it is peace of mind that you are wnting, then I think you have earned it.",
      "created_at": "2005-08-26T19:24:24.000Z"
    },
    {
      "author": "Nate",
      "body": "In all seriousness - for once - I fail to see how a single cup-holder de-vintage-izes a chair.  It's a bit like shoulder seat belts in a 65 Mustang isn't it?  <br/><br/>But then I've been told I have terrible taste in antiques by past girlfriends.<br/><br/>I would hate for future Moxie-goers to associate, (on even a deeply sub-conscious level,) the experience of Moxie-going with the discomfort of holding a drink in their laps.  Charm is one thing.  Deliberate austerity is another.<br/><br/>It WILL save on spills.  How could it not?  Cupholders combined with the terrazo (Terrazo!) will save you a lot of headaches.<br/><br/>Unless, of course, money is an issue, but you never mentioned that.",
      "created_at": "2005-08-26T21:02:45.000Z"
    },
    {
      "author": "Nate",
      "body": "Plus, how many times do you think it might be possible that a patron will be wavering on getting a drink or not, but pass in the end - the deciding factor being an unwillingness to dampen their crotch for two hours.  I could see that happening a lot - I know I could see myself doing that at Campbell 16 if they did not have cupholders...not because of the exhorbitant cost of the drink, but because I wouldn't want the task of it while I was trying to focus on the latest Bay-Bruckheimer ExCrapaganza.<br/><br/>Over the long term, what would that cost in revenue?",
      "created_at": "2005-08-26T21:09:40.000Z"
    },
    {
      "author": "nicole",
      "body": "Too bad we can't install airplane trays.",
      "created_at": "2005-08-26T22:18:02.000Z"
    },
    {
      "author": "Scott",
      "body": "Cup holders make sense.  And they are convenient.  I like the single ones that mount on the seat in front.",
      "created_at": "2005-08-27T00:24:40.000Z"
    },
    {
      "author": "Caleb",
      "body": "I thought I might announce on here that on Friday, September 23, the Manhattan Short Film Festival will be coming to Springfield. We are the only city in Missouri that the festival is coming to. It will be held at MSU in the Plaster Student Union Theatre beginning at 7:00pm. 12 short films will be shown and the audience will be voting on the winner, which will be announced in New York two days later. Tickets are $8 ($5 for students) and there will be door prizes and raffle prizes as well as food and drinks. All profits will go towards a new scholarship at MSU for students majoring in digital filmmaking. This is a great accomplishment for MSU and the city of Springfield to host this event, so please come out and support us!<br/><br/>Hopefully the Moxie isn't opening on that night...",
      "created_at": "2005-08-27T01:52:36.000Z"
    },
    {
      "author": "Caleb",
      "body": "Oops...here's the link for the festival:<br/><br/><a href=\"http://www.msfilmfest.com/\">Manhattan Short Film Festival</a>",
      "created_at": "2005-08-27T01:54:04.000Z"
    },
    {
      "author": "brian of moore",
      "body": "caleb- that sounds fun.. you should remind me a week ahead of time.. so i can remember to ask off work :-)",
      "created_at": "2005-08-27T08:22:29.000Z"
    },
    {
      "author": "justin springer",
      "body": "wow touching the 401(k) now thats going balls out man! can't wait for you guys to open!!",
      "created_at": "2005-08-27T21:05:52.000Z"
    },
    {
      "author": "nicki j",
      "body": "i demand Happy Endings!!!<br/><br/>Yup. you'd better show it.<br/><br/>are you shaking from my threat yet?",
      "created_at": "2005-08-29T04:22:21.000Z"
    },
    {
      "author": "Oz",
      "body": "Wow, you cashed out your 401k.  Now that takes moxie!",
      "created_at": "2005-08-29T18:46:30.000Z"
    },
    {
      "author": "Dave Tarulli",
      "body": "You can't imagine how happy I was when I read \"I LOVE DOCUMENTARIES!\" in your post. I was beginning to think I was the only one. Wow. I might have some suggestions for you.",
      "created_at": "2005-09-07T08:54:10.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
