{
  "id": 291,
  "title": "The Moxie's opening date will be...",
  "body": "... announced tomorrow, both on the blog and via our <a href=\"http://www.moxiecinema.com/mail.php\" class=\"broken\">mailing list</a>. I had every intention of writing a lengthy post tonight, but then I sat down in front of the computer (after an extremely long day) all of my energy was immediately zapped. I will, however, leave you with <a href=\"http://www.news-leader.com/apps/pbcs.dll/article?AID=/20050827/NEWS01/508270381/1001/ARCHIVES\" target=\"_blank\" class=\"broken\">this article</a> about the new multiplex that will be opening two blocks North of The Moxie next year. You might remember me <a href=\"/post/60\">mentioning it before</a>.\r\n\r\nSince my quotes were a bit vague in the article, I thought I'd pontificate a bit. First off, I do NOT think the College Station multiplex will spell the end to our theater. If anything, it will increase the community's awareness of downtown being a legitimate entertainment alternative... especially for movies. Secondly, I think 14 screens is a bit excessive for downtown. Had I been running the show, I would've considered six to eight screens and used the extra money to make them amazingly posh. Thirdly, both Wehrenberg (a St. Louis based theater chain) and Goodrich (a Kansas City based theater chain) really dropped the ball by allowing Wallace Theaters (a PORTLAND, OREGON based theater chain) to jump in and steal their hard-earned market share. Had Goodrich acquired the lease, they could've delivered a crushing blow to Campbell 16 Cine... and vice versa. Now both theaters are going to be fighting just to keep up (assuming that College Station can overcome the initial financial burden of opening a multi-million dollar multiplex at a time when most theaters are barely making ends meet). I have a sneaking suspicion that College Station will be charging more per ticket than any other theater in town.\r\n\r\nSo there's the long and short of it. A multiplex opening right next door isn't the best news in the world, but it's also not the worst. We've been faced with a lot bigger obstacles (we've almost run out of money <i>how</i> many times?), and we always seem to come out on top. If anything, having an evil cineplex within line sight of our theater will just make it easier for us to differentiate ourselves from the typical multiplex affair. Until tomorrow...",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-08-30T07:19:59.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "i agree with all things said\r\nthe thought of a 14 screen owned by someone with the ugly mug that reed guy has... (note: all opinions stated in commenting section are soley the opinions of said commentor and not of the moxie...... maybe)  is not very appealing... \r\neither way i figure its very unlikely they will be showing the same movies as the moxie... as it states on that article they are looking at mostly new releases.... \r\nso will i go there? probably.. if there is a new movie out i want to see.. it sure would be alot shorter drive.. than down to cambell 16 or any of the others\r\nif that place wasnt being built.. id still go to one of the others to see those new movies... \r\nso i agree.. they arent really competition.. because you are catering to a different audience .. or at least selling a different product",
      "created_at": "2005-08-30T08:14:20.000Z"
    },
    {
      "author": "matt",
      "body": "the multiplex is indeed a thorn in the side, but i think you're right that it will only serve to highlight the area and show that the moxie is a real alternative.  big multi-screen theaters don't pick up the indies like they should.  instead they have 6 screens of star wars, 3 screens of blockbuster X, and 1 screen for all the other crap that is supposed to be big, but flops.  if you stick to your strategy of counter-programming, i think you'll be fine.  i hope to visit some time.",
      "created_at": "2005-08-30T09:35:42.000Z"
    },
    {
      "author": "Caleb",
      "body": "College Station ain't got nothing on you! Downtown is a place for art, not crap. Look how popular the Artwalk is. All those people would be more interested in seeing a Moxie movie than a CS movie. But I must say that those love seats sound intriguing. But not fot $10 per ticket. \r\n\r\nAnd I thought they were turning the Gillioz into an art gallery. Classic movies will be nifty.\r\n\r\nI honestly don't think it will hurt your business too much. You have a large niche market here and you also have things other theaters won't have. Like good taste in film selection for instance...",
      "created_at": "2005-08-30T17:04:51.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Yeah, when I was at the press conference and they said \"14 screen all-stadium-style auditoriums\" my jaw just about dropped. 14 screens? Why? Are there ever 14 decent Hollywood-produced movies out there at one time? Even if you ran two showings of each, are there even 7 decent flicks?",
      "created_at": "2005-08-30T17:24:18.000Z"
    },
    {
      "author": "Jay",
      "body": "Not to beat a dead horse, but...14 SCREENS?!  Not a good idea.  I agree that fewer screens and a more plush theater would be the way to go.  What will make this new multiplex any different from the others?  Downtown is about variety and uniqueness.  They should have brought something different to the table.  That said, who cares?  I'm going to the Moxie for my movie fix!",
      "created_at": "2005-08-30T17:52:12.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "You'll play to different audiences. 14 Screen Superplexes aren't going to carry Hustle and Flow, Broken Flowers, whatever the next Napoleon Dynamite might be.",
      "created_at": "2005-08-30T17:54:48.000Z"
    },
    {
      "author": "nicole",
      "body": "I was surprised that Hustle and Flow came to Campbell 16. But it was only there for about a week.",
      "created_at": "2005-08-30T19:11:44.000Z"
    },
    {
      "author": "Caleb",
      "body": "Yeah, I was gonna point out what Nicole already did. Campbell 16 is a 16-screen multiplex and got Hustle & Flow, Napoleon Dynamite, and March of the Penguins.",
      "created_at": "2005-08-30T20:07:55.000Z"
    },
    {
      "author": "brian of moore",
      "body": "all three of those movies were playing commercials on tv every five minutes.. before they came out\r\n\r\ni wasnt surprised at all that they were playing at cambell.....\r\n\r\ni agree with aaron though.. the likelyhood of having even 7 good hollywood-style movies at once is very slim",
      "created_at": "2005-08-30T21:22:04.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Geez, even 3.5 at one time is once in a blue moon. I'd almost hesitate to say 1.75, but then I read this:\r\nTheatre show times for Campbell 16 Cine, Tuesday Aug-30-2005\r\nThe Cave\r\n12:40, 3:05, 5:25, 7:45, 10:10\r\nUndiscovered\r\n12:55, 3:00, 5:15, 7:20, 9:25\r\nThe Brothers Grimm\r\n1:20, 4:10, 7:10, 9:55\r\nValiant\r\n1:40, 3:30, 5:20, 7:10, 9:00\r\nThe 40 Year Old Virgin\r\n1:45, 4:20, 7:00, 9:40\r\nRed Eye\r\n1:15, 3:15, 5:15, 7:15, 9:15\r\nSupercross\r\n1:35, 3:30, 5:25, 7:20, 9:15\r\nDeuce Bigalow: European Gigolo\r\n9:20\r\nThe Great Raid\r\n1:00, 4:00, 6:55, 9:45\r\nFour Brothers\r\n2:45, 5:05, 7:25, 9:50\r\nSkeleton Key\r\n12:45, 3:00, 5:20, 7:40, 10:05\r\nDukes of Hazzard\r\n2:15, 5:10, 7:35, 10:05\r\nMust Love Dogs\r\n2:30, 7:30\r\nSky High\r\n2:00, 4:45, 7:05\r\nMarch of the Penguins\r\n12:50, 2:50, 4:50, 6:50, 8:50\r\nWedding Crashers\r\n1:50, 4:40, 7:25, 10:00\r\nCharlie and the Chocolate Factory\r\n4:50, 9:45\r\nWar of the Worlds\r\n1:25, 4:05, 6:45, 9:35\r\n\r\nAt least they only have one screening of Deuce Bigalow today. And the springfield.net website says they have Constant Gardener, but not today?",
      "created_at": "2005-08-30T21:49:29.000Z"
    },
    {
      "author": "Nate",
      "body": "Rotten Tomatoes does not have kind things to say about that list.",
      "created_at": "2005-08-30T22:06:58.000Z"
    },
    {
      "author": "Andy",
      "body": "Constant Gardener = Wednesday release.",
      "created_at": "2005-08-30T22:35:22.000Z"
    },
    {
      "author": "Caleb",
      "body": "Charlie and the Chocolate Factory and of course March of the Penguins are the only two really worth seeing of those. Though I would recommend Red Eye. It was a good thriller with Hitchcock undertones. \r\n\r\nI am trying to find someone to work for me Sept. 21. I wouldn't miss the Moxie grand opening! Is there any way I can reserve/pre-pay for a ticket or two or three or four?",
      "created_at": "2005-08-30T23:26:07.000Z"
    },
    {
      "author": "Andy",
      "body": "Maybe showing some classics/cult favorites on the 21st and 22nd and moving on to new releases Friday?\r\n\r\nThere is only one limited release on the 23rd, and that is limited to LA/NY.  However, the previous week sees Everything Is Illuminated, Thumbsucker, The Thing About My Folks, Hellbent, Crazy Like a Fox, G.\r\n\r\nWho knows.  I'm excited to find out.",
      "created_at": "2005-08-31T01:22:58.000Z"
    },
    {
      "author": "brian of moore",
      "body": "yay!.. 21st! i was totally gonna guess that\r\nso when will the film lineup be released?",
      "created_at": "2005-08-31T01:39:22.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
