{
  "id": 293,
  "title": "I should've mentioned this earlier...",
  "body": "We'll be on the 10:00 news tonight on channel 33 (Springfield's ABC affiliate). If you read this within the next 8 minutes, turn on the tube and check us oooouuuuutttttt!<br/><br/>Otherwise, make sure you drop by the theater tomorrow night for our \"open house,\" which is in no way associated with the First Friday Artwalk. We'll be showcasing paintings from our inaugural artists, Olof and Jennifer Pierson. Their stuff is very, very cool, so make sure you swing by and take a look... and check out the nearly-finished theater! As always, popcorn will be on the house!<br/><br/>Be there or be square... and even if you're square, you should still stop by.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-09-02T06:52:32.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "I was gonna say...Spongebob might take offense to that comment! <br/><br/>I'll be stopping by tomorrow night.",
      "created_at": "2005-09-02T08:46:16.000Z"
    },
    {
      "author": "brian of moore",
      "body": "awwww.. crap.... i was totally watching the 10 o'clock news.. too... but only for a bit... then grew bored and changed it<br/>how sad<br/>im not square.. just boxy..<br/>have fun tomorrow.. ill be working (boo)",
      "created_at": "2005-09-02T13:18:16.000Z"
    },
    {
      "author": "Stephanie",
      "body": "If only there were a red-eye between Knoxville and St. Louis....I'd so be there!<br/><br/>Much luck to you!",
      "created_at": "2005-09-02T16:51:24.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "You guys will also sorta be on the cover of next week's SBJ. We're running a story on our new website and I took a screenshot of the current front page with Justin scooping popcorn on there. I also added some bookmarks on Safari, one for the Moxie, one for MOrawk. We'll get them all, slowly, subliminally.",
      "created_at": "2005-09-02T17:23:28.000Z"
    },
    {
      "author": "Nicole Peters",
      "body": "I did see the Moxie piece on the news. I think the  tie-ins with the community are definitely a plus. My movie group friends and I will be at the open house tonight. Can't wait! ",
      "created_at": "2005-09-02T17:38:12.000Z"
    },
    {
      "author": "Nate",
      "body": "I will be there and be somewhat conical shaped.",
      "created_at": "2005-09-02T19:13:21.000Z"
    },
    {
      "author": "mish",
      "body": "\"yay\" in the comment section from a few days ago.<br/><br/>that would totally rock.<br/><br/>will you give us a preview of what movies you will show?",
      "created_at": "2005-09-02T21:47:51.000Z"
    },
    {
      "author": "mish",
      "body": "i mean, a preview in the blog",
      "created_at": "2005-09-02T21:48:03.000Z"
    },
    {
      "author": "Caleb",
      "body": "Of course Dan & Nicole won't give us a preview of the movies they will be showing. They are sneaky sneaky little people. They wear us down until we follow their every command...and I just broke protocol.",
      "created_at": "2005-09-02T22:22:33.000Z"
    },
    {
      "author": "bjork24",
      "body": "The Caleb drone speaks the truth.",
      "created_at": "2005-09-02T23:56:16.000Z"
    },
    {
      "author": "11 of 9",
      "body": "We are the Borg.  Livestrong bracelets and all things Hollister.  Resistance is futile.",
      "created_at": "2005-09-03T01:39:31.000Z"
    },
    {
      "author": "Tristor",
      "body": "Thank you Dan for allowing me to take photos tonight.  I had to leave for another engagement but I got them uploaded real fast.  My posting on the subject is <a href=\"http://tristor.name/index.php?itemid=269\" title=\"My blog post about it\">somewhere on my blog</a> and the photos are <a href=\"http://trixxpix.org/thumbnails.php?album=21\" title=\"Photos of the Moxie\">somewhere in my picture gallery</a>.  ",
      "created_at": "2005-09-03T04:51:49.000Z"
    },
    {
      "author": "Tristor",
      "body": "Dan, you wouldn't mind me taking photographs again on opening night would you?  Also, feel free to use the images for whatever you want, I don't have a problem with it.",
      "created_at": "2005-09-03T07:58:25.000Z"
    },
    {
      "author": "whitty",
      "body": "Hey Dan, Thanks for letting us sit in your theater and kvetch for about an hour last night.<br/><br/>And Timmy pointed out that I said the screen was small.  What I meant was, the screen is small YET perfect for the space.  Everything looks great!  I mean it!  I am not even sucking up for free popcorn or nothing,<br/><br/>And I thought the art hall looked really spectacular, that was an excellent idea.",
      "created_at": "2005-09-03T17:04:48.000Z"
    },
    {
      "author": "erin",
      "body": "tristor has made me famous! i shall now only be known as... woman with baby stroller.<br/>dont call me erin. i wont respond.<br/>: )<br/><br/>dan, nicole - i was really impressed last night. you guys have done so much since the august art walk. amazing.",
      "created_at": "2005-09-04T04:15:48.000Z"
    },
    {
      "author": "Grey Hodge",
      "body": "I must admit to halping Tristor describe some of them. Picasso had \"Woman descending a staircase\", Tristor has \"Woman with stroller\". We need to petition Dan to show that before ever film. ;)<br/><br/>Glad you made it there Tristor, and Dan, I'm sorry for inflicting my friends upon you. ;)",
      "created_at": "2005-09-04T10:11:34.000Z"
    },
    {
      "author": "Tristor",
      "body": "Yeah, I really can't take credit for the descriptions.  I had a few I wrote, but they pretty much sucked and weren't near as funny.  Grey helped me with some creative editing.",
      "created_at": "2005-09-04T10:16:18.000Z"
    },
    {
      "author": "Pam Nickle",
      "body": "I want to come to a test screening!  Pick me, pick me!!!",
      "created_at": "2005-09-04T17:42:14.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
