{
  "id": 294,
  "title": "The long weekend",
  "body": "Here's a quick recap of this weekend's events:\r\n\r\n<b>Friday</b> - <i>First Friday</i> - We had an enormous crowd at the theater. If I were to take a guess, which I'm going to do right now, I'd say we had at least 600 people swing by to say hello. The best part of the evening was seeing people sit in the auditorium and say \"Wow, these seats are really comfy!\" The worst part of the evening was when one gentleman sat down and the seat broke and he fell to his death on the cold hard terrazzo. Just kidding! The worst part was actually when our popper stopped working... roughly 40 minutes into the event. Apparently there's a short in the kettle. Martin Short.\r\n\r\nIt was also funny to see people sit in the auditorium and watch a 15 minute slideshow of us renovating the building (imagine every phlog photo, plus a bunch more, on a continuous loop). Another enjoyable moment that sticks out in my mind was seeing a bunch of kids literally climb over the chairs and jump up and down on the stage... despite my awesome <a href=\"http://trixxpix.org/displayimage.php?album=21&pos=7\" target=\"_blank\" class=\"broken\">warning sign</a> (picture via <a href=\"http://www.tristor.name\" target=\"_blank\" class=\"broken\">Tristor</a>). That pretty much sealed the deal for us NEVER having a kid's movie.\r\n\r\nThirdly, here's a funny conversation I had with an old woman (and by old, I mean 30 years old... we're talkin' seriously ancient!):\r\n\r\nWOMAN: Um, will your movies be rated?\r\nME: Yes. They're just like regular movies.\r\nWOMAN: So they'll have a standard PG rating?\r\nME: Some of them will, but we'll show all kinds of movies - everything from family-oriented films to movies for an older, more matured crowd.\r\nWOMAN: (<i>looks mortified</i>)\r\nME: We're not showing porn.\r\nWOMAN: (<i>sigh of relief</i>) Oh. Thank gosh!\r\n\r\nThen an even stranger guy jumps into the conversation.\r\n\r\nGUY: But you're showing local films, right?\r\nME: That's right.\r\nGUY: Will they be rated too?\r\nME: No, I doubt the local films will be rated.\r\nGUY: Then how will you know if you should show them?\r\nME: Well, we'll probably screen the movie beforehand, and if it's not too vulgar or pornographic, we'll show it.\r\nGUY: But it won't be rated.\r\nME: No.\r\nGUY: Then how will I know if I should see it? And how will you know what age to limit the movie too?\r\nME: I guess you'll just have to trust us.\r\nGUY: I don't know. I've seen a lot of PG movies that should've been rated R.\r\nME: Lots of boobies and stuff?\r\nGUY: I beg your pardon!\r\nME: Why don't you go talk to someone who cares.\r\nGUY: Wha.. wha... what?\r\nME: You heard me, oatmeal-breath. Go tell it to the toilet.\r\nGUY: But that doesn't make sense.\r\nME: Neither does this! (rips chair out of the ground and throws it through the boarded up windows) See you later, dorkus maximus! (jumps through the broken window and vanishes into the milky night)\r\n\r\nAll of that was completely true. Up to the part about me saying \"dorkus maximus.\" I actually said \"dorkeys maximurse,\" but I changed it so I'd look cooler in the flashback.\r\n\r\nThe rest of the weekend was spent working on the theater, as per usual. We observed the holiday weekend by only working 10 hours on Friday. How's that for laborious! Huh? You're not supposed to work 44 hours over the course of a four day weekend? Then why do they call it <i>labor</i> day? That's ridiculous. I don't even own a rooster!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-09-06T07:31:43.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "hah!... erin is known as 'woman with baby stroller'  ... awesome",
      "created_at": "2005-09-06T08:27:49.000Z"
    },
    {
      "author": "brian of moore",
      "body": "ps:  whats with the big M behind you and nicole in one of the photos... are you going to put it on a podium.. and stick it by the door to the auditorium.. so people can rub it for good luck before going in to watch a movie?  .. please?",
      "created_at": "2005-09-06T08:30:41.000Z"
    },
    {
      "author": "woman with baby stoller",
      "body": "yes i am brian. yes i am.",
      "created_at": "2005-09-06T09:12:17.000Z"
    },
    {
      "author": "Andy",
      "body": "The open house was sweet.  My friends and I were telling everyone we met later that night to check it out.",
      "created_at": "2005-09-06T16:47:21.000Z"
    },
    {
      "author": "Caleb",
      "body": "Some people are so annoying in this town! I bet that same woman would DIE if she took her kids to a PG-13 movie with a mild sex scene, but at the same time probably lets her kids play Grand Theft Auto and kill cops all afternoon. Agh! You handled it well. I could not have been so polite, heh heh. \r\n\r\nThe Moxie looked amazing, and those seats truly are comfy!",
      "created_at": "2005-09-06T17:35:08.000Z"
    },
    {
      "author": "Tristor",
      "body": "Your conversation with that lady had me in stitches.  I'm surprised anybody would think you'd be showing porn at an independent theater.",
      "created_at": "2005-09-06T18:41:30.000Z"
    },
    {
      "author": "nicole",
      "body": "Surprisingly, a lot of people have asked about that.",
      "created_at": "2005-09-06T20:56:41.000Z"
    },
    {
      "author": "Derek the local college student",
      "body": "Guy totally deserved it. Me is so awesome.",
      "created_at": "2005-09-06T22:13:03.000Z"
    },
    {
      "author": "erin",
      "body": "i was telling my grandma about the moxie. when i told her it was an independent theater she asked me if that meant it was a porn theater...",
      "created_at": "2005-09-06T23:23:44.000Z"
    },
    {
      "author": "Caleb",
      "body": "Perhaps we <i>should</i> tell them you will show porn. At least we'll keep the morons away! Just kidding. Morons bring in business too.",
      "created_at": "2005-09-07T01:02:45.000Z"
    },
    {
      "author": "Nate",
      "body": "An attorney at my job asked the SAME thing when I said \"art-house\" theatre.  What is WITH people?",
      "created_at": "2005-09-07T01:08:18.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Sounds like people REALLY subconciously want there to be a porn theater in this town.",
      "created_at": "2005-09-07T01:26:02.000Z"
    },
    {
      "author": "justin springer",
      "body": "your flashback makes me laugh a lot!....in fact, i think i peed myself (is that how you spell \"peed\"? that looks weird. hmmm.) lol boobies.",
      "created_at": "2005-09-07T01:42:12.000Z"
    },
    {
      "author": "actually....",
      "body": "I haven't seen a whole ton of independent movies but at least a couple of those I have seen were darn near pornographic...maybe that's the sort of thing those people were referring to...",
      "created_at": "2005-09-07T01:48:04.000Z"
    },
    {
      "author": "brian of moore",
      "body": "wait a second....  no porn?!?!?\r\nwhy do yout think i became a founding member???  sheesh\r\ni take it .. the brown bunny.. wont be showing...\r\nthat chloë.... such a silly girl",
      "created_at": "2005-09-07T03:36:08.000Z"
    },
    {
      "author": "nicki",
      "body": "people are stupid. i mean all people. even myself.",
      "created_at": "2005-09-07T04:14:05.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 14,
      "name": "Dialogue"
    }
  ]
}
