{
  "id": 295,
  "title": "Our projector is up and running",
  "body": "For testing purposes, our projector installer, Lanny, gave me an old film that was gathering dust in his garage. \"You can keep it,\" he told me. And so, ladies and jelly spoons, I give you the film that christened the Moxie's porthole:<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/090605/shining_through.jpg\" width=\"350\" /><br/><br/><a href=\"http://www.imdb.com/title/tt0105391/\" target=\"_blank\">Shining Through</a>, starring the indomitable team of Michael Douglas and Melanie Griffith... and Liam Neeson. Unfortunately, Liam's not on any of the reels we have, so I'm not sure if he's <i>really</i> in the movie.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-09-07T07:34:47.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Andy",
      "body": "\"Ed Leland is an American spymaster who needs to spy on a high level German Army officer during World War II. Because of her pastry-baking skills, he decides to send in his secretary, Linda Voss. For this part, the producers bravely (if stupidly) cast Melanie Griffith.\"<br/><br/>Spy-baking.  Mmhmm...",
      "created_at": "2005-09-07T07:40:17.000Z"
    },
    {
      "author": "nicole",
      "body": "She has the same last name as I used to have!",
      "created_at": "2005-09-07T07:41:43.000Z"
    },
    {
      "author": "Caleb",
      "body": "haha. what an appropriate title. but you know what we REALLY want to know. the one thing you will not tell us: the opening night feature! when do you think you will be announcing what movie will be showing?",
      "created_at": "2005-09-07T07:58:29.000Z"
    },
    {
      "author": "brian of moore",
      "body": "youre not going to make anyone else watch that .. are you?<br/>... err i mean.. im sure it has its good points.... *cough* credits *cough*<br/>",
      "created_at": "2005-09-07T10:30:15.000Z"
    },
    {
      "author": "erin",
      "body": "yes. i have the same question as mr. caleb...",
      "created_at": "2005-09-07T15:51:32.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "I put that on my netflix queue because her last name is Voss.",
      "created_at": "2005-09-07T16:29:27.000Z"
    },
    {
      "author": "nicole",
      "body": "You might want to take it off...although we only saw it for about 30 minutes and without sound, so who am I to judge?",
      "created_at": "2005-09-07T17:08:46.000Z"
    },
    {
      "author": "Nate",
      "body": "Hey, I REMEMBER this one! My mom rented it one night; I must have been pretty young...Even then I remember thinking: \"That girl's voice is really squeaky and she seems awfully miscast.  I think I may go play Excite Bike.\"<br/><br/>But I will watch anything set around 40's era Nazi-spy-intrigue type stuff.  Anything.  No matter the level of crappy.",
      "created_at": "2005-09-07T17:29:34.000Z"
    },
    {
      "author": "Jeremy",
      "body": "Did anybody else laugh at the phrase \"christened the Moxie's porthole\"?  Anybody?  Anybody?",
      "created_at": "2005-09-07T17:46:41.000Z"
    },
    {
      "author": "Stephanie",
      "body": "If you take into account that I don't care for either Griffith or Douglas...I didn't totally hate this movie.  <br/><br/>Then again, I'm not sure I could watch it again, either!<br/><br/>You're better off waiting for the not-yet made/released 'The Good German'; much better material and cast.",
      "created_at": "2005-09-07T18:32:12.000Z"
    },
    {
      "author": "Nate",
      "body": "Solo dos semanas!  Ayeeee!",
      "created_at": "2005-09-07T20:26:50.000Z"
    },
    {
      "author": "C. A. Yankton",
      "body": "Actually, it wasn't THAT bad, The film is based on a true story. ",
      "created_at": "2005-09-08T02:51:37.000Z"
    },
    {
      "author": "nicholas",
      "body": "The only bad part is the Griffith is supposed to speak convincing lower-class German. But she can't. At all. And it just makes you groan. Yes, I've watched the whole movie... (sigh) there goes my indy cool cred.",
      "created_at": "2005-09-08T05:10:07.000Z"
    },
    {
      "author": "Allison",
      "body": "That was my favorite movie for years!  Besides the whole moving being fabulous, I love the part near the end where they're watching \"Tristan und Isolde\" and Liam takes her hand -- brilliant!  Meanwhile, the book is even more superb -- it covers (generally) the same story but at a different time, mostly pre-what the movie covers.  Really well written  and an easy read.",
      "created_at": "2005-09-08T06:27:40.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
