{
  "id": 296,
  "title": "Stress in, stress out",
  "body": "This week has been <i>CRAZY!</i> We've gotten so much done, yet we have so much left to do. The biggest accomplishment was getting the projector up and running. Everything is running 100%, and we're completely ready for our test screenings (starting next week). I know everyone is anxious to hear what our schedule will be, but all I can tell you is this...\r\n\r\nOur test film will be <b>Amelie</b>! I know the majority of you have already seen it, but we still thought it would be a great film to show for our test screenings. Mainly because 1) it's a 35mm print, which means we can test our big projector (the bread and butter of the operation), 2) it's subtitled (so we can make sure everyone gets a good view of the screen), and 3) it's a really good film. We're still planning on having one (maybe two) blog reader screenings, but I haven't come up with a solid way to ensure everyone gets a fair chance at claiming a ticket. If I can find some time tomorrow, I'll create an online RSVP form that will allow you to claim a ticket, along with a guest.\r\n\r\nWe still have lots to do before the screenings begin (as in, get our final inspections), but I'm hoping everything will fall into place. As for the first film... I won't say much, but I will say this: the title is longer than five words.\r\n\r\nMore later.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-09-09T08:38:45.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Ben Dillon",
      "body": "Me and You and Everyone We Know? \r\n\r\nThat's not my guess for the movie, I was just asking.",
      "created_at": "2005-09-09T09:13:34.000Z"
    },
    {
      "author": "justin springer",
      "body": "you're in luck i'm an inspector...trust me on this one. everything looks great. in my opinion you should probably just go ahead and open this puppy up. skip the wait. actually i'm...not really an inspector, but if i were that's what i'd say.",
      "created_at": "2005-09-09T11:26:21.000Z"
    },
    {
      "author": "erin",
      "body": "thumbsucker thumbsucker thumbsucker thumbsucker thumbsucker thumbsucker.\r\n\r\nthats six.... but i guess it probably doesnt work that way.\r\n\r\n: )",
      "created_at": "2005-09-09T16:01:29.000Z"
    },
    {
      "author": "Nate",
      "body": "The.  Sisterhood.  Of.  The.  Traveling.  Pants.\r\n\r\n\r\n\r\nWhat?",
      "created_at": "2005-09-09T17:49:36.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "It's a Mad Mad Mad Mad Mad Mad Mad Mad Mad Mad Mad Mad Mad Mad Mad Mad Mad Mad World?",
      "created_at": "2005-09-09T18:30:46.000Z"
    },
    {
      "author": "Ole",
      "body": "The Return of the Jedi, part 32?",
      "created_at": "2005-09-09T19:09:24.000Z"
    },
    {
      "author": "Nate",
      "body": "Le Fabuleux destin d'City of Broken  Flowers Lost in the Aquatic.",
      "created_at": "2005-09-09T19:16:36.000Z"
    },
    {
      "author": "Elise",
      "body": "! !!!",
      "created_at": "2005-09-09T19:28:39.000Z"
    },
    {
      "author": "Caleb",
      "body": "Did I ever tell you about the Beat that My Heart Skipped? I told the Smartest Guys in the Room at Enron. I was going to tell the Prize Winner of Defiance, Ohio but she doesn't win until September 30.\r\n\r\nGlad you're showing Amelie. I can't think of a better test film. ",
      "created_at": "2005-09-09T22:36:45.000Z"
    },
    {
      "author": "brian of moore",
      "body": "<a href=\"http://www.indiewire.com/biz/biz_050628road.html\">sarah silverman: jesus is magic</a>\r\n.. a colon counts right?\r\ni thought that wasnt coming out till november... and you already got it??  awesome!!",
      "created_at": "2005-09-09T22:45:11.000Z"
    },
    {
      "author": "Nate",
      "body": "Oh those luscious enhanced greens!\r\n\r\nThat gorgeous piano score!\r\n\r\nThe 15 orgasm scene will be certain to rock the new sound system.\r\n\r\nWait...is this film rated?",
      "created_at": "2005-09-09T22:56:46.000Z"
    },
    {
      "author": "Andy",
      "body": "Aww... why can't we watch Jean-Pierre Juenet's masterpiece Alien Ressurection?!",
      "created_at": "2005-09-09T23:59:01.000Z"
    },
    {
      "author": "Mark",
      "body": "IDEA! You must sell film magazines!\r\n\r\nI've always wondered why cimemas don't. After you've watched a film and all you want want to do is talk about the movie and the trailers, the latest movie mag would be the perfect companion!\r\nM ",
      "created_at": "2005-09-10T00:07:45.000Z"
    },
    {
      "author": "Nate",
      "body": "That really is a good idea.  Blockbuster does it.\r\nThere must be some kind of catch.",
      "created_at": "2005-09-10T00:27:53.000Z"
    },
    {
      "author": "elliott",
      "body": "amelie good... test screenings good... moxie good... me=happy...",
      "created_at": "2005-09-10T00:35:59.000Z"
    },
    {
      "author": "Maddy",
      "body": "Off topic, but my local college is showing Mad Hot Ballroom right now.  It is going to be great!  You all need to show it at the the Moxie.",
      "created_at": "2005-09-10T00:58:07.000Z"
    },
    {
      "author": "Caleb",
      "body": "I just realized Dan TOLD us the name of the movie and none of us caught it.\r\n\r\n\"Longer than Five Words\" is a heartbreaking tale about a young man who has a disability of writing sentences that have more than five words in them. He travels across the Netherlands trying to find something that inspires him to write an epic 10-word sentence. He meets all kinds of people in his journey and in the end discovers that it's not how many words there are, it's how you say them. \r\n\r\nI don't think it was very popular here in the States. Kudos to Dan and Nicole for bringing an international classic to the Moxie.",
      "created_at": "2005-09-10T01:20:46.000Z"
    },
    {
      "author": "Nate",
      "body": "That was just plausible enough to make me IMDB it.  \r\nDamn you.  Damn you and your invented Dutch art films!",
      "created_at": "2005-09-10T02:03:37.000Z"
    },
    {
      "author": "bjork24",
      "body": "That was funny... funny and true.",
      "created_at": "2005-09-10T02:19:33.000Z"
    },
    {
      "author": "Steve",
      "body": "Amelie...Dan...I love you, man...*sob*",
      "created_at": "2005-09-10T10:33:02.000Z"
    },
    {
      "author": "erin",
      "body": "oh god. i thought caleb was serious there for a moment...\r\n\r\nit actually sounds like one of the short films we would make. haha. good idea caleb!",
      "created_at": "2005-09-10T18:44:55.000Z"
    },
    {
      "author": "erin",
      "body": "hey dan - will the moxie have a little spot in the news-learder LIFE section with all the other theaters that tell whats showing and when?\r\n\r\nnot that i (or lots of other people) would ever use that as a reference. because all of that would be listed on the site anyway. but i was just wondering...",
      "created_at": "2005-09-11T20:55:49.000Z"
    },
    {
      "author": "rachel",
      "body": "i'm sorry i'm going to miss it, especially the part where dan goes up and tries to make-out with the screen",
      "created_at": "2005-09-12T00:09:07.000Z"
    },
    {
      "author": "David & Kate Foster",
      "body": "Have you seen \"A Very Long Engagement\" yet??  It has the chick from \"Amelie\" in it, is subtitled, and is generally a fantastic movie.  A couple of good foreign films I've seen recently include:\r\n\"Zelary\"\r\n\"Downfall\" (about Hitler's last days)\r\n\r\nJust some ideas.  :)",
      "created_at": "2005-09-12T04:00:12.000Z"
    },
    {
      "author": "Caleb",
      "body": "Downfall was amazing. Also check out Oldboy  - great movie.",
      "created_at": "2005-09-12T10:29:20.000Z"
    },
    {
      "author": "David & Kate Foster",
      "body": "Oldboy?  What is that about?  Sounds interesting.  \r\n\r\n",
      "created_at": "2005-09-13T10:02:56.000Z"
    },
    {
      "author": "elliott",
      "body": "i figured out what movie will be playing for the first show... \"dont be a menace to south centeral while drinking your juice in the hood\"... maybe... bad guess",
      "created_at": "2005-09-14T01:47:05.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
