{
  "id": 297,
  "title": "I'm sorry, dear blog readers",
  "body": "I've been noticably absent from the comment and forum interaction for quite some time. As I <a href=\"/posts/192\">noted in the past</a>, there's a definite correlation between how busy I am at the theater and how involved I get with the blog. There was once I time when the blog and I were quite... \"intimate,\" shall we say. Whenever a new comment was posted, I was quick to respond with a comment of my own. I used to compliment the blog. Take it out for dinner. We were tight. Now I won't even return the blog's phone calls. When I see the blog in public, I pretend like I'm searching for loose change on the ground so I don't have to talk to it. It's a sad, sad situation. With that being said, I've noticed a lot of questions floating around in the comments as of late. Nicole has answered most of them, but a lot of them are still dangling out there... on the ledge of a building... like Goldie Hawn in <i>Bird on a Wire</i>... waiting for a mulleted Mel Gibson to save her. Anyways, I think it's time for a new Q&A session.\r\n\r\nSo, for those of you who are new to the game or have forgotten the rules, here's how it goes: if you have a question, stick it in the comments section of THIS post and I'll try my darnedest to answer each and everyone of them in my NEXT post, which will either be late tomorrow night or sometime on Tuesday. I'll even answer what our first film will be, if anyone's still wondering. I won't, however, give you my social security number. Everything else is fair play!\r\n\r\nSo reach deep inside you... deeper... DEEPER... there you go. Now see that burning pile of trash over there in the corner? Yeah, the one by the Dr. Pepper can. That's a burning question that you've been dying to ask. Go ahead... drink that Dr. Pepper. It's good isn't it? Now pick up the burning question. WAIT! No! I meant ASK the burning question, not PICK UP the burning question! Sorry. Well, what did you expect? All fire is hot! Ok, ask your question so I can go to sleep. Thanks.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-09-12T08:09:28.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Rob",
      "body": "So what will the first film be?\r\n\r\nWhat can we expect at the cine-bar?",
      "created_at": "2005-09-12T08:44:32.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "When is the blogfan test screening?\r\n\r\nDid you ever find your hat?\r\n\r\nCan I be on the Moxie Street Team??",
      "created_at": "2005-09-12T08:46:14.000Z"
    },
    {
      "author": "nathan",
      "body": "boxers or briefs?",
      "created_at": "2005-09-12T09:12:51.000Z"
    },
    {
      "author": "erin",
      "body": "i asked this down below...\r\n\r\nwill the moxie have a spot in the news-learder LIFE section with showtimes and other information?\r\n\r\ndoes that cost you folks tons of money?",
      "created_at": "2005-09-12T09:25:30.000Z"
    },
    {
      "author": "erin",
      "body": "hey! i wasnt even done with what i asked... but it posted it without my permission.\r\n\r\nthe other part of the question was going to be...\r\n\r\nwould that even be nessisary?",
      "created_at": "2005-09-12T09:26:30.000Z"
    },
    {
      "author": "nicki",
      "body": "Are you jellin?",
      "created_at": "2005-09-12T09:37:59.000Z"
    },
    {
      "author": "Caleb",
      "body": "When is the test screening (or two)? \r\n\r\nAre you still looking into setting up a MSU course through the Moxie?\r\n\r\nHow willing are you going to be in showing local college student short films?\r\n\r\nWill you be holding any festivals in conglomeration with the Missouri Film Alliance?\r\n\r\nDid the popcorn popper ever get fixed?\r\n\r\nI asked six questions the last time, so this time I will give you a break and make it only five. I'm thoughtful like that.",
      "created_at": "2005-09-12T10:27:58.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i suppose ill have to email you\r\ni also want to know when the blog screening is... as well as the founders screening\r\nbut in order to ask off work for these events i need to know by at least noon on tuesday :-)\r\n\r\naside from that .. the only real question is whether or not you will serve white russians......... please.. for the love of god.. tell me that you will... ",
      "created_at": "2005-09-12T16:11:40.000Z"
    },
    {
      "author": "Jessi D",
      "body": "will there be root beer?\r\n\r\ni sure love root beer.",
      "created_at": "2005-09-12T17:24:13.000Z"
    },
    {
      "author": "Nate",
      "body": "What's in YOUR wallet?",
      "created_at": "2005-09-12T17:46:25.000Z"
    },
    {
      "author": "Jes",
      "body": "It is 11 PM do you know where your kids are at?",
      "created_at": "2005-09-12T17:50:52.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "Dan, top five musical crimes perpetrated by Stevie Wonder in the '80s and '90s. Go. Sub-question: is it in fact unfair to criticize a formerly great artist for his latter day sins, is it better to burn out or fade away?",
      "created_at": "2005-09-12T18:27:13.000Z"
    },
    {
      "author": "Lor",
      "body": "Are you one of those guys that can easily grow a beard or does it take a while for the hair to grow?\r\n\r\nHave you invited anyone famous to the opening night, if so, who?\r\n",
      "created_at": "2005-09-12T20:29:51.000Z"
    },
    {
      "author": "mish",
      "body": "\r\nif it was possible to take out your eyes, optical nerves still attatched and everything was okay, and you were to point each eye at another, what would eye would you see?",
      "created_at": "2005-09-13T01:52:40.000Z"
    },
    {
      "author": "Nate",
      "body": "If a cat always lands on its feet, and a piece of buttered bread always lands butter-side down, what would happen if you strapped a piece of buttered bread to the back of a cat?",
      "created_at": "2005-09-13T02:35:37.000Z"
    },
    {
      "author": "Mark",
      "body": "How's the poster collage (too tired to check spelling) coming?\r\n\r\nWill you have a Mark's Magazine Rack?\r\n\r\nHow many Founding Member chairs have you sold?\r\n\r\nM",
      "created_at": "2005-09-13T03:26:36.000Z"
    },
    {
      "author": "Sheila",
      "body": "So, it's just over a week til opening night and some of us might like to know:  a)  what movie are you showing and 2)  what are the movie times and iii)  how much will tickets cost?  You might even consider putting that info on your phone call-in line, since it doesn't seem to be anywhere on your website.  Thanks - I'm trying to become a fan, here!!",
      "created_at": "2005-09-14T00:08:39.000Z"
    },
    {
      "author": "erin",
      "body": "another question!\r\n\r\nfirst friday artwalks - will you still be open to look at your art wall even if there is a movie playing?",
      "created_at": "2005-09-14T06:46:15.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
