{
  "id": 299,
  "title": "I shan't keep you waiting...",
  "body": "Today has been a long day. I was meaning to sit down and answer the Q&A, but I haven't found the time yet. My grandmother unexpectedly died this afternoon. All work has pretty much stopped since then. Nicole and I have done a few things, but it's hard to do much when your mind is elsewhere. I won't delve into unnecessary detail here, but I did want to leave a quick post to FINALLY announce our opening film(s). I'm sorry I didn't announce them earlier, but we wanted to make darn sure we had them in the bag.\r\n\r\nThe opening night film will be <a href=\"http://www.imdb.com/title/tt0415978/\" target=\"_blank\">Me and You and Everyone We Know</a>, Miranda July's poetic and penetrating observation of how people struggle to connect with one another in an isolating and contemporary world. The film has already garnered a TON of awards at Sundance, Cannes, and the Independent Spirit Awards, so you can only imagine the pride Ms. July must feel for being chosen as our opening film.\r\n\r\nThere will also be a yet to be announced late night movie on Friday and Saturday night (Sept. 23 & 24)... I won't say much, but I will say this: \"I like your nurse's uniform, guy.\" Or maybe I'll say this: \"Hey Peter, man, check out channel 9! It's the breast exams!\"\r\n\r\nMoving on... we'll be splitting <a href=\"http://www.imdb.com/title/tt0415978/\" target=\"_blank\">Me and You and Everyone We Know</a> with <a href=\"http://www.imdb.com/title/tt0436613/\" target=\"_blank\">Murderball</a> starting on September 28th, and then premiering our biggest movie yet on October 5th. Will I tell you the movie? Of course not! You'll just have to wait until the October calendar comes out.\r\n\r\nAgain, I'm sorry about the Q&A session. I'll get to it soon... I promise. Until then, we still have a few seats left for our Thursday night blog reader test screening. If you haven't <a href=\"/post/invite/\" class=\"broken\">claimed your tickets</a> yet, I'd suggest doing so... NOW!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-09-14T05:11:58.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Al",
      "body": "Sorry about your loss, Dan and Nicole.",
      "created_at": "2005-09-14T05:39:27.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i send my condolences as well\r\nive dealt with this kind of thing far too much this year\r\n\r\nsee ya thursday",
      "created_at": "2005-09-14T05:56:01.000Z"
    },
    {
      "author": "erin",
      "body": "my thoughts are with you.",
      "created_at": "2005-09-14T06:44:54.000Z"
    },
    {
      "author": "David & Kate Foster",
      "body": "We're sorry for your loss.",
      "created_at": "2005-09-14T06:48:12.000Z"
    },
    {
      "author": "Caleb",
      "body": "Sorry for your loss. ",
      "created_at": "2005-09-14T06:58:21.000Z"
    },
    {
      "author": "brian of moore",
      "body": "btw.. i recall seeing that movie on apple/trailers .. well both of those actually.. \r\ncant wait to see them both :-)",
      "created_at": "2005-09-14T07:21:13.000Z"
    },
    {
      "author": "Andy",
      "body": "I'm awfully sorry to hear the news.\r\n-\r\nAwesome opening film choices!\r\n\r\nI know both those midnight movie quotes and they're both awesome, also.",
      "created_at": "2005-09-14T07:30:23.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "My condolences for your loss...\r\n\r\nI saw \"Me and You and Everyone We Know\" at The Ragtag a couple weeks ago. It's an excellent choice for the opening film. Unfortunately, I'm stuck in Columbia without means of getting to Springfield for the opening, so I'll just have to settle for The Ragtag that night. Your allusions to the late night films make it all the more upsetting.",
      "created_at": "2005-09-14T08:36:17.000Z"
    },
    {
      "author": "Dave",
      "body": "sorry to hear about your grandmom dan",
      "created_at": "2005-09-14T16:31:13.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "Sorry Dan. That's no fun at all.\r\n\r\n\"O.R. they?\"",
      "created_at": "2005-09-14T16:50:20.000Z"
    },
    {
      "author": "whitty",
      "body": "I am so sorry.  You two take care of each other.",
      "created_at": "2005-09-14T17:24:07.000Z"
    },
    {
      "author": "elliott",
      "body": "sorry about the loss of your grandma...\r\n\r\nnice movie quotes!\r\n\r\nexcited!\r\n\r\ni heard there was going to be piranas!\r\n\r\n\r\n\r\n",
      "created_at": "2005-09-14T17:35:58.000Z"
    },
    {
      "author": "Sukotto",
      "body": "[delurk]\r\nMy sincere condolences Dan and Nicole.",
      "created_at": "2005-09-14T17:46:10.000Z"
    },
    {
      "author": "Rachel",
      "body": "It's been a tough year, hasn't it? Hang in there...I think things are going to get significantly better from here on out.",
      "created_at": "2005-09-14T18:30:28.000Z"
    },
    {
      "author": "mish",
      "body": "my prayers are with you all!\r\n\r\n\r\n\r\ndamn it feels good to be a gangster.",
      "created_at": "2005-09-14T18:40:05.000Z"
    },
    {
      "author": "liam",
      "body": "I'll be honest with you, I love his music, I do, I'm a Michael Bolton fan. For my money, it doesn't get any better than when he sings \"When a Man Loves a Woman\"",
      "created_at": "2005-09-14T20:44:47.000Z"
    },
    {
      "author": "Kess",
      "body": "So sorry to hear about your loss, Dan and Nicole. My grandfather passed away two weeks ago and I know how hard it was to focus on anything. My thoughts and prayers are with you and your family.\r\n\r\nI have been wanting to see both of your opening movies ever since I stumbled upon their trailers a few weeks ago (Oh how I love you, www.apple.com/trailers/). Fantastic choices.\r\n\r\n\"But here's my advice to the rest of you: Take dead aim on the rich boys. Get them in the crosshairs and take them down. Just remember, they can buy anything but they can't buy backbone. Don't let them forget it.\"",
      "created_at": "2005-09-14T20:53:19.000Z"
    },
    {
      "author": "elliott",
      "body": "^\r\n|\r\ngood quote... i should of thought of that one...",
      "created_at": "2005-09-15T00:11:46.000Z"
    },
    {
      "author": "brian of moore",
      "body": "btw.. this made me feel good after my roommate passed away.. figured id pass it on- \r\n\r\nDeath is nothing at all. It does not count. I have slipped away into the next room. \r\nNothing has happened. Everything has remained exactly as it was.\r\nI am I, and you are you, and the old life that we lived so fondly together is untouched, unchanged. \r\nWhatever we were to each other, that we are still. Call me by the old familiar name. \r\nSpeak of me in the easy way, which you always used. Put no difference into your tone. \r\nWear no forced air of solemnity or sorrow. Laugh as we always laughed at the little jokes \r\nthat we enjoyed together. Play, smile, think of me, and pray for me. Let my name be ever \r\nthe household word that it always was. Let it be spoken without an effort, without the ghost \r\nof a shadow upon it. Life means all that it ever meant. It is the same as it ever was. There is \r\nabsolute and unbroken continuity. What is this death but a negligible accident? Why should \r\nI be out of mind because I am out if sight? I am but waiting for you, for an interval somewhere \r\nvery near, just round the corner. All is well.\r\n\r\n-Henry Scott Holland",
      "created_at": "2005-09-15T01:43:23.000Z"
    },
    {
      "author": "erin",
      "body": "CALEB COPELAND: this is a note to remind you to tell dan and moxie blog readers about the Mark Zupan lecture. i would tell them... but i already forget the time and date.",
      "created_at": "2005-09-15T02:37:43.000Z"
    },
    {
      "author": "Caleb",
      "body": "Ha...just as I come to the Moxie to post a comment about it I see Erin has beat me to it and scolded me publicly. I have been shamed.\r\n\r\nTo those who are interested, Mark Zupan (the star of Murderball) will be at Missouri State on Tuesday, Sept. 20 to show and talk about his film. The event will be held at 7:00pm in the PSU Theater (I recommend parking in the lot south of the football stadium just off Grand and National. Dan and Nicole I'm sure you'll be swamped with work but if you find time I thought you might want to go. ",
      "created_at": "2005-09-15T02:57:09.000Z"
    },
    {
      "author": "tim",
      "body": "My Condolences on your loss\r\n\r\n--------------------------\r\nM&Y&EWK is hands down the best movie i have seen all year. SO AMAZING!!!! Everyone in my theater gasped at the fish scene! Its a testament to miranda july, something so small can keep a packed theater on edge!!! I really want to gush but you guys will see it soon!!!!! IM SO HAPPY FOR YOU!!!!! My GF and i were in town from chicago and stopped by to see your digs, it looks so nice!!! MORE GUSHING!!!!!! I WILL STOPITH THE GUSH NOW!!!   (congrats! i wish i could be there for the opening) ",
      "created_at": "2005-09-15T19:34:30.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
