{
  "id": 3,
  "title": "Introduction, Part 3",
  "body": "As I mentioned in <a href=\"/post/2\">yesterday's post</a>, everyone has ideas, or fantasies, about starting their own business, and, typically, the only thing that's stopping them from realizing their dreams is cold, hard cash.\r\n\r\nNicole and I had been dreaming about starting our own art-house theater for close to three years, but the fact that we only had $0.48 to our names always seemed to deter us. Then, back in the early part of March, my best friend Doug asked me why we'd never proceeded with the theater project...\r\n\r\n<b>ME</b> - Oh, I don't know, maybe because of the fact that we don't have half a million dollars lying around to buy a building, projectors, and all the other crap we'd need to start the theater.\r\n<b>DOUG</b> - Why don't you get a loan?\r\n<b>ME</b> - Because we don't have any experience running our own theater. Sure, we've worked at one before, but we've never <i>run</i> one.\r\n<b>DOUG</b> - So?\r\n<b>ME</b> - So...\r\n\r\nDoug was on to something, so I decided to start researching the idea again. I told my mom about it and she told me that she had just read that someone was already planning on putting an art-house theater downtown. Nicole and I were crushed. Not only were we not going to be able to start our own theater, but now we'd have to sit idly by and watch some imbecile take our theater and screw it up and make everyone hate it and only losers would hang out there and one day I'd run into him on the street and I'd have to kick him in the face and thank him for ruining my life. Nicole and I were a wee bit angry.\r\n\r\nThankfully, my mom was wrong. Apparently, she'd read some other story about an outdoor cinema club and confused it with an art-house theater... don't ask me how, but by that point it didn't matter.  The light under our butts had been relit - Nicole and I would stop at nothing to get our theater started!\r\n\r\nI immediately started calling realtors to find out how much a suitable building would cost us downtown. The news wasn't good. Had I been in the market 5 years ago, I might have been able to grab a unique older building for somewhere between $100,000 and $200,000, but that was then... due to downtown's recent economic influx, real estate prices have gone through the roof.  The few spaces that were still available were running anywhere from $400,000 all the way up into the seven digit range.\r\n\r\nBuying a building was definitely out of the picture, so I started to look into leasing options. My first few calls were fruitless, but then I spoke to a realtor who happened to have a friend who had just purchased a building with the intention of putting in a small art-house theater. Unfortunately, the potential theater owner had a family life and didn't have the time needed to run the theater, so he forgot about his plans for the time being and went on with his life... and that's when Nicole and I stepped in.\r\n\r\nI immediately contacted the owner, Andrew, and told him about our plans. He seemed excited, so we scheduled a meeting to discuss our plans further and look at the potential building. We spoke with Andrew and Doug, his business partner, and they seemed just as excited to have discovered us as we were to have found them. Turns out, they want the theater just as badly as we do, and they'll do everything they can to help us make the theater a reality.\r\n\r\n**** FAST FORWARD ****\r\n\r\nSince that time, Andrew and I have been in constant contact via e-mail, since he's in Midwestburg and I'm in St. Louis. We've discussed everything from investor relationships to probable auditorium layouts. He's been nothing but helpful and extremely generous. A lot of work and research has been completed since we met back in the early part of May, and I have every intention of chronicling it here, but as far as this post goes, I believe it's spent.\r\n\r\nMy goal was to relate the circumstances that lead to Nicole and I being able to pursue our theater project beyond the \r\nstage of an unrealized daydream, and I hope I've done that. More to come...",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-05-27T00:28:41.000Z",
  "author": "Dan",
  "comments": [],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 14,
      "name": "Dialogue"
    }
  ]
}
