{
  "id": 30,
  "title": "Theater etiquette",
  "body": "Yesterday's post was a real brain fryer, so today's will be a bit more \"fresco,\" as it were.<br/><br/><u>Theater Etiquette</u><br/><br/>When squeezing through a crowded movie aisle, do you face the screen (butt flash) or the projection port (crotch flash)? Why? What if someone were to hit/pinch/slap/bite your butt/crotch? What then, I ask? What then?<br/><br/>That's all.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-07-02T02:59:44.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Lance",
      "body": "Hahaha...! Crotch flash, pobably? XP",
      "created_at": "2004-07-02T03:12:56.000Z"
    },
    {
      "author": "Piers Khaki Randolph",
      "body": "That sort of lewd behaviour is what sets you people apart from us British!<br/><br/>What if there was a lady reading this page for heavens sake!",
      "created_at": "2004-07-02T03:37:24.000Z"
    },
    {
      "author": "bjork24",
      "body": "Piers Khaki Randolph - all apologies. I should have said \"bum\" instead of \"butt.\"",
      "created_at": "2004-07-02T04:05:06.000Z"
    },
    {
      "author": "nika",
      "body": "I'm going for butt flash.  If some stranger were to hit/pinch/slap/bite something of mine, I'd much rather have it be my butt than my crotch.",
      "created_at": "2004-07-02T05:58:18.000Z"
    },
    {
      "author": "Newell",
      "body": "Wouldn't it all depend on which way you're going? Plus, the reaction to the contact depends on what type of contact it is. Kind of a good touch/bad touch thing. If someone accidentally brushes up against my rump (or something else) I think I'd say, \"Excuse me,\" just to let them know that I noticed that we touched. I'm don't have any idea why someone would be slapping or biting my butt OR my crotch in a movie theater anyway. That's definitely what I would call bad touch, and I think I'd have to speak up about it.",
      "created_at": "2004-07-02T06:31:35.000Z"
    },
    {
      "author": "Brett",
      "body": "Heh, definitly a butt flash. I don't know why, that's just what I do. And then I would bite them back of course! Anyway, I think your sense of humor is great. Hilarious, keep it up.",
      "created_at": "2004-07-02T07:34:42.000Z"
    },
    {
      "author": "Sandra",
      "body": "i sit on the aisle.<br/><br/>but if someone's squeezing through, i'd prefer to bite his/her butt.",
      "created_at": "2004-07-02T08:35:14.000Z"
    },
    {
      "author": "muddgirl",
      "body": "crotch flash, of course, so I can apologize for stepping on their toes.<br/><br/>(great blog, btw. very enjoyable read)",
      "created_at": "2004-07-02T08:50:18.000Z"
    },
    {
      "author": "princessmatilda",
      "body": "hmmm...i guess it depends on how many people you have to go through to get out and why you are getting up (or sitting down)in the middle of a performance. also, i'm only 5'3\", so i actually \"boob\" flash anyone i walk by, and really, the whole boob hypnosis licks on and i never get touched. comments a-plenty, but not touched. maybe i'm doing it wrong?",
      "created_at": "2004-07-02T11:05:44.000Z"
    },
    {
      "author": "Scott",
      "body": "I opt for the crotch flash.  If I'm going to flaunt me nethers in the face of a complete stranger, I think they're at least entitled to the dignity of a face-to-face (er... kinda) interaction.<br/><br/>With that said, my response to a hit, slap, bite or pinch to the crotch would probably be to squeal like a girl and fall to the ground in lament.",
      "created_at": "2004-07-03T01:27:19.000Z"
    },
    {
      "author": "Siren1122",
      "body": "I try to walk side ways in an effort to avoid the butt in face or crotch exposed. I would never place my hands/mouth on the body of someone I didn't know so I can't answer that other stuff. Sorry.",
      "created_at": "2004-07-03T01:15:17.000Z"
    },
    {
      "author": "bjork24",
      "body": "anonymous - I can't share all my secrets with you, but I can tell you this... whatever the yearly total is, subtract roughly 96.5% of it and that's what we'll be making... total. Forever.",
      "created_at": "2004-07-03T01:20:56.000Z"
    },
    {
      "author": "Sarah",
      "body": "I guess i would just go with the Butt. I have a nice one, why dont i just show it off? And i dont mind a small slap now and again, ggrrrrrr.",
      "created_at": "2004-07-02T20:26:14.000Z"
    },
    {
      "author": "anonymous",
      "body": "tyler durden would be proud. :) it would depend indirectly upon the appearance of those i'm passing. i tend to rotate on the way past. hey cutie! (crotch flash--spin move) hey dude (butt flash) hey mom (butt flash) hey cutie! (spin move--crotch flash). and Dan, i'm moving your DAFT into excel to play with some numbers. i want to know how much money you're going to be making (after taxes) so i can hit you up for dough. i only need to know how many employees you have and what they'll be making...",
      "created_at": "2004-07-03T00:20:38.000Z"
    },
    {
      "author": "princessmatilda",
      "body": "sorry about the multi=post...my computer is not a close friend of mine...",
      "created_at": "2004-07-02T11:08:57.000Z"
    },
    {
      "author": "James",
      "body": "It would really depend on whether or not I had showered that day...",
      "created_at": "2004-07-02T13:24:20.000Z"
    },
    {
      "author": "bloggonator",
      "body": "Which way I point my body is in direct relationship to how much effort people make in getting out of my way. If they're late standing up, I give 'em the behind. If they're courteous, I face them and smile. If they don't stand up, I kick over their supersized Pepsi.",
      "created_at": "2004-07-02T16:25:44.000Z"
    },
    {
      "author": "Oz",
      "body": "I do the butt flash, but I try to keep it sideways as much as possible, so it's more of a hip flash.  If someone pinched me, I would probably be stunned and just keeping going.  Then when I was in the bathroom, what happened would settle over me, and I would think of all these great lines to say and/or ways to hit the person.  I would hope that when I walked back, the person would try it again so that I could use my great lines/assault, but it wouldn't happen, and I'd just glare at her/him for the rest of the film.",
      "created_at": "2004-07-02T17:26:42.000Z"
    },
    {
      "author": "bjork24",
      "body": "So many responses... an interesting psychological analysis these results could warrant.",
      "created_at": "2004-07-03T02:16:22.000Z"
    },
    {
      "author": "justin",
      "body": "It would probably depend on whatever the punchline was in Fight Club.",
      "created_at": "2004-07-03T03:50:01.000Z"
    },
    {
      "author": "Merc",
      "body": "I would suggest facing the person that you are squeezing by. That way you can keep an eye on them. Other than some mothers, you can't keep an eye on the behind.<br/><br/>Also... if you are to thank a person for making way, you can more easily (and more quietly) thank them by facing them.<br/><br/>I would have to agree; if you don't make room, you are going to get your beverage kicked. It is just the proper pay-back for being rude.",
      "created_at": "2004-07-03T05:33:32.000Z"
    },
    {
      "author": "Upone",
      "body": "Why go//watch it at home!",
      "created_at": "2004-07-04T06:44:30.000Z"
    },
    {
      "author": "Tony",
      "body": "Generally, I go with Butt Flash. I think with complete strangers exposing my rump to them is less personal.I am showing the \"a butt\". When I am facing them I am showing them \"my genitals\"<br/><br/>Of course, as a guy I am not usually wearing tight pants that display my genitals through the fabric and people couldn't really see my genitals.<br/><br/>I guess my initial thoughts only apply when I am going to movies in my exercise shorts and I don't often do that.<br/><br/>If pinched or slapped I guess I would consider the pincher/slapper. Bitten? This happens?<br/><br/>I think I have spent enough time on this.",
      "created_at": "2004-07-06T10:58:20.000Z"
    },
    {
      "author": "Miel",
      "body": "I swear that Emily Post has something on this--I'm not making that up. And crotch facing the seated is the way to go.  According to Emily.",
      "created_at": "2004-07-06T11:56:54.000Z"
    },
    {
      "author": "nathan",
      "body": "you just made those to cover up that chzeck  us out guy's land rover up",
      "created_at": "2005-07-06T09:30:27.000Z"
    }
  ],
  "categories": [
    {
      "id": 12,
      "name": "Thoughts"
    }
  ]
}
