{
  "id": 300,
  "title": "Tonight's the big night...",
  "body": "I wonder how many things can, and will, go wrong? We're going to have two sold out shows back to back tonight, so we'll find out pretty quick how well traffic moves through the building. As for our inventory... HA! We're having a bit of an inventory quandary: as in, which beers and pops do we keep cold first, and in what amounts? We have to predict which drinks will be the most popular and stock accordingly. The only problem is, we don't have a lot of space to store cold drinks! AH! We're going to die of a heart attack tonight. Seriously.\r\n\r\nRemember, if you show up tonight and we don't have what you want (or what you want isn't cold), just remember: this is a test run. We're working the kinks out folks! We have to figure out what people want the most of, and then go from there. Thanks for your patience (in advance) and we'll see you tonight!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-09-15T20:18:14.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Aaron Scott",
      "body": "I'll tell you this much right now: I will drink at least three bottles of root beer.",
      "created_at": "2005-09-15T20:55:53.000Z"
    },
    {
      "author": "Nate",
      "body": "Will anyone come tonight in a Zorro outfit?  Double dare ya.",
      "created_at": "2005-09-15T21:02:23.000Z"
    },
    {
      "author": "nicki j",
      "body": "that's right, foo! you'd better figure it out before i get there tomorrow night!\r\n\r\n;)",
      "created_at": "2005-09-15T21:26:15.000Z"
    },
    {
      "author": "whitty",
      "body": "Please stock some soda as I don't drink pop.\r\n\r\nJust joshin' with you there! Hilarious!\r\n\r\nI am sure things will go wonderfully tonight.",
      "created_at": "2005-09-15T21:26:27.000Z"
    },
    {
      "author": "liam",
      "body": "good luck guys!",
      "created_at": "2005-09-15T21:42:20.000Z"
    },
    {
      "author": "DUG",
      "body": "beer is beer, give it to me hot, hell, I don't care",
      "created_at": "2005-09-15T22:19:18.000Z"
    },
    {
      "author": "Oz",
      "body": "As long as the Dr. Pepper is cold, does anything else matter?",
      "created_at": "2005-09-15T22:27:16.000Z"
    },
    {
      "author": "elliott",
      "body": "i would drink dirty, hot, and smelly water for you moxie... seriously...",
      "created_at": "2005-09-15T22:44:02.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "I for one am hoping things go really bad tonight so that I'll feel justified in waiting till tomorrow to go.",
      "created_at": "2005-09-15T22:46:20.000Z"
    },
    {
      "author": "erin",
      "body": "dito what mr. dave adams said.\r\n\r\n: P\r\n\r\ngood luck tonight guys!",
      "created_at": "2005-09-15T22:56:03.000Z"
    },
    {
      "author": "Caleb",
      "body": "I plan on drinking Dr. Pepper. At least until November 27...",
      "created_at": "2005-09-15T23:37:53.000Z"
    },
    {
      "author": "Ryan",
      "body": "So are there no more tickets for either Thursday or Friday?",
      "created_at": "2005-09-15T23:43:54.000Z"
    },
    {
      "author": "bjork24",
      "body": "We're as sold out as a free Bjork concert in my backyard. NUDE!",
      "created_at": "2005-09-16T00:07:17.000Z"
    },
    {
      "author": "Melissa",
      "body": ":( i'm so bummed. i didn't see the invitation :(",
      "created_at": "2005-09-16T01:33:54.000Z"
    },
    {
      "author": "brian of moore",
      "body": "hah i agree with whitty.. my pop lives in st. louis.. and i highly doubt you would have enough room to stock him somewhere\r\n\r\nand please dont joke about bjork like that.. unless you want me hanging around in your back yard.. waiting for the show to start... which reminds me.. cant wait to see her new film... you guys will be playing it when it comes out.. right?  of course you will\r\n\r\nsee ya in a few hours :-)",
      "created_at": "2005-09-16T02:47:46.000Z"
    },
    {
      "author": "Derek the local college student",
      "body": "I wouldn't wish a warm one on anyone. The colder it is, the more of a one it is. Of course, I don't drink, so I'm really not concerned with the colditude of the ones. Anyway, my group is ever so very excited. My roommate can't come, so I'm bringing someone other than the name I put down when I signed up. That's okay, right? You won't be IDing the guests or anything?",
      "created_at": "2005-09-16T03:30:03.000Z"
    },
    {
      "author": "nicholas",
      "body": "If you need to cool beer fast, the best way is to hit it with a blast from a fire extinguisher for a few seconds--not shitting, it really works. Just make sure the cap is still on...",
      "created_at": "2005-09-16T03:34:20.000Z"
    },
    {
      "author": "brian of moore",
      "body": "excellent\r\ni cant wait to see a film that i dont already own :-)\r\nbut actually that was the first time i had seen it in a theater\r\nwhy? because i live in springfield and it was never played here... as i recall i downloaded it.. then bought it later\r\nbut now i can just go to the moxie!\r\n\r\nthe place looks great.. the cinebar.. the art wall.. everything.. great\r\nand sitting in the back row.. i had no obstructions (heads) in my way at all\r\nim a bit tall i suppose.. but still it looked just fine\r\n\r\nbtw who else was helping out tonight?\r\nare they going to be on the staff?\r\nwe need some introductions up in here",
      "created_at": "2005-09-16T10:00:11.000Z"
    },
    {
      "author": "jb",
      "body": "I just wanted to say thanks for the show last night. The place looks great.",
      "created_at": "2005-09-16T16:50:10.000Z"
    },
    {
      "author": "Nate",
      "body": "Amelie played at Springfield 8 (Then Dickinson 8) for a week in early 2002.  The box office lady made sure I understood that it was subtitled before selling me a ticket.",
      "created_at": "2005-09-16T17:46:22.000Z"
    },
    {
      "author": "nicole",
      "body": "I'm so bad about introducing people. It's probably one of my worst habits. We will keep that in mind for our next group of showings! Thanks for coming, everyone!",
      "created_at": "2005-09-16T18:15:12.000Z"
    },
    {
      "author": "brian of moore",
      "body": "really? springfield 8? .. im impressed... although i now realize that was during my one year stint living in st. louis... what a sad friendless, boring time that was\r\nno no.. dont misinterpret... i love st. louis... i was just working non-stop with people in their 50s... in an area where i knew no one... which made for very few recreational moments",
      "created_at": "2005-09-16T19:19:17.000Z"
    },
    {
      "author": "Lori",
      "body": "we had so much fun last night, checking out your theater! (i've been following the progress online for months but hadn't made it by one of the art walk open houses yet). \r\ncongratulations! i'm so impressed with what you guys have done. ",
      "created_at": "2005-09-16T19:48:19.000Z"
    },
    {
      "author": "Andy",
      "body": "Yeah, it was a great time!  Dan had me all scared that it would be chaotic and stuff but it turned out really nice.\r\n\r\nI especially liked the intermission.  Not sure why, but it just felt good.\r\n\r\nI can't wait until Wednesday.  I'll be there to get my ticket as soon as I get out of school.",
      "created_at": "2005-09-16T22:04:43.000Z"
    },
    {
      "author": "nicole",
      "body": "Caleb:: Who is sponsering Murderball? I want to see if we can get Mark Zupan to come by the theater before he leaves town.",
      "created_at": "2005-09-16T22:25:40.000Z"
    },
    {
      "author": "Greg Holman",
      "body": "Dan and Nicole--\r\n\r\nI seem to have misplaced your contact info from the last time we talked so I'mm resorting to blog-o-messaging. (A spiffy and new experience for an MSM print person like myself.) If you see this post this afternoon, do shoot me an e-mail or call prior to the show tonight! Thanks!\r\n\r\nGreg",
      "created_at": "2005-09-16T23:24:11.000Z"
    },
    {
      "author": "matt",
      "body": "opening night phlog!  opening night phlog!  opening night phlog!  (oh, and test screening phlog! would be more accurate)  congrats on the near-opening, i wish i lived closer.",
      "created_at": "2005-09-16T23:56:17.000Z"
    },
    {
      "author": "Kess",
      "body": "Great show, Dan and Nicole. I had - against the advice of friends - not seen \"Amelie\" before. This was the perfect time/place to see it. My wife had such a great time she could not stop dropping popcorn. She was dropping it like it was hot - which, fortunately, it was not. It was just right.\r\n\r\nI, on the other hand, managed to keep from spilling my Diet Root Beer, which was fantastic. I will never drink regular diet soda again! At least not at The Moxie. I already packed a Diet Wild Cherry Pepsi to drink with my dinner at work. I was also very impressed with the bank vault. It's a good thing I was not behind the counter because I probably would've locked myself inside. I'm clumsy and accident prone like that.\r\n\r\nI'm so thankful, Dan and Nicole, that you have invested so much into this theatre - and not just financially. You have done an outstanding job and I look forward to giving you a lot of my money in the future. Springfield is now a better, more entertaining place thanks to you and your Moxie.",
      "created_at": "2005-09-17T00:27:18.000Z"
    },
    {
      "author": "Caleb",
      "body": "Kess pointed out a great...point. \"Springfield is now a better, more entertaining place thanks to you and your Moxie.\" Amen.\r\n\r\nNicole - The MSU Student Activities Council is bringing him here. Below is a link to the SAC Officer websites for contact info. NOTE: they have the WRONG e-mail addresses linked. You need to make sure you put \"@smsu.edu\" instead of the \"@missouristate.edu\" like it has. SAC obviously did not check with Computer Services before linking the new domain.\r\n\r\n<a href=\"http://organizations.missouristate.edu/sac/officers.htm\">SAC Officers</a>",
      "created_at": "2005-09-17T00:45:52.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
