{
  "id": 302,
  "title": "This will be on the test",
  "body": "Well, the test screenings went a lot better than I had predicted. I was expecting pieces of the roof to fall off during one of the showings, or for the projector to explode right in the middle of the movie or something similarly tragic! But everything went pretty smoothly. The worse thing to happen was having the HVAC go all screwy during the Thursday night shows. Dear Thursday night audiences: I'm sorry the auditorium was colder than a well digger's ass in China. It won't happen again. I promise. I called the HVAC guys on Friday and everything was fixed by that evening's shows. Now the auditorium maintains a balmy 68 degrees all day long. Yay!\r\n\r\nI wish there were more exciting incidents to report, but alas... there wasn't. Just good movies, good times, and good peoples. A couple moviegoers did, however, spill their drinks, which really strengthens the argument for cupholders. Another person said I looked really HOTT in my Moxie T-Shirt, which really strengthens the argument for cheaper vision health insurance. *rim shot* That was a good one! I totally set myself up for that one!\r\n\r\nBefore each of the blog screenings, Nicole and I popped up on the stage and mumbled a few words about something or rather. Nicole was a bit shy during the first introduction, but she started to come out of her shell over the course of the five showings. By the time Saturday's Founding Member party rolled around, Nicole was completely sans-shell, which is illegal in 58 states. While I was up on stage, I though it might be fun to snap a picture of the two blog reader audiences. My instructions were to \"do something exciting,\" but Thursday night's group was too cold to react. Click on the pictures to see the BIG version.\r\n\r\nThursday Night:\r\n\r\n<a href=\"/pix/phlog/091905/thursday_big.jpg\"><img src=\"/pix/phlog/091905/thursday_small.jpg\" width=\"425\" /></a>\r\n\r\nFriday Night: \r\n\r\n<a href=\"/pix/phlog/091905/friday_big.jpg\"><img src=\"/pix/phlog/091905/friday_small.jpg\" width=\"425\" /></a>\r\n\r\nWhile you're still focusing on the pictures, I'd like to introduce you to two of our employees: Mr. <a href=\"http://www.sweetwaterabilene.com\" target=\"_blank\" class=\"broken\">J.R. Top</a> and Mr. <a href=\"http://justin.commonelectric.com\" target=\"_blank\" class=\"broken\">Justin Glow</a>. J.R. is hovering in the doorway in the Thursday night photo, and Justin can be seen looking somewhat possessed in the projection port hole on Friday night's photo. We also have a third employee, Ms. Kelley Fox, but she's not pictured in either photo. I'm sure you'll hear more about them in the very near future.\r\n\r\nAnd that's about it. I'm glad all of you got a chance to swing by and check the place out. OH YEAH! One more thing... the site is going to be changing over the next few days (as in, finally going live). Here's <a href=\"http://www.moxiecinema.com/calendar.php\" class=\"broken\">the first sign of improvement</a>. Keep an eye out for more over the next couple days!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-09-18T09:22:44.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "whitty",
      "body": "Man, us blog readers sure are attractive!\r\n\r\nSurely such a HOTT audience is good for business.",
      "created_at": "2005-09-19T20:43:40.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Hey! The calendar looks great! The demonic eyes of your blog audience not so great.",
      "created_at": "2005-09-19T21:28:10.000Z"
    },
    {
      "author": "brian of moore",
      "body": "nicole was shy? i missed that part\r\n\r\nhey look! there i am!\r\nand hey look! there some guy with a threadless.com shirt on!\r\nand hey! theres some kid that used to work with me at pizza inn!... and hey look! theres some hot girl!! and lots of beers!\r\n... *whew*.. that was fun",
      "created_at": "2005-09-19T22:26:49.000Z"
    },
    {
      "author": "mish",
      "body": "demonic eyes. thats exactly what i was thinking. especially on the friday night crowd.",
      "created_at": "2005-09-20T00:04:34.000Z"
    },
    {
      "author": "erin",
      "body": "give me a M. O. X-I-E.\r\n\r\n: )",
      "created_at": "2005-09-20T01:41:27.000Z"
    },
    {
      "author": "Fyse",
      "body": "Wow! Congratulations on your first screenings! I'm almost home now, so will be a regular reader again. Can't believe I missed out on the most exciting stages, but it seems you somehow managed without me...",
      "created_at": "2005-09-20T02:15:03.000Z"
    },
    {
      "author": "Caleb",
      "body": "I wasn't worried about the demonic eyes...\r\n\r\nI was worried about all the ORBS in the photos! The Moxie is HAUNTED! \r\n\r\nSpeaking of haunted...any ideas on a special Halloween weekend event? I think you should show Legally Blonde. It's about the scariest movie ever made.",
      "created_at": "2005-09-20T02:22:18.000Z"
    },
    {
      "author": "is anyone else",
      "body": "who didn't get to go bummed that there were empty seats even though the shows were rumored to be \"sold out\"??  \r\n\r\nNot Dan and Nicole's fault, but who among you reserved seats and then found something \"better\" to do? *pout*",
      "created_at": "2005-09-20T03:53:00.000Z"
    },
    {
      "author": "Caleb",
      "body": "Good point...\"is anyone else.\" \r\n\r\nShame on you people who reserved seats and were no-shows. You have no excuse!",
      "created_at": "2005-09-20T06:55:36.000Z"
    },
    {
      "author": "Maddy",
      "body": "So...uh... not to be picky, but are you EVER going to answer all those blog questions we asked a billion years ago (8 days ago)?",
      "created_at": "2005-09-20T07:14:04.000Z"
    },
    {
      "author": "nicole",
      "body": "That was 8 days ago???",
      "created_at": "2005-09-20T07:15:48.000Z"
    },
    {
      "author": "brian of moore",
      "body": "time flies when your gorging yourself on fitz's and junior mints",
      "created_at": "2005-09-20T08:12:36.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yes, I'll answer them... but give me some time. I'm a busy, busy woman! Er, man. I meant MANLY MAN!",
      "created_at": "2005-09-20T08:24:00.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "For what it's worth \"anyone else\", no one was checking names, so you should have just showed up.",
      "created_at": "2005-09-20T08:49:43.000Z"
    },
    {
      "author": "brian of moore",
      "body": "my name was checked\r\nalthough if i had worn my invisi-suit it wouldnt have mattered",
      "created_at": "2005-09-20T09:37:55.000Z"
    },
    {
      "author": "brian of moore",
      "body": "the calander and descriptions part of the site are looking very nice...  (im on here way too often)",
      "created_at": "2005-09-20T13:08:15.000Z"
    },
    {
      "author": "erin",
      "body": "i had a dream about the moxie. but im not sure if dan existed. it was nicole's baby. and instead of being its own place, the moxie was one rented theater inside wherenburg (unable to spell that).....\r\nnicole kept telling me to write a note to dan on a index card. but dan wasnt around (or even in existance??) to give it to.",
      "created_at": "2005-09-20T16:06:51.000Z"
    },
    {
      "author": "Nate",
      "body": "Um...\r\n\r\nOdd?",
      "created_at": "2005-09-20T18:19:38.000Z"
    },
    {
      "author": "nicole",
      "body": "I think I'm flattered!",
      "created_at": "2005-09-20T18:40:07.000Z"
    },
    {
      "author": "Nate",
      "body": "It could be more of a nightmare if you were trapped inside the theatre and voices were whispering from dark corners from all sides, \"wherenberg, wherenberg, wherenberg.\"\r\n\r\nIt's a bit like the \"kill kill kill\" whisper in the Friday the 13th movies, innit?",
      "created_at": "2005-09-20T20:02:59.000Z"
    },
    {
      "author": "Scott G.",
      "body": "Dan and Nicole, congrats on getting this far.  Good luck and have fun with the business!!!!",
      "created_at": "2005-09-21T03:15:06.000Z"
    },
    {
      "author": "Al",
      "body": "I couldn't believe how hot Nicole was in person!!!!!!!!!!\r\n\r\nActually, I live in WI, but these were really lame comments.",
      "created_at": "2005-09-21T03:17:57.000Z"
    },
    {
      "author": "mish",
      "body": "dave adams, im sure theres alot of people really grateful for the good advice.",
      "created_at": "2005-09-21T04:34:08.000Z"
    },
    {
      "author": "duanekeys",
      "body": "<sheepishly>sorry...  I uhhh... forgot</sheepishly>  Glad the screenings went well and congrats to making it this far!",
      "created_at": "2005-09-21T04:56:39.000Z"
    },
    {
      "author": "Caleb",
      "body": "If Me, You and Everyone We Know is showing at 11:15 and 11:00 on Friday and Saturday, does that mean the \"late show\" is going to start around 1:00am? And which night are you showing Rushmore and which night are you showing Office Space? \r\n\r\nOr was this a cruel practical joke...",
      "created_at": "2005-09-21T06:11:36.000Z"
    },
    {
      "author": "Caleb",
      "body": "Oh, and just to inform you...those bastards over at Campbell 16 are showing Mad Hot Ballroom beginning this Friday. What a cheap shot at competing with the Moxie. They don't even compare...\r\n\r\nThere was a great article in the News-Leader about the Moxie today. And this week's issue of Go Magazine had some nice words to say about you all too. It was also in the Missouri State Standard. Dan and Nicole are...EVERYWHERE!",
      "created_at": "2005-09-21T06:16:27.000Z"
    },
    {
      "author": "nicole",
      "body": "Like KGBX tomorrow morning!\r\n\r\nI'll let Dan answer the question about Office Space and Rushmore...",
      "created_at": "2005-09-21T08:45:38.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
