{
  "id": 303,
  "title": "Look boss! De press! De press!",
  "body": "If you're in the Springfield metro tomorrow, tune your radio dial to 105.9 for the Woody and Suzanne morning show at 8:00 AM. I won't tell you who the guests will be, but I'll give you a hint: their names rhyme with \"Spam and lick hole.\" Then, when you're done listening to that, read <a href=\"http://www.news-leader.com/apps/pbcs.dll/article?AID=/20050920/ENTERTAINMENT/509200319/1094\" target=\"_blank\" class=\"broken\">this lengthy article</a> about us that ran into today's News-leader... and <a href=\"http://www.news-leader.com/apps/pbcs.dll/article?AID=/20050920/ENTERTAINMENT/509200320/1005\" target=\"_blank\" class=\"broken\">this one too</a>... and check out <a href=\"http://www.news-leader.com/apps/pbcs.dll/gallery?Site=DO&Date=20050919&Category=ENTERTAINMENT&ArtNo=919001&Ref=PH&Profile=1094\" target=\"_blank\">this gallery</a> (yes, that's Melanie Griffith on the screen)! And when you're finished with that, zoom over to the Drury Mirror and check <a href=\"http://www.drurymirror.com/media/paper740/news/2005/09/19/Features/Grand.Opening-988840.shtml\" target=\"_blank\" class=\"broken\">this story</a> out.\r\n\r\nAs for the theater... we're slated to open tomorrow afternoon. Duh! The film (\"ME & YOU & EVERYONE WE KNOW\") was supposed to be delivered today between 1:00 and 3:00 PM, but DHL was late delivering the film to Technicolor, which means we won't be getting it until tomorrow around noon. Thanks DHL! That means I'll have to build up the film like a madman and hope the intermission falls at a decent spot. Thanks again DHL! Still, I feel like I should be more stressed about it than I actually am. In relation to all the stress I've endured over the last year, this barely registers on the ulcer-meter.\r\n\r\nWe got a lot finished at the theater today. The poster collage is up, the Cinebar sign is up (<a href=\"http://www.sgfsoccer.com\" target=\"_blank\">SGFsoccer.com</a> Cinebar, I should say), the wireless network is up (read: wireless NETWORK, not free wifi), and the bathrooms are clean. I really hope everything goes well tomorrow. I really, really, really do. Either way, you'll hear about it. And now it's time to <i>try</i> and get some sleep.\r\n\r\nBefore I go, I'd like to apologize for the lack of phlogs. I'll make it up to you with something HUGE in the coming weeks. I promise.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-09-21T08:41:59.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "elliott",
      "body": "well moxie... you did it... you got all built, and have an opening day, and it is exciting... \r\n\r\ni will be at wilco tomorrow, but first thing friday... i'm there!",
      "created_at": "2005-09-21T09:09:18.000Z"
    },
    {
      "author": "brian of moore",
      "body": "hmm.. what is it you kids are using a wireless network for?\r\nwill there be computers in the bathrooms?\r\nyoure high tech\r\n\r\n\"Rock and Roll Space Patrol, Action is Go!\" - oh oh? whats this? hmm.. interesting\r\n\r\nso how long do you think it will be before you buy out all the businesses in the building connected to you.. and build 4 more screens?\r\nyeah.. youre right.. im sure you'd like a rest from construction for a while",
      "created_at": "2005-09-21T09:27:06.000Z"
    },
    {
      "author": "Steve Kirks",
      "body": "Any chance you'll make the bathrooms \"unisex\" to relieve the load at intermission?\r\n\r\nWow, that's a lot of bathroom puns...",
      "created_at": "2005-09-21T19:06:14.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
