{
  "id": 304,
  "title": "Opening Day... LIVE!",
  "body": "Ok, here we go. A minute by minute account of our opening day!<br/><br/><b>8:37 am -</b> Just walked into the theater (note to self: don't leave theater lying around). We were on the Woody and Suzanne show this morning. It was really fun, except when Woody asked what movie makes me cry. \"SELENA!\" I didn't even wait for Woody to finish his question. Everyone looked at me a little funny, so I hung my head in shame. Time to clean the theater!<br/><br/><b>9:37 am -</b> Still cleaning. Nicole just went to fax something at Kinko's. How exciting!<br/><br/><b>10:42 am -</b> The wireless connection in the projection booth has just gone down for no reason at all. I was trying to transfer some preshow slides from the vault computer to the projector computer when... zip! It's down. What's even stranger is that the other two computers are working just fine (station one and the vault computer). Damn you wireless network! Damn you to hell!<br/><br/><b>12:23 pm -</b> Man, I'm starving! I had to run home so I could burn all the renovation pictures onto a disk (since the projection room computer has decided to drop itself out of the wifi loop). I also threw together a few preshow slides. Some are funny, some are HILARIOUS! Nicole just called. The film has arrived, which means I need to hurry and burn the pictures to CD, run by Taco Bell (I haven't eaten since lunch yesterday), fly to the theater, build up the film, and at least leave myself enough time to test the first half. Tickets go on sale in 30 minutes! Woo hoo!<br/><br/><b>12:28 pm -</b> 29 minutes to burn the CD?! Damn you 4x CD writer! Damn you to hell!<br/><br/><b>12:41 pm -</b> Since the CD is taking so long I have to resort to finding something to eat around our house. Not an easy task. I'm currently inhaling a bowl of Raisin Bran, which probably isn't the smartest move, considering the way my stomach has been acting today. I'm also eating it out of a coffee mug... with a fork... we really need to do our dishes more often.<br/><br/><b>3:46 pm -</b> I'm not dead, just SUPER BUSY MAN! I got back here at 1:15 and I've been building up the film ever since (i.e. splicing together the little reels into the big reels). I just finished, now I have to go thread up the projector and staple up our NOW OPEN sign. Forty-five minutes till the first showing!<br/><br/><b>4:05 pm -</b> We're beign attacked by the press. KOLR 10 and KSPR 33 are running around with their cameras filming everything in sight... including me spray painting the sign! Nicole has been fielding questions since I've been too busy building up the film. Uh oh, people are showing up. I'll be back in a jiffy!<br/><br/><b>4:06 pm -</b> Raisin Bran was a bad idea.<br/><br/><b>4:42 pm -</b> First show started well. There's news cameras EVERYWHERE! All their lights are making it really hot in the theater. I just turned the air down to 62 degrees to try and stabalize it. It doesn't help that I've been running around all day. Ok, they need me for an interview. Back in a bit... oh yeah, we sold 1/3 of the auditorium for the first show. Not too shabby!<br/><br/><b>5:55 pm -</b> The second half of the film just started. We're having a bit of trouble cooling the auditorium. Everyone says it's comfortable, but I think it's hot. Last week it was too cold, now it's too hot. Maybe it's because I have two shirts on - one of which is long sleeved. Either way, if you come to the 7:00 or 9:15 shows, dress cool!<br/><br/><b>7:26 pm -</b> Great turnout for the 7:00 show. The auditorium has stabalized itself, and now it's nice and cool. A couple students from a local high school are here filming now. I don't know what we're going to do when all the media attention dies down. Probably cry myself to sleep on my HUGE pilla!<br/><br/><b>8:31 pm -</b> Just heard from Rob at the Mudhouse... we'll have our coffee tomorrow. Sorry no one this evening was able to try some. The 7:00 showing is about 15 minutes away from ending, so I better go prepare the broom and dustpan. Only 3.5 hours to go before our first day is wrapped up!<br/><br/><b>10:13 pm -</b> Well, the last show was the busiest! At 9:15, when it was time for me to start the film, I realized that I had forgotten to rewind the first half!!! I had to rewind at the speed of light and then drag the film into the auditorium and explain to the audience, \"these reels are big, and my arms are small, so thanks for your patience.\" Oh well, I wouldn't be an eventful night if SOMETHING bad didn't happen. Still, I could think of a lot worse things. All in all, things have been going pretty well.<br/><br/><b>11:34 pm -</b> I just finished cleaning and vaccuuming the auditorium. All the trash is collected and Nicole is restocking our inventory. All we have left to do is close the cash drawer and head home! What a great first day! Hip hip hooray! Sixteen hours after it began, we're finally ready to head home. Poor Bogey. He misses us. Maybe we can sleep in a little tomorrow. We need <i>some</i> rest before we do this all over again tomorrow. Woo hoo! A big thanks to everyone who made it by tonight.<br/><br/>THANK YOU SPRINGFIELD! GOOD NIGHT!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-09-21T17:36:33.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Dave T",
      "body": "At 12:28 pm did you mean to say \"19 minutes to burn the cd\" instead of 29? Because a 4X cd burner takes at most 20 min. My 4X burner made me late to work so many times...<br/><br/>And to Flo in comment #42: european dvds have a different frame rate and frame size than ours, and won't play in most stand-alone players. But if you have a computer it should be able to play it. <br/><br/>Someone with the proper software and know-how could also convert it and burn a new disc for you.",
      "created_at": "2005-09-28T05:24:02.000Z"
    },
    {
      "author": "Nate",
      "body": "A big congratulations, Chiltonettes.",
      "created_at": "2005-09-21T17:49:42.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "Joel cries at Selena every time too.",
      "created_at": "2005-09-21T18:16:13.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "\"Dumb and Dumber\" gets me every time.<br/><br/>Best of luck today, and congratulations!",
      "created_at": "2005-09-21T18:21:20.000Z"
    },
    {
      "author": "brian of moore",
      "body": "*pees his pants*",
      "created_at": "2005-09-21T19:16:18.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Any movies about sports.",
      "created_at": "2005-09-21T19:35:21.000Z"
    },
    {
      "author": "DUG",
      "body": "I always cry at How to Win a Date with Tad Hamilton.  She knows his smiles too!!!  Aboo...aboo hoo hoo",
      "created_at": "2005-09-21T19:45:45.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "\"Toys\" made me cry.",
      "created_at": "2005-09-21T20:45:26.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "This just in!<br/>http://www.sbj.net/enews_article.asp?lID=47&sID=46&cID=Z&aID=51738434.5082361.915395.3284832.584966.101&aID2=70406",
      "created_at": "2005-09-21T20:59:32.000Z"
    },
    {
      "author": "Rachel",
      "body": "The Little Mermaid. When Tritan has to give Ariel away to the land of the legged...gasp...it still makes me weepy. I am SO wishing I could SO be in Springfield right now. SO.",
      "created_at": "2005-09-21T21:39:14.000Z"
    },
    {
      "author": "Sukotto",
      "body": "cheering<br/>cheering<br/><br/>rah rah... goooooo TEAM!",
      "created_at": "2005-09-21T22:09:08.000Z"
    },
    {
      "author": "Steve Kirks",
      "body": "Dan and Nicole:<br/><br/>I'm sorry I won't be there tonight (getting sick instead) and I wanted to wish you congrats.<br/><br/>Also, good to see the pseudo-link for RSS on the movies page.  Don't forget a handy orange RSS icon:<br/><br/><img src=\"http://houseofwarwick.com/images/xmlicon.gif\">",
      "created_at": "2005-09-21T22:31:33.000Z"
    },
    {
      "author": "Dave",
      "body": "Dishes. I once ate a whole rack of lamb out of a mailbox with a bic pen.",
      "created_at": "2005-09-22T00:00:30.000Z"
    },
    {
      "author": "brian of moore",
      "body": "im loving that you can post from the moxie now... nice<br/>and i guess i just got a glimps at an answer as to what you are using wifi for<br/>and i guess i was right.. you *are* high tech",
      "created_at": "2005-09-22T00:57:57.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "I almost shed a tear when I set the text for the new business license. Theater, restaurant and retail 5 percent beer by drink!",
      "created_at": "2005-09-22T01:23:12.000Z"
    },
    {
      "author": "Tyler",
      "body": "Damn, I should have come to the first showing. There'll probably be more people at the others.",
      "created_at": "2005-09-22T01:59:54.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Fantastic!  We're pulling for you her in Knoxville...",
      "created_at": "2005-09-22T02:10:53.000Z"
    },
    {
      "author": "Stephanie",
      "body": "here.  The word is 'here'.  That's what happens when you try to type while holding a kitten.",
      "created_at": "2005-09-22T02:12:56.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "I think you meant \"hurrrr.\" And I think you meant to give me that kitten.",
      "created_at": "2005-09-22T02:17:20.000Z"
    },
    {
      "author": "Caleb",
      "body": "I'm really enjoying your minute-by-minute updates. Keep 'em coming!",
      "created_at": "2005-09-22T02:32:00.000Z"
    },
    {
      "author": "matt",
      "body": "congrats!  wireless blogging on the job is the best!",
      "created_at": "2005-09-22T03:24:57.000Z"
    },
    {
      "author": "Caleb",
      "body": "When I worked at Movie Gallery we kept it about 70 degrees. I was always burning up while working but if I ever went in just to rent movies it always seemed a perfect cool temperature. It might just be the fact that you're working. ",
      "created_at": "2005-09-22T03:29:39.000Z"
    },
    {
      "author": "erin",
      "body": "gosh i wish i could be there tonight. im proud of you folks!<br/><br/>uhhh. i feel im missing out on so much!! darnit.",
      "created_at": "2005-09-22T03:46:30.000Z"
    },
    {
      "author": "Andy",
      "body": "I was at the first screening!  It was me, about 40 senior citizens, and two girls that were about my age (19).<br/><br/>The old people all heard about the Moxie from the paper.  They figured, 'what else is there to do in town right before bed?'<br/><br/>The guys behind me were talking during intermission, trying to figure out what \"the twist\" was going to be.  One of the guys said \"I'm pretty sure that the guy with the ugly hair is some sort of pyscho killer.\"  And the other guy seemed to think that might be a possiblity.  It was awesome.<br/><br/>Congrats Dan & Nicole.  I was dressed cool-ley and was fine.",
      "created_at": "2005-09-22T05:05:05.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Thank you for thanking me to the Moxie!",
      "created_at": "2005-09-22T06:14:10.000Z"
    },
    {
      "author": "brian of moore",
      "body": "ive seen dan and nicole on tv three times today.. yay!... i think this thing is gonna steamroll.. and its gonna be completely packed over the weekend",
      "created_at": "2005-09-22T07:13:04.000Z"
    },
    {
      "author": "Caleb Copeland",
      "body": "Great movie. Great Fitz's. Great popcorn. Great time.<br/><br/>And don't worry about forgetting to rewind the film. It just meant more time to socialize and watch the slideshow. <br/><br/>And I know I said I wasn't coming. But I decided the Moxie was more important than homework. I'm positive it was the <i>right</i> decision.",
      "created_at": "2005-09-22T08:37:51.000Z"
    },
    {
      "author": "brian of moore",
      "body": "so did you or nicole even get to see the whole film yet?",
      "created_at": "2005-09-22T08:45:51.000Z"
    },
    {
      "author": "Zach",
      "body": "What a refreshing enjoyable night out. There is no way I would have been exposed to that great movie had it not been for the Moxie. All of your hard work shows. Congratulations, it was a great time. I look forward to bringing my friends for future showings.",
      "created_at": "2005-09-22T09:18:57.000Z"
    },
    {
      "author": "deborah",
      "body": "I just spent several hours (well, in between watching Lost and the commercials) going through your phlogs.  Wow!  Really, just wow.<br/><br/>Congrats and good luck with the theatre!",
      "created_at": "2005-09-22T09:37:30.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Hooray, Dan and Nicole!<br/><br/>And Aaron Scott: you may visit the kitten, but you can't have him.  He's mine, all mine!",
      "created_at": "2005-09-22T10:09:17.000Z"
    },
    {
      "author": "Fyse",
      "body": "Congratulations on your triumphant first day!",
      "created_at": "2005-09-22T14:09:06.000Z"
    },
    {
      "author": "Nightwarrior",
      "body": "))<>((",
      "created_at": "2005-09-22T17:41:29.000Z"
    },
    {
      "author": "Untitled",
      "body": "I've been thinking about the poop.",
      "created_at": "2005-09-22T19:36:30.000Z"
    },
    {
      "author": "Nightwarrior",
      "body": "Back and forth.<br/><br/><br/>Forever.",
      "created_at": "2005-09-22T20:15:06.000Z"
    },
    {
      "author": "nicki",
      "body": "Yay! I wish I could have commented sooner, but I had to sleep and then work in the time since leaving the theater.<br/><br/>I had a great time last night, I'm glad caleb finally accepted the truth that the moxie is far greater than any homework assignment. :D",
      "created_at": "2005-09-22T20:32:52.000Z"
    },
    {
      "author": "erin",
      "body": "im SO glad we ended up going opening night.<br/><br/>the moxie makes my heart 3x bigger.<br/><br/>thanks so much for the many, many, many, many enjoyable evenings at the moxie to come.",
      "created_at": "2005-09-22T21:26:13.000Z"
    },
    {
      "author": "Liz",
      "body": "Congratulations on what sounds like an excellent opening day!  Good luck on the weekend.",
      "created_at": "2005-09-22T22:48:21.000Z"
    },
    {
      "author": "Caleb",
      "body": "Hey Dan I sent you an e-mail at info@moxiecinema.com. It was just a question about your Manhattan Short Film Festival ticket donation and how I can go about getting some kind of ticket/certificate. Could you just stamp something we have with your nice little Moxie stamp you used on the Murderball postcards?",
      "created_at": "2005-09-22T23:14:22.000Z"
    },
    {
      "author": "Oz",
      "body": "Congrats, Dan!  I'm glad it went so well.",
      "created_at": "2005-09-22T23:37:38.000Z"
    },
    {
      "author": "Wunderle",
      "body": "Hey Andy-<br/>I was at the first show. Granted, I'm almost a senior citizen (52) but SOME old farts actually know a thing or two about movies. <br/>I'm amazed at some people younger who don't understand why Citizen Kane was a big deal or why John Cassavetes was so important to what's now the \"independent\" film biz.<br/>Are YOU the guy who kicked my walker out from under me?<br/>Wunderle",
      "created_at": "2005-09-23T04:46:52.000Z"
    },
    {
      "author": "Tristor",
      "body": "Congrats on opening, I'm sorry I missed it.  I tried to get out of class that night but we were working on a major project in class, so I had to stay.  I'll try to make one of the showings on the 28th.",
      "created_at": "2005-09-23T06:12:15.000Z"
    },
    {
      "author": "Flo Williams",
      "body": "This is very exciting for Springfield. Not sure if I will make it to this film, but there is a lot of buzz at work about this theater. Will you show foreign-political films? I am anxious to see The Take from Argentina about companies that were taking the factories apart and selling them until the workers started inhabiting them and getting them back into production. Also, for the life of me the name has left me, but the Jonathan Demme movie (did I get that right?) about the Haitian radio personality that was murdered by the interim government Bush put in place? I bought that one from Amazon UK and it won't play in my DVD player. :-( ",
      "created_at": "2005-09-23T23:35:28.000Z"
    },
    {
      "author": "Flo Williams",
      "body": "You are right, a computer will play it. But only if you change the settings and then for only 5 times. If you forget to change the settings back and go over the limit, you are stuck with not being able to play US DVD's in that drive again. Not a very good option. I am just hoping down the line the parameters of the software changes to my advantage. ",
      "created_at": "2006-07-12T04:04:29.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
