{
  "id": 305,
  "title": "It's gettin' hot in here...",
  "body": "... so take off all your clothes... and let me know how hot it is where you're at! I like hearing about the weather in different parts of the world. Right now, in Springfield, it's 90 degrees with 40% humidity, which makes it feel like 93 degrees. That's too hot. What's it like where you're at? Tell me. Tell me!<br/><br/>By the way, our first show was pretty slow (only 8 people). One guy came in late and said our concessions were overpriced. \"Try to get a soda and popcorn for less than $5.00 at any other theater,\" I <i>should've</i> said. But instead of saying that, I just yelled \"SELENA!\" and ran off crying.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-09-23T02:11:30.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "as well as <br/>'try and get this selection of beverages at another theater'<br/><br/>ill be at the 7pm show.. with a few friends<br/>ill be going for the fitz's cream soda.. and my founders small popcorn :-)",
      "created_at": "2005-09-23T02:37:08.000Z"
    },
    {
      "author": "nathan",
      "body": "i would have stabed the guy then spit on him, it is too hot everywhere, and i sweat way to much. arm pits suck.",
      "created_at": "2005-09-23T02:41:21.000Z"
    },
    {
      "author": "Stephanie",
      "body": "just before seven, it's 86 degrees in Knoxville.<br/><br/>But then...Knoxville sucks.",
      "created_at": "2005-09-23T02:42:29.000Z"
    },
    {
      "author": "Caleb",
      "body": "I take up tent in Springfield so I'm getting ready to walk in that 90 degree weather. Damn Missouri.<br/><br/>Good luck with your shows tonight. I will be swinging by the theater tomorrow around 4:00 to pick up those passes. Thanks again for donating them. <br/><br/>As far as prices, I think for the product you're selling and comparison to other theaters you guys are very cheap. And honestly even if you did charge more I don't think I would mind paying because I would know it was going to a good cause. However don't take that as a suggestion to raise your prices! These other bloggers might kill me...",
      "created_at": "2005-09-23T02:48:29.000Z"
    },
    {
      "author": "Karla",
      "body": "I wish it were hot, hot, hot.  But it's not.  Our daytime high today in Northern Saskatchewan (Canada) was a whopping 15 Celsius - that's about 59 fahrenheit to you Americans.  Our low over night was around 32 fahrenheit - that's freezing people! ",
      "created_at": "2005-09-23T02:51:58.000Z"
    },
    {
      "author": "nicki",
      "body": "i would come every night that i could... but I don't want to see the same movie every night.. so i don't... :(",
      "created_at": "2005-09-23T03:07:54.000Z"
    },
    {
      "author": "erin",
      "body": "i think your consessions are VERY resonable.<br/><br/>i would have kicked the guy for you if i would have been there. i would have kicked him REAL good.<br/><br/>im ready for murderball. now!! now!! now!!<br/><br/>p.s. why do dan and nicole look so diffrent in pictures (newspaper, etc.) ??<br/>do you have 'evil' twins to do all your publicity work?",
      "created_at": "2005-09-23T03:34:52.000Z"
    },
    {
      "author": "matt",
      "body": "it's 85 degrees in atlanta, pretty nice out, not too humid.  overpriced is paying 4 dollars for an 18 ounce bottle of dasani water at the local landmark theater here.",
      "created_at": "2005-09-23T03:35:54.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "I'm with Caleb. I'm much more willing to pay a premium at a place like the Moxie where I know who I'm supporting. I'm hoping to make it to see every movie, but it's hard to get out when you have a four year old.",
      "created_at": "2005-09-23T05:18:20.000Z"
    },
    {
      "author": "Steve Kirks",
      "body": "1.  Prices for concessions aren't bad.  You get a real product and a great price, compared to the inflated s**t you get at other places.<br/><br/>2.  Congrats again!  I wish I had felt good enough to go to opening night!<br/><br/>3.  Echoing another commenter: MURDERBALL!",
      "created_at": "2005-09-23T05:33:15.000Z"
    },
    {
      "author": "brian of moore",
      "body": "))<>((<br/>back and forth, forever<br/><br/>everyone should go see Me & You & Everyone We Know... it was most excellent<br/>sadly the \"friends\" that were to come with me... backed out at the last minute.. but im hoping to make them go before it leaves the moxie... either way i definately want to go see it again... its <i>that</i> kind of movie",
      "created_at": "2005-09-23T05:52:14.000Z"
    },
    {
      "author": "Caleb",
      "body": "#@%& Peas!<br/><br/>After the film I was chatting with Erin about Miranda July's filmmaking style. I suggested it was a strange mixture of Wes Anderson and Jared Hess (Napoleon Dynamite). What do you all think?<br/><br/>And did anyone else notice who did the soundtrack? Michael Andrews. The guy who did the music for Donnie Darko.<br/><br/>P.S. <br/>Jared Hess just so happens to work for the production Company Moxie Pictures.",
      "created_at": "2005-09-23T06:37:08.000Z"
    },
    {
      "author": "nicole",
      "body": "To be fair, the guy who said the concession prices were too high loved the movie, so hopefully that will bring him back again for the next one!",
      "created_at": "2005-09-23T06:54:32.000Z"
    },
    {
      "author": "Krystal",
      "body": "It's 54 here in Michigan at 11:22 in the p.m. <br/><br/>I'm looking forward to comming home and seeing a show at the Moxie.",
      "created_at": "2005-09-23T07:23:30.000Z"
    },
    {
      "author": "mish",
      "body": "yes. concessions seem a bit high to me... (sorry im not kissing your butts, but i can afford soda that costs that much!) i dont think i would complain about them though. if i wanted concessions that badly i would just give in and pay for them (which i may or may not do in the future as a treat- my friends ginger ale was amazing) and if i dont want to pay that much, then i wont get any. simple as that.<br/><br/>i personally think it may be high for me, but if you rose the prices any higher, itd be to high for anyone.",
      "created_at": "2005-09-23T08:30:24.000Z"
    },
    {
      "author": "brian of moore",
      "body": "hmm.. how much is a fitz's when you are actually at fitz's in st. louis?  been a while since ive been... can you get a fitz's at dillions or anything?  i really dont know...<br/>either way.. i figure its worth it.. but i tend to live under my means.. and thus usually have plenty of surplus for such things... eh",
      "created_at": "2005-09-23T08:43:48.000Z"
    },
    {
      "author": "nicole",
      "body": "Apparantly the only other place in Springfield that serves Fitz's is at Applebees, and that's just the root beer.",
      "created_at": "2005-09-23T09:38:50.000Z"
    },
    {
      "author": "nicholas",
      "body": "61 degrees and clear skys in Edinburgh, Scotland, UK. Sorry I missed the opening... I was there in spirit!",
      "created_at": "2005-09-23T14:11:59.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "75 degrees in Holy Toledo. Wish you were here.",
      "created_at": "2005-09-23T16:36:53.000Z"
    },
    {
      "author": "Rachel",
      "body": "According to weather.com it is currently 6 degrees cooler in Chicago than it is in Springfield. (9:16 am) Over and out.",
      "created_at": "2005-09-23T18:16:36.000Z"
    },
    {
      "author": "Sara",
      "body": "I haven't come yet, but I can't wait! I just think it's going to be the best movie experience to watch cool movies, drink a real beverage, and be in a theatre at the same time. Charge me whatever, I'll be there soon.",
      "created_at": "2005-09-23T19:10:48.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Are you guys going to drive all your recyclables to Michigan sometime?",
      "created_at": "2005-09-23T20:07:05.000Z"
    },
    {
      "author": "Kess",
      "body": "As for the concession prices...there will always be a few who complain, just like everything else. My wife and I thought it was very reasonable, especially when you consider the cost of other movie theaters in town. I wouldn't worry about it.",
      "created_at": "2005-09-23T20:46:26.000Z"
    },
    {
      "author": "Maddy",
      "body": "65 degrees in Normal, Illinois",
      "created_at": "2005-09-23T21:13:22.000Z"
    },
    {
      "author": "Liz",
      "body": "78 degrees in Salt Lake City, with a pleasant breeze. (2:00 PM)",
      "created_at": "2005-09-24T00:04:29.000Z"
    },
    {
      "author": "Amanda",
      "body": "70 and Breezy in Boise...",
      "created_at": "2005-09-24T01:34:15.000Z"
    },
    {
      "author": "Jessica",
      "body": "I wish I could tell you how hot it is at my home town Beaumont, Texas....but I am guessing hot, windy, and under water.",
      "created_at": "2005-09-25T04:49:03.000Z"
    },
    {
      "author": "Jessi D",
      "body": "92* in orlando, florida",
      "created_at": "2005-09-27T04:54:56.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
