{
  "id": 306,
  "title": "I think...",
  "body": "... we're going to get swamped tonight. Wednesday was super busy, Thursday was pretty slow, but today is already shaping up to rival Wednesday. Hip hip hooray! We have to pay a $1,150 deposit to City Utilities just to get an account set up! Hip hip hoorboo! The News-Leader misprinted our schedule for today. Oh well. Lots of people are still showing up.<br/><br/>THANK YOU SPRINGFIELD! WE CAN FINALLY AFFORD TO BUY NEW SHOES!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-09-24T02:22:33.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "David & Kate Foster",
      "body": "Will they be of the blue suede variety?",
      "created_at": "2005-09-24T03:39:37.000Z"
    },
    {
      "author": "bjork24",
      "body": "Perhaps",
      "created_at": "2005-09-24T03:40:19.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "I'm glad to hear things are going well! Too bad about CU. If it's like residential accounts, they will give it back to you in a year, at which point you'll have forgotten about it and it will be a bonus!",
      "created_at": "2005-09-24T04:59:49.000Z"
    },
    {
      "author": "Rachel",
      "body": "I'm not sure if you're interested in sharing this info, or maybe it was mentioned in another post but what kind of business do you need to do well or break even? How long do you anticipate it taking for you to start making a profit? How long before there is a naked phlog?",
      "created_at": "2005-09-24T07:38:08.000Z"
    },
    {
      "author": "Caleb C.",
      "body": "We had roughly 350-400 people show up tonight. We were so happy to see so many people come. We think we did pretty good with the amount of planning time we had for this and it being the first time. The films were fantastic. The winner in our venue was <a href=\"http://www.msfilmfest.com/index.php?section=pfinals&level=0&filmpage=hibernation\">Hibernation</a>.<br/><br/>Thanks again for donating the two tickets. I heard a lot of people talking about the Moxie. Hope you guys had a swell night with the movie. <br/><br/>Hopefully you guys can come next year!",
      "created_at": "2005-09-24T09:32:35.000Z"
    },
    {
      "author": "brian of moore",
      "body": "ive wondered that as well.. and actually last night i was <a href=\"http://theimaginaryworld.com/box738.jpg\"crunching some numbers</a> trying to figure out when you kids might get out of debt... hmm  .. i wouldnt dare ask for any explicit details of your finances... but it would be cool to get a headcount over this first weekend.. perhaps<br/><br/>but just imagine it.. a sold out show at 7pm... all sr citzens and college students of course... then then about 50 people for the late show... only about 15 for the matinee.... as well as the late late show... (totally guessing) half of all of them bought at least one soda...at $2.50<br/>mmmmm  $1065.75<br/>that would be a nice friday... for now at least",
      "created_at": "2005-09-24T09:50:06.000Z"
    },
    {
      "author": "brian of moore",
      "body": "woah.. super link.. my bad",
      "created_at": "2005-09-24T09:50:39.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Yeah, I was totally stoked when I found out CU credited back my deposit a few months ago. Took care of one bill and cut the next in half! I thought they would just pay it back whenever I moved or something. ",
      "created_at": "2005-09-24T17:50:06.000Z"
    },
    {
      "author": "Mark",
      "body": "Congrats on a sucessful opening!<br/><br/>M",
      "created_at": "2005-09-24T19:07:31.000Z"
    },
    {
      "author": "mish",
      "body": "whoa! hibernation one?! that is awesome. i totally voted for that one.<br/><3<br/><br/>my goodness it was amazing.<br/><br/>and i hear the moxie is very awesome from alot of first time viewers from this week already. congrats guys!",
      "created_at": "2005-09-24T22:15:18.000Z"
    },
    {
      "author": "Caleb",
      "body": "Question, should you choose to accept it:<br/><br/>Is the movie you're getting on October 5 being released on October 5? Because if so, I think I may have figured out the movie. And if it isn't, I think you should get this movie. I've been wanting to see it since I heard about it premiering at Sundance in JANUARY. It's called <i>The Squid and the Whale</i>. ",
      "created_at": "2005-09-25T00:30:08.000Z"
    },
    {
      "author": "Caleb",
      "body": "<a href=\"http://www.apple.com/trailers/independent/thesquidandthewhale.html\">The Squid & the Whale Trailer</a>",
      "created_at": "2005-09-25T00:33:27.000Z"
    },
    {
      "author": "bjork24",
      "body": "Caleb: It's Broken Flowers.",
      "created_at": "2005-09-25T00:37:54.000Z"
    },
    {
      "author": "---",
      "body": "would you ever show something like 9 songs?  how do you think that would play in a place like Springfield?  if you don't think it would play well here--do you think that your for-profit status means that you can't show some of the edgier films (even if they are good) just because you need positive publicity and higher attendance? ",
      "created_at": "2005-09-25T02:31:03.000Z"
    },
    {
      "author": "Caleb",
      "body": "WOOHOO! I hope I didn't force you into an early revealing of what film you are showing. I can't wait!",
      "created_at": "2005-09-25T03:28:59.000Z"
    },
    {
      "author": "Jamie",
      "body": "I suggest matching cowboy boots!",
      "created_at": "2005-09-25T04:38:10.000Z"
    },
    {
      "author": "brian of moore",
      "body": "caleb- it was in the previews<br/>which begs the question.. will that always be the case... i suppose it only makes sense.. preview the movie to be showing next.. <br/><br/>i do like the trailer caleb linked too..<br/>'walt, did you write that?'  \"yes\"  <br/>lol.... ",
      "created_at": "2005-09-25T05:05:31.000Z"
    },
    {
      "author": "Caleb",
      "body": "There was also a trailer for Grizzly Man...hmm.... :-)",
      "created_at": "2005-09-25T10:25:14.000Z"
    },
    {
      "author": "CJ",
      "body": "Thanks for playing the movie for the few of us on Friday night, definitely enjoyed it and I'm so glad we have something like you guys in town so I can get my fill of Fitz's ginger ale and dont have to wait to go home to watch independent movies. :)",
      "created_at": "2005-09-25T21:44:11.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
