{
  "id": 307,
  "title": "Super slow Sunday",
  "body": "Man, today has been slow. I imagine most Sundays will probably be like this. We had 21 people for the 3:00 pm show, but the 5:00 and 7:00 only had 15... COMBINED! I doubt the 9:00 show will fare much better, but we shall see.\r\n\r\nFor those of you who were wondering, we've sold 152 bags of popcorn since our opening night. Not too shabby. I plan on keeping a running tally of how many bags we've sold from now until eternity. That way we can add a little line on the bottom of our sign that says, \"over 300 served!\" That would be great.\r\n\r\nYou know what makes me mad? People who throw their regular trash into the glass recycling bins. If the world were fair, those people would be attacked by raccoons and/or flying squirrels... whilst sitting on the toilet.\r\n\r\nThere was something else I was going to say... hmm, I can't seem to remember. I bought new shoes yesterday. They're the kind that have two big velcro straps across the top. No laces, just velcro. They cost me $10 at Wal-Mart. I also shelled out $8 for some Dr. Scholl's gel pads. Now I'm gellin' like a felon eating watermelon at the Carnegie Mellon memorial cafeteria, which was named after Dr. Stephen Hellon. Why? I ain't tellin', cause my feet are really smellin' and the kids they are a-yellin', but my dog won't quit eating all the damn beef-flavored ramen noodles out of the trash.\r\n\r\n7:00 movie is almost over. I better go lord over the projector.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-09-26T05:31:19.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "LOL. You weren't kidding about being able to buy new shoes now. Hope your first opening weekend went great. Can't wait for Murderball and Broken Flowers to come out! ",
      "created_at": "2005-09-26T06:58:17.000Z"
    },
    {
      "author": "Wunderle",
      "body": "Hey Dan- The trash thing is frustrating. I was janitor at the Gillioz for 5 years. Needless to say there were no recycling bins there. People even using a trash can was sort of rare. I found on the auditorium  floor: More soiled Pampers than I can remember, a vice cop's plastic case filled with hollow point bullets, several suspicious handkerchiefs (the Gillioz showed soft porn every once in a while in those final years), entire giant tubs of popcorn with one handful gone and the rest used as a spitoon for mint flavored chaw, a baggie containing boiled new potatoes, a bottle of something from the drugstore called \"sweet oil,\" a ceramic pot pipe, etc. Also, one time someone went all the way up to the men's room (it was on the balconey level) and took a dump NEXT TO the toilet.\r\nI hope next week goes well. See you soon\r\nWunderle",
      "created_at": "2005-09-26T08:05:33.000Z"
    },
    {
      "author": "Caleb",
      "body": "Um, that's disturbing. And one of the best comments I've seen on this blog. \r\n\r\nI'm going to have nightmares tonight...",
      "created_at": "2005-09-26T08:57:47.000Z"
    },
    {
      "author": "Jillian",
      "body": "))<>((\r\nforever.",
      "created_at": "2005-09-26T10:27:00.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "I told Nicole to get some gellin' soles so she could be gellin'. Glad to hear things are moving smoothly. Excpept for the trash.",
      "created_at": "2005-09-26T17:50:57.000Z"
    },
    {
      "author": "brian of moore",
      "body": "today my photography teacher urged everyone to go see MYEWK... i was the only other one that had seen it.. and so i seconded the motion...  quite a few seemed interested... some even wrote it down.. as if it were an assignment :-)\r\nill be back to see it again on tuesday.. with at least four friends in tow",
      "created_at": "2005-09-26T20:39:56.000Z"
    },
    {
      "author": "nicole",
      "body": "Woohoo! Word of mouth is our best form of publicity. Keep it coming.",
      "created_at": "2005-09-26T20:40:50.000Z"
    },
    {
      "author": "erin",
      "body": "he said the same thing in MY class!! and i too was the only one who had seen it.. but nobody seemed too thrilled. art classes with people hardly intrested in art. what gives??\r\n\r\nanyway!\r\n\r\ni HATE people who dont seperate their trash too. i used to work at a golf course. and i would have to go through every single trashcan on the course seperating the cans from everything else because people were too lazy to do so by themselves.... it is the most disgusting thing. ever. and when i would see people put trash in the can containers.... i wanted to murder them. twice!!",
      "created_at": "2005-09-26T21:28:02.000Z"
    },
    {
      "author": "erin",
      "body": "but wunderle's story is much worse. i feel blessed now.",
      "created_at": "2005-09-26T21:30:00.000Z"
    },
    {
      "author": "bjork24",
      "body": "Actually, I'm not referring to people at the theater. Everyone has been really good at separating their trash at the theater. I'm talking about the recycling center where we TAKE the recycling to. That's where people throw their trash together and it KILLS ME!",
      "created_at": "2005-09-26T21:55:58.000Z"
    },
    {
      "author": "nicole",
      "body": "Yeah - they throw plastic bags in the PAPER bin. \r\n",
      "created_at": "2005-09-26T22:15:33.000Z"
    },
    {
      "author": "duanekeys",
      "body": "Not seperating at the theater, that I can understand happening...  but at the recycling center?!  They were there for that specific purpose!",
      "created_at": "2005-09-26T23:00:17.000Z"
    },
    {
      "author": "Wunderle",
      "body": "I hate to offer more disturbing things and I swear this is true. I have a weird ritual of taking my recyclables to the College St IGA location on holiday mornings.Thanksgiving, Xmas, Easter... I like to see whose up and around early on those days. On Xmas morning in 2002 I saw a beagle (deceased) in one of the bins. It pretty much set my holiday mood. ",
      "created_at": "2005-09-27T06:27:52.000Z"
    },
    {
      "author": "bjork24",
      "body": "That's where I take the recycling to, Jim. It's quite an interesting locale. Lots of local color.",
      "created_at": "2005-09-27T07:17:11.000Z"
    },
    {
      "author": "CJ",
      "body": "I'm from Columbia and I know ragtag is not even open on Sundays like past 5 or so.....also considering you are in bible belt town america almost everyone is probably too busy attending church on Sundays.....or some of them are probably too hungover, so maybe you should look into cutting down some Sunday shows of course after you have analyzed what the crowd wants, which seems like will take a while to figure out.....good luck",
      "created_at": "2005-09-27T08:53:52.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
