{
  "id": 308,
  "title": "Expectations: shattered!",
  "body": "Things I expected, but now find to be untrue:<br/><br/><ol><li>That the women's restroom would be cleaner than the men's. Surprisingly, this has yet to prove true.</li><br/><li>That Monday nights would see more than 15 people show up... total. My hypothesis is that only 10% of our potential market (if that) even know we're open yet. We get lots of people coming in \"just to look around.\" The first thing they say is, \"I didn't know you were open!\" We've only just scratched the surface of our market saturation. We passed out a total of 100 flyers on Missouri State's campus the night before we opened. Then we dropped a few off at the Mud House, but that's about it. I think as the weeks draw on, we're going to see a steady increase in traffic. The biggest turning points will be a) when we get our permanent marquee up (as opposed to the same old banner that's been hanging out front for the last nine months), and b) when we do a full distribution of our monthly calendars.<br/><br/>I remember reading an article about the Mud House and how for the first few months their business was nearly non-existent. The owners, Rob and Brian, took a look around and asked themselves, \"did we do the right thing?\" Then, slowly, word started to spread and people started to drop by more often. Now they're busy from open to close. Patience is the key here. Patience and good advertising.</li><br/><li>Budweiser isn't a big seller. That was a surprise. Believe it or not, Boulevard Wheat is our biggest money maker... along with Fitz's Orange Soda.</li></ol><br/>So there it is. A list of expectations that really surprised me. I'm sure things will turn around in October. We've got a good line-up of films (three of which are already visible <a href=\"http://www.moxiecinema.com/films.php\" class=\"broken\">here</a>), and things can only get better from there.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-09-27T06:51:40.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Al",
      "body": "I've been in retail for 13 years, and the women's room is always dirtier. <br/><br/>",
      "created_at": "2005-09-28T00:52:56.000Z"
    },
    {
      "author": "brian of moore",
      "body": "ahh yes.. to second that... ive worked in many places.. and most every place ive worked.. the womens room is always very disgusting.. in comparison<br/>which is open to interpretation i guess",
      "created_at": "2005-09-28T01:54:02.000Z"
    },
    {
      "author": "Nate",
      "body": "Ok - then I'll step up and interpret:<br/><br/>Shorties just be dirtier.",
      "created_at": "2005-09-28T02:12:50.000Z"
    },
    {
      "author": "duanekeys",
      "body": "Here's your problem.  Banner at the top of the page still reads \"Opening in late 2004, February, March SOON\"",
      "created_at": "2005-09-28T02:37:20.000Z"
    },
    {
      "author": "Caleb",
      "body": "Ooh. Good point duanekeys. I didn't even notice that. Somehow though I doubt it's to blame...",
      "created_at": "2005-09-28T03:36:09.000Z"
    },
    {
      "author": "mish",
      "body": "oh i think its to blame.<br/>its the little things like that...",
      "created_at": "2005-09-28T03:59:28.000Z"
    },
    {
      "author": "nicole",
      "body": "I worked / lived in a dorm with 400+ females. We had to periodically lock the bathroom doors as punishment because they would keep them so disgustingly dirty.",
      "created_at": "2005-09-28T04:49:40.000Z"
    },
    {
      "author": "Matt",
      "body": "It's a shame i'm too far across the pond to have made it to the blog nights, and everyone thinks my shirt is an obscure Simpsons reference they just dont get.. but one comment I would immediately have is that, while awaiting word of mouth, fill the towns letter boxes with a nicely simple postcard that fits with the moxie brand, a nice spot gloss finish on the logo would be an elegant touch. Simply stating that the cinema is now open and everyones invited, maybe an  offer for free 'snack size' (read: mini) popcorn that wont break your budget but nothing too cheesey IMO.<br/><br/>Just to set yourself with a good 'now open' awareness foundation for the word of mouth to build on? ",
      "created_at": "2005-09-28T15:18:36.000Z"
    },
    {
      "author": "Sara",
      "body": "Don't give up on Monday nights, those are perfectly available nights for me that I have designated to the Moxie, although I have yet to get away. I still can't wait! ",
      "created_at": "2005-09-29T18:41:05.000Z"
    },
    {
      "author": "Sara",
      "body": "Question, why can't you find show times in the paper with the movie info.? They have your movies in the reviews, but there is only a phone number in very fine print at the bottom of the page. ",
      "created_at": "2005-09-29T18:45:14.000Z"
    },
    {
      "author": "a",
      "body": "but at least women's rooms don't smell like men's rooms...we don't pee on the walls!",
      "created_at": "2005-09-29T18:54:53.000Z"
    },
    {
      "author": "nicole",
      "body": "Sara - getting an ad for those show times costs between $50 and $75 a day, which we just can't justify right now. We'll be getting free listings in the weekend supplement, and based on how that goes, we'll figure out advertising.",
      "created_at": "2005-09-29T19:02:18.000Z"
    },
    {
      "author": "Melinda",
      "body": "Yey!!!  I don't have to clean the bathroom with a Q-tip!!!  Yey!!!!  I really enjoyed the Friday matinee of You and Me and Poop.  Very comfy theater... I kinda like it not all packed, but I don't have a financial stake, so I could definitely handle a full crowd if it helps ya'll out.  <br/><br/>Hope to make Murderball tomorrow evening.  It will be a very interesting contrast to the family reunion I'm taking my mama to in Ava, MO earlier in the day.  ",
      "created_at": "2005-10-02T03:30:29.000Z"
    },
    {
      "author": "Monkey",
      "body": "try to get some really underground, cheap movies and run them late at night for a cheap price on friday nights. that will get the broke bastards with nothing to do demographic. That's sure to be a big group in this town.",
      "created_at": "2005-10-10T03:27:26.000Z"
    },
    {
      "author": "erin",
      "body": "uhh. i will never be able to come up with a witty comment......",
      "created_at": "2005-09-27T07:42:58.000Z"
    },
    {
      "author": "mish",
      "body": "personally i always envisioned the moxie being so popular that, like the mudhouse, you go in hoping to get a seat and if you do get a seat then God must look favorably upon you.<br/><br/>i think its gonna happen.",
      "created_at": "2005-09-27T07:59:25.000Z"
    },
    {
      "author": "Nathaniel Carroll",
      "body": "God does look favorably upon the Moxie; I asked him.  You guys are doing a terrific job.  I have been telling all my peeps about it.  Give it time, and the people will show up.<br/><br/>I've decided to start seeing movies again, and the Moxie is my only source.<br/><br/>xoxo,<br/>nathaniel",
      "created_at": "2005-09-27T08:04:10.000Z"
    },
    {
      "author": "Caleb C.",
      "body": "I'm interested in seeing that locally-made film. And of course Broken Flowers. I am sure once enough people hear about you being open more and more will come. I'm spreading the word. The MSU Film Society is hoping to go see a movie together at the Moxie soon. Hopefully we can get a big group to go. <br/><br/>And by the way Nathanial Carroll: keep on making awesome music. ",
      "created_at": "2005-09-27T08:13:27.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i have a nathanial carroll cd<br/>okay fine.. it was a split cd with daniel weinhaus.. close enough.. good stuff though... interesting packaging<br/><br/>yeah i keep hearing people talk about the moxie in my art classes.. and no.. i dont *always* instigate the conversation.. people keep telling me they havnt gone yet but are definately excited about it.. so yes im sure word of mouth is spreading and business will pick up in no time",
      "created_at": "2005-09-27T08:48:17.000Z"
    },
    {
      "author": "CJ",
      "body": "Any way we could get 9 songs at the moxie sometime next month, thanks",
      "created_at": "2005-09-27T08:56:26.000Z"
    },
    {
      "author": "sam",
      "body": "Replace the Bud with PBR - all the hip kids drink PBR these days - it's almost as cheap as Bud too...",
      "created_at": "2005-09-27T16:38:34.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "Mmmm. I miss my Bouley. Can't find it in Ohio.",
      "created_at": "2005-09-27T16:57:20.000Z"
    },
    {
      "author": "Nate",
      "body": "Your assessment of the situation is most likely spot on, Dan.  Give it a little time.  In the meantime, we will bring Taco Bell by so you and N can occasionally eat.<br/><br/>I just said \"your ass\".",
      "created_at": "2005-09-27T17:47:18.000Z"
    },
    {
      "author": "Ole",
      "body": "what Nathaniel said, without the 'speaking to God\" part.  ewww.",
      "created_at": "2005-09-27T18:55:19.000Z"
    },
    {
      "author": "Ty",
      "body": "I'm excited about Broken Flowers and the bear movie.  The other night I dreamt that Bill Murray came to my house.",
      "created_at": "2005-09-27T18:59:04.000Z"
    },
    {
      "author": "brian of moore",
      "body": "last night i had a dream that one of my uncles invented a cloning machine.. they were cheap to make.. and you could clone a person in the time it takes to make a pot of coffee... he was a billionaire.. and giving everyone in the family millions of dollars<br/>then i woke up.. without millions of dollars..<br/>its probably better this way... there are alot of people i know.. that should *not* be cloned",
      "created_at": "2005-09-27T21:31:02.000Z"
    },
    {
      "author": "Nathaniel Carroll",
      "body": "sorry I offended you, Ole!  I was being silly.<br/>I've got other cds.  hopefully I can get 'em on the moxie preview screens or whatever.<br/><br/>xoxo,<br/>nc",
      "created_at": "2005-09-27T22:51:35.000Z"
    },
    {
      "author": "Melinda",
      "body": "Well, dingdong dang it!  I have been so excited and eager for your opening, and very intrigued by the first film, but have I gotten there yet?  Nope.  I will, though.  Hopefully tomorrow's matinee.  And then I want to see Murderball.  And then I want to see each and every other film.  Please hang in there... there are many like me who have life or sloth get in the way, but we'll get there.  <br/><br/>If I don't haul my sorry ass to the Moxie this week, I vow to clean the ladies bathroom with a Q-tip as penance.",
      "created_at": "2005-09-27T23:06:03.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 7,
      "name": "Lists"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
