{
  "id": 31,
  "title": "Como te llama",
  "body": "<b>Criterion Cinema</b>\r\n\r\nThere it is. That's the name of the theater. I see no reason why I should keep it a secret any longer. The name <b>Criterion Cinema</b> won't give away Midwestburg's location, nor will it, or should it, alter any conceptions that one may or may not have about the theater itself. I mean, really... what's in a name? Would a theater by any other name be as unique? If you patron it, will we not bleed? Well, let's hope not. And for the record, for all you English majors out there, yes, I do know that those quotes did not come from the same play. Geez.\r\n\r\nSo, there you have it - <b>Criterion Cinema</b>. But why? Why, of all the names in all the world, did she have to walk into mine... and call it the Criterion? Well, let me illuminate for a moment. We wanted the name to embody several motifs, namely:\r\n\r\n1. Harken back to the golden era of cinema when theater names were as grand and palatial as the auditoriums within. Names like the Ambassador, the Atlantic, the Avalon, the Bijou, the Capital, the Capri, the Crown, the Empire, the Empress, the Esquire, the Fox, the Gem, the Grand, the Isis, the Liberty, the Orpheum, the Paramount, the Plaza, the Regal, the Rialto, the Roxy, the Royal, the Star, the State, the Sun, the Tower, and the World. Great names. Great times. Here's a few pictures of Criterion theaters from the golden era of film (<a href=\"http://www.cinematreasures.org/theater/1967/\" target=\"theater\">Los Angeles</a>, <a href=\"http://www.cinematreasures.org/theater/1136/\" target=\"theater\">Santa Monica</a>, <a href=\"http://www.cinematreasures.org/theater/3702/\" target=\"theater\">Oklahoma City</a>, <a href=\"http://www.cinematreasures.org/theater/528/\" target=\"theater\">New York City</a>, and <a href=\"http://www.cinematreasures.org/theater/932/\" target=\"theater\">Bar Harbor, Maine</a> - which is still open today)\r\n\r\n2. The name needed to have a meaning beyond the reference to the good ole days. <b>cri·te·ri·on</b> <i>n. pl.</i> - a basis for comparison; a reference point against which other things can be evaluated (<a href=\"http://www.cogsci.princeton.edu/cgi-bin/webwn?stage=1&word=criterion\" target=\"_blank\" class=\"broken\">source</a>). Pretty deep, eh? Our theater will be so friggin' incredible that it will set the new standard for cinematic incrediblity, ya dig?\r\n\r\n3. The name shouldn't allude to other, less than cinematic, entities. In the beginning I liked the sound of <b>the Rushmore</b>, but I changed my mind because it sounded too presidential in nature. Sure, it conjoured up the thought of Wes Anderson's film, which is great, but that fact negated our first rule of harkening back to the good ole days. We also liked <b>the Bijou</b>, but were afraid people would pronounce it as be-JEW instead of be-ZHoo.\r\n\r\nBeyond those rules, the sky was the limit. We entertained lots of different names, but <b>Criterion Cinema</b> just had that certain \"umph\", that certain \"je ne sais quoi\", that certain \"mmm, that's good... just like that... no, don't stop... yeah, yeah, YEAH\", that certain \"la la la\". You get the picture. In any case, it stuck, and we've used it ever since. We even had a logo made for us, and that's exactly what I'm going to share with you, my loyal readers, after the long holiday weekend. Until then, be good, and if you can't be good, be careful, and if you can't be careful, just don't hold on to any fireworks for too long.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-07-03T05:20:23.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Newell",
      "body": "I like it! It does bring to mind one thing though... Criterion Collection DVD's. But that's not really a bad thing. I love the Criterion Collection and they do good movies from all ages.",
      "created_at": "2004-07-03T06:47:08.000Z"
    },
    {
      "author": "bjork24",
      "body": "Newell - Oh yeah, I forgot to mention that. But yes, as you say, being compared to the Criterion Collection isn't necessarily a bad thing. Maybe people will think we distribute them... I mean, they are good movies, and we're planning on showing good movies... so you put two and two together! BOOM! We distribute Criterion Collection DVDs.",
      "created_at": "2004-07-03T06:59:27.000Z"
    },
    {
      "author": "Oz",
      "body": "I hear the name Criterion and think \"Criteria.\"  Not a bad association (and I assume it's on purpose).  Makes me wonder what the \"criteria\" is for your theater/movies.  It's sort of something to live up to, when you think about it.  With other theaters, I just assume they're showing every movie they think will make money.  But Criterion (criteria) Theater, I expect to have some standards.  Are you man enough for that, Dan?",
      "created_at": "2004-07-05T19:31:35.000Z"
    },
    {
      "author": "bjork24",
      "body": "You better believe it!",
      "created_at": "2004-07-05T19:37:28.000Z"
    },
    {
      "author": "Tim",
      "body": "I too had the Criterion DVD connection happening and I love it.  If only we had a theater around here with that kind of thought put into the name alone.  And by the way, I'm still reeling from the use of \"celiac plexus\" on the 30th.  Keep it up!",
      "created_at": "2004-07-06T00:54:06.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
