{
  "id": 310,
  "title": "A couple pictures to bide the time",
  "body": "I haven't posted any phlogs for awhile (mainly because I haven't had a chance to take any pictures), so here are a couple pix to hold you over.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/092905/open.jpg\" width=\"425\" />\r\n\r\nWe will not have completely \"arrived\" until the day I get to cut this tattered rag of a banner off the front of the building. What do you think I should do with it? Burn it for a sense of cathartic release? Hang it in the office? Sell it on eBay? I just don't know!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/092905/wall.jpg\" width=\"425\" />\r\n\r\nThe film poster wall ended up better than I ever could have imagined. It looks really, really good from the street too. Sweet!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-09-30T06:41:34.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "step 1: buy posters\r\nstep 2: cut into squares\r\nstep 3: glue to some foam board\r\nstep 4: attach to wall in pattern of your choosing",
      "created_at": "2005-10-02T01:44:00.000Z"
    },
    {
      "author": "brian of moore",
      "body": "oh!.. \r\nstep 5: accent with nice lighting",
      "created_at": "2005-10-02T01:44:32.000Z"
    },
    {
      "author": "nicholas",
      "body": "I love the poster wall... and I think you should hand on to the banner until you can come up with something fun to do with it. At the very least, cut off the bottom and save the top for taking \"on location\" to promotional places like Cinemerge, MFAS Film Fest stuff, etc.\r\n\r\nNow, for fun, check out <a href=\"http://www.ps260.com/molly/SHINING%20FINAL.mov\" target=_blank\">this link</a>. AMAZING example of how editors make the movie.",
      "created_at": "2005-09-30T06:44:32.000Z"
    },
    {
      "author": "bjork24",
      "body": "I saw that trailer earlier this evening... funniest thing I've seen in a LONG time!",
      "created_at": "2005-09-30T06:48:31.000Z"
    },
    {
      "author": "brian of moore",
      "body": "hah!.. nice link.. nicholas\r\n\r\n.. ill buy the banner...20... uh.. 15 bucks? .. .. it would look good on my livingroom ceiling.... err\r\n\r\nand yes.. the poster collage looks great from the street.. bright colors bursting out from the dark maroon-ish wall... nice",
      "created_at": "2005-09-30T06:49:30.000Z"
    },
    {
      "author": "Caleb",
      "body": "Nicholas, thank you for providing that link. I haven't laughed that hard since...well since I saw Me and You and Everyone We Know at the Moxie!\r\n\r\nI think I'm going to bring that into my MED 365 class tomorrow at MSU. We're discussing editing, and that indeed is a great example of the importance of it.",
      "created_at": "2005-09-30T08:34:56.000Z"
    },
    {
      "author": "nathaniel carroll",
      "body": "Dan,\r\n  I know every movie on the wall except for the black and red face (which, until I saw on the website from this angle, I didn't know was a face).  What movie is that?\r\n\r\nAlso, nicholas, that is a beautiful trailer indeed!  good find.\r\n\r\nxoxo,\r\nnathaniel",
      "created_at": "2005-09-30T08:50:02.000Z"
    },
    {
      "author": "bjork24",
      "body": "The black and red face is none other than Marlon Brando from THE GODFATHER!",
      "created_at": "2005-09-30T10:15:59.000Z"
    },
    {
      "author": "brian of moore",
      "body": "had that one.. the only one i cant remember is the fourth from the left on bottom.. surfer ish looking?  .. it looks very familiar.. yet i cant seem to figure it out.. eh\r\ni cant quite decide which of those movies i like the best.. but the david bowie amuses me the most\r\n\"you remind me of the babe....\"",
      "created_at": "2005-09-30T11:45:43.000Z"
    },
    {
      "author": "Chris",
      "body": "The surferish one is Endless Summer, isn't it?",
      "created_at": "2005-09-30T17:20:22.000Z"
    },
    {
      "author": "Nate",
      "body": "I can't decide what that preview is more of:  Flat out funny or cool and eye-opening.  I had no idea I was so manipulated.  Yeesh.",
      "created_at": "2005-09-30T18:08:11.000Z"
    },
    {
      "author": "Jay",
      "body": "Everyone should click that link and watch the trailer...it's inspired.\r\n\r\n\"What babe?...\"\r\n\r\nBowie is god/goddess",
      "created_at": "2005-09-30T20:51:18.000Z"
    },
    {
      "author": "Al",
      "body": "Dan, I'd never get rid of my banner, if it were mine.\r\n\r\nBy the way, as I took a day off from work today to take care of my son, as my wife is ill, when do you plan on taking a day off?",
      "created_at": "2005-09-30T22:35:25.000Z"
    },
    {
      "author": "bjork24",
      "body": "I doubt we'll get a day off until Thanksgiving.",
      "created_at": "2005-09-30T23:12:04.000Z"
    },
    {
      "author": "Nate",
      "body": "Which is appropriate, because you and Nicole are hardy Pilgrims.",
      "created_at": "2005-09-30T23:45:27.000Z"
    },
    {
      "author": "Fyse",
      "body": "As I said on Nicole's blog, that poster wall looks AWESOME, and you should SOOO give the world a chance to own a 'Moxie Cinema Film Poster Wall'.",
      "created_at": "2005-10-01T04:25:02.000Z"
    },
    {
      "author": "Matt",
      "body": "I'd be very tempted to offer the banner as a comp prize, auction the banner off on the site.. or personally, cut the logo out and glue and varnish it vertically into the door to the screening room, or get another and add one of each to the toilet doors :)\r\n\r\nThe poster wall looks fantastic... I seriously want one for my living room now :P question though, did you use original posters or digitally manipulate the artwork and reprint them as required?",
      "created_at": "2005-10-01T18:45:14.000Z"
    },
    {
      "author": "nicole",
      "body": "I purchased the posters and cut them to size. It was a fun project - but pretty expensive!",
      "created_at": "2005-10-01T18:47:53.000Z"
    },
    {
      "author": "Mark",
      "body": "I'm with Matt, I want a film poster wall too! Was there a 'how to make' post or did I dream that?\r\n\r\nM",
      "created_at": "2005-10-01T19:17:48.000Z"
    },
    {
      "author": "Mark",
      "body": "No protective coating? Foam board seem a bit flimsy though.\r\n\r\nM",
      "created_at": "2005-10-02T18:31:18.000Z"
    },
    {
      "author": "Derek the local college student",
      "body": "If you hire me, you can have lots of days off, hahaha. Yeah, I'll probably bug you about that until you get really annoyed and yell at me in front of everyone I know, causing a huge scene and making it impossible for me to ever again show my face within a block of your theater. Of course, that's when I'll start showing up in a Nixon mask because I can't seem to hold myself back. My friends and I have started setting aside our weekly \"Moxie budget\" so that we can see every film you show (preferably on opening night). See you there!",
      "created_at": "2005-10-02T20:56:01.000Z"
    },
    {
      "author": "Wunderle",
      "body": "As for the wall of fame,\r\nAudrey Tautou's face stands out. Thank you god.",
      "created_at": "2005-10-02T21:50:14.000Z"
    },
    {
      "author": "brian of moore",
      "body": "mark- im not at all sure what they really used.. but i would think foam board would work just fine.. for most purposes.. iabout a year ago.. i actually did cut 6\" square peices of foam board.. and glued some prints of a graphic i made to them... and after about a year.. they are still in great condition.. i wouldnt call them flimsy at all.. i mean.. if you are looking for a more expensive.. possibly more permanent solution.. maybe something else would be better.. but in *my* situation.. living in an apartment that i might be out of within two years.. and might not want to decorate the same in a new place... foam board is viable",
      "created_at": "2005-10-03T02:00:16.000Z"
    },
    {
      "author": "brian of moore",
      "body": "SWEEEEEEEEEEEEEEEEEEEEEETT!\r\neverybody click on films! go look!\r\n\r\nlook at all the movies that i want to see that are listed!!?  its amazing! thank you moxie!  thank you dan!  thank you nicole!\r\n\r\nsaving face... hey erin.. look harold and maude!... the aristocrats!\r\n\r\n*whew* i gotta lay down and catch my breath",
      "created_at": "2005-10-03T08:38:57.000Z"
    },
    {
      "author": "outoftowner",
      "body": "Why is saving face only showing on weekdays? :(",
      "created_at": "2005-10-03T19:12:17.000Z"
    },
    {
      "author": "Monkey",
      "body": "sell it on ebay!",
      "created_at": "2005-10-10T03:57:42.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
