{
  "id": 311,
  "title": "The poster wall",
  "body": "Since several of you were curious about how the poster collage was made - and since I was too busy to take pictures of the actual process - here's a step-by-step guide on how to build your own Moxie poster collage.<br/><br/><u>Materials</u><br/><br/><ul><li><b>4x8 piece of MDF board</b> (makes 32 squares) - you can buy it at Lowe's or Home Depot for about $15 per sheet.</li><br/><li><b>3M 77 spray adhesive</b> - $8 dollars at Wal-Mart or $15 at any craft store.</li><br/><li><b>Exacto knife or other sharp cutting blade</b> - you can usually find these at craft stores or anywhere where babies AREN'T.</li><br/><li><b>Black spray paint</b> - unlike the cutting blades, you can usually find black spray paint in most well-equipped baby cribs.</li><br/><li><b>Artwork</b> - posters, graphics, metal signs, whatever.</li><br/><li><b>Cardboard</b> - to use for your template.</li><br/><li><b>Spray-on matte finish</b> (OPTIONAL) - if you don't want your poster to be super shiny, use this stuff. We bought a couple cans at the local crafts store for about $5 a pop.</li></ul><br/><u>Directions</u><br/><br/><ol><li>If you buy a 4x8 sheet of MDF board, you'll need to get it chopped down to 1x1 squares (or whatever size you prefer). Lowe's will cut the board for you, but they only allow a certain amount cuts... somewhere around 15, if I remember correctly. I had Lowe's chop the board into eight 1x4 planks (which is a perfect size for shelves, by the way), and then I used my Dad's table saw to cut the planks into 1x1 squares.</li><br/><li>Once your squares are cut, use your black spray paint and cover the edges. This will help hide the board, and give each square a nice, finished look.</li><br/><li>Take your cardboard and cut out a template equal to the size of your squares (1x1). The template should end up looking like a big square letter \"O\"... I'll try to demonstrate with ASCII art:<br/><pre><br/>|||||||||||||||||||||<br/>||00000000000000000||<br/>||00000000000000000||<br/>||00000000000000000||<br/>||00000000000000000||<br/>||00000000000000000||<br/>||00000000000000000||<br/>||00000000000000000||<br/>||00000000000000000||<br/>|||||||||||||||||||||<br/></pre><br/>The straight lines are the cardboard, and the O's are the open space in the center. It's kind of like a cardboard TV... I'm sure everyone's made one of those before. Once you have your template cut, use it to determine which part of the poster you want to use for your detail. Once you've found the perfect detail, use your cutting blade to chop off the excess poster AROUND the outside of the template. DO NOT cut inside your template unless you want your detail and the board to not line up.</li><br/><li>After you've cut away the excess poster, flip the detail over and realign your template.</li><br/><li>Spray the back of your poster detail and board with adhesive, and carefully place them together. Remember, the board should fit perfectly inside the template (the TV tube).</li><br/><li>Allow the adhesive to dry for a few minutes, then use your cutting blade to trim off the excess poster from around the board. The easiest way to do this is to cut from the back, with the poster facing down.</li><br/><li>If you want to spray the front of the poster with a finish / protectant, now would be the time to do it. The matte finish we used not only cuts down on glare, but it also protects the posters from UV light, moisture, and fingerprints.</li><br/><li>Repeat steps 3 through 7 for each and every poster in your collage.</li><br/><li>Now all you have to do is hang them. Be mindful of whether your collage will be permanent (like ours) or temporary (like anyone who lives in an apartment). I'd suggest using removable mounting tape if you live in an apartment, or even industrial strength velcro.</li><br/><li>Once you've figured out how you'll hang them, it's time to figure out how you WANT to hang them. Will your collage be willy-nilly, nice and level (like ours), or something completely different? The possibilities are as endless as a pack of Juicy Fruit chewing gum!</li></ol><br/>That's about it. You can switch up materials as needed (i.e. foam board instead of MDF board, red spray paint as opposed to black, whatever), so have fun with it! The project was pretty pricey for us since we had to buy each and every poster (I didn't want to deal with copyright infringement for replicating an unlicensed work of art), but for personal use I imagine you could get away with a really high quality print out. Good luck!<br/><br/>And, of course, big PROPS to Nicole for building all of our squares. She's <i>crafty</i>!<br/><br/>Uh oh, the 4:30 showing of MURDERBALL is almost over. I better go hit the lights.<br/><br/>By the way, we have lots and lots of OCTOBER CALENDARS for you, so please stop by and grab one. We also need friendly volunteers to help pass out the calendars around town. If you'd like to help, please let us know. Thanks!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-10-04T03:35:25.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Jamie",
      "body": "We will actually be in town this weekend!  We might be able to help!  How fun.",
      "created_at": "2005-10-04T05:50:17.000Z"
    },
    {
      "author": "Caleb C.",
      "body": "I will never look at ASCII art the same way again. ))<>((  Thanks a lot Moxie! <br/><br/>Great tutorial by the way.<br/><br/>",
      "created_at": "2005-10-04T06:14:27.000Z"
    },
    {
      "author": "brian of moore",
      "body": "red spray paint!? you just blew my mind...<br/><br/>ill be there tomorrow.. ill be sure and get some calanders.. i can tag them up at the art buildings that i have classes in..and pass a few out<br/><br/>",
      "created_at": "2005-10-04T06:14:28.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Hello, ReadyMade!<br/><br/>So, is this a chimp or a human project?",
      "created_at": "2005-10-04T10:31:48.000Z"
    },
    {
      "author": "nicole",
      "body": "Hmmm...since there are power tools involved, it's probably in the middle between chimp and human.<br/><br/>I never thought of Ready Made!",
      "created_at": "2005-10-04T19:18:47.000Z"
    },
    {
      "author": "Nate",
      "body": "This is the only Moxie blog post I've actually printed out for later use.<br/><br/>You go, Moxie blog!",
      "created_at": "2005-10-04T19:24:02.000Z"
    },
    {
      "author": "Nate",
      "body": "As far as calendar distribution, I assume you've already hit every billboard at every coffee shop in town, right?",
      "created_at": "2005-10-04T19:25:00.000Z"
    },
    {
      "author": "Fyse",
      "body": "That's not just a poster wall, man, it's Art. Plus, it's got Audrey Tatou AND Natlie Portman. AWESOME.",
      "created_at": "2005-10-05T00:02:02.000Z"
    },
    {
      "author": "Mark",
      "body": "Thanks Dan, I'm deffinately going to make my own movie poster wall now.<br/><br/>M",
      "created_at": "2005-10-07T19:22:27.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 7,
      "name": "Lists"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
