{
  "id": 312,
  "title": "Rock n' Roll Space Patrol... OUT OF CONTROL!",
  "body": "Tonight was supposed to be pretty slow. Last Tuesday we sold a total of 24 tickets... so if you average that over three showings, that's roughly 8 tickets per show. I was figuring we might double that tonight for two reasons: 1) our first independent film (<a href=\"http://www.moxiecinema.com/7\" class=\"broken\">Rock n' Roll Space Patrol</a>) would probably bring in a good crowd, and 2) our last showing of Murderball would bring in all the people who wanted to see it, but didn't get a chance over the last week. Fifty, maybe sixty tickets total. That was my prediction. Boy, was I wrong. Our 4:30 show of Murderball was par for the course (about 15 people), but by 6:00, when we had already pre-sold 20 tickets for Rock n' Roll Space Patrol, we knew tonight was going to be big. I immediately called Justin and Kelley, and begged them to come in. Luckily, they weren't busy, so they agreed to put in a few hours.\r\n\r\nBy 7:00, Rock n' Roll Space Patrol was completely sold out, breaking our previous record of 54 admissions for one showing. It was amazing! Kudos to Mr. Jim Bultas, the director of R&RSP, for bringing in such a huge crowd. We even had to turn people away! Had Justin and Kelley not been there, Nicole and I would've exploded into a million gooey pieces of wriggling flesh. Then came the 9:15 show - our last showing of Murderball. Thirty-one people! That's insane. We actually tied the total attendance record that we set on opening night! AWESOME!\r\n\r\nAnd to top everything off, the Cardinals won their first playoff game tonight. Wow. I'm exhausted. A very busy, but a very good night. Thanks Springfield!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-10-05T07:11:48.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "Wish I could have been there. Damn MED 290 night class. Congrats on such a great night.\r\n\r\nEvery time you said \"Justin and Kelley\" I couldn't help but think of a certain god-awful movie... ",
      "created_at": "2005-10-05T07:26:12.000Z"
    },
    {
      "author": "matt",
      "body": "congrats.  sounds like a success.  wish i could have been there.  damn living 772 miles away.",
      "created_at": "2005-10-05T07:37:27.000Z"
    },
    {
      "author": "Jim",
      "body": "It was a great time had by all.Just dad gum fabtabulous. I wish you guys could have been there too. Thanks again Dan and Nicole!",
      "created_at": "2005-10-05T08:36:08.000Z"
    },
    {
      "author": "brian of moore",
      "body": "awesomeness\r\ni really wish i would have had time to stay and see the local film.. i know the person who played the bad guy... so it would have been pretty amusing.. ",
      "created_at": "2005-10-05T10:50:57.000Z"
    },
    {
      "author": "Jamie",
      "body": "Adam and I were discussing what time we want to see our movie this weekend.  We are scheduled to go see a football game on Saturday, don't ask, but I think I would much rather come see you two!  And the moxie of course.  Louise will not be coming, her grandma has decided to babysit, seeing that she is here for 15 days because my grandma had a stroke.  :(",
      "created_at": "2005-10-05T16:04:25.000Z"
    },
    {
      "author": "Maddy",
      "body": "Hey--not sure where else to put this, but I have a lame suggestion.\r\n\r\nSometime when you show something really old school-- The Maltese Falcon, etc. you might want to to do a matinee showing and advertise at a local senior apartment complex.  I know a lot of them plan activities, and a lot of those seniors might love to see an old movie from their youth on the big screen again.  Can you just imagine the senior home bus pulling up to the Moxie?\r\n\r\nI just think that if you contacted a senior retirement community (not a care center--a lot of those patients owuld not be mobile, but just one of those places where the seniors are independent), they might thnk it was a pretty cool idea.  Maybe even give them a discount on tickets if they bring 25+ people?\r\n\r\nThat was my thought for the day...",
      "created_at": "2005-10-05T16:18:36.000Z"
    },
    {
      "author": "elliott",
      "body": "awesome... i loved murderball... wish i could of seen RRSP - AIG... \r\n\r\nand a big huge p.s. the pita hummas mediterranean box(is that what it was called?) = amazing... ",
      "created_at": "2005-10-05T17:59:24.000Z"
    },
    {
      "author": "nicole",
      "body": "Yay! I'm glad you liked the little lunch box!",
      "created_at": "2005-10-05T18:56:32.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "So, any chance of a repeat showing of R&RSP? I'm thrilled you guys had such a great night. Cha-ching!",
      "created_at": "2005-10-05T20:10:27.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Wow, that's fantastic Dan! You're doing it man, you're really doing it! :)",
      "created_at": "2005-10-05T21:08:05.000Z"
    },
    {
      "author": "erin",
      "body": "yay for the moxie.\r\n\r\npeople should place bets on the tickets sold. : P",
      "created_at": "2005-10-05T21:20:34.000Z"
    },
    {
      "author": "nicki",
      "body": "i would go see R&RSP if it was shown again, s'long as it wasnt a tuesday or thursday night....",
      "created_at": "2005-10-06T02:50:40.000Z"
    },
    {
      "author": "Stevie G",
      "body": "Wow! Awesome Dano...well, everything except the Cardinals winning. Closet Cub fan here *shhhhh*",
      "created_at": "2005-10-06T03:06:48.000Z"
    },
    {
      "author": "Hawk",
      "body": "R&RSP owned.  Thanks to Jim for making it and Dan & Nicole for bringing it!\r\n\r\n--Hawk\r\n\r\n(Props to Red Arrow for some sweet Ninja A$$ kicking!)",
      "created_at": "2005-10-06T03:43:05.000Z"
    },
    {
      "author": "Chris",
      "body": "R&RSP Rocks! I would quickly go to see it again! The Moxie rules!!! Thanks Dan & Nicole!\r\nBuck Fiesta is Da Bomb! Thanks Jim, you great visionary. I had a great time. Look forward to seeing more local films.",
      "created_at": "2005-10-06T16:45:59.000Z"
    },
    {
      "author": "nathaniel carroll",
      "body": "You guys should get \"The Squid and The Whale\" starring Jeff Daniels.\r\n\r\nwww.squidandthewhalemovie.com",
      "created_at": "2005-10-06T23:27:31.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i put up flyers at the msu art annex... then got bombarded by people asking me for one... so after putting two up.. i handed out 8 more... \r\ni was planning on putting one up at ellis hall.. but they were all gone before i could make it there... ",
      "created_at": "2005-10-07T00:40:24.000Z"
    },
    {
      "author": "nicole",
      "body": "Yay Brian! ",
      "created_at": "2005-10-07T01:55:29.000Z"
    },
    {
      "author": "White Rabbit",
      "body": "Yeah...  I really, really wanted to see this movie at the Moxie, but I'm only in Springfield on the weekends.  I wish you guys would show this one again.",
      "created_at": "2005-10-07T08:07:15.000Z"
    },
    {
      "author": "Sara",
      "body": "Sorry, this isn't a Moxie related comment, but we \"White Rabbit\" and no one who plays can ever tell me what it's all about. Beyond that, it's a good excuse to call friends and family at least once a month and fun too.Bummer this is a crazy \"back blog\" (is that a term?) and Mr White Rabbit won't even know I was here. :(\r\n\r\nThis is a Moxie comment. I finally got to the Moxie and in short, LOVED IT, LOVED IT, LOVED IT. ",
      "created_at": "2005-10-13T19:49:45.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
