{
  "id": 313,
  "title": "Out with the bad, in with the good",
  "body": "Our beer line-up is changing. I won't say which beer is getting the boot, but I will tell you why... in a slightly truncated (and censored) version of the entire story. In the beginning, The Moxie carried TEN beers from THREE breweries in Missouri. Four from St. Louis, three from Kansas City, and three from Springfield. Although our orders haven't been HUGE, all of the distributors, and their respective sales reps, have gone out of their way to make sure we were happy. They return our calls in a timely fashion, fill our orders on time, and even give us cool neon signs. All of them but one.<br/><br/>One beer distributor didn't bother returning our calls, even though I left four voicemails asking them to do so. Perhaps I was being too pushy... trying to \"make an order\" and all. In fact, our initial order for six cases of beer, made in mid-September, has yet to be completed. I understand that the beer is made to order - that's perfectly fine - but why won't the sales rep call to let me know? The lack of communication on the beer distributor's behalf is completely intolerable. If I'm going to sell your product, I expect (at the very, VERY least) for my phone calls to be returned... ESPECIALLY when I'm trying to place an order!<br/><br/>So, long story short, I called the brewery and explained to them that our theater would no longer be carrying their product - not because it wasn't selling well, and not because we didn't like them, but because their beer distributors treated us like shit. \"I'm completely open to doing business with you in the future, but as long as your beer is distributed through BLEEP BLEEP BLEEP, our theater won't be selling it.\" And that was that. I would've liked to have told this to a real person, but the manager of operations was out of town, so I left it on his voicemail.<br/><br/>I did, however, speak to a real person at the beer distributor's office - the sales manager, to be exact. I explained the situation, making sure to let him know that \"I'm not trying to be an asshole, but the level of service I received from your company is inexcusable.\" The sales manager was very polite about everything, which was much appreciated. We settled the account and that was that. Shortly thereafter, I called another distributor and made an order for our replacement beers: Shlafly's out of St. Louis.<br/><br/>I hate being a hard-ass about stuff, but I have to remember that I'm no longer just a peon customer. I have \"purchasing power!\" I'm glad all of our other vendors have bent over backwards to fill our orders, despite their size. Kudos to you, other vendors!<br/><br/>And now it's time to go clean the auditorium.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-10-08T05:40:28.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Aaron Scott",
      "body": "Just as long as it's beer and not ROOT BEER. ",
      "created_at": "2005-10-08T06:57:42.000Z"
    },
    {
      "author": "nicole",
      "body": "no worries, Aaron. We still have our Fitz's!",
      "created_at": "2005-10-08T07:21:39.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Hooray for Schlafly! Not that I even like beer... BUT I was just at the Tap Room last weekend.",
      "created_at": "2005-10-08T07:55:44.000Z"
    },
    {
      "author": "duanekeys",
      "body": "Yep, business is business.  Stick it to em if you're not getting service!",
      "created_at": "2005-10-08T09:14:39.000Z"
    },
    {
      "author": "brian of moore",
      "body": "damn the man!<br/>or... dans the man!<br/>but dont damn dan the man!<br/>err",
      "created_at": "2005-10-08T09:28:05.000Z"
    },
    {
      "author": "erin",
      "body": "ooh yes. im with aaron. as long as its not the rootbeer!<br/>considering.. im not 21. : )",
      "created_at": "2005-10-08T18:37:51.000Z"
    },
    {
      "author": "Hawk",
      "body": "Damn.  For all of your hassle, next beer is on me, Dan. :)<br/><br/>--Jeff ",
      "created_at": "2005-10-08T19:38:43.000Z"
    },
    {
      "author": "nicki",
      "body": "Hmm... Thursday and from then on out, I can finally sample your beers and wines. How exciting is that? I know you're excited!",
      "created_at": "2005-10-08T20:21:00.000Z"
    },
    {
      "author": "Adam",
      "body": "This comment really has shit to do with beer, I'm to little to drink it. I just wanted to say how impressed I was with the theatre and how well it seemed to be run. Im a student at MSU, and if you ever need someone to pass out fliers, etc. let me know! Thanks again for giving Springfield an art-house!",
      "created_at": "2005-10-09T01:17:05.000Z"
    },
    {
      "author": "Caleb",
      "body": "Me and You and Everyone We Know comes out on DVD tomorrow. For all you silly little people who missed it at the Moxie...check it out!",
      "created_at": "2005-10-10T23:39:47.000Z"
    },
    {
      "author": "erin",
      "body": "whatever happened to that jingle someone wrote for the moxie?",
      "created_at": "2005-10-11T06:47:53.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
