{
  "id": 314,
  "title": "Return to form",
  "body": "*NOTE* - This post was supposed to be published last night, but I didn't finish it in time, and I'm too lazy to go back through and change it to a Tuesday point of view. You've been warned.<br/><br/>Mondays are slow, which means it's time for me to drone on about what happened this weekend.<br/><br/><b>Celebrity encounters</b> - Over the weekend The Moxie played host to two shows for the third annual CINEmerge Film and Video Festival. On Friday, we played <a href=\"http://www.imdb.com/name/nm0673512/\" target=\"_blank\">Jack Perez</a>'s <a href=\"http://www.imdb.com/title/tt0157913/\" target=\"_blank\">La Cucaracha</a>, starring Eric Roberts, who, as you probably already know, is one of the only humans alive who can claim a mutual womb with America's favorite ex-sweetheart, Mrs. Julia Roberts.<br/><br/>I didn't get to watch the film, so I can't say whether it was good or not, but I did have plenty of time to chat with Jack Perez, who was a really cool guy, despite his being from Los Angeles (ha ha... just kidding Sanaa). Jack opted not to watch his film, but instead spent most of his time across the street at <a href=\"http://www.wellfedhead.com\" target=\"_blank\" class=\"broken\">Well Fed Head</a> books and surfing the net in our office. He was super cool... did I already say that? He and his wife just bought a house in L.A. for an ungodly amount of money. I literally could've built SIX Moxies for the cost of a two bedroom house in Los Angeles, which begs the question: why do people really <i>need</i> to live in Los Angeles to be successful in the film industry? Why not take the money you'd spend on a house ($700K), invest $500K on your movie, $100K on a house in a small town like Springfield, and use the other $100K to fly back and forth between L.A. and NYC to pitch your movie? It seems ridiculous that in this technologically advanced era, you can't stay in complete touch with people in the film industry from virtually anywhere in the world.<br/><br/>Jack, if you're reading this, I think you and your wife should sell your new house and move to Springfield. That goes for you too, Eric Roberts.<br/><br/>As for <a href=\"http://www.imdb.com/name/nm0001235/\" target=\"_blank\">William Forsythe</a>, who was featured in THE ROCK, DICK TRACY, RAISING ARIZONA, and DEUCE BIGALOW, I don't have many things to say. Yes, he came by the theater, and yes, he strolled up and down our art hall, and yes, he waved to me while I was stuffing my face with a roast beef and turkey sandwich from Jimmy John's, but other than that... nothing. Nicole asked him if he'd stick around to take a picture with us, and he said \"Sure. Absolutely. Anything for you guys.\" But soon after his movie ended, he was gone. I'm sure he had other places to go, so I'm not holding it against him, but I mean... come on! Why would anyone turn down a chance to have their picture taken with the world famous owners of The Moxie? He's a fool! A damned fool!<br/><br/><b>Messy, messy, cocoa puffs</b> - There were two massively messy shows over the weekend. The first was a near sold out showing of BROKEN FLOWERS on Friday evening, so I wasn't all that surprised to find the auditorium strewn with cabbage leaves, baby diapers, and left over bits of kindling from the bonfire that was blazing near the stage. It took me nearly 20 minutes to clean up after that show... but that wasn't the worse. Oh no. Yesterday, during a 4:30 show with only 6 people, someone spilled a Diet Coke in the very last row, and I'll be damned if that sticky serum of satan didn't run all the way down to the front of the freaking stage! I was on my hands and knees scrubbing the floor with Mean Green for nearly 15 minutes. It was almost enough to make me quit. I seriously considered giving myself my two week's notice. Luckily, I talked myself out of it AND gave myself a nice raise to salve my wounds.<br/><br/><b>Nude scenes</b> - While building up SAVING FACE last night (building up is the act of splicing together all the small reels onto one BIG reel), I managed to stop the film on the exact scene where the two main characters get naked. That may not sound too impressive, but you have to realize that the first reel holds roughly 10,000 feet of film, and the nude scene only comprises about 100 of those feet. It's like finding a needle in a haystack made up of exactly 1,000 straws of hay! Many of you are probably thinking, \"I can't believe Dan is looking for nude scenes. He totally dropped down a few notches in my book. Doesn't he realize that he's running a business now, and not some seedy house of sin?\" Well, to you I say: I'm a guy first, projectionist second. And I mean, COME ON, who <i>doesn't</i> like nude scenes? Guy or girl? Anyone? Anyone? That's what I thought.<br/><br/>And since we're on the subject of SAVING FACE, I'd like to alert everyone who wants to see it that 1) it's going to be a big show, so you'd be smart to swing by early and secure your tickets, and 2) there's absolutely no nudity in it (snicker snicker).<br/><br/>Other than that, it's been a fairly slow Monday. I'm glad I'm writing this on a Monday, because writing posts on Tuesday is totally overrated. I even wrote a haiku about it:<br/><br/><center>This post was written<br/>On a Monday evening, not<br/>On Tuesday, thank you.</center>",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-10-12T02:11:47.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb C.",
      "body": "Was William Forsythe in disguise so he wouldn't get bombarded by the rabid Springfield paparazzi? <br/><br/>According to Time Magazine, cup holders would stop 95% of your spilled drinks.<br/><br/>It's too bad you're not getting Saving Face longer. I'd love to hear you quote some comments by the \"locals\" about your theater ruining American values by showing a film with lesbians in it.<br/><br/>I'll be there Wednesday night. And FYI: the MSU Film Society is planning a \"Night at the Moxie\" for Oct. 19 to see Grizzly Man at the 9:15 show. We're hoping to get 10 people to come. We're doing our best to get the little club going again.",
      "created_at": "2005-10-12T02:51:56.000Z"
    },
    {
      "author": "brian of moore",
      "body": "people have to understand.. we arent talking about some average.. run of the mill nude scene... these are asian lesbians!....  it simply doesnt get better than that<br/><br/>so good job dan.. im proud of you<br/>i walked by around 2-ish today.. the door was locked.. i figured as much.. i was hoping to ensure my seat tonight<br/>but im thinking ill just end up getting there a bit early.. and in the mean time.. crossing my fingers",
      "created_at": "2005-10-12T02:53:42.000Z"
    },
    {
      "author": "erin",
      "body": "ahhh.<br/>best blog post since last... friday!<br/><br/>: )",
      "created_at": "2005-10-12T07:20:01.000Z"
    },
    {
      "author": "Nate",
      "body": "Cups runneth over with no way to holdeth.",
      "created_at": "2005-10-12T17:14:56.000Z"
    },
    {
      "author": "elliott",
      "body": "i like nud-i-ty<br/>it is fun to be in the<br/>sun and run nude<br/><br/>ha... i can write haiku poems too... i think...",
      "created_at": "2005-10-12T23:10:49.000Z"
    },
    {
      "author": "Caleb C.",
      "body": "Congrats on the huge turnout at both screenings of Saving Face. It was an excellent and hilarious film and those of you who didn't come really missed out!",
      "created_at": "2005-10-13T09:49:40.000Z"
    },
    {
      "author": "Sara",
      "body": "Hey Mr. White Rabbit, where ever you are, why do we \"White Rabbit\"? I know your out there. (a current response to an Oct. 4th post)<br/><br/>Dan and Nicole, do you think you'll rerun R&RSP? Missed it and regretful.",
      "created_at": "2005-10-13T19:54:55.000Z"
    },
    {
      "author": "bjork24",
      "body": "Perhaps.",
      "created_at": "2005-10-13T20:16:06.000Z"
    },
    {
      "author": "Shaun",
      "body": "I have, what could be considered a strange question, but for whatever reason this place looks like an appropriate place to ask.  <br/>I'm doing a budgeting project in school involving a situation about how to make money as the producer of a play (I was given the expenses, I have to come up with profit ideas).  I'm wondering if you have (or could estimate) certain statitics like: What percentage of people who visit your theater buy consessions?  How much averagely does 1 person spend at the consession, when they get some?  And how much does it cost to maintain the consessions for however long they last? <br/><br/>I know this was probably weird, but your help would be appreciated :) Oh and I'm not asking you to like go out of your way to try and figure out exact figures, just like a quick estimate would suffice.",
      "created_at": "2005-10-16T02:14:20.000Z"
    },
    {
      "author": "Sue",
      "body": "Not related to this topic per se - but I finally made my first visit on 10/12...had a terrific time!  (As did the rest of our group.)  And, for an obligatory reference to this topic:  I was very careful not to spill my wine.",
      "created_at": "2005-10-16T05:52:39.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
