{
  "id": 315,
  "title": "Strange things are amiss at the Circle K",
  "body": "Last night, right after we closed (about 1:45 am), Nicole heard a bunch of sirens, so she poked her head out the front door to see what was hopping. There, only half a block away from The Moxie, was not one, not two, not five, not ten, not fifteen, but TWENTY OR MORE cop cars with their cherries and blueberries in full effect. I jogged down the street to see what was going on, but no one seemed to have a clue.<br/><br/>\"I don't know what happened?\"<br/>\"I think someone got shot!\"<br/>\"I ate too much.\"<br/>\"The whistles go WHOO!\"<br/><br/>Since I couldn't find an answer, I decided to start taking pictures.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/101505/pic1.jpg\" width=\"425\" /><br/><br/>This is the view from The Moxie. At first, I thought the president of Burundi had just swung by for a surprise visit. The cop cars literally jammed the streets from Campbell all the way up past South Avenue. They were EVERYWHERE!<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/101505/pic2.jpg\" width=\"425\" /><br/><br/>This is the view back towards Campbell. More cop cars... all with their lights on. Doesn't that run their batteries down?<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/101505/pic3.jpg\" width=\"425\" /><br/><br/>This picture is kind of blurry, but you can make out at least eight cops... PLUS a cop dog.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/101505/pic4.jpg\" width=\"425\" /><br/><br/>Here's a shot of some of the perps being handcuffed and taken away in the patty wagon. The original picture was really dark, so I had to lighten it up in PhotoShop, thus the graininess. Check out the dude in the Caddy...<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/101505/pic5.jpg\" width=\"425\" /><br/><br/>Here's a more detailed shot. I think my camera took him by surprise.<br/><br/>We never figured out what happened, but I heard rumors that it was ANOTHER stabbing at Traffic. I can't confirm this, but the majority of the action was taking place right outside Traffic's doors. I guess we'll have to wait until the News-Leader does a write-up. Either way, it was pretty AWESOME... as in, awe inspiring. I've honestly never seen so many cop cars in one place at one time - unless you count the parking lot outside of the downtown police station.<br/><br/><b>Strange things going on with the blog</b><br/><br/>I'm sorry I haven't written more posts lately. Everytime I sit down to write one, something more pressing happens. Whoever said owning your own business wasn't time-consuming was wrong, wrong, wrong. Dead wrong. Totally wrong. Last time I sat down to write a post, the projector exploded. Then, another time, the popper fell over and Nicole on trapped her for 20 minutes. It was an oily mess. So all this lack of posting got me thinking: is it time to end The Moxie Blog? It's been going strong for the last year and a half, but since we opened up in September, I think the blog has lost a lot of its umph... you know, its steam, its momentum, its impetus, its zip, and most of all, its moxie. So, what should I do?<br/><br/>I brought it up with Nicole and Justin and they urged me (practically begged me) to keep it going. \"Dan, you can't stop The Moxie Blog. It's still so relevant. It's the light in so many people's lives. It's our <i>everything</i>!\" And then it hit me like a blood-thirsty grizzly bear attacking an amateur documentarian (GRIZZLY MAN opens on Wednesday)... I'm a control freak! If I want to learn to overcome my ONE true weakness, I have to start sharing some of my responsibilities with others. After all, I can't run the Moxie alone, so why should I write the blog alone?<br/><br/>Over the next few days, you might be seeing posts from people other than me. It might be Nicole, it might be Justin, it might be the homeless guy who chases me down the alley at night. Is the Moxie Blog jumping the shark? Who knows. Either way, I owe it to you, my loyal readers, to start posting more content. Woot woot!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-10-16T06:45:19.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Sherri",
      "body": "Wow, I feel safe knowing it took so many cops away from the rest of the city to handle the tiff at Traffic. And now the city is trying to shut Traffic down.<br/><br/>Can you imagine, Dear Moxie, how it would feel if, after all the work you've done and all the money you've spent, someone had a scuffle OUTSIDE of your business and then the city tried to shut you down?<br/><br/>It's ridiculous.",
      "created_at": "2005-11-01T09:50:55.000Z"
    },
    {
      "author": "Sukotto",
      "body": "I hope you'll continue posting.<br/><br/>If you invite others to post, please PLEASE put a byline so we know who's writing what.  <br/>",
      "created_at": "2005-10-17T19:16:39.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "End the blog, and the bunny gets it.<br/><br/>Don't stop this blog, an update a week is better than nothing at all. You don't have an obligation, but you do have an audience. Don't forget that.",
      "created_at": "2005-10-19T19:34:14.000Z"
    },
    {
      "author": "nicki",
      "body": "whew! had me scared for a second!<br/><br/>don't quit the blog!<br/><br/>and on another topic, i can't wait to come have a beer at the moxie! :D",
      "created_at": "2005-10-16T07:23:53.000Z"
    },
    {
      "author": "Mr. Wally",
      "body": "Please keep posting!<br/>I make a point of checking every day for more fun from Dan and Nicole.<br/>By the way, you were right about Traffic.  Just saw it on the news.  I'm all for a bustling downtown nightlife, but perhaps Natural Selection could kick in and we could thin the nightclub herd by one.<br/>On another note, make sure you round up the Neil Young concert film that's coming soon.  I'd pay to see that!",
      "created_at": "2005-10-16T07:44:09.000Z"
    },
    {
      "author": "Liz",
      "body": "The Moxie blog never says die!<br/>",
      "created_at": "2005-10-16T08:39:27.000Z"
    },
    {
      "author": "Caleb",
      "body": "If you blog it, they will come.",
      "created_at": "2005-10-16T09:28:30.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "That's a lot of police for just one stabbing. If two stabbings happened at the same time I think they would run out of cops.<br/><br/>As for jumping the shark, the Moxie blog totally jumped the day the identity of Midwestburg was revealed. Springfield, Missouri? You gotta be crazy. I stopped reading it that day. I assume nothing much has happened since.",
      "created_at": "2005-10-16T09:37:11.000Z"
    },
    {
      "author": "Allison",
      "body": "If you were to end the blog, I would feel like you were breaking up with us.  I would be sad.",
      "created_at": "2005-10-16T16:29:34.000Z"
    },
    {
      "author": "--Jeff",
      "body": "One word:  Ghostwriter.  If you need someone to simultaneously continue your blog and ruin the good name you've created for yourself as a business owner and excellent blog writer, I'll be happy to fill in. Just let me know. :) <br/>",
      "created_at": "2005-10-16T18:12:25.000Z"
    },
    {
      "author": "nicki",
      "body": "i used to watch a show called ghostwriter. on nickelodeon i believe? spooky. I'd never have thought about it ever again, had jeff not just said that.<br/><br/>weird...",
      "created_at": "2005-10-16T20:45:34.000Z"
    },
    {
      "author": "nicole",
      "body": "Oh my gosh - I LOVED Ghostwriter. With their magic pens? I think it was a PBS show.",
      "created_at": "2005-10-16T22:30:36.000Z"
    },
    {
      "author": "Nathan Springer",
      "body": "RIOT.. i heard the cops used peper spray. i wish i could have been down there i love nothing more than a good ole mob.",
      "created_at": "2005-10-16T22:33:22.000Z"
    },
    {
      "author": "nicki",
      "body": "nicole: yeah, it was pbs. i googled it :)",
      "created_at": "2005-10-16T23:31:10.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Yeah, it's been quite a while since we've had a good old fashioned riot in Springfield: Late 80's (early 90's?) on Elm Street on the SMS campus. I can't even remember why it started--well, booze and low brain cell counts aside--but it was a sight to behold...<br/>",
      "created_at": "2005-10-16T23:43:00.000Z"
    },
    {
      "author": "Dave",
      "body": "you should write a random post creator that takes sentences from your previous posts and concatenates them into new and bizarre posts. i bet you could keep people reading for a few months before they realized it was all nonsense.",
      "created_at": "2005-10-17T00:16:02.000Z"
    },
    {
      "author": "Rachel",
      "body": "I can still think of the end of the theme song \"Ghostwriter..WORD.\" That was a funny show to watch on PBS because I was way too old for it and I didn't want anyone knowing about it. I'm glad there is a forum for these feelings. Sometimes I wish I had magnetic letters on my fridge so Ghostwriter might talk to me too. What, too far?",
      "created_at": "2005-10-17T00:25:40.000Z"
    },
    {
      "author": "Stevie G",
      "body": "If you end the blog, I'll shoot this dog...",
      "created_at": "2005-10-17T01:13:44.000Z"
    },
    {
      "author": "Jennifer Neil",
      "body": "This is going to be sooo contradictory, but I think maybe you should end this blog.  You ARE busy, and you have a full site for anyone interested in checking out The Moxie and what it's offering its patrons.  If you feel that you can't offer the same kind of witty posts you think your readers have come to expect with the same frequency that you had in the past, then maybe it is the right thing to do.<br/><br/>Your readers (myself included) would miss your ramblings and updates, and Stevie G. might shoot that dog, but ultimately, we would get over it (well, Stevie G. might not).<br/><br/>Another option is to commit to a weekly \"column\" of the trials and tribulations you've experienced, and maybe get your employees and Nicole to pitch in with their thoughts, too.<br/><br/>Whatever you decide, I want you to know that reading your words and viewing the phlogs have really made an impression on me--dreams do come true, after all!<br/><br/>Wishing you, Nicole and The Moxie only the best,<br/>Jennifer Neil",
      "created_at": "2005-10-17T03:04:29.000Z"
    },
    {
      "author": "Andy",
      "body": "Those pictures were awesome.  They look like they came from a zombie movie or something...<br/><br/>You guys should spin this your way, you know, like an ad that says:<br/><br/>\"HEY!<br/>Wanna hang out downtown and NOT get stabbed?!<br/>Check out a flick at The Moxie!\"",
      "created_at": "2005-10-17T05:53:20.000Z"
    },
    {
      "author": "nicole",
      "body": "Oh my gosh, I thought I was in a zombie movie because Dan and Justin flickered the lights and then joked about people flocking toward us because they saw we were open. All I could think of was zombies.<br/><br/>Luckily, I have that vault to hide in. Unless they can figure out the lock combination...",
      "created_at": "2005-10-17T07:19:14.000Z"
    },
    {
      "author": "Caleb",
      "body": "I disagree with Jennifer. Your most dedicated fan base is thanks to your personal touch with customers by having a blog this whole time. While we all definitely would understand if you had to limit yourself to weekly or even bi-weekly posts, we would still appreciate it! And if you're wondering what to write about, I'm always curious about how people are reacting to the films and if they are enjoying them. Of course that could drive away customers if they read on here that everyone hated the movie.<br/><br/>Anyway, I think if you added Nicole and employees as writers it would be great. I remember Nicole writing that one post one time and she did a splendid job. Whatever you do...don't leave us! :-)",
      "created_at": "2005-10-17T07:22:54.000Z"
    },
    {
      "author": "brian of moore",
      "body": "ghostwriter.. nice.. i was too old for that too.. but it didnt stop me from watching it on occasion<br/><br/>... the uprising of internet zombies would surely come...... if you were to quit the blogging.. i wouldnt even mind if you only posted once a week.. or once every two weeks... but to completely quit?  thats madness...<br/><br/>seeing that many cop cars in one place.. makes me wonder how much of the rest of springfield wasnt under any authority at all<br/>",
      "created_at": "2005-10-17T07:30:26.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
