{
  "id": 316,
  "title": "Two week runs",
  "body": "Yeah, yeah, yeah. I say I don't have enough time to devote to the blog, and yet here I am writing TWO posts in TWO days. Why? Because it's a REALLY slow weekend, that's why. Friday and Saturday set all-time lows for weekend attendance, but since this is only our fourth weekend being open, that doesn't say much. Either way, we learned a valuable lesson: if you own a single screen theater, don't play a movie exclusively for two weeks. Yes, BROKEN FLOWERS has been strong, but not strong enough to warrant the time we allotted for it. Thank goodness for SAVING FACE, which catapulted last Tuesday and Wednesday's stats into weekend-like numbers. In case you didn't know, I'm a whore for metrics. I love keeping track of our stats and writing formulas to plot and graph every little trend. Anyways, I'm getting off track here.\r\n\r\nIt's been a slow weekend. Piss poor slow. Paul, our booking agent, urged us to hold BROKEN FLOWERS for two weeks so we could \"ride the wave\" of a popular movie. In this business, especially in the indie sector, you have to jump on every mini-mega-hit you can (i.e. MY BIG FAT GREEK WEDDING, NAPOLEON DYNAMITE, BILL & TED'S EXCELLENT ADVENTURE, etc.). Unfortunately, BROKEN FLOWERS hasn't proven quite that popular. It's been big, but not that big. I had a bad feeling this would happen, so I pushed for a more diverse October schedule... unfortunately, we had to take what we could (we were on a tight deadline), so our film selection suffered as a result. November will be much better. We have a couple movies in store that may prove to be bigger than BROKEN FLOWERS, but they'll both be split with more offbeat movies.\r\n\r\nLike I said in the past, October is our experimentation month.\r\n\r\nConclusion #1: No more nine o'clock movies on Sundays. Matinees are big on Sunday, but the later shows are sparsely attended. We had 6 for our 7:00 show and 10 for our 9:30... compared to 29 for our 2:00 and 15 for our 4:30.\r\n\r\nConclusion #2: I'm going to bring in a laser pointer and burn out the eyes of anyone who has the audacity to speak while I'm giving the personal introduction.\r\n\r\nOn another note, we now have advertising in our restrooms. A local marketing group is leasing the space from us to run ads for local businesses. Yay for advertising revenue! Speaking of which, our advertising rate sheets are finished. If you'd like to see your ad on the Moxie's <i>kinda</i> BIG screen, let us know. End of plug. Anyways, back to the new bathroom ads... in the old men's restroom (which is now the blue unisex restroom), there's an ad for a certain hair cutting joint here in Springfield. I won't mention the name of the business, because I'm not \"that guy,\" but I will reproduce their ad for you VERBATIM:\r\n\r\n<b>Top 10 reasons <u>not</u> to cut your own hair:</b>\r\n\r\n<ol><li>Everyone else knows it. Look in a mirror.</li>\r\n<li>Special occasions mean getting a left-handed date.</li>\r\n<li>Eeeeeewww! That's not hair gel.</li>\r\n<li>Your girlfriend will leave you.</li>\r\n<li>631 % chance your girlfriend will cheat on you.</li>\r\n<li>Celabci Sucks.</li>\r\n<li>Blue Balls do too.</li>\r\n<li>No car, no job, live with Mom. Why make it worse?</li>\r\n<li>Yes, those good-looking girls were laughing at you.</li>\r\n<li>Fat chicks love do-it-yourselfers.</li></ol>\r\nNow, I'm certainly not one to pick on a local business (I love them with all my heart), but... come on! Is that not the most mean-spirited ad you've ever read in your whole entire life? Particularly number ten. Also, what does reason number two mean? I'm assuming it has something to do with masturbating, but I can't seem to make the connection. Celabci? I'm sorry [unnamed hair cutting place], but I don't think that's the kind of image you want to be sending to your potential clientele. For a successful ad, all you really need is a nude woman and a pair of scissors. The placement of the scissors would depend on the business, of course. I'm busy making a Moxie ad with that very motif. The copy reads: \"Come see a movie at The Moxie. Why? Because fat chicks sweat a lot and all the Smurfs are latent homosexuals.\"\r\n\r\nI'm going to get sued for this post, aren't I?\r\n\r\nPS - The title of this post makes it sound like it's going to be about me eating Taco Bell for two weeks straight.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-10-17T07:26:44.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "bjork24",
      "body": "And yes, I cut my own hair.",
      "created_at": "2005-10-17T07:41:18.000Z"
    },
    {
      "author": "mish",
      "body": "does that mean nicole was once fat?",
      "created_at": "2005-10-17T07:52:21.000Z"
    },
    {
      "author": "bjork24",
      "body": "No. Nicole has never been fat... nor does she like do-it-yourselfers... which is why I had to replace her with a fembot that I constructed out of a dryer vent and three rolls of electric tape.",
      "created_at": "2005-10-17T07:59:27.000Z"
    },
    {
      "author": "brian of moore",
      "body": "id have to say thats an odd ad... #s 8 and 9 are kinda funny.. the rest are just weird... ... i mean i do like that they are at least trying not to have the average run of the mill boring... dancing monkey... used car salesman type of ad...but that still doesnt work for me very well\r\neh",
      "created_at": "2005-10-17T08:08:15.000Z"
    },
    {
      "author": "--Jeff",
      "body": "I offered to fill in for you as a ghostwriter for your blog. I formally rescind that proposal. I don't think I could fill your shoes.    \r\n\r\nBTW, you owe me a new keyboard and monitor for the coffee I spit up from today's blog. :)\r\n\r\nClassic.\r\n\r\n\r\n\r\n\r\n",
      "created_at": "2005-10-17T17:46:39.000Z"
    },
    {
      "author": "jb",
      "body": "I think the \"left hand\" comment has to do with the fact that when cutting one's own hair it's very difficult to get both sides evenly with one's single cutting hand, which for most people would be the right.",
      "created_at": "2005-10-17T18:17:53.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Yeah, the two week run is killing me! AND I missed Saving Face. More movies! More movies!",
      "created_at": "2005-10-17T18:55:56.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Speaking of more movies:  give it up, Dan.  What movies are starting in November???  The suspense is CUTTING MY HAIR. ",
      "created_at": "2005-10-17T19:25:24.000Z"
    },
    {
      "author": "Nathaniel Carroll",
      "body": "Oh no, I cut my hair too.  Is that really how you spell Celebacy?  \"Celabci\"?  I think I know what sleezy hair salon in town would want to post an add like this.\r\n\r\n",
      "created_at": "2005-10-17T19:29:59.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "Just reading that previous post reminded me of Toledo this weekend. We had a riot and 8pm curfew. Darn those nazi white supremicist groups...",
      "created_at": "2005-10-17T20:15:48.000Z"
    },
    {
      "author": "brian of moore",
      "body": "hah!.. is that really supposed to say celibacy? i wondered what the hell that was....   .... was that a dan typo.. or is that actually what they have on there?\r\n\r\neither way.. after my first read through.. i assumed that it was that \"too hotties\" place... and im still assuming that...",
      "created_at": "2005-10-17T20:53:37.000Z"
    },
    {
      "author": "nicki",
      "body": "yes. must be \"too hotties..\"\r\n\r\nNow I feel the need to come by the moxie just to see what ad it is... and.. buy.. popcorn.. no.. subliminal messaging.. working... aaaAAAahhh!",
      "created_at": "2005-10-17T21:40:15.000Z"
    },
    {
      "author": "matt",
      "body": "that ad copy is terrible.  at least spell your offensive comments correctly!  i liked broken flowers alright, but it didn't stick around here very long and didn't seem to light too many people on fire.",
      "created_at": "2005-10-18T01:24:30.000Z"
    },
    {
      "author": "Caleb",
      "body": "THIS is the reason you could never stop posting on the blog! Because of hilarious posts like this. I too cut my own hair and I haven't all 10 of those problems. Now one or two yeah...\r\n\r\nOk ok, Broken Flowers was good but not good enough to be a two-weeker (I found it to be a tad over-rated). But how can you predict that in Springfield? Or anywhere? I think after a few months you will know much better which kinds of movies will draw in bigger audiences. I'm anxious to see how The Aristocrats does. Anyway, I'm sure having two-week runs will be a rarity, right? I mean after a while that could put someone in a hospital...",
      "created_at": "2005-10-18T01:31:07.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Nathaniel cuts my hair.\r\n\r\nAnd for the list, blue balls still means you're getting some, right?",
      "created_at": "2005-10-18T02:23:14.000Z"
    },
    {
      "author": "Nate",
      "body": "Oh no, no, no.  Conventional wisdom dictates that blue balls means frustrated in the gettin' some department.  Or that you are messing around with a member of Blue Man Group.  \r\n\r\nI would say something about their percussive pipe pounding, but I will not.  Only because I don't do that whole alliteration thang.",
      "created_at": "2005-10-18T17:42:27.000Z"
    },
    {
      "author": "Tammy Kirks",
      "body": "Now I'm curious to see this ad. Since I work in the advertising field, I've seen my share of both good and bad advertising. I must say this one ranks in the bad category. I like the idea, but instead of being funny, it's just stupid and sad.\r\n\r\nAnd I was once a fat chick, so now I'm offended!",
      "created_at": "2005-10-18T20:34:34.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Hmm, I stand corrected. See, I missed the after-school sex ed class. I don't even know what/where third base is!",
      "created_at": "2005-10-18T21:07:08.000Z"
    },
    {
      "author": "Nate",
      "body": "Third base is what Eckstein, Walker, and Pujols rounded on their way to home last night.  Go Cards!",
      "created_at": "2005-10-18T21:10:22.000Z"
    },
    {
      "author": "bjork24",
      "body": "Nate: I think you mean Eckstein, Edmonds, and Pujols.",
      "created_at": "2005-10-18T21:42:56.000Z"
    },
    {
      "author": "Nate",
      "body": "Ahem.  That may be true...\r\n\r\n...BUT Edmonds WAS a walker!  That's all I meant to say.  Really.",
      "created_at": "2005-10-18T23:15:27.000Z"
    },
    {
      "author": "Caleb",
      "body": "I saw the News-Leader used your photography expertise in the paper today. Nice job.",
      "created_at": "2005-10-18T23:21:55.000Z"
    },
    {
      "author": "jh",
      "body": "I saw Broken Flowers the other night -- my first Moxie experience. I enjoyed it. Any chance you'll be showing the movie in the preview with Elijah Wood? \"Everything is Illuminated\" or something close was the title if I recall...",
      "created_at": "2005-10-19T02:45:41.000Z"
    },
    {
      "author": "erin",
      "body": "when will you let us in on novembers movies?\r\n\r\neverything is illuminated will be on it. yes? yes! YES! please?!",
      "created_at": "2005-10-19T03:44:57.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
