{
  "id": 317,
  "title": "Groin-Grabbingly Transcendent",
  "body": "Nicole and I are starving, but we can't decide what to eat for dinner. I'm in the mood for a roast-beefy-warmish-to-hotish-type dish (with or without bread), and Nicole just wants anything that's edible. Hell, she'll even go for SEMI-edible at this point. Ok, we just ordered Jimmy John's... not because I'm a big fan of Jimmy John's, but it's close (although we're still having them deliver) and they have roast beef sandwiches, which I can heat up in our quarter-power microwave. I've yet to freak from their fastness... although I'm about to frunk* from my fasting.<br/><br/><b>FR•UNK</b> <i>v.</i> (phrunk) - To die from exceedingly severe hunger pains or a lack of proper roast-beefy-warmish-to-hotish-type dishes.<br/><br/>My growing hunger has made me delirious, so I'm now going to write something that I always promised myself I wouldn't... a list of restaurants that would strive and profit in Springfield, MO (especially downtown) due in large part to my sole patronage. If I had all the money in the world, and knew ANYTHING about running a restaurant, I would start ALL of these eateries. However, since I don't have the funds (yet), I'm going to share my ideas with the world in hopes that someone with enough loose change will take one of these ideas and make it into a reality.<br/><br/><b>Cheap Chinese food downtown (with delivery)</b> - I'm amazed that I even have to mention this one, given Springfield's borderline-perverted love of Chinese food. Being a native Springfieldian, I salivate at the thought of having $3.99 Cashew Chicken delivered to The Moxie. Some may say, \"but what about The Ricksha or Korea House?\" And to you I say, \"I want delivery!\" Catering to laziness is the cornerstone of success.<br/><br/><b>Two words: Stir Crazy</b> - (1) Go to St. Louis, (2) go to Stir Crazy, (3) fall in love. For a town as much in love with Chinese food as Springfield, there is practically NO VALID REASON why we shouldn't have a Stir Crazy. In fact, one would go really well where Traffic is (used to be). I can honestly say that Stir Crazy is my favorite restaurant in the entire world. Better than the French Laundry, better than Emeril's, better than Wolfgang Puck's, better than PIZZA HUT!<br/><br/><b>Hello? Macaroni Grill calling!</b> - Why should Zio's own the Italian restaurant market in South Springfield. They literally have zero competition for good, mid-range, family-friendly Italian cuisine. And EVERYONE goes there! Have you ever been to Zio's when it wasn't packed? A Macaroni Grill would level the playing field, and add variety to the Italian palette. If you haven't eaten there before, drive up to Kansas City, St. Louis, or Columbia (yes, even they have one) and experience Focaccia bread that will make you spilch in your pants.<br/><br/><b>Lion's Choice, for the love of...!</b> - Ok, <strike>Popeye's Chicken</strike> Bojangles just went out of business on Battlefield (they were open for what? One month? Two months tops?), which leaves a perfect location for a Lion's Choice - home of the world's greatest roast beef sandwiches. Forget all the other chain restaurants that need to come to Springfield - White Castle, What'a'Burger, El Taco - Lion's Choice MUST open a location here in Springfield... TODAY! I don't think I can go much longer without one of their roast-beefy-warmish-to-hotish-type combo meals. Mmmmm... warmish.<br/><br/><b>California Pizza Kitchen</b> - The only alternative for non-family oriented gourmet pizza is South Avenue Pizza Company, which leaves the South side WIDE OPEN. I would kiss three small-to-medium sized billy goats for one of their Thai chicken pizzas.<br/><br/><b>Canyon Cafe</b> - I only mentioned this one because Nicole likes their chips, and Springfield likes mid-range restaurants disguised behind high-end facades.<br/><br/>That's about it. Over the course of writing this post I heated up my Jimmy John's roast beef sandwich and gobbled it down with the ferocity of an Alaskan Grizzly Bear (GRIZZLY MAN opens tomorrow). I'm now a fan of Jimmy John's.<br/><br/>RICH PEOPLE - read these suggestions, go forth, and BUILD! I'm available for consultation seven days a week, so feel free to swing by the theater if you have any questions about setting up your new restaurant(s).",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-10-19T06:00:00.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "elliott",
      "body": "<a href=\"http://www.drury.edu/sub/BandPoll.cfm \">bring us rufus</a><br/><br/>can i use ",
      "created_at": "2005-11-10T01:13:08.000Z"
    },
    {
      "author": "nicole",
      "body": "I think Rock School just came out on DVD...had we only been open a few months earlier.",
      "created_at": "2005-10-20T19:04:46.000Z"
    },
    {
      "author": "mish",
      "body": "whats all this talk of arris pizza?! its amazing i admit, but to call it the best?! better than PIZZA house?! pizza house is definitly the best.<br/><br/><br/>and i have to agree with the white castle comment. their burgers are the nastiest thing ever, but they sure do make good chicken ring sandwhiches. mmmm! probably my favorite food ever.",
      "created_at": "2005-10-21T03:08:08.000Z"
    },
    {
      "author": "brian of moore",
      "body": "so... grizzly man...... that guy was KUH-Raazzzzy ... and all of his family and friends.... KUH-Raazzzzzy<br/><br/>good though... i recommend it.. i seriously dont even know what to think about it all..  nor do i feel that i will given some time for it to sink in...",
      "created_at": "2005-10-21T08:39:51.000Z"
    },
    {
      "author": "Stevie G",
      "body": "I believe that was Bojangle's Chicken, not Popeye's. No wonder they went out of business; everything on their menu (and I mean everything) was excessively salty.<br/><br/>I agree. 'Midwestburg' could use more diversification in it's assortment of dining establishments. Hell, I'd be tickeld with a White Castle. I'm easy.",
      "created_at": "2005-10-19T06:09:41.000Z"
    },
    {
      "author": "bjork24",
      "body": "Good call, Steve. I just fixed it.",
      "created_at": "2005-10-19T06:47:42.000Z"
    },
    {
      "author": "nicole",
      "body": "Mmmm, CPK and Canyon Cafe would get my business EVERY DAY. <br/><br/>But if we're on the topic of rich people wanting to start franchises: TRADER JOES.",
      "created_at": "2005-10-19T06:53:11.000Z"
    },
    {
      "author": "nicole",
      "body": "But I have to say, there is no comparison like South Ave Pizza. They are up there with the best pizza (and cups) ever.<br/><br/>Ok. I'm done.",
      "created_at": "2005-10-19T06:54:02.000Z"
    },
    {
      "author": "Homer J. Simpson",
      "body": "MMMmmmmm.  Pppiiizzzaaa....  and BBBEEEEEERRR! ",
      "created_at": "2005-10-19T07:07:42.000Z"
    },
    {
      "author": "Caleb",
      "body": "I'm definitely with you on a Chinese delivery place. I was in Dallas one time in my very own deluxe suite on the eleventh floor of the Mark Adam's Hotel and I ordered Chinese delivery. Of course they had no idea what cashew chicken was and explaining it to them turned out to not be that great of an idea, but it was still very awesome.<br/><br/>As far as Stir Crazy, I hear good things from many citizens, but I have yet to eat there. And I prefer cheap-ole Fazoli's over Zio's any day.",
      "created_at": "2005-10-19T07:25:42.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i agree with lions choice<br/>and i was going to comment white castle.. but apparently its been done already.. personally im not much for white castle.. but ive heard many times of many different people taking a roadtrip up all the way to eureka just to get some whitecastle<br/><br/>also.. jack in the box.. people seem to love... <br/>personally i love italian food<br/>and my dad lives near the hill in st. louis... so my vote would be for more italian style restaurants... the type that actually make their pasta...<br/>if you ever happen to be in st. louis near grand st..  i suggest <a href=\"http://www.dineatmangia.com/\">mangio italiano</a><br/>not because i want to make out with all the waitresses and the bartender... but because their pasta is made fresh daily and friggin delicious and the decor is very cool.. imo",
      "created_at": "2005-10-19T07:27:45.000Z"
    },
    {
      "author": "Jessi D",
      "body": "definitely jack in the box- it is only thing i can think of to add to that perfect list of what springfield is missing.",
      "created_at": "2005-10-19T07:35:48.000Z"
    },
    {
      "author": "what about...",
      "body": "Arris' Pizza? It's on the south side and I think it's just as good as south ave.  ",
      "created_at": "2005-10-19T08:05:29.000Z"
    },
    {
      "author": "Maddy",
      "body": "I lived in Springfield for two years, and I still cannot get over the lack of Chinese delivery.  What is Chinese food without delivery?  That is like Pizza without delivery, Adam without Eve, Dan without Dr. Pepper.  Seriously, I am really really bothered at the lack of Chinese delivery in Springfield.",
      "created_at": "2005-10-19T08:07:29.000Z"
    },
    {
      "author": "erin",
      "body": "..... cashew chicken sucks!",
      "created_at": "2005-10-19T08:47:07.000Z"
    },
    {
      "author": "Caleb",
      "body": "Not NEARLY as bad as sweet n' sour chicken!",
      "created_at": "2005-10-19T09:11:58.000Z"
    },
    {
      "author": "Jessica",
      "body": "Even the little bitty town of Republic has delivery cashew kitty.  And Caleb is correct when he says Cashew Chicken doesn't exist in Texas and it sucks.  ",
      "created_at": "2005-10-19T17:39:56.000Z"
    },
    {
      "author": "Nate",
      "body": "\"mid-range restaurants disguised behind high-end facades.\"<br/><br/>This is so, so very true.<br/><br/>You and your cutting observations, Dan!",
      "created_at": "2005-10-19T17:48:55.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "I'm betting that if the College Station development ever actually happens, you'll get your wish for one or more of these chains. But don't give into the hype!! If I've learned anything from the Moxie it's that LOCAL IS BETTER! Downtown is overflowing with good local joints: Maria's, Nonna's, Gailey's, Merle's, Mille's, St. Michael's, Bruno's--hmm, I'm noticing a naming trend--South Avenue Pizza, Rasta Grill, Agrario. WE DON'T NEED NO STINKING MACARONI GRILL!!",
      "created_at": "2005-10-19T17:54:34.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "(Although if we are getting new chains, my vote is for Chipotle, please. Qdoba is a lame imitation.)",
      "created_at": "2005-10-19T17:57:03.000Z"
    },
    {
      "author": "Andy",
      "body": "I second California Pizza Kitchen.  My gosh is that restaraunt delicious.  I wouldn't mind a Sammy's Woodfired Pizza either.<br/><br/>I think that Arris is the best in town, but doesn't even compare with these two.",
      "created_at": "2005-10-19T18:07:42.000Z"
    },
    {
      "author": "Chad Johnston",
      "body": "My friend Jennifer and I run a local film class called Sanctuary of the Cinema.  Would it be alright if we advertised for you guys free of charge on Monday nights?  We could easily put up an promotional slide or two in a PowerPoint presentation prior to the film screening.  We don't have a huge constituency or anything, but we want to do what we can.  Check us out at www.sanctuaryofthecinema.com.  If you are interested, shoot me an e-mail and we'll figure something out. <br/><br/>Also, I am a teacher at Missouri State.  Do you have any promotional materials I could hand out to my students?  Or even something I could send to them via e-mail.  <br/><br/>I used to be in public relations, so I've got a nose for promos. :)  <br/><br/>Saw \"Broken Flowers\" last night and loved it to pieces.  Kudos to you guys for bearing the independent film torch in Springfield, MO USA! :)  ",
      "created_at": "2005-10-19T18:09:05.000Z"
    },
    {
      "author": "Jennifer Harris",
      "body": "Yes, definitely loved \"Broken Flowers.\" And I vote yes to the Macaroni Grill (and really everywhere else you mentioned).<br/><br/>Hope you found something to eat before frunking, cause uh, that would be really sad. I might even cry.",
      "created_at": "2005-10-19T18:51:44.000Z"
    },
    {
      "author": "Jennifer",
      "body": "I would love to see CPK, and if someone in town delivered chinese food I would weigh twice as much as I do now.  Two other restaurants we've been pining for in Springfield:  P.F. Changs and Pizzeria Uno.  Although we did eat at Ocean Zen recently and it bore a faint resemblance to Changs.",
      "created_at": "2005-10-19T19:23:23.000Z"
    },
    {
      "author": "Caleb",
      "body": "Can we expect new Moxie t-shirts in time for Christmas?",
      "created_at": "2005-10-19T20:31:23.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "CHIPOTLE, CHIPOTLE, CHIPOTLE. Of course, if you guys get one, that doesn't help my case in Toledo.",
      "created_at": "2005-10-19T20:42:10.000Z"
    },
    {
      "author": "Nate",
      "body": "Nothing a little riot couldn't solve.",
      "created_at": "2005-10-19T21:24:19.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Too much to write. Looks like a blog update later.  <br/><br/>Nicole:  Trader Joes: YES!!!  Whole Food Market would be nice too. We need a seriously awesome grocery store that carries things that you can't find at other stores around here.  I'm willing to pay up, and I think there are others like me. <br/><br/>Jennifer:  P.F. Changs ROCKS, though I don't think OZ has ANY resemblence to it. :-/ PFC's little brother Pei Wei would actually do better here in Springfield, though.  <br/><br/>There's a place in Phoenix called \"Flo's\" which puts any Asian-American fusion place to shame.  If you're ever there, you must go. MUST.  Man, if Springfield had Flo's my life would be begin to be complete...<br/><br/>Grizzly Man starts tonight!  <br/> <br/>Cards will win tonight! <br/><br/>Cat Power at Randy Bacon's Gallery Sounds  tomorrow night! What a week! :) <br/><br/><br/><br/>  <br/><br/>  <br/> <br/>",
      "created_at": "2005-10-19T23:16:33.000Z"
    },
    {
      "author": "Nate",
      "body": "!Los Cardinales tienen un palo muy grande en El Alberto! !El Alberto Pujoles Frijoles!",
      "created_at": "2005-10-19T23:36:56.000Z"
    },
    {
      "author": "Nate",
      "body": "And here's hoping Mulder can open a Category 5 Level of Whup-Ass on 'em, too.<br/><br/><br/>Weather reference!",
      "created_at": "2005-10-19T23:38:34.000Z"
    },
    {
      "author": "nicki",
      "body": "Yes for chinese delivery! I'm moving out soon and will need lazy food!!!<br/><br/>And as for fast food that we need: Taco Johns. Erin knows what I'm talkin' about! I'm from Iowa.. and until recently it's was like a needle in a haystack trying to find a Taco Bell up there because Taco Johns is FAR SUPERIOR!!! Potato Oles are my lovers. mmmMMMmmm.<br/><br/>great. Now I have to go hunt down some food.. Looks like it's grasshoppers and acorns again...",
      "created_at": "2005-10-20T01:55:18.000Z"
    },
    {
      "author": "Caleb",
      "body": "Dan, have you seen Rock School? It's a great documentary and would be awesome for the Moxie. Course I don't know how you go about getting your movies but if it was a future option for you I vote for it!",
      "created_at": "2005-10-20T10:38:28.000Z"
    },
    {
      "author": "Anonymous",
      "body": "Springfield needs another crappy, trendy, unimaginative chain restaurant like it needs another baptist church. I just don't understand why people in this town flock to garbage chains and beg for more when there are so many good LOCAL restaurants struggling. The most interesting thing Macaroni grill has on its menu is about as flavorful as a pinecone sprinkled with cardboard flakes. zio's is just a culinary black hole. Try looking around for a restaurant that cares about being part of this community.They're everywhere. ",
      "created_at": "2005-12-03T13:04:03.000Z"
    },
    {
      "author": "Robotech_Master",
      "body": "Springfield used to have, a few years back, a cheap Chinese delivery chain called Master Wang's (<i>nee</i> Master Wong's). It seems to have vanished without a trace, and I'm not entirely sure why. If you were to check <a href=\"http://www.quikdine.com\">Quikdine</a>'s website you would find some Chinese delivery options; however, they have a minimum order and a delivery fee that makes it rather not-cheap.<br/><br/>Anyway, good food options <i>have</i> slowly but surely been migrating into Springfield. We even got a Planet Sub in from Kansas City way, which is for my money the best non-\"gourmet\" submarine sandwich place I've ever visited; I sure won't be darkening Subway's door again if I can help it.",
      "created_at": "2006-05-17T04:47:49.000Z"
    },
    {
      "author": "ACW",
      "body": "Springfield lacks many restaurant genres. Where's a great salad bar place? SouperSalad or Sweet Tomatoes would be awesome here. It's a buffet of salad, soup, bread, pasta, etc.; people here love buffets. I lived on it in college in Arizona!!! Lots of vegetarian options. We need another good mexican food place (besides Marias) to boot. ",
      "created_at": "2006-08-10T21:58:37.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
