{
  "id": 318,
  "title": "One month old",
  "body": "For those of you keeping track, The Moxie turned one month old on Friday. A big thank you to everyone who stopped by during our first 31 days of business... even to the guy who pretended to throw popcorn at me during my introduction on Friday. I really appreciated that, by the way. So here's what's coming up in November:<br/><br/><ol><li><b>NEW MOVIES</b> - We have TEN (possibly ELEVEN) new movies for November. Compare that to the TWO we showed in September, or the SEVEN we showed in October, and you'll see that we're actually showing MORE MOVIES THAN EVER BEFORE! I'll start announcing movies later in the week, so keep your eyes open.</li><br/><li><b>SCHEDULE CHANGES</b> - Thanks to the data we collected during October, we've come up with two important conclusions: (1) nine o'clock shows on Sunday nights do very, very bad, and (2) Mondays are really slow. So, to counter these low points, we're doing away with the Sunday night niners and renaming Mondays to \"Matinee Mondays,\" where all the movies will be matinee priced ($5.00). Woo hoo!</li><br/><li><b>ONLINE TICKETING</b> - Online ticketing is up and ready to go. I'd like to unveil it to the public on November 1st, but before I do that, I need to do some beta testing. Would any of you be willing to buy your next Moxie ticket online (between now and November 1st)? If so, drop me a line and I'll supply you with the ticket gateway address. If you don't know my e-mail address, it's MrAwesome@moxiecinema.com, but remove the \"MrAwesome\" and replace it with \"dan\". Cool? Cool.</li></ol><br/>December and January are looking good too. I think we're going to do our first month-long retrospective series in January. Basically, for each week in January we'll show a different movie from a particular director. You'll be able to buy an entire month-long pass for a discounted price, or buy tickets at regular price before each showing. We're still in the formulating stage, but it was too cool NOT to keep secret. If it goes over well, we'll do a new one every few months and change it up between director retrospectives, actor retrospectives, and genre series. SWEET!<br/><br/>Uh oh, it's intermission time...",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-10-24T00:14:01.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Maddy",
      "body": "Hey, so how are things going with the Moxie?  Have the numbers picked up?  For all of us who don't live in Springfield, could you give us an update on your successes?  Or is it just too early for that?",
      "created_at": "2005-10-24T00:58:13.000Z"
    },
    {
      "author": "bjork24",
      "body": "We're doing pretty good, but we'll need to give it a few months until we get can get an accurate handle on our overhead (varying utilities, distribution fees, etc.). Don't worry, I'll keep you updated.",
      "created_at": "2005-10-24T01:37:20.000Z"
    },
    {
      "author": "brian of moore",
      "body": "oh boy!.. i see some good ideas afoot..<br/>ive also noticed (or at least think i may have noticed) a steady climb in attendance.. the last few shows i saw.. compared to the first few shows... seemed to be a bit more crowded..... yay for that",
      "created_at": "2005-10-24T02:34:15.000Z"
    },
    {
      "author": "Caleb",
      "body": "Happy (Belated) Birthday! I can't wait for another month of awesome movies! ",
      "created_at": "2005-10-24T02:49:30.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Congrats guys! Are the director series shows going to be just one or two nights each? I hope you will be showing some Kubrick and Kurosawa. Also, Michael Bay.",
      "created_at": "2005-10-24T03:16:20.000Z"
    },
    {
      "author": "erin",
      "body": "how did the harold and maude showings go......<br/><br/>: * (",
      "created_at": "2005-10-24T04:45:38.000Z"
    },
    {
      "author": "Al",
      "body": "Did you mean 2+ movies a week from the same director? It seems strange to have 20 showings of an old movie.",
      "created_at": "2005-10-24T05:34:56.000Z"
    },
    {
      "author": "bjork24",
      "body": "Dave: they'll most likely be 3 nights (Friday, Saturday, and Sunday)<br/><br/>Erin: H&M went extremely well. We were lucky enough to have an original 1971 theatrical print of the film. It was really cool. We had just shy of 100 for two showings, which isn't bad.<br/><br/>Al: January has 4 weekends, so each weekend will have 3 showings of one movie.",
      "created_at": "2005-10-24T05:43:48.000Z"
    },
    {
      "author": "matt",
      "body": "when you do your david lynch retrospective, i'll have to fly up to springfield for a month! :)",
      "created_at": "2005-10-24T19:17:40.000Z"
    },
    {
      "author": "DUG",
      "body": "I'm glad you are getting online ticketing so I don't have to crack open your skull and feast on the goo inside!",
      "created_at": "2005-10-24T20:10:47.000Z"
    },
    {
      "author": "elliott",
      "body": "happy late moxie b-day... <br/><br/>question: if i were to email mrawesome@moxiecinema.com... where would it go and who would receive it?",
      "created_at": "2005-10-24T23:24:24.000Z"
    },
    {
      "author": "erin",
      "body": "it would go to my mailbox. and i would receive it. and then i would translate it to \"Dogpaw.\" and then i would send it to bogey. and he would read it. and not care.",
      "created_at": "2005-10-24T23:30:36.000Z"
    },
    {
      "author": "erin",
      "body": "(im special!)",
      "created_at": "2005-10-24T23:30:55.000Z"
    },
    {
      "author": "Caleb",
      "body": "And by 10 movies you mean Everything is Illuminated, Thumbsucker, The Squid and the Whale, Junebug, Good Night and Good Luck, Proof, Capote, Last Days, The Memory of a Killer, Ushpizin, and Paradise Now, right? (These are just guesses, of course. I'd be happy with anything you get.)<br/><br/>I can't wait for you to announce them! What day this week might you do so?",
      "created_at": "2005-10-25T01:13:31.000Z"
    },
    {
      "author": "Caleb",
      "body": "Whoops, that was eleven movies.",
      "created_at": "2005-10-25T01:13:51.000Z"
    },
    {
      "author": "Nate",
      "body": "That's okay.  The Moxie goes to eleven.",
      "created_at": "2005-10-25T01:50:37.000Z"
    },
    {
      "author": "Nate",
      "body": "Oh come ON people.  That was brilliant.",
      "created_at": "2005-10-26T02:43:11.000Z"
    },
    {
      "author": "bjork24",
      "body": "I got it, Nate.",
      "created_at": "2005-10-26T02:44:24.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
