{
  "id": 319,
  "title": "The Aristocrats...",
  "body": "THE ARISTOCRATS opens on Wednesday. We've already pre-sold a bunch of tickets. Like most theaters across the nation, we're choosing to run the film as NC-17... as in, no one under the age of 18 will be allowed. I'm going to get beat up by a gang of angry high schoolers, aren't I? This will be the first time we've had to check IDs at the door. I bet that will lead to some good <strike>storys</strike> stories. Whew boy!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-10-25T06:42:39.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "--Jeff",
      "body": "As long as you ditch the pre-show rap music and reinstate the dress code, you'll be fine. ;)   ",
      "created_at": "2005-10-25T06:56:23.000Z"
    },
    {
      "author": "mish",
      "body": "jeff = \\m/",
      "created_at": "2005-10-25T09:28:10.000Z"
    },
    {
      "author": "Oz",
      "body": "Good <i>stories</i>, my friend--storIEs.",
      "created_at": "2005-10-25T17:17:08.000Z"
    },
    {
      "author": "--Jeff",
      "body": "\r\nHow sad is it when you have to urbandictionary \"\\m/\"? \r\n\r\nYeah, I know.  I'm a Geezer. At 32, to boot. It's all downhill from here folks...",
      "created_at": "2005-10-25T20:01:20.000Z"
    },
    {
      "author": "Rachel",
      "body": "You should have some sort of joke-telling contest for junior mints or something during the intermission. Or Bob Saget look-a-like contest.",
      "created_at": "2005-10-25T20:12:02.000Z"
    },
    {
      "author": "bjork24",
      "body": "Good catch, Oz. Your mommy instincts serve you well.",
      "created_at": "2005-10-25T21:11:59.000Z"
    },
    {
      "author": "Nate",
      "body": "NC-17?!\r\n\r\nSo now I can't bring my date?",
      "created_at": "2005-10-25T21:40:44.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Hrm. NC-17? Bummer. What exactly are you afraid of again?",
      "created_at": "2005-10-26T01:01:34.000Z"
    },
    {
      "author": "brian of moore",
      "body": "hey kids... if i wasnt able to get into these types of movies when i was your age.. you shouldnt be allowed to either\r\nlike when you haze the freshmen.... i hated being a freshmen.. but when you are no longer a freshmen.. you almost have to haze them.. because if we had to go through it.. why should they get away scott free?\r\n.... wow.. i just brought up highschool.. that was like 8 years ago..",
      "created_at": "2005-10-26T01:27:38.000Z"
    },
    {
      "author": "brian of moore",
      "body": "note: i dont think they even had NC-17 when i was 17... it was just plain RRrrrr",
      "created_at": "2005-10-26T01:28:21.000Z"
    },
    {
      "author": "erin",
      "body": "how old must you be to get into an R rated movie?",
      "created_at": "2005-10-26T01:41:02.000Z"
    },
    {
      "author": "erin",
      "body": "your ACTUALLY choosing to run the film nc-18. cause... you know. no one under 18. thats one step above nc-17 you know.\r\n\r\n: P\r\n\r\nim such a jerk.",
      "created_at": "2005-10-26T01:42:37.000Z"
    },
    {
      "author": "bjork24",
      "body": "Actually, in accordance with the MPAA rating, NC-17 means \"No one 17 and under admitted.\" R means \"Under 17 requires accompanying parent or adult guardian.\"",
      "created_at": "2005-10-26T02:02:39.000Z"
    },
    {
      "author": "Nate",
      "body": "Curse you Jack Valenti!  Curse you and your artificial barriers keeping my 16 year old dates from seeing nothing but Herbie Fully Loaded!",
      "created_at": "2005-10-26T02:47:05.000Z"
    },
    {
      "author": "Nate",
      "body": "Joking about dating minors comes off as kinda creepy, don't it?\r\n\r\nDefinitely does not = \\m/",
      "created_at": "2005-10-26T02:47:36.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Creepy?  Only if previous hits include \"Beat It\", \"PYT\", and \"Thriller.\"\r\n\r\nOh, and if you're 32. \r\n\r\nOther than that, not so much. :) \r\n\r\n\r\n",
      "created_at": "2005-10-26T05:24:58.000Z"
    },
    {
      "author": "mish",
      "body": "i urbaned dictionaried it too to see what it said exactly. i use it to say \"rock\" sometimes.\r\n\r\n\"it has recently begun to be used by people who are fans of other music genres and simply believe it is trendy to do. These people ar posers and are beneath notice\"\r\n\r\nwow. its like they KNOW me.",
      "created_at": "2005-10-26T07:15:37.000Z"
    },
    {
      "author": "Archer Spade",
      "body": "\r\nWhen I saw this a few months ago in Atlanta, the two elderly, yes, ELDERLY, women sitting next to me got up and left after about 15 minutes.\r\n\r\nThis movie, along with Manhunt (the video game) are the two things I've seen that actually deserve the cautious ratings.\r\n\r\nBut,  it's still hilarious.  Do you guys get to have the Trailer for \"Jesus Is Magic\" run before the film?  Genius.",
      "created_at": "2005-10-29T02:54:41.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
