{
  "id": 32,
  "title": "The Name Game",
  "body": "Perhaps I spoke too soon. After <a href=\"/posts/31\">Friday's post</a> regarding our decision to name the theater <b>Criterion Cinema</b>, we might have, just maybe, changed our minds... a little. Maybe. We're recanting. We were too hasty in our reporting. As it turns out, Florida is having some problems tallying their votes, so we can't say, with any degree of certainty, who the actual winner is. I bet you're wondering, \"What happened, Dan? I mean, one minute I'm planning my '<b>Criterion Cinema</b> is the winner' celebration party, and now I'm second guessing everything! Is this my child? Is Paul dead? Where's my hat? I just don't know anymore. Damnit Dan, look what you've done! How can this be happening? I demand a recount!\"\r\n\r\nAnd a recount you shall have.\r\n\r\nHere's the skinny: Before we settled on <b>Criterion Cinema</b>, Nicole had her eye on a little name called <b>Moxie</b>. We tossed it around a bit, but for whatever reason, it fell between the cracks. Nicole kept chanting, \"Do you have Moxie? I've got Moxie! Need some Moxie? Here's some Moxie! Smoke this Moxie! Moxie my hat? Speaking of which, where is my hat?\"\r\n\r\n\"You don't have a hat, sweetie,\" I'd say.\r\n\r\n\"Oh. But I do have Moxie!\"\r\n\r\nI'm not sure why we eventually decided on <b>Criterion</b> over <b>Moxie</b>, but I have a feeling that alliteration may have played a part in it. I love alliteration. I don't know why... I just do. I always seem to find myself subtly, and not so subtly, slipping similar sounding syllables into my superbly structured sentences all the stinkin' time! Sheesh! Either way, alliteration or no, <b>Criterion Cinema</b> won us over. It took us out to fancy dinners, gave us boxes full of personalized pens, polo shirts, and key chains, it even helped us advance our application to the final tier in this season's casting of <i>Amazing Race</i> (although, unfortunately, we didn't make the final cut). Then came <a href=\"/posts/31\">Friday's post</a>, and everything seemed to be shored up...\r\n\r\n... but <b>Moxie</b> had moxie, and it grabbed us by our scrawny little necks, donked our heads together, and jabbed us in our poochy celiac plexuses! Another translation, sans superfolous personification, would be that Paul, our super cool booking-agent-to-be, e-mailed me and said, \"it's probably a bit late for this, but how about this name for the theater: The Moxie Cinema.\" And just like that, all of the old feelings came rushing back. The more I said it, the more I liked it. Sure, <b>Criterion Cinema</b> sounded more regal and harkened back to the good ole days of giant, palatial theaters, but, like I said earlier, <b>Moxie</b> had moxie, by gum, and it embodied our independent, \"come hell or high water\" spirit.\r\n\r\n<b>mox·ie</b> <i>n. Slang</i> - 1. The ability to face difficulty with spirit and courage. 2. Aggressive energy; initiative. 3. Skill; know-how. (<a href=\"http://dictionary.reference.com/search?q=moxie&r=67\" target=\"_blank\">source</a>)\r\n\r\nSounds good to me... but what do you think? When we originally started brainstorming names for the theater we only had a handful of friends and family that we could bounce ideas off of, but now, thanks to this blog, all that's changed. I'm very eager to hear what you think, especially from those of you who have made it a point to stop by on a near daily basis and leave thoughtful, beneficial comments. Tomorrow is my 24th birthday, so you probably won't hear from me again until Wednesday, which should hopefully allow plenty of time for this post to accumulate lots of valid comments regarding the potential name of our theater.\r\n\r\nHow many blogs give its readers the opportunity to pick the name of a super cool, independent, art-house theater? So what will it be: <b>Criterion Cinema</b> or <b>Moxie Cinema</b>? Let your voice be heard. Rock the vote!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-07-06T05:35:00.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "I personally like The Moxie.  But, if it's the Moxie, I think \"Cinema\" should be dropped from it.  If not, at least make sure everyone calls it \"the Moxie\" -- because that sounds good.",
      "created_at": "2004-07-06T07:05:32.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yes, \"The Moxie\" does have a ring to it, doesn't it. We won't be serving Moxie though, in case any of you were curious.",
      "created_at": "2004-07-06T07:40:44.000Z"
    },
    {
      "author": "Jurgen",
      "body": "I can't wait to rent some of your DVDs.  What a great selection the Criterion has!",
      "created_at": "2004-07-06T08:05:42.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "I think that \"Criterion\" looks a bit better than \"Moxie\" but \"Moxie\" sounds way better.\r\n\r\n\"Hey, wanna go catch a show a The Moxie?\"\r\n\r\n\"Let's meet in front of The Moxie.\"\r\n\r\n\"Did you check and see what's playing tonight at The Moxie?\"\r\n\r\nLike you said, it just has a nice ring to it.",
      "created_at": "2004-07-06T08:56:44.000Z"
    },
    {
      "author": "elspeth",
      "body": "It's gotta be Moxie. I did like Criterion, I was very happy with it, but given the choice...it's gotta be Moxie. Also saves on neon.",
      "created_at": "2004-07-06T10:03:09.000Z"
    },
    {
      "author": "Tony",
      "body": "I go with \"Moxie Cinema\". I can see people saying, I am going to \"The Moxie\" It sounds fun and at the same time suggests that you guys are going upstream.\r\n\r\nCriterion sounds too upscale and pretentious. And I have to point out that there is no alliteration invlolved as the sounds are \"kry\" and \"Sin\" Now \"Kryterion Sinema\" might work.",
      "created_at": "2004-07-06T10:46:10.000Z"
    },
    {
      "author": "Mike",
      "body": "Can I just add into the discussion that 'Moxie' was actually a character from the popular eighties drama, 'Auf Wiedersehen Pet', he was the scouser.. not that it should put you off, but he did have failry bad skin.",
      "created_at": "2004-07-06T13:35:36.000Z"
    },
    {
      "author": "Brandon",
      "body": "There is no question about it...Moxie is the better choice.  Besides the fact that \"Criterion\" would have people thinking you were playing films taken from the Criterion Collection (as Jurgen previously pointed out), Criterion sounds way too pompous and hollow.  Also, four syllables before \"Cinema\" takes way too much time to say.  With \"Moxie\" it has flavor and pizzazz and screams success!  Plus, people would most likely get into the habit of shortening it to \"The Moxie\" or even better--\"The M.C.\".  Now that is beyond chic and honestly has more ring to it than a telephone.",
      "created_at": "2004-07-06T16:52:54.000Z"
    },
    {
      "author": "Jimmy",
      "body": "I like the playfulness of The Moxie vs. the almost-too-seriousness of The Criterion.",
      "created_at": "2004-07-06T18:03:03.000Z"
    },
    {
      "author": "Andrew",
      "body": "If those are the only two choices, you ought to stick with Criterion. If you call it the Moxie, you will redline the \"cute\" meter. I'm envisioning instead of your current logo, a small cineaste dog, or something like that...",
      "created_at": "2004-07-06T18:16:28.000Z"
    },
    {
      "author": "Bryan",
      "body": "The Moxie.  No matter what you call it, people are going to find a simpler way to say it.  Given that, do the work for them.  No one will ever confuse the Moxie with another place.  It'll become it's own landmark.  The Moxie.",
      "created_at": "2004-07-06T18:48:56.000Z"
    },
    {
      "author": "Sandra",
      "body": "Moxie, definitely. I love it!\r\n \r\nReminds me of The Roxie Cinema (that goes by Roxie) in San Fran. www.roxie.com\r\n\r\nPlus, Criterion is also a non-theatrical distributor and it's hard to abbreviate the name.",
      "created_at": "2004-07-06T19:54:55.000Z"
    },
    {
      "author": "Kameron",
      "body": "What, no poll? You're forcing me to leave a comment in order to vote. Whatever happened to anonymity on the internet?\r\n\r\nI'd say if you want to include \"Cinema\" in the name then stick with \"Criterion Cinema.\" It rolls off the tongue a lot easier then \"Moxie Cinema.\" However, \"The Moxie Theatre\" has a nice ring to it, but that wasn't a choice.\r\n\r\nSo, my vote is for \"Criterion Cinema.\"",
      "created_at": "2004-07-06T20:22:50.000Z"
    },
    {
      "author": "the singaporean kid",
      "body": "Criterion Cinema  reminds me of crickets or something buggy,moxie sounds funny,i cant decide,gd luck with your project",
      "created_at": "2004-07-06T22:46:51.000Z"
    },
    {
      "author": "Oz",
      "body": "Moxie is certainly a good name.  In the interest of alliteration, you could name it Moxie Movies or The Moxie Movie Theater.  I'm not that crazy about Moxie Cinema.  Moxie Theater is better, in my opinion.",
      "created_at": "2004-07-06T23:15:02.000Z"
    },
    {
      "author": "anonymous",
      "body": "i like moxie cinema. i'd love to tell people to meet me at the Moxie at eight. it harkens back to days of yore (when was the last time you were told you had moxie?), and it also screams of fun times and youth. now all you need is the vintage red-coat james dean stand-up and a cardboard rocky next to him, pointing people towards the ticket office. after all, there's already a \"regal\" theatre with a ritzy name in M-town. this one will be different. this one will have moxie. ;)",
      "created_at": "2004-07-07T00:53:25.000Z"
    },
    {
      "author": "david",
      "body": "&lt;a href=\"http://theworldaroundtheworld.blogspot.com\"&gt;Yeah The m&m repition Sound good in Moxie Movie. I Also think its sounds better than Moxie Cinema &lt;/a&gt;",
      "created_at": "2004-07-07T01:03:53.000Z"
    },
    {
      "author": "bjork24",
      "body": "So many comments, so little time.",
      "created_at": "2004-07-07T01:17:15.000Z"
    },
    {
      "author": "sandra",
      "body": "The Moxie \r\nmovies * media * munchies\r\n\r\nMoxie\r\na movie house\r\n\r\nThe Moxie\r\nfilm and fun food\r\n\r\nwish i could have named my movie house :)",
      "created_at": "2004-07-07T01:38:26.000Z"
    },
    {
      "author": "Stefan",
      "body": "Definitely \"The Moxie\"  Film obsessives will know what \"Criterion\" means, but the rest won't, and won't care.\r\n\r\nCan you imagine somebody saying, \"Let's go see a movie at the Crit?\"\r\n\r\nNo, neither can I.",
      "created_at": "2004-07-07T02:12:28.000Z"
    },
    {
      "author": "bjork24",
      "body": "But what about, \"Let's go see a movie at the Criter?\"\r\n\r\nHmmm, on second thought...",
      "created_at": "2004-07-07T02:18:58.000Z"
    },
    {
      "author": "Oz",
      "body": "By the way, Happy Birthday!",
      "created_at": "2004-07-07T03:34:42.000Z"
    },
    {
      "author": "Newell",
      "body": "I'm going to have to go with The Criterion. 'The Moxie' is just too cute to me. I can see someone asking a friend, \"Hey, you wanna' go catch a flick at The Moxie?\" and the other person giggling and saying, \"The what???\"",
      "created_at": "2004-07-07T04:07:28.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Oz!",
      "created_at": "2004-07-07T04:31:30.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Criterion Cinema, definitely. Moxie is cute, but Criterion has class.\r\n\r\nWhen in doubt, you'll definitely get more patrons with class than with cuteness.",
      "created_at": "2004-07-07T04:59:30.000Z"
    },
    {
      "author": "sara",
      "body": "i  vote for The Moxie: it is retro, hip, simple, & classic, all rolled into one. i do say though, what is in a name that cannot be created with clever marketing. the image you want your theater to project is still up to you whatever name you choose. frankly, Criterion just feels dry & snooty. in the end, however, it's all about your marketing. every opinion here is stated based on how an Individual feels about a Word in connection with their experience with Art House Cinema. again, i'll stress, marketing is the key ingredient to the success of your theater. best of luck with your decision! and, cheers to an awesome marketing campaign in your future!",
      "created_at": "2004-07-07T08:29:35.000Z"
    },
    {
      "author": "Colleen",
      "body": "\"The Moxie\"........... it says it all.  I like the ring it has to it.  Good luck with your decision!",
      "created_at": "2004-07-07T09:48:53.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "Ack! Dan, by that reasoning I should be a grandmother soon.",
      "created_at": "2004-07-08T00:24:40.000Z"
    },
    {
      "author": "bjork24",
      "body": "Young? I'm 24, which is almost 25, which is almost mid-thirties!",
      "created_at": "2004-07-07T19:14:12.000Z"
    },
    {
      "author": "sarah",
      "body": "http://www.criteriontheater.com/\r\n\r\nyou should go with moxie cause criterion is already being used by a theater and a dvd distributor (as mentioned earlier) and is therefore, not as original.\r\n\r\ngood luck with the project, sounds absolutely awesome!",
      "created_at": "2004-07-07T14:50:15.000Z"
    },
    {
      "author": "trinity",
      "body": "Criterion Cinema could become \"the double C\" as opposed to something like \"the crit\" which is way to close to the crypt.  (clever marketing?)  Or maybe it would just become \"the crypt\" and that would be your special thing!  Eeek.  Criterion is a difficult word with lots of syll-a-bles, but classy.\r\n\r\nMoxie is cute, but not too cute.  Would be fun to say, \"Let's go to the Moxie.\"\r\n\r\nEither way, happy birthday.  I envy the fact that you are so young and ambitious!",
      "created_at": "2004-07-07T16:24:39.000Z"
    },
    {
      "author": "Donald Melanson",
      "body": "\"The Moxie\", without the \"Cinema\".  Maybe \"Moxie Movie Theatre\" or \"Moxie Movie House\".",
      "created_at": "2004-07-08T04:12:30.000Z"
    },
    {
      "author": "abcdefghijklmnopqrstuvwxyz",
      "body": "u need some inspiration,suck satans cock muhahahhaa",
      "created_at": "2004-07-08T07:39:12.000Z"
    },
    {
      "author": "Craig",
      "body": "I'd vote for...neither.  I think Moxie sounds too old and makes it sound like you're only playing 1950s films. (Oh, the Moxie has new films?  I never knew...) And Criterion doesn't mean much to most people, I think. Maybe some vague connection to the DVDs of the same name. \r\n\r\nI've always been partial to theater names that resonate with the place they're located, like \"Rain City Cinema\" in Vancouver or \"The Admriral\" in some port town or other I was in.\r\n\r\nJust my 2 cents.",
      "created_at": "2004-07-08T08:26:02.000Z"
    },
    {
      "author": "Amy",
      "body": "I vote for Moxie Theatre or Moxie Movie House over Criterion for all the reasons stated above. It sounds better, funner, less stuffy, etc. I also think it fits your situation. You have to have a lot of moxie to be 24 and starting your own theatre, etc. Plus a lot of independent films have moxie so that fits. I think Criterion does sound more regal and high brow. So I guess it just depends on the image you have of your theatre. Plus, as someone else posted, marketing can give it whatever image you want it to have.",
      "created_at": "2004-07-08T20:06:32.000Z"
    },
    {
      "author": "Donald Melanson",
      "body": "Another possibility -- why not just take inspiration from this blog and call it \"Cinema 24\".  It'd be a Studio 54 for the art hourse cineaste crowd.\r\n\r\nI could even design a logo for you if you're interested, email me if you want to discuss it further.",
      "created_at": "2004-07-08T23:33:17.000Z"
    },
    {
      "author": "Craig",
      "body": "I was thinking the same thing as Donald.  I like \"Cinema 24\" quite a bit.",
      "created_at": "2004-07-09T06:11:20.000Z"
    },
    {
      "author": "c",
      "body": "i have to read back, but the immediate impressions are: oh wow they must be like the place to go see Criterion films!  & re moxie, of course Moxy Fruvous",
      "created_at": "2004-07-09T10:08:33.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 14,
      "name": "Dialogue"
    }
  ]
}
