{
  "id": 320,
  "title": "Where's the Moxie sign?",
  "body": "<a href=\"/phlogs/8\">The old, tattered banner that has been hanging on the front of our building for nearly nine months</a> has finally come down. Not because we have a new sign to replace it, but because the city has demanded we take it down or file for a banner permit. Okay. Whatever. The banner is now hanging proudly in our lobby; a relic of all the hard work we put into the theater. Eventually, a nice big marquee is going to grace the front of our building. It will have our logo on the left side, changeable letters (for the showtimes) in the center, and a Dr. Pepper logo on the right side. Coke is paying for the sign ($1,200 - thanks Coca Cola), which means I don't have much of a leg to stand on when it comes to complaining about it not being up yet. I called twice last week - \"it'll be done by the end of this week.\" I called on Monday - \"it's not done, but it's a top priority.\" If I were paying for the sign myself, I'd be a lot more aggressive, but instead I say, \"okay. I'm a complete wuss. Thank you for taking advantage of my patience.\" And then I hang up. Keep your fingers crossed that it will be up soon, as we currently have ZERO signage designating our building as the mythical Moxie.\r\n\r\nSpeaking of The Moxie being mythical, a unicorn with a Yeti on its back just flew by. Also, a guy (Derek was his name) dropped by before our 4:30 movie and introduced himself to me. He was from San Diego and just happened to be driving through, so he decided to drive downtown and visit the infamous Moxie Cinema. He's planning on building a similar theater in San Diego. It was kind of weird, but cool. I sometimes forget that people other than me and my alter ego (Renaldo) read this blog. What is this thing: \"comments {96}?\" Forum? What the hell, man? What the hell!\r\n\r\nI just sent out a newsletter to all the good Moxie boys and girls who are signed up on our mailing list. If you're not already, <a href=\"http://www.moxiecinema.com/mail.php\" class=\"broken\">GO SIGN UP RIGHT NOW</a>! You have no idea what you're missing. None! <a href=\"http://www.moxiecinema.com/newsletters.php?id=11\" class=\"broken\">Read this right now!</a> That's what you're missing, man.\r\n\r\nOh yeah, I just remembered the other thing I was going to write about: THE ARISTOCRATS. Our print of THE ARISTOCRATS arrived today, and upon screening it I realized that it looked (and sounded) like absolute P-O-O-P. There were scratches all over the film, and the sound suffered from a tinny crackle. Upon further inspection, I noticed that the film looked like it had been run through a cheese grater! There were scratches all over the place. I immediately went into \"projection booth emergency mode,\" which basically consists of me posting my problem on <a href=\"http://www.film-tech.com\" target=\"_blank\">film-tech</a> and then running around in circles until someone answers. Here's today's <a href=\"http://www.film-tech.com/cgi-bin/ubb/ultimatebb.cgi?ubb=get_topic;f=1;t=007566\" target=\"_blank\">emergency post</a>.\r\n\r\nAs you can see, the film was in pretty bad condition. It was still watchable, but I have more respect for our audience than to throw a shitty print like that up on the screen. It's all about presentation in this business, and I refuse to project anything less than \"slightly above average.\" Anyways, long story short, I called Technicolor and requested a new print. I didn't expect the film to be here until Thursday, but lo and behold, it's going to be here bright and early in the morning. No one will be subjected to the sub-average print! Yay! Thank you Technicolor!\r\n\r\nThat's all.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-10-26T05:21:38.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "New Moxie sign coming soon? Woohoo! Your e-mail was quite amusing. And hopefully I can make it to The Aristocrats tomorrow night at 9:30. I wanted to buy an online ticket but wasn't sure if I'd be able to go. Either way - I hope you have a big turnout. ",
      "created_at": "2005-10-26T06:19:09.000Z"
    },
    {
      "author": "elliott",
      "body": "banner permit? thats crazy... but at least you will get a new sign soon... \r\n\r\ni am very excited about aristocrats...i am glad that you care enought to make sure we have a good quality film to watch...\r\n\r\ni love you moxie friends....\r\n\r\n",
      "created_at": "2005-10-26T08:21:06.000Z"
    },
    {
      "author": "brian of moore",
      "body": "thank god.. a scratched up copy of aristocrats would have put a damper on my thursday.... btw.. see ya thursday!\r\n\r\nand how very cool that coca-cola is paying for the sign.. late or not.. thats a pretty good deal",
      "created_at": "2005-10-26T08:55:06.000Z"
    },
    {
      "author": "Anthony Thompson",
      "body": "Coca Cola pays for the sign...and puts a Dr. Pepper logo on it?\r\n\r\n\r\nGreat site!!!!!!",
      "created_at": "2005-10-26T19:52:17.000Z"
    },
    {
      "author": "Nate",
      "body": "Thanks for being such a hard-ass on our behalf, Dan.  And I'm thrilled the new print is getting here on time.  It will be Aristocratastic.",
      "created_at": "2005-10-26T20:32:37.000Z"
    },
    {
      "author": "Caleb",
      "body": "Every time I try telling people about you showing \"The Aristocrats\" I end up saying \"The Aristocats\" and people question why you're showing a Disney cartoon about cats. \r\n\r\nDan: \"I'll start announcing movies later in the week, so keep your eyes open.\"\r\n\r\nPlease define \"later in the week.\" I'm dying here! :-)",
      "created_at": "2005-10-27T00:02:31.000Z"
    },
    {
      "author": "bjork24",
      "body": "If you come see THE ARISTOCRATS tonight, you'll see not one, not two, but three previews for upcoming Moxie movies.\r\n\r\nI'll also start posting them online tonight.",
      "created_at": "2005-10-27T01:45:13.000Z"
    },
    {
      "author": "nicki",
      "body": "dr. pepper is owned by coke.\r\n\r\n\r\nand i was really sweatin' when i was reading the part about the crappy film... was afraid i wouldn't get to see it. but now i've popped a bottle of valium... and... no... I like potatoes.",
      "created_at": "2005-10-27T02:56:04.000Z"
    },
    {
      "author": "Derek from San Diego",
      "body": "Thanks for letting me look around the place. It was neat to put a face to the writing. I figured it was literally a once in a lifetime opportunity for me. Springfield seems like a very nice town. The area surrounding the theater has beautiful old houses and huge trees. Overall it seems like a very good location. The interior was very tastefull as well. I wish I would have had time to watch the movie but I guess that will be my motivation to return someday. BTW, I didn't see the yeti or the unicorn; did I miss them? ",
      "created_at": "2005-10-27T08:07:35.000Z"
    },
    {
      "author": "brian of moore",
      "body": "ladies in lavender?\r\nmy grandmother's name is ursula.. .. ursula dergance... why yes actually... we are of slavic decent\r\ni also own a violin that my grandpa made from his own two hands....... no not out of his hands.. that would be gross and freakish... his hands carved the wood that it was made from... geez...\r\n\r\nso...because of the amazing similarities this movie has with my own life... i have decided that i will definately go and see it",
      "created_at": "2005-10-27T08:23:00.000Z"
    },
    {
      "author": "brian of moore",
      "body": "the mirror mask!!\r\nohhh i am soooo on that shiiiit!\r\nor... i mean.. i want to see it... that is...\r\n\r\nand whats 'the animation show'  ??\r\ni need more details! :-)\r\n.. that picture is definately from the guy that did that well known internet-passed-around  \"my spoon is too big\" animation... i forget his name\r\nits on my comp somewhere... i could go see.. im lazy... i might do that momentarily...\r\n\r\neverything is illuminated is a definate.. of course\r\nthe enron thing looks quite interesting.. i love me some scandal.. and politics...\r\n\r\ni wanted to see proof pretty badly.. glad your playing it... \r\nthumbsucker!.. awesome... look at all these movies!! \r\n\r\ni love you guys!\r\nand by that.. i mean that i want to be the godfather of your children...\r\nnot in the way that ill make them kiss my rings... but in the way that ill buy them toys at christmas and stuff\r\n",
      "created_at": "2005-10-27T08:28:44.000Z"
    },
    {
      "author": "nicki",
      "body": "oh man.\r\n\r\nHappy Endings.\r\n\r\nThanks again!! As my friends can attest (prolly not the right spelling or word, but go with it), I will someday (atleast in my mind) run away with Maggie Gyllenhaal to Canada and get married. Yes :D \r\n\r\nUhm. Heh. ;)",
      "created_at": "2005-10-27T08:47:50.000Z"
    },
    {
      "author": "Caleb",
      "body": "What a closet case! :-P",
      "created_at": "2005-10-27T09:07:47.000Z"
    },
    {
      "author": "Caleb",
      "body": "Your November movie lineup makes me feel like....an Aristocrat (if you know what I mean)! Very impressive. I hope I can make it to all of them.\r\n\r\nOh and everyone - The Aristocrats is GREAT. But do take heed of Dan's many warnings if you get offended easily or simply are a prude. ",
      "created_at": "2005-10-27T09:11:46.000Z"
    },
    {
      "author": "nicki",
      "body": "closet case?! \r\n\r\ni'm a nut case!\r\n\r\nfruit basket!\r\n\r\nor something. :P",
      "created_at": "2005-10-28T04:35:58.000Z"
    },
    {
      "author": "erin",
      "body": "yes. its true. nicki and maggie will indeed run off and get married.\r\n\r\nbut not before steve buscemi and i do....\r\n\r\nswooon.\r\n\r\n: )\r\n\r\ni asked before and i will ask again.... WHAT HAPPEND TO THE MOXIE JINGLE???",
      "created_at": "2005-10-28T04:47:20.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
