{
  "id": 321,
  "title": "The Moxie is hiring",
  "body": "Are you 21 or older? Do you love independent film? Can you lift 50 lbs. of film over your head? Do you love The Moxie? Can you give an introduction to a film you've never seen before in front of a group of people who would rather see you dead than have you continue talking? Can you hold an apple in your mouth while wearing tight black leather and a blindfold? If so, you might have what it takes to join our team. Maybe.\r\n\r\nIf you're interested, send us an e-mail at PeeStrain@moxiecinema.com... only replace \"PeeStrain\" with \"info.\" Why PeeStrain, you ask? It's that Cat Steven's song... you know it:\r\n\r\n<i>Oh pee strain sounding louder,\r\nGlide on the pee strain,\r\nCome on now pee strain,\r\nYes, pee strain holy roller.\r\n\r\nEveryone jump upon the pee strain,\r\nCome on now pee strain!</i>\r\n\r\nTHE ARISTOCRATS has done terrible things to my humor... not to mention my innocent, innocent ears.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-10-28T04:46:11.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "jeff",
      "body": "are you guys still hiring? i worked at a movie theatre for two years in high school. i've got experience.",
      "created_at": "2005-11-18T09:27:26.000Z"
    },
    {
      "author": "Satarah",
      "body": "I wanna work there. I'm not 21. :( But I am 19...you should change the rule. It's a dumb rule anyway. Dumb moxie pee strain legal age for alcohol consumption turd heads. ",
      "created_at": "2005-11-01T22:49:31.000Z"
    },
    {
      "author": "j-fry",
      "body": "i am extremely excited to see mirror mask in the line up... i just hope to the god of movies (or... dan will do.) it stays there.",
      "created_at": "2005-11-02T00:27:12.000Z"
    },
    {
      "author": "michelle",
      "body": "I don't think I want to see The Aristocrats...but I will be checking out many films this month. I have been twice already to the Moxie, and LOVE my experiences. Its so fun to tell my friends from other places that we FINALLY have an independent movie theater with GOOD beer and are getting some culture. finally. did I mention finally?",
      "created_at": "2005-11-02T07:57:58.000Z"
    },
    {
      "author": "michelle",
      "body": "I'm letting some quality folks know that you are hiring. I bet you'll have peeps lining up. Do you?",
      "created_at": "2005-11-02T07:59:44.000Z"
    },
    {
      "author": "Adam",
      "body": "Im only 18! Why can't I work at the Moxie! I would be the coolest kid in town. You should let me work there. I would make cookies and bring them in!",
      "created_at": "2005-11-02T11:15:33.000Z"
    },
    {
      "author": "Caleb",
      "body": "Question: when you guys get two-night classics such as Harold & Maude, Napoleon Dynamite, and Night of the Living Dead, is that a big cost for you? Because I think you should have a weekly night dedicated to showing a classic (or modern classic) film. I suggest a Wes Anderson film for December!",
      "created_at": "2005-11-02T20:28:25.000Z"
    },
    {
      "author": "bjork24",
      "body": "Caleb: Yes, small runs are very expensive. We make little to no money when we show our late night features. The only reason we show them is to try and get new people to the theater. Once they're in, they're hooked!",
      "created_at": "2005-11-02T21:32:25.000Z"
    },
    {
      "author": "Caleb",
      "body": "Darn! I figured as much. Well we greatly appreciate the small ones you do get! ",
      "created_at": "2005-11-02T21:33:47.000Z"
    },
    {
      "author": "erin",
      "body": "oh my. if you had a wes anderson month... i would poo myself.\r\n\r\nhave i mentioned wes and i are to be married?\r\nswoon.",
      "created_at": "2005-11-02T23:24:59.000Z"
    },
    {
      "author": "elliott",
      "body": "i also would like a wes anderson month... ohh rushmore... i love you... \r\n\r\nhave i mentioned that i am erin and wes's child...",
      "created_at": "2005-11-03T02:29:56.000Z"
    },
    {
      "author": "Jordan",
      "body": "I sent an e-mail expressing my interest in Moxie employment... And I haven't heard back.  I find that to be very saddening.  I don't wanna work at the Campbell 16 anymore...\r\n\r\nOh well, a boy can dream.",
      "created_at": "2005-11-03T07:29:03.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Dan, the getting new people hooked thing was definitely working at Night of the Living Dead. It seemed like everyone around me was new to the Moxie and for the most part very impressed.",
      "created_at": "2005-11-03T08:56:18.000Z"
    },
    {
      "author": "Caleb",
      "body": "Dan? Innocent ears? Right...\r\n\r\nI would be interested in working there but only after November 27. I'm only 20. I'll send PeeStrain an e-mail though.\r\n\r\nAre you going to put up a sign in your parking lot this weekend saying \"Moxie Parking Only!\" with the pub crawl going on? And can we buy online tickets for the Halloween party?",
      "created_at": "2005-10-28T05:26:22.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "I assume this means things are going well for you guys. Also, it's never clear to me that that's really you guys' parking lot. In fact, isn't there a sign about monthly parking only? I'm always too scared to park there.",
      "created_at": "2005-10-28T06:39:34.000Z"
    },
    {
      "author": "Rachel",
      "body": "I'm so sad I don't live there. I would SO gladly work for you two...for free popcorn and soda alone.",
      "created_at": "2005-10-28T08:04:31.000Z"
    },
    {
      "author": "Melinda",
      "body": "Peestrains and grizzly poop.  Dang, man, that Timmy Teddy Bear film wrapped my head up and around, so I felt the need to yak at somebody about it, so I went to Well Fed Head Bookstore, and yep, they'd seen it, and we had some eyerolling conversation.  And then, on to the Bodega Bar for a deep breath.  And a chocolate martini.  And I was telling the lovely waitstaff about the movie, and they're gonna come to a show there......  very soon.  They've been meaning to, I mean, hell, it's just a hop and a skip away.\r\n\r\nAnd then I still wasn't done wrapping my head around the hippie freakie fella nature lover (it could get very dangerous here in the grizzly maze), so I went to Patton Alley Pub and met some more folks that are gonna come to the Moxie......... I swear.\r\n\r\nAnd then, there was the jazz at the Brew Co.... Thursday nights are so smooth there.  I think my head has finally wrapped itself up.  Thanks Nicole and Dan for the greatest, ding-dong dangest theatre in the WORLD...... it's a great starting point for a most interesting evening.\r\n",
      "created_at": "2005-10-28T09:39:34.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i would totally work there.. if you could afford me.... alas.. i must keep my current job in order to live my lavish... running around with 5th generation ipods.... lifestyle...\r\ni do have all the qualifications though.. its creepy how you described my halloween costume so well... i hadnt even told anyone about it..\r\nits an old outfit that i used to wear back when my family had our traveling sideshow... but thats a whole other story... id be glad to tell it sometime....",
      "created_at": "2005-10-28T10:19:34.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "I'm over 21 and I love the Moxie and I love getting up infront of people...well, sometimes. Sweeeeeeeeet!\r\n\r\nToo bad I live in a different time zone.",
      "created_at": "2005-10-28T17:57:31.000Z"
    },
    {
      "author": "April",
      "body": "Yes! Yes! No. =( Yes! Yes! Yes!\r\n\r\nDoes one \"no\" disqualify me?  I bet it does.  Shit.  Couldn't someone else do the lifting part?",
      "created_at": "2005-10-28T20:57:57.000Z"
    },
    {
      "author": "April",
      "body": "Ooo!  I'm gonna tell Michael about it.",
      "created_at": "2005-10-28T21:00:38.000Z"
    },
    {
      "author": "erin",
      "body": "curse all you twenty one year olds. curse you!",
      "created_at": "2005-10-28T21:27:45.000Z"
    },
    {
      "author": "Kess",
      "body": "Spooky. I took my \"The Very Best of Cat Stevens\" cd to work with me today. I'm fixin' to pop it in and have a sing along. I wonder if I'll get fired? Good thing The Moxie is hiring.",
      "created_at": "2005-10-28T22:10:56.000Z"
    },
    {
      "author": "Honkey Hero",
      "body": "Does it still pay $50.00 an hour?",
      "created_at": "2005-10-28T22:43:52.000Z"
    },
    {
      "author": "Caleb C.",
      "body": "It WOULD be paying $6.25 an hour minimum (and all jobs for that matter), but thanks to our wonderful Congress we are stuck with $5.15. ",
      "created_at": "2005-10-28T23:12:40.000Z"
    },
    {
      "author": "Andy",
      "body": "Wait, The Moxie has it's own lot???  What?",
      "created_at": "2005-10-29T00:59:25.000Z"
    },
    {
      "author": "matt",
      "body": "Wait, The Moxie has its own Congress?",
      "created_at": "2005-10-29T01:19:52.000Z"
    },
    {
      "author": "Nate",
      "body": "I like the Moxie's lot.  Congress can keep its own Lott.",
      "created_at": "2005-10-29T01:54:29.000Z"
    },
    {
      "author": "Allison",
      "body": "I've never heard of a movie theatre employing only 21+.  Is this common?  Is this because you serve alcohol?",
      "created_at": "2005-10-30T19:32:37.000Z"
    },
    {
      "author": "brian of moore",
      "body": "well who wants to work with a bunch of 18 yr olds running around with all those hormones and fart jokes........ err... jk.. .. okay im not totally kidding.. cause i work with alot of kids that age.. and i know its true :-)",
      "created_at": "2005-10-30T23:02:40.000Z"
    },
    {
      "author": "bjork24",
      "body": "You have to be 21 due to the alcohol sales.",
      "created_at": "2005-10-30T23:04:41.000Z"
    },
    {
      "author": "nicole",
      "body": "Some places get away with 18, but they're the ones with full liquor licenses or have square footage of over 6,000 feet. \r\n\r\nSilly rules.",
      "created_at": "2005-10-31T01:17:37.000Z"
    },
    {
      "author": "Joe",
      "body": "Are you guys going to get the movie 2046?",
      "created_at": "2005-10-31T11:11:28.000Z"
    },
    {
      "author": "Jordan",
      "body": "Moxie?  Hiring?  I can't help but notice my interest has suddenly increased.\r\n\r\nI will investigate further... Oh yes.",
      "created_at": "2005-11-01T01:24:12.000Z"
    },
    {
      "author": "Caleb",
      "body": "Since Happy Endings and Proof open on the same night, which will be the 7:00 show and which the 9:30 show?",
      "created_at": "2005-11-01T03:40:15.000Z"
    },
    {
      "author": "erin",
      "body": "danny-dan, nicolie-cole ....\r\n\r\nther is not 9:15 (or was it normally 9:30) showing of ladies in lavender on wednesday. will there no longer be late showings on wednesday. say it aint so!!",
      "created_at": "2005-11-01T09:05:23.000Z"
    },
    {
      "author": "erin",
      "body": "oh hey! im stupid. i now see whats going on... aristocrats 9:30. i get it.. ignore me and my stupidity please. thank you!",
      "created_at": "2005-11-01T09:06:48.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
