{
  "id": 322,
  "title": "Oh my garsh...",
  "body": "What's that over on the right? Is that... no, it couldn't be! Is that <a href=\"/phlogs/38\">a new phlog</a>! Good gravy, it is!<br/><br/>And on a side note, if you're looking for a good date movie... look no further than LADIES IN LAVENDER. Seriously, if any movie will immediately put your lady in the mood, it's this one. Judy Dench... MEOW... Maggie Smith... HOTTTTT! Seriously though, this film is better than Spanish Fly. I get chills from just touching the film.<br/><br/>If you want a nice night out, come see LADIES IN LAVENDER. If you want to cap off your evening by having sex with the family dog, THE ARISTOCRATS is still playing for another week.<br/><br/>PS - We filled our part-time position. Thank you SOOOOOOO much for all the replies. We'll keep all of your e-mails on record and give you a shout when another opening emerges and/or we need more help for the holidays. I wish we could hire every last one of you, but alas... my ass can only take so much kissing. Thanks again!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-11-03T11:07:57.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "phlogs are soooo in this season<br/>... so this new part timer..<br/>is it a lady? .. can you put in a good word?<br/>nicole.. you do it.. it sounds more reliable coming from a girl<br/>oh.. is it a guy?<br/>well i suppose i could buy him lunch or something...... but no touching!",
      "created_at": "2005-11-03T13:24:27.000Z"
    },
    {
      "author": "NAME!",
      "body": "Was November supposed to be an intentional Gyllenhaal theme month, or was that just an accident? Either way, Jake Gyllenhaal and Maggie Gyllenhaal stand hot on their own. But put them together! In one month! Wow. I think I would watch them make out, even though they're brother and sister. Does that make me incestuous and creepy?",
      "created_at": "2005-11-03T13:27:06.000Z"
    },
    {
      "author": "Fyse",
      "body": "I saw 'Ladies in Lavender' on British TV a while back. 'Tis a damn good film. Those ladies can ACT.",
      "created_at": "2005-11-03T16:08:29.000Z"
    },
    {
      "author": "erin",
      "body": "NAME! : Does that make me incestuous and creepy?<br/><br/><br/>....yes.<br/>: )",
      "created_at": "2005-11-04T05:09:52.000Z"
    },
    {
      "author": "Jordan",
      "body": "Judy Dench, you say?  To be honest, hearing that name isn't the first thing to make me get in line for a film... <br/><br/>But between here and the things I've read on IMDB, I suppose it couldn't hurt to see \"Ladies In Lavender\".<br/><br/>I want to see \"The Aristocrats\" as well, but my friend said some of the bits (namely Eddie Izzard's) fall flat.  I'll probably just end up seeing it for the Bob Saget factor.",
      "created_at": "2005-11-04T11:22:09.000Z"
    },
    {
      "author": "hmmm...",
      "body": "can you please explain to me why you anticipate needing more help for the holidays?  I would have thought that the breaks would be a slower time...",
      "created_at": "2005-11-06T05:56:59.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanksgiving, and the weekend following, is traditionally one of the busiest times of the year for movie theaters. On top of that, some of our regular staff is taking off for several days to spend time with their own families. Therefore...",
      "created_at": "2005-11-06T06:12:22.000Z"
    },
    {
      "author": "erin",
      "body": "has ladies in lavender had a good turnout? i want to see it.. i just dont think i will be able to make it out there before the last showing.",
      "created_at": "2005-11-06T22:29:46.000Z"
    },
    {
      "author": "nicole",
      "body": "Ladies in Lavender has been pretty slow for us. It's enjoyable, but thank goodness for The Aristocrats!",
      "created_at": "2005-11-07T04:31:27.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
