{
  "id": 323,
  "title": "Lovely Lesbians in Liquid",
  "body": "That's what they should've called LADIES IN LAVENDER. Maybe with a title like that we'd be able to get more than FIVE PEOPLE PER SHOW! Come on Springfield and surrounding areas, do you NOT want to see Maggie Smith and Judi Dench pull each others clothes off with their false teeth? Of course you don't! And let me tell you, this movie won't disappoint [*pause*] in NOT showing them naked. If you want to see some gratuitous nudity, give me a 20 dollar bill or offer Nicole anything made with chocolate.<br/><br/>If it weren't for THE ARISTOCRATS, we'd be out of business right now.<br/><br/>Ok, it's not really THAT bad, but isn't it funny how a movie as filthy and obscene as THE ARISTOCRATS is smashing every attendance record we've ever had? And to think, some people thought Springfield couldn't handle a movie like that. I think we should only show NC-17 movies from here on out. Next up, FABIO AND THE FABULOUS <a href=\"http://en.wikipedia.org/wiki/Professional_farter\" target=\"_blank\">FLATULISTS</a>.<br/><br/>Let me tell you something: not being able to serve beer and wine on Sundays is killing, killing, KILLING us! Literally, the ACT of NOT being able to sell on Sundays has transformed itself into a little marshmallow-looking orb that is gnawing on Nicole's leg. Now it's threatening me with the popcorn scoop. \"I'm writing a post on my blog,\" I say.<br/><br/>\"It's about fucking time,\" says the non-beer selling marshmallow.<br/><br/>So, tonight is our first Sunday without a late show. Yippee! We're actually only 15 minutes away from the last movie being over... and it's only 8:30. It's like... amazing, and I bet you're thinking, \"I wonder what Dan and Nicole are going to do with their new found time off?\" Let me tell you: we're going to go see a movie! JARHEAD, to be more specific. We're priming ourselves up for Gyllenhaal week starting on Wednesday (Jake in PROOF and Maggie in HAPPY ENDINGS). Ew-rah!<br/><br/>Ok, it's time to write a quick newsletter before my hands cramp up to the point where I can't type anymore.<br/><br/>More later.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-11-07T07:33:57.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "Wish I could have gone to seen it but I couldn't make it to any of the shows before 8:00 all week and this weekend I've been slammed with huge school projects and tests to study for. I figure November and early December will be slower for you guys in the college student sector. Especially when you show an old woman movie! Just kidding, I'm sure it was good. I WILL be there for Happy Endings though and Proof next weekend. Hope this next week goes better for business!<br/><br/>Jarhead is very good by the way. Don't let the critics fool you.",
      "created_at": "2005-11-07T09:41:49.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "I bet my ancestors were flatulists.",
      "created_at": "2005-11-07T09:57:10.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Since the Moxie has been open I haven't been to the OTHER theatres. Unfortunately you guys didn't get this movie, so I went and saw  \"Good Night, and Good Luck\" somewhere else. AWESOME movie, and not just 'cos I worked in TV for a little under a decade. It's a great movie on so many levels...Well worth dealing with the screaming babies and stupid high school kids.  My apologies to any high school kids who aren't stupid. ",
      "created_at": "2005-11-07T21:03:14.000Z"
    },
    {
      "author": "Jonna",
      "body": "I liked Ladies in Lavender!  I'm still laughing at puppy dog for dinner.  AND I'm looking around for hot violinists.  I don't think there are any in Springfield, though, sadly enough (come on.. prove me wrong!).  wink wink.<br/><br/>Yay for the Gyllenhaals!",
      "created_at": "2005-11-07T22:05:38.000Z"
    },
    {
      "author": "Tomatometer Reader",
      "body": "I can't really say anything about Ladies in Lavender, having not seen it and all, but Rotten Tomatoes only puts it 61% (and only 65% in the \"respectable critics\" column).<br/><br/>That's only two percentage points above \"rotten.\"<br/><br/>Me and You and Everyone We Know got 82% and 85%, The Aristocrats got 80% and 86%, Murderball got 97% and 100%...",
      "created_at": "2005-11-07T22:33:00.000Z"
    },
    {
      "author": "Caleb",
      "body": "You can't always trust the Holy Tomatometer. It works in mysterious ways. For example it is giving Jarhead only 57% which I strongly disagree with. I think the Tomatometer has something up its...stem...as of late. It gave Wedding Crashers a 74%, 40 Year Old Virgin an 84%, and War of the Worlds an unbelievable 72%. So ignore that rotten contraption if you know what's good for you!",
      "created_at": "2005-11-07T23:07:42.000Z"
    },
    {
      "author": "Nate",
      "body": "There's also the the only-critic-that-really-counts column: YOU<br/><br/>So go decide for yourself.<br/><br/>And many people here would gasp (GASP I say!) that Rotten Tomatoes gave Napleon Dynamite a paltry 70%.",
      "created_at": "2005-11-07T23:11:46.000Z"
    },
    {
      "author": "Ian",
      "body": "I meant to stop by when I was downtown earlier to say this:<br/>\"Ladies in Lavender is the only show I _won't_ see, sorry.  AND 9:15 showings on weeknights are KILLING me.  Seriously, a little marshmallow-shaped avatar is gnawing the pillow I left in my bed to fool it into thinking I slept in.  Many of your customers are students who have night classes which don't get out until 9:20 or so.  I've rushed over to y'all several Wednesdays to make a 9:30, but I can't POSSIBLY make 9:15.\"<br/>I must add that 9:15 is okay for the universe on any day other than Monday or Wednesday.",
      "created_at": "2005-11-08T02:48:11.000Z"
    },
    {
      "author": "Caleb",
      "body": "Along with what Ian said, showing your newest release as your earlier show is what made me not go see Ladies in Lavender. I assume this was because you wanted the NC-17 Aristocrats to be shown later but I hope in the future it won't be that way. At least alternate them por favor! ",
      "created_at": "2005-11-08T03:13:07.000Z"
    },
    {
      "author": "nicki",
      "body": "mmmm.... maggie.",
      "created_at": "2005-11-08T07:10:24.000Z"
    },
    {
      "author": "Andy",
      "body": "Jarhead = Pure rock and roll.",
      "created_at": "2005-11-08T09:19:10.000Z"
    },
    {
      "author": "Melinda",
      "body": "I thought that Ladies in Lavender suffered from some editing problems... it seemed like there was something missing.  A bit too sweet for my tastes, but it depends on the day.  I think I must have been in the mood for sex, profanity, and naked people.<br/><br/>I did enjoy the scenery and the violin music.  Joshua Bell was the violinist, and I've seen him perform at Hammons Hall with Bela Fleck.  Mighty fine.  I think he also did the soundtrack for The Red Violin.  ",
      "created_at": "2005-11-10T00:03:40.000Z"
    },
    {
      "author": "Sandi",
      "body": "I saw Ladies in Lavender and I loved it.  It waaaas almost embarassing to watch Ursula make a fool out of herself over that very handsome and Oh so young BOY!  I like movies that make me feel something and that one did.<br/>I am looking forward to Proof and Happy Endings.  See you there!",
      "created_at": "2005-11-10T05:32:29.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
