{
  "id": 324,
  "title": "Matinee Mondays and online ticketing",
  "body": "Two words: MATINEE MONDAY! Amazing. Before tonight, our biggest Monday was last week with 50 people... total. We more than doubled that tonight. Was it just because of MATINEE MONDAY? I doubt it, but I bet that was a big part of it. Most people were just here to catch LADIES IN LAVENDER or THE ARISTOCRATS before they left town. I bet we almost sell out THE ARISTOCRATS tomorrow night. It's going to be crazy.\r\n\r\nOn that note, if you want to buy your tickets up to a week in advance, give this a shot: <a href=\"http://tickets.moxiecinema.com\" class=\"broken\">http://tickets.moxiecinema.com</a>. Here's how it works: (1) go to the online ticketing gateway, (2) click on the movie time you want to purchase, (3) laugh at the hideous payment gateway (note: I didn't build it!), (4) pay for your tickets with your credit card of choice, (5) print out your receipt, (6) bring your credit card with you to the theater, (7) pick up your tickets. It's just that easy. Once you buy your tickets online, they're yours... reserved... set in stone... too legit to quit. Isn't that cool?\r\n\r\nOk, I have to go clean now.\r\n\r\nPS - MATINEE MONDAYS are running for the entire month of November... and if they're all as successful as tonight, they may just run forever.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-11-08T09:55:36.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "i think you mean FOR-EV-ER\r\n\r\nsidenote: sandlot 2 was on tv last night\r\ni saw it while parusing the 'guide'\r\ni didnt dare try to watch any of it\r\ni can only imagine how bad it must be..\r\ni didnt want it to tarnish my memory of the first one",
      "created_at": "2005-11-08T10:12:18.000Z"
    },
    {
      "author": "Jordan",
      "body": "I had my first ever Moxie experience this past Monday at \"The Aristocrats\", and it was a knee-slapping good time.\r\n\r\nGranted, I'm not one to indulge in knee-slapping in a public place, but if I were... I guarantee some knee-slapping would've occurred.  No question about it.\r\n\r\nFrom the look of it, you guys have got some worthwhile stuff in the pipeline, so I plan to return fairly regularly.",
      "created_at": "2005-11-09T16:24:23.000Z"
    },
    {
      "author": "elliott",
      "body": "blog readers... i ask for your help... here is my pickle... \r\n\r\nwe have the chance to vote for our homecoming band, and what not... and one of the options is rufus Wainwright... and it would be awesome if he would come to drury!\r\nthe other, more crappy options are:\r\n\r\nBlake Shelton\r\nNappy Roots\r\nVanessa Carlton\r\nDierks Bentley\r\nMatt Nathanson\r\nDarius Rucker\r\n(Hootie of Hootie and the Blowfish)\r\n\r\nplease give us a hand, stupid kids at drury are voting for dierks bentley... (no offense if you like dierks...)\r\n\r\nbut please have sympathy on us and just vote... you dont need a login or anything... just go here:\r\n\r\nhttp://www.drury.edu/sub/BandPoll.cfm\r\n\r\nit takes 2 minutes... ",
      "created_at": "2005-11-10T01:11:50.000Z"
    },
    {
      "author": "elliott",
      "body": "i didnt know we could use html... here is a  direct link...\r\n\r\n\r\n<a href=\"http://www.drury.edu/sub/BandPoll.cfm\" target=\"_blank\">bring us rufus</a>\r\n\r\nthanks \r\n-el",
      "created_at": "2005-11-10T01:15:51.000Z"
    },
    {
      "author": "Nate",
      "body": "Oh definitely Rufus.  He has a song on the mix CD that came with Nick Hornby's songbook that is just flat out amaaaaazing.\r\n\r\nDarius Rucker has said many times, with a little annoyance, that no member of the band was either Hootie OR the Blowfish.  The name comes from the nicknames of 2 inseparable buddies the band knew in college that had nothing to do with the band itself.  Hootie had big owl like glasses and The Blowfish was kinda chubby.\r\n\r\nAhem.  I have never listened to Hootie and The Blowfish or anything.",
      "created_at": "2005-11-10T02:27:27.000Z"
    },
    {
      "author": "Caleb",
      "body": "If you get Rufus Wainwright that would be awesome. If you get Dierks Bentley I will have a good laugh and then never look respectfully at Drury again. Why is he even an OPTION? ",
      "created_at": "2005-11-10T04:33:28.000Z"
    },
    {
      "author": "nicole",
      "body": "Dan and I saw Rufus in concert a couple years ago and he HATED the Columbia crowd. For some reason, they were really rude (well, one person was rude and talked really loudly during the entire show). But I would be so excited if he came here. He's one of my favorites!\r\n\r\nAnd Proof is really good.",
      "created_at": "2005-11-10T05:34:44.000Z"
    },
    {
      "author": "Lyndsey",
      "body": "I am originally from Dallas and people always ask me what I miss the most about the city. One of my replies has always been \"an independent movie theater\"....I love the Moxie! Thank you Dan and Nicole. I tell everyone how great your place is!! \r\n\r\nI also thought Proof was good.",
      "created_at": "2005-11-10T09:25:33.000Z"
    },
    {
      "author": "mish",
      "body": "ugh. stop spamming the comment board.",
      "created_at": "2005-11-10T09:58:42.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
