{
  "id": 325,
  "title": "PROOF is good... prove me wrong!",
  "body": "It's a shame when good movies are plagued with mediocre reviews. Case in point: PROOF - the movie we just opened. You have a big name director (John Madden), big name actors (Anthony Hopkins, Gwyneth Paltrow, and Jake Gyllenhaal), and a good screen adaption of a prize-winning play. So what's not to like? Personally, I don't know. Nicole and I watched the film today and I enjoyed the hell out of it! I thought the acting was good, the story believable, and the plot twists kept me engaged and guessing to the very end. Honestly, I can't believe that we're the only theater playing it in Springfield. Oh well... their loss, our gain.<br/><br/>Since we're on the topic of reviews and critics, I'd like to toss in a few nuggets of joy. First off, <a href=\"http://www.RottenTomatoes.com\" target=\"_blank\">RottenTomatoes.com</a> and <a href=\"http://www.MetaCritic.com\" target=\"_blank\">MetaCritic.com</a> are great, but they're not infallible. When you're dealing with such a small sample group (say, 50 critics or so), it doesn't take much to skew a percentage in any given direction, which is exactly why the majority of films end up falling in the mid-ranges (50 to 75%). A film can have several supporters, quite a few well-wishers, and only a couple detractors and suddenly find itself in the 60-ish percentile, which is exactly why the system is flawed. No matter how good a film is, there's always that one person who decides to hate it just to be different. \"Man, LORD OF THE RINGS totally sucked. It was completely retarded and stupid and Elijah Woods and that guy from \"Lost\" are total douche plugs.\" It's people like that who skew the percentages towards the middle.<br/><br/>Do yourself a favor and look up the last few films you've seen on your review website of choice. Do they all agree with how you felt about the film? If not, take note of which critics seem to always fall in your corner. I have three critics that act as bellwethers for me: NPR's Kenneth Turan, Slate's David Edelstein, and Chicago's finest, Roger Ebert (say what you will, but the man can rarely be beat... at eating). If I take the scores from these three and average them together, I almost always get a percentage I agree with.<br/><br/>Again, case in point, PROOF:<br/><br/>Roger Ebert = 100<br/>Kenneth Turan = 80<br/>David Edelstein = n/a<br/><br/>My Critic's Percent (M.C.P.) = 90% (and yes, I'd give PROOF a 9 out of 10.)<br/><br/>Now, let's take another movie I recently watched: JARHEAD. If I were to give this movie a concise review, I'd say: \"Following in the footsteps of CONTACT and THE ABYSS, this movie held together up until the end when it collapses in on itself with a sappy, overly dramatic denouement.\" Did I enjoy the film? Yeah, it was alright. I don't regret seeing it, but I doubt I'll be forcing any of my family and friends to catch the next showtime. I'd say my overall feeling about JARHEAD is \"better than average, but the ending ruined it for me.\" Now, let's see how that stacks up with M.C.P.:<br/><br/>Roger Ebert = 88<br/>Kenneth Turan = 50<br/>David Edelstein = 50<br/><br/>My Critic's Percent (M.C.P.) = 63%<br/><br/>And that's pretty much how I felt about the film... 6 out of 10. If the developers of <a href=\"http://www.RottenTomatoes.com\" target=\"_blank\">RottenTomatoes.com</a> or <a href=\"http://www.MetaCritic.com\" target=\"_blank\">MetaCritic.com</a> are reading this, please create a section that will allow users to create and track their own personal M.C.P.! I'm tired of figuring up these numbers in my head... or on a nearby calculator.<br/><br/>Finally, what's up with crappy, and not so crappy movies having one word reviews? I mentioned this in my last newsletter, but since I doubt EVERYONE reads EVERY word of those e-mails, I'll repeat it here... knowing full well that EVERYONE reads EVERY word on this blog. Right. Right? Right?! That's what I thought. Seriously though, could the new ZORRO movie not come up with anything other than \"THRILLING\" and \"RIP-ROARING FUN?\" When I see those short reviews, I immediately think they've been taken out of context. \"Zeta-Jones boobs were the most thrilling part of the movie!\" or \"My friend kept rippin' ass during the movie. I swear, I 'bout shit myself trying not to laugh. It was the most rip-roaring fun we'd had outside of a strip club in years! YEARS!\" -Dingleburt Fistybuns, Butte Bugler.<br/><br/>Intermission is nigh. I best be scootin' on.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-11-10T09:27:09.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nicki",
      "body": "please convince my infamous group of friends that seeing happy endings with their good buddy nicki is far more important than any homework and/or migraine. thank you. :D",
      "created_at": "2005-11-10T10:11:17.000Z"
    },
    {
      "author": "nicole",
      "body": "I saw the first half today and was thoroughly engaged. I can't wait to see how it ends! I hope it has a...happy ending...",
      "created_at": "2005-11-10T10:28:27.000Z"
    },
    {
      "author": "Ole",
      "body": "Drury may not offer good music choices but their presentation of \"Proof\" onstage 1-2 years ago was very good. Is the lead actress still in town or did she go onto bigger/better?  <br/><br/>And Danno - Roger Ebert?  Ewww.  Michael Wilmington does a much better job in Chicago!",
      "created_at": "2005-11-10T10:32:37.000Z"
    },
    {
      "author": "Caleb",
      "body": "Please convince Nicki to not be so anti-social and go to the Moxie without having someone to hold her hand.<br/><br/>I saw Proof at Drury a couple years ago too and greatly enjoyed it...especially the ending. And I highly agree with you pointing out Ebert. He respects great independent filmmaking and  art films while at the same time gives props to movies that while may be asthetically or technically weak, still hold up as entertaining films. I always see what he has to say about a film before seeing it. I find most other critics to be too pretentious most of the time.",
      "created_at": "2005-11-10T11:22:05.000Z"
    },
    {
      "author": "whitty",
      "body": "Timmy and I went to go see a movie that got 3% good reviews on Rotten Tomatoes.  And we looked at RT before we went.  Granted that was before the Moxie came to town.  We'll never stoop that low again.<br/><br/>And 3% was about right.",
      "created_at": "2005-11-10T19:34:11.000Z"
    },
    {
      "author": "Dave",
      "body": "saw this on broadway a few years ago. ann heche and neil patrick harris were in it.<br/><br/>they threw me out cause i kept yelling \"DOOGIE! DOOGIE! DOOGIE!\"",
      "created_at": "2005-11-10T19:42:53.000Z"
    },
    {
      "author": "Observer",
      "body": "Funny that Dave should mention Doogie.  ",
      "created_at": "2005-11-10T21:00:40.000Z"
    },
    {
      "author": "Tomatometer Reader",
      "body": "Wow, I'm flattered to have inspired a whole DanRant® with my noting of Ladies in Lavender getting only a 61/65 Tomatometer rating.  I agree with your top three critics, Dan, but Turan and I don't always get along.  Even with my huge NPR crush.<br/><br/>Anyway, just wanted to point out that Roger Ebert gave Ladies in Lavender thumbs down.<br/><br/>...AND I quote: \"...a very old-fasioned, sort of flat story with these 2 wonderful actresses in it who are not really given anything to engage with, it's just a question of why this movie was made.  They're just isn't an engine to drive us to the end.\"<br/><br/>Still looking forward to getting disappointed by Proof in person, though. Can't wait to hand over some more student loans for The Animation Show and Mirrormask.",
      "created_at": "2005-11-10T21:45:26.000Z"
    },
    {
      "author": "Nate",
      "body": "Lisa Schwarzbaum over at EW.  She rawks.<br/><br/>But not Owen f'in how-many-words-can-I-string-together-with-hyphens-to-create-a-made-up-word-comprising-cobbled-together-adjectives-when-I-should-have-just-used-a-single-word Gleiberman.",
      "created_at": "2005-11-10T21:47:54.000Z"
    },
    {
      "author": "erin",
      "body": "i for one NEVER read reviews. [unless they are caleb's.... but then its too late. because i usually see the movie with him. so thats pointless..]<br/>if a preview looks good ill watch it. its that simple!",
      "created_at": "2005-11-10T22:41:46.000Z"
    },
    {
      "author": "bjork24",
      "body": "TomatoEater, I'm glad you pointed out that Ebert didn't like LADIES IN LAVENDER. In fact, his quote pretty much sums up my feelings about the movie. However, just because I don't like a movie doesn't mean I'm not going to show it at The Moxie. That would be incredibly shortsighted of me. <br/><br/>If I were to take that route and play the tyranical theater owner, you could forget ever seeing any Anime, musicals, or anything featuring Elijah Woods.<br/><br/>But look! Here comes EVERYTHING IS ILLUMINATED! Foiled again!!!<br/><br/>I'm glad we showed LADIES IN LAVENDER, mainly because it brought in a big percentage of new faces who, prior to us having shown the movie, had nothing worth seeing at our theater. They enjoyed the movie and promised to be back. Mission accomplished.<br/><br/>PS - I look forward to taking your student loan money and buying lots and lots of Taco Bell. :)",
      "created_at": "2005-11-10T22:43:31.000Z"
    },
    {
      "author": "Frodo Baggins",
      "body": "What do you have against Elijah, Dan?<br/><br/><img src=\"http://img369.imageshack.us/img369/6530/kevinsincity3rr.jpg\" alt=\"Image Hosted by ImageShack.us\" /><br/><br/>>:) ",
      "created_at": "2005-11-11T00:23:49.000Z"
    },
    {
      "author": "--Jeff",
      "body": " <br/>Good. HTML DOES work in the Comments. :) <br/><br/>I mean, if someone were to hypothetically use HTML to link to a picture, it would work.  Hypothetically speaking, of course.  <br/><br/>DOOGIE!!!!<br/>",
      "created_at": "2005-11-11T00:27:49.000Z"
    },
    {
      "author": "Caleb",
      "body": "Speaking of Elijah, I'll never forget when I was at some really crappy theater on Campbell seeing Sin City and the people behind me said \"it's that kid from Harry Potter!\"",
      "created_at": "2005-11-11T03:25:27.000Z"
    },
    {
      "author": "Andy",
      "body": "I was going to say something about how RT used to have the \"my critics\" section but... I'm too depressed.<br/><br/>Arrested Development was cancelled today.",
      "created_at": "2005-11-11T03:28:23.000Z"
    },
    {
      "author": "nicole",
      "body": "Noooooo....it's all my fault. I haven't had the time to devote to TV this season...I haven't even purchased Season 2 yet...",
      "created_at": "2005-11-11T03:38:21.000Z"
    },
    {
      "author": "nicole",
      "body": "Wait...before I get too upset...are you sure? Because I read Jason Bateman had throat surgery, and they were postponing taping until he recovered...",
      "created_at": "2005-11-11T03:39:24.000Z"
    },
    {
      "author": "Nate",
      "body": "I think it's just temporary for November sweeps.  Doesn't bode well though.<br/><br/>I'm not boding too well either today.  That Steak & Shake has seriously affected my bode.",
      "created_at": "2005-11-11T03:53:55.000Z"
    },
    {
      "author": "Andy",
      "body": "No... they haven't officially cancelled it, but FOX annouced today that production will not resume after Bateman's surgery, and it is being removed from their schedule indefinitly.<br/><br/>So basically, they've got 13 episodes shot, 5 already run.  And it's not above FOX to just say \"screw it\" and put the unaired ones on DVD two years later ie. The Inside and Firefly.<br/><br/>http://www.variety.com/article/VR1117932759?categoryid=14&cs=1&s=h&p=0",
      "created_at": "2005-11-11T04:06:00.000Z"
    },
    {
      "author": "Jonna",
      "body": "But... but I love Arrested Development!  It's been a long time since I laughed as hard as I did Monday night...  I mean.. what with the Mole and Jetpack in Tiny Town..... hahahahahah",
      "created_at": "2005-11-11T05:44:47.000Z"
    },
    {
      "author": "Andy",
      "body": "Mr. F is probably in my top 5 episodes.",
      "created_at": "2005-11-11T07:18:09.000Z"
    },
    {
      "author": "brian of moore",
      "body": "this isnt true...<br/>i refuse to believe it<br/>i havnt bought season 2 yet either.. <br/>its definately on my to do list.. <br/>i love that show.. but never have time to actually watch it<br/>i caught some of the first season.. then just bought it on dvd... caught some of the second.. and knew i would buy it on dvd... and cant seem to catch any episodes that air lately.. so i figured id keep with the dvd set buying pattern<br/>",
      "created_at": "2005-11-11T08:02:30.000Z"
    },
    {
      "author": "evilvet",
      "body": "I'm so vain, I probably think yer blog is about me...<br/><br/>I am one of the fans you mentioned in your previous entry who was lured to your theatre by way of the safer fare of \"Ladies in Lavender.\"  Thoroughly enjoyed myself.  Especially the beer part.  Forget cupholders; you need to dispense igloo coolers filled with ice.  The English spinsters got better looking as the movie went on.  See you at \"Proof\".",
      "created_at": "2005-11-11T23:04:58.000Z"
    },
    {
      "author": "Nate",
      "body": "Arrested Development Bah!  I require polar bears, ex-hobbits, inconsistent character development, and giant, unresolved plot threads with all my television!",
      "created_at": "2005-11-11T23:44:14.000Z"
    },
    {
      "author": "Nate",
      "body": "Oh.  And Cryptic Dialogue.<br/>Can't forget the Cryptic Dialogue.",
      "created_at": "2005-11-11T23:55:46.000Z"
    },
    {
      "author": "Caleb",
      "body": "I'd rather be LOST than ARRESTED!<br/><br/>Just kidding. ",
      "created_at": "2005-11-11T23:57:00.000Z"
    },
    {
      "author": "--Jeff",
      "body": "We know what you watch Nate: :)  <br/><br/><a href=\"http://img52.imageshack.us/my.php?image=boardroom11wm.jpg\" target=\"_blank\"><img src=\"http://img52.imageshack.us/img52/2443/boardroom11wm.th.jpg\" border=\"0\" alt=\"Free Image Hosting at www.ImageShack.us\" /></a>",
      "created_at": "2005-11-12T00:23:47.000Z"
    },
    {
      "author": "--Jeff",
      "body": "AD is good, but <i>Scrubs</i> is still the best show on TV...<br/><br/>",
      "created_at": "2005-11-12T00:41:39.000Z"
    },
    {
      "author": "Derek the local college student",
      "body": "I like Arrested Development, but I have to agree that Scrubs is better. See you tonight :-)",
      "created_at": "2005-11-12T03:42:39.000Z"
    },
    {
      "author": "Jeff, the God of Biscuits",
      "body": "\"Dingleburt Fistybuns\".  An Eddie Izzard reference.  Excellent!  Bring his standup performance films to The Moxie and I'm there.",
      "created_at": "2005-11-12T12:02:24.000Z"
    },
    {
      "author": "Caleb",
      "body": "Future Moxie movie idea:<br/><br/><a href=\"http://www.apple.com/trailers/independent/duanehopwood/trailer/\">Duane Hopwood</a>",
      "created_at": "2005-11-12T13:55:54.000Z"
    },
    {
      "author": "Caleb",
      "body": "Ooh, this one too:<br/><br/><a href=\"http://www.apple.com/trailers/independent/ellieparker/\">Ellie Parker</a>",
      "created_at": "2005-11-12T20:22:02.000Z"
    },
    {
      "author": "The PromoChick",
      "body": "The last article I read in the trades said the net ordered 13 more episodes.  Doesn't look good, but at least there are a few more in the works.  The article I read made no mention of Bateman's surgery. 'Brian of Moore' nailed the problem: the demo this show appeals to is too active to watch it and threrfore, create a blip on the Nielsen meter, or in our case locally, to write it down in a Nielsen diary.  Until there is a better system to calculate TV ratings, shows like this will continue to die on the vine.  Sad but true.      ",
      "created_at": "2005-11-12T23:06:57.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 10,
      "name": "Reviews"
    }
  ]
}
