{
  "id": 327,
  "title": "Frequent flier program",
  "body": "Over the last two months of operation, we've seen a lot of repeat customers. Whether they stop in a couple times per month or several times per week, it's high time we start rewarding their loyalty with a frequent movie-goer program of some sort. We brainstormed several ideas last night, but couldn't come up with a conclusive program.<br/><br/>The premise is simple - nothing out of the norm: if you see nine movies, your tenth one's free... and on the way up the ladder you get a free popcorn after the fourth movie and a free drink after your seventh. Pretty simple, right? Wrong. As with most things \"MOXIE\" we want it to be unique and fun. A punch card is doable, but it's so mundane and easy to fraud. My idea was wooden nickels - you'd receive a special Moxie wooden nickel every time you catch a movie or purchase more than $10 in concessions. Then, like the Kool-Aid stamps of old, you'd bring in your nickels and exchange them for wonderful prizes like movie tickets, popcorn, beer, or a paddle with a rubber ball attached to it. The only problem is that we'd have to buy 10,000 wooden nickels, which aren't cheap... despite what Little Bear Fist told you.<br/><br/>So, let's relive the old days and toss important marketing decisions into the capable arms of the blog readers. What say you, good readership? Can you help us come up with a unique, difficult to fraud, and fun loyalty program?",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-11-16T00:31:55.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "sam",
      "body": "Oh! if you went with the card swipe idea you could also reward people for more than just 10 visits too - at 100 visits you could give them something like 10 free visits, or a moose. And, you could pretty easily build the card swipey thing into this website so people could enter in their card # to see where they stand on number of visits.",
      "created_at": "2005-11-16T19:10:56.000Z"
    },
    {
      "author": "Jessica",
      "body": "Even though I am not as frequent as some customers, given the 900 miles between my home and the Moxie, I still visit enough when I do go home to make a suggestion.  That is keep whatever item the customer is collecting simple. Marbles or wooden nickles are to easily lost and inconvient to carry around when needed. Just think of all the people that lose their keys on a daily bases.  There is no way they could hold on to wooden nickles or marbles.  I like the unique stamp idea. Just one piece of paper to keep track of and it is easy to carry around when needed.",
      "created_at": "2005-11-16T20:07:59.000Z"
    },
    {
      "author": "DUG",
      "body": "Why don't you just print out MOXIE bucks, with your head in Washington's place.  It's been done before, but it would be hard for someone to copy and you could print 10,000 of those if you make them the size of monopoly money",
      "created_at": "2005-11-16T20:58:12.000Z"
    },
    {
      "author": "Laurali",
      "body": "I like the tattoo idea but as often as we go I think I would run out of skin very quickly.<br/><br/>If you don't want to go to the trouble of buying a special stamp perhaps you could print out a card that has ten lines. Each time the person buys a ticket then you or Nicole could initial a line. The tenth line could have a special symbol that indicates the holder receives a free ticket.",
      "created_at": "2005-11-16T22:40:15.000Z"
    },
    {
      "author": "Caleb",
      "body": "I really like the encoded card idea but I have a feeling something like that is more expensive than you might think. Plus that's what Campbell 16 does. Who wants to copy them?!",
      "created_at": "2005-11-16T22:57:36.000Z"
    },
    {
      "author": "evilvet",
      "body": "As a veterinarian, I have access to one of those pet microchippers.  Since your business hours are generally, when I am closed, you are welcome to the chipper and scanner device as long as you return it by 8 the next day.  Perhaps the software could be tweaked to include visitation frequency, beer preference, film snob yes or no, and vaccination status.  It would be a great way to track your clientele, as long as you promise not to sell the information to the government or spam artists.",
      "created_at": "2005-11-17T01:45:20.000Z"
    },
    {
      "author": "Nate",
      "body": "That would be called \"The Ashcroft System.\"",
      "created_at": "2005-11-17T02:04:46.000Z"
    },
    {
      "author": "cockypop",
      "body": "It's expensive yes, but go with the card stripe idea, and you keep track of people's visits for them. (Forget the novelty card punches and marbles, they'll just get lost.)<br/><br/>Imagine walking in to see a movie and every once in a while being told \"By the way, today it's free. Put your wallet away. Enjoy.\" <br/><br/>That's a customer who will walk out of the theatre and have a story to tell 10 other people about their Moxie adventure. Sure it's more work on your end, but it's one hell of a customer experience.",
      "created_at": "2005-11-17T08:30:55.000Z"
    },
    {
      "author": "jeff",
      "body": "I personally like the movie poster idea... reminds me of McDonald's Monopoly game.<br/><br/><br/>...kinda?",
      "created_at": "2005-11-17T13:20:06.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Speaking of Monopoly: Two Words: \"Moxie Bux\"<br/><br/><a href=\"http://imageshack.us\"><img src=\"http://img332.imageshack.us/img332/5733/moxiebux4nj.jpg\" border=\"0\" width=\"278\" alt=\"Image Hosted by ImageShack.us\" /></a><br/><br/>Seriously, have some double sided money printed out (harder to replicate) and give it out with your tickets.  Collect enough money: use it to buy another movie, popcorn, whatever.  Also gives you a chance to put your mug on some moolah. :) ",
      "created_at": "2005-11-17T21:47:24.000Z"
    },
    {
      "author": "Nate",
      "body": "That's your winner, right there.<br/><br/>But do different denominations, with different pictures: Dan, Nicole, Bogey, and highest denomination = Benzo.",
      "created_at": "2005-11-17T21:59:43.000Z"
    },
    {
      "author": "Stevie G",
      "body": "Keep it simple...use a stamp card. You don't need to get too cutesy with this.<br/><br/>Decent quality scanners and printers can replicate just about anything these days. Only Dan, Nicole and their inner Moxie circle would have access to stamps.",
      "created_at": "2005-11-18T03:53:28.000Z"
    },
    {
      "author": "Derek the local college student",
      "body": "What about bringing in our ticket/receipts? You could initial them when they've been used for whatever we can use them to get. That way we could keep our ticket stubs (with official Moxie Dan or Moxie Nicole marks on them, which means they'll be even more valuable), and you won't have huge piles of trash to keep track of. Just a thought.",
      "created_at": "2005-11-16T00:44:53.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "I'm gonna put some ideas out there; if you like them, you can take them, if you don't, send them right back...<br/><br/>A card that is marked with a different speciality stamp for every visit! (Nine stamps in all) The stamps could portray members of the Moxie family, such as you, Nicole, and Benzo.<br/><br/>A Moxie totem pole with tally notches for each person!<br/><br/>A tattoo for each time you visit the Moxie!",
      "created_at": "2005-11-16T01:19:42.000Z"
    },
    {
      "author": "Oz",
      "body": "I never thought about punching holes in those cards myself.  What a BRILLIANT idea!  Or perhaps I'm a daft moron?  Nevermind, I will be getting some free coffee and a free tube of paint very, very soon.",
      "created_at": "2005-11-16T01:54:49.000Z"
    },
    {
      "author": "brian of moore",
      "body": "bwaha.. a tattoo... do it!<br/><br/>actually i like the stamp idea<br/>springfield stamp & engraving is located by kinkos on glenstone... only 5 bucks for a small stamp... of any design you like... so 50 for 10 stamps... surely cheaper than 10000 wooden nickels<br/>match this with a rad looking wallet sized card to stamp.. and it should work beautifully... <br/>now.. its true.. someone could feasibly create their own similar stamps.. but it would cost them 50 bucks too.. so its not likely that they would<br/>actually if you use this method i would VERY MUCH like to discuss it with you in person",
      "created_at": "2005-11-16T02:47:32.000Z"
    },
    {
      "author": "Jamie",
      "body": "I would also suggest punching for every $10 spent at the concession stand.  People might think they are getting more a deal that way.  ",
      "created_at": "2005-11-16T02:55:51.000Z"
    },
    {
      "author": "Jamie",
      "body": "By the way, off topic, but Adam and I put an offer to buy a house.  We find out tonight if they accept or counter.  Go to the website hilgendorfhome.com to see it. ",
      "created_at": "2005-11-16T02:57:55.000Z"
    },
    {
      "author": "Rachel",
      "body": "Something you can buy in bulk...marbles, pop beads..or something more film related like film canisters or popcorn kernals.",
      "created_at": "2005-11-16T03:08:11.000Z"
    },
    {
      "author": "what about",
      "body": "How about if you give a year of free movies to the person who comes the most in 2006?  Don't tell people if they are winning so that lots of people will think they are in the running and come often.  The only thing would be making sure that people don't team up...so just tickts won't work.  You could do gold stars on a wall chart like in 1st grade!?!  I think punch/stamp cards are best b/c I would keep it in my wallet, but a pile of wooden nickles I would probably lose.  Of course, that's less free stuff for you to give away if I lose them, so whatever.  Piercings could work...you could also try rings around necks so that all the Moxie-lovers look like giraffes (like the tribal pics in National Geographic). ",
      "created_at": "2005-11-16T03:43:22.000Z"
    },
    {
      "author": "elliott",
      "body": "you should have a small glass cup for every frequent flyer, and then you break it! and give them a piece of it each time... once they have a full cup, you fill it with somthing... hehe... hard to fraud, but the cut issue makes it tough...<br/><br/>",
      "created_at": "2005-11-16T05:20:12.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "I love the gold star on wall chart idea, although you couldn't do that for every patron. I don't know what the best way to do this is but if it might possibly garner me some free stuff, I'm all for it.",
      "created_at": "2005-11-16T05:41:35.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Actually, why not put in a small tattoo parlor in the back and give everyone a tiny Moxie logo for each movie they attend.",
      "created_at": "2005-11-16T05:42:14.000Z"
    },
    {
      "author": "elliott",
      "body": "agree with the tattoos, or you could BRAND us... for each movie visit...",
      "created_at": "2005-11-16T06:13:28.000Z"
    },
    {
      "author": "Stevie G",
      "body": "I like the stamp idea as well. That was the the first idea I thought of. As convenient as the punch card, but less suseptable to fraud.",
      "created_at": "2005-11-16T07:37:14.000Z"
    },
    {
      "author": "matt",
      "body": "a custom rubber stamp is the way to go.  the cards could be forged, but the stamp would be hard to copy, and it's cheap enough that you could have several.  stampman.com is always my hookup for that sort of thing, and you can get a stamp of any digital image.<br/><br/>you could also have a custom die-cutter made with a special moxie 'M'.  probably a greater up front cost on that, but also too hard to forge to be worth it to anyone.",
      "created_at": "2005-11-16T08:08:04.000Z"
    },
    {
      "author": "Caleb",
      "body": "I like Rachel's idea for marbles. <br/><br/>Although I would probably lose my marbles.<br/><br/>I like the specialty stamp idea. But then I also like the tattoo idea. To present the idea you could screen Memento. If you do the stamps you could just do a single stamp with the capital M of the logo as the stamp. ",
      "created_at": "2005-11-16T09:38:09.000Z"
    },
    {
      "author": "Caleb",
      "body": "...here's another idea. Might be way too complicated. But it's something. All you need is a color printer (or a local Kinko's), some scissors, and a sharpie. Print out very small copies of classic indie movie posters and cut them into nine pieces and number them on the back. When someone tells you they're a frequent flier they would say \"I have pieces 1 through 4\" and you give them piece 5. Once they complete the poster they can bring it in as their movie ticket (can't be used on the night it was completed unless viewing two movies). If you had 100 frequent fliers that's only 50 color prints because you could fit two to a page. And also you could change the movie poster every 6 months or something to encourage them to come often or else they would have to start over when a new poster came out.",
      "created_at": "2005-11-16T09:41:32.000Z"
    },
    {
      "author": "what about",
      "body": "I really like the dye-cut thing...You could get some crazy shape that no one else would have.  Each person could have a jar with their name on it, and when they buy a ticket they spit in the jar. When your jar is full, you get a ticket. Great because it's unique, and also because it rewards people who are extra good at producing saliva.  OH---and it evaporates so you have to go often in a short time period.  :)  ",
      "created_at": "2005-11-16T10:58:21.000Z"
    },
    {
      "author": "what about",
      "body": "Okay, for real...Dan, what is your demographic?  Tell us who goes most often, and who spends the most money when they go??  Then the program can be more targeted and hopefully more successful...",
      "created_at": "2005-11-16T11:03:11.000Z"
    },
    {
      "author": "sam",
      "body": "What about printing Moxie ID cards? Printers that print on magnetic-striped cards aren't really all that expensive and they usually come with software - you've already got a digital camera and a USB magnetic card-swipe reader is very cheap. You could make fancy cards for people that you encode with a special unique identifier and other special Moxie info  - then you'd just swipe them in every time they visit - they wouldn't even have to have a photo on them if you thought that was too labor intensive - you could just pre-print a bunch of moxie cards and hand them out willy-nilly.",
      "created_at": "2005-11-16T19:04:55.000Z"
    },
    {
      "author": "nicholas",
      "body": "Why not hand out a card with a sequential number on it? Like a frequent flier number: a cool card with your own unique identifier. Then when someone buys a ticket, you ask if they have a Moxie Regular card. Plug each visit into an Access database on your computer at the office, and YOU keep track of the data (no way to forge that unless someone breaks in). If you really wanted to get carried away, you could integrate it with the website so people could check out where they stand.",
      "created_at": "2005-11-20T04:38:53.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
