{
  "id": 328,
  "title": "Campbell Sucks-teen",
  "body": "Uh oh. It's a multi-topic post! Buckle in!<br/><br/><b>Imitation is the sincerest form of unoriginal corporate chicanery</b><br/><br/>We just found out last night that Campbell 16 (the largest multiplex in Springfield) suddenly started carrying specialty popcorn seasoning last week. What poseurs! Someone needs to put a few well-placed Moxie stickers over their specialty seasoning shakers. If you decide to spend your multiplex money at Cambpell 16, make it a point to announce loudly: \"Hey! They have specialty popcorn seasoning just like The Moxie! How original!\" Then when you come to see a good movie at The Moxie, make it a point to announce: \"Hey! You have specialty seasoning just like they do at Campbell 16! How original!\" Then make it a point to lower your face so I don't have to kick so high to hit your forehead.<br/><br/>*shakes fist at sky*<br/><br/>Phew. Now that I got that little tantrum out of my system... damn, it feels good to be an innovator.<br/><br/><b>I've got M.U.M.P.S. and I love it!</b><br/><br/>As for the movie rewards system, I'd like to thank you ALL for your input... and I'm happy to announce that we have an idea in place:<br/><br/><b style=\"color: red;\">M</b>oxie's<br/><b style=\"color: red;\">U</b>noriginal<br/><b style=\"color: red;\">M</b>ovie<br/><b style=\"color: red;\">P</b>erks<br/><b style=\"color: red;\">S</b>ystem<br/><br/>Hey! I used the word \"unoriginal\" again! I'm AWESOME! We weighed several factors when deciding which method to use: cost, speed of transaction, non-unoriginality, and the ability to form silly acronyms. A typical transaction will go a little something like this:<br/><br/><b>Nicole:</b> Ok, that's two tickets and a popcorn. Anything else?<br/><b>You:</b> Nope, I think that's it.<br/><b>Nicole:</b> Great. Do you have M.U.M.P.S.?<br/><b>You:</b> Why yes! Yes I do.<br/><b>Nicole:</b> Wonderful. Can I see your M.U.M.P.S. R.A.S.H. (<b style=\"color: red;\">R</b>eally <b style=\"color: red;\">A</b>wesome <b style=\"color: red;\">S</b>tamp <b style=\"color: red;\">H</b>older)?<br/><b>You:</b> You sure can!<br/>(<i>You hand your R.A.S.H. to Nicole and she stamps it with one of several super cool hand-designed stamps</i>)<br/><b>You:</b> Thanks! I love you, Moxie!<br/><br/><b>Nicole:</b> I can help who ever's next.<br/><b>Next:</b> One movie ticket please.<br/><b>Nicole:</b> Do you have M.U.M.P.S.?<br/><b>Next:</b> How did you know?<br/><b>Nicole:</b> Can I see your R.A.S.H.?<br/><b>Next:</b> My rash? You don't get a rash from mumps! It makes your neck and cheeks swell up.<br/><b>Nicole:</b> Dan! I told you that the \"R.A.S.H.\" part didn't make sense!<br/><b>Dan:</b> (<i>to Next</i>) Get the hell out of my theater!<br/><br/>Wasn't that great?! MUMPS RASHes should be appearing shortly, so make sure you're susceptible.<br/><br/><b>An inter-wha? I'm outta here!</b><br/><br/>Strange new trend: people who show up late to movies, and don't get to hear the introduction (when I say \"we have an intermission\"), have been leaving during intermission. A couple ladies did it yesterday during the ENRON documentary, and a few more just did it during THUMBSUCKER. I wonder what their conversations sound like on the way home?<br/><br/><i>Wasn't that a strange little movie?</i><br/><br/>- Indeed. I'm tired of The Moxie always playing 50 minute short films that don't have a conclusion.<br/><br/><i>I know! And what's up with the lack of credits? Do directors not think they need to recognize their film crew? Kids these days... geez!</i><br/><br/>- And did you notice how everyone just sat there once the movie was over? It was like they were waiting for something else! HELLO! The movie's OVER! Grab your things and go, people!<br/><br/><i>Psh! Kids these days... always lollygagging about.</i><br/><br/>That's all.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-11-18T05:10:36.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nicole",
      "body": "To be fair - the two ladies were told. I did the introduction for that show. But the other couple today were not told because they came late and it slipped my mind. I will remember for future customers. <br/><br/>Sorry.",
      "created_at": "2005-11-18T06:08:35.000Z"
    },
    {
      "author": "Ranty McRanterson",
      "body": "All four times I've been to the Moxie, the the lights in the theatre immediately flip on full blast SECOND the end credits start to roll, so I assume that last part of the post wasn't sarcastic.<br/><br/>It's incredibly jarring to watch a good movie end and then be instantly doused with an ice-cold bucket of reality (\"Me and You and Everyone We Know\" in particular).  This is a bad metaphor, but I need to \"wake up\" back into the real world.  To badly paraphrase, David Cronenberg was on Fresh Air a few weeks ago and talked about how the opening credits should act as a transistion between the real world and the world of the cinema.  The end credits let you reflect on what you've just seen while simultaneously allowing for the re-adjusting of your consciousness back to Springfield.<br/><br/>I'm in the minority, I know, but at least the Sucks-teen doesn't turn on the lights full blast until after the credits stop crawling.<br/><br/>If people keep sitting there AFTER the end credits, you can pull a Ferris Bueller, but you wouldn't know what that means since you don't have the patience to sit through credits.",
      "created_at": "2005-11-18T06:29:40.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ranty: valid point, but having worked at a large multiplex that utilizes automation (i.e. Springfield 8 and Campbell 16), I can tell you that the lights do indeed come up when the credits begin to roll. It's a matter of safety, especially since the majority of the audience is standing up and making their way to the exits.<br/><br/>Do the multiplexes turn the lights up full blast at the beginning of the credits? No. It's typically 50% or somewhere there about. But do those multiplexes serve glass bottled beverages or use glasses to serve wine, and do those multiplexes lack cupholders (meaning the majority of the drinks are on the ground), and do those multiplexes only have one (sometimes two) people cleaning the entire auditorium? No.<br/><br/>You win some, you lose some.<br/><br/><i>\"... but you wouldn't know what that means since you don't have the patience to sit through credits.\"</i> That's rather assumptive of you, wouldn't you say? You KNOW what assuming does don't you? It makes an ass out of you and Ming.<br/><br/>On a final note, I'd hardly consider our lights to be \"full blast\" or harsh, seeing as they're barely bright enough to illuminate a speaker when they stand on the stage, but everyone's entitled to his or her own opinion.",
      "created_at": "2005-11-18T07:31:46.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "I sure wish I had mumps... er, M.U.M.P.S.<br/><br/>I probably won't be able to get a R.A.S.H. for a while...",
      "created_at": "2005-11-18T08:02:41.000Z"
    },
    {
      "author": "evilvet",
      "body": "You needn't worry about any other theatre trying to steal your thunder regarding unique snack flavorings.  You were the first and the best.  Now we actually get payback for eating it?  Incredible.<br/><br/>Your idea to acknowledge frequent guests is great.  Thank you.  The M.U.M.P.S. and R.A.S.H. concept is a good one.<br/><br/>I can't wait until that day in the near future where I can actually be rewarded for drinking a beer and digging into a hot,steaming bag overflowing with your famous P.U.S. (Popcorn, Uniquely Seasoned). ",
      "created_at": "2005-11-18T09:03:02.000Z"
    },
    {
      "author": "bjork24",
      "body": "P.U.S. - ha ha! Acronyms are great!",
      "created_at": "2005-11-18T09:04:42.000Z"
    },
    {
      "author": "Andy",
      "body": "It is kind of lame that C16 started offering seasoned popcorn, but, they also have been running a \"frequent flyer\" system for several months now.  I'd say you guys are even.",
      "created_at": "2005-11-18T09:05:36.000Z"
    },
    {
      "author": "Caleb",
      "body": "I have never noticed the lights being anything close to exceedingly bright when they go up at end credits. And Dan's right - when they ARE on full blast it's not even bright enough to see the details of Dan's face as he does the introduction. So we all should be very thankful for the lighting...",
      "created_at": "2005-11-18T09:06:24.000Z"
    },
    {
      "author": "bjork24",
      "body": "Andy: you're right... damn you!",
      "created_at": "2005-11-18T09:07:41.000Z"
    },
    {
      "author": "Caleb",
      "body": "Has anyone encountered the Ticket Nazi at C16? She's short and has short black hair. I handed her my college I.D. and cash for a ticket to an R-rated movie and she asked to see my driver's license. I ask why. She says she needs to make sure I'm over 17. I pointed out that I just handed her my COLLEGE i.d. She says \"you never know with kids these days.\" I gently reminded her that MSU is not Harvard where dorky 15 year olds flock to get ahead in their very unsocial life. She still persisted to see my driver's license. It has happened thrice with the same lady. So watch out for her! Or better yet, AVOID C16 at all costs!<br/><br/>I commend Moxie-goers for keeping quiet during the films (most of the time!). I am a firm believer in the theory that movie-talkers are what's killing Hollywood (as well as less than appealing filmmaking).",
      "created_at": "2005-11-18T10:36:11.000Z"
    },
    {
      "author": "Grey Hodge",
      "body": "You know Dan, about the thing where people miss the intro about there being an intermission. I was thinking if only there was some form of technology where that message could be somehow affixed to a stationary medium, such as a board or paper of somekind, and then this board or paper could be affixed to some type of vertical surface in the theatre or near the doorways, such as a wall. If this kind of signaling technology existed, some type of \"sign\" if you will (as though from the prescient gods of indie cinema) that people could see at all times, as opposed to the fleeting, momentary auditory transmission, this technology may be able to save these poor people's movie going experience. Something like \"All films have a brief intermission, so please don't leave yet! Thanks - Dan the Man\"<br/><br/>Oh, oh, if only such a technology existed... ;)",
      "created_at": "2005-11-18T10:57:43.000Z"
    },
    {
      "author": "Jonna",
      "body": "MUMPS RASH?!?!?!  I knew my incessant nagging would finally pay off!  =)<br/><br/>Dan, I have to hand it to you.  I laughed a lot when I read this post.  If I actually liked the phrase, I would say, \"you're my hero.\"<br/><br/>And....... well, not to sound overly cool or anything, I never did like Campbell 16.",
      "created_at": "2005-11-18T12:29:12.000Z"
    },
    {
      "author": "erin",
      "body": "i LOVE when you flick on the lights. its seriously my favorite part of the film! its when i get to tease caleb about how he is going to be a best boy or key grip somday and have his name in the credits!<br/>yay for lights!!",
      "created_at": "2005-11-18T18:25:20.000Z"
    },
    {
      "author": "Nate",
      "body": "As far as Dan's obscured facial features: that is merely scruff.",
      "created_at": "2005-11-18T19:39:27.000Z"
    },
    {
      "author": "Responding Ranty",
      "body": "And Ranty, a bit of 'big picture' is in order.  The Moxie is a small, single screen theatre, with a tiny staff, and what I'm assuming is even tinier profit margins (you have seen the pre-show slide about Please Visit the Cinebar Because the Studios Take All Our Money, right?)<br/>So, it's simple market economics.  You can have your ten minutes in darkened peace, if you like, which will either mean adding another staffer to clean the auditorium (a staffer who wouldn't have much to do in between), which will entail raising ticket costs, or concession costs, OR it means that the Moxie adds more time between shows, which means fewer showings, which is bad for us the audience, and is also less revenue for the theatre, which isn't good for us either since we're all so thrilled it's frickin' here in the first place.<br/>I could go on, but you see my point.  Everything has a cost, a give and take, an ebb and flow, rivers and tides, a yin yang, a...I believe I may break into song!",
      "created_at": "2005-11-18T19:46:28.000Z"
    },
    {
      "author": "L-O-L-A Lola",
      "body": "A friend of a friend works at C16 and that person said that C16 is taking out a theater or two to make other theaters larger, replacing their seats and.....wait for it.....putting in a wine bar.  Now this is totally second hand rumor.",
      "created_at": "2005-11-18T20:31:08.000Z"
    },
    {
      "author": "Ranty McRanterson",
      "body": "Having sat through a number of credit sequences at the sucks-teen, I know (and so do Dan & Nicole) that three, MAYBE four people clean all 3,500 seats--which is still a larger workload than a measly (yet awesome) nine rows of only eight or nine seats each.<br/><br/>Besides, the only movies that have credits as long as \"ten minutes\" are ginormous Hollywood blockbuster crap that the Moxie would thankfully never show.  Time some indie credits and you'll see the only thing long is the \"special thanks\" section.<br/><br/>How 'bout a compromise?  Gimmie 5 seconds of stretching in 50% light to let my irises open up a little before turning on the relative floodlights.  Then the Moxie would be PERFECT IN EVERY CONCEIVABLE WAY CAUSE THE MOXIE IS TURBO RADICAL TO THE MAX!!!!",
      "created_at": "2005-11-18T20:39:11.000Z"
    },
    {
      "author": "Responding Ranty",
      "body": "They don't clean all 3,500 at once, in five minutes.  I assume that's staggered.  <br/><br/>And saying they \"clean\" them is a stretch.<br/><br/>And they seem to have pretty exacting standards at the Moxie.  I've never put my feet into a sticky puddle beneath my chair there.  To illustrate this point further, compare the bathrooms.",
      "created_at": "2005-11-18T20:46:26.000Z"
    },
    {
      "author": "brian of moore",
      "body": "you know what i dont like<br/>... people that wear sunglasses<br/>... now.. i realize this is about 99 percent of you.. .. so im sorry if it hurts your feelings that i dont like you... but i dont... <br/>i just dont get it... i dont understand the need for them... what? you need them when the sun is bright?... well dont look directly at it...... what else do you need... are you really that lazy that you cant bare to move your head or eyes slightly so as not to burn your retinas?<br/>what is it that your hiding!?",
      "created_at": "2005-11-18T23:18:03.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<b>L-O-L-A Lola says:</b><br/><i>A friend of a friend works at C16 and that person said that C16 is taking out a theater or two to make other theaters larger, replacing their seats and.....wait for it.....putting in a wine bar. Now this is totally second hand rumor.</i><br/><br/>You know, this doesn't bother me, and here's why:  <br/><br/>Yeah, I can drink an Adult Beverage at the Moxie. Great. Been doing that since I was twenty-one, so it's not that big of a deal for me, really. The <i><b>real</i></b> reason I go to the Moxie: to see movies that the Sucks-Teen will never show, and to see those movies in an environment where there aren't crying babies, immature teenagers, and Chatty Cathys. Bottom line.  The flavored popcorn, the awesome beer, cleaner bathrooms:  That's all icing.   <br/><br/>Oh, and the owners kick ass. That's kinda important too.  I don't think the Sucks-Teen owners care about me or my thoughts about their crummy theatre... ",
      "created_at": "2005-11-19T00:29:33.000Z"
    },
    {
      "author": "Caleb",
      "body": "People without eye problems just don't understand...",
      "created_at": "2005-11-19T00:31:03.000Z"
    },
    {
      "author": "i'll wear 'em if i wanna",
      "body": "apparently people without eye problems are ridiculous.",
      "created_at": "2005-11-19T01:01:41.000Z"
    },
    {
      "author": "bjork24",
      "body": "My eyes are super sensitive to sunlight. I can go outside without sunglasses, but I have to constantly squint and hold my hand over my eyes, which causes me to run into things like street cleaners, light posts, hotdog vendors, and the occasional vagrant.",
      "created_at": "2005-11-19T01:06:41.000Z"
    },
    {
      "author": "Cyclops",
      "body": "I wear sunglasses because if I don't, I'll burn a softball sized hole through my girlfriend's head whenever I look at her.<br/><br/>You non-mutants should stop bitching about your little non-mutant problems.",
      "created_at": "2005-11-19T01:11:13.000Z"
    },
    {
      "author": "Bono",
      "body": "Me?  Well, let's see: I'm the world's greatest rock star.  I have several multi-platinum albums under my belt.  I sang \"One.\"  I meet with world leaders and was briefly considered for ambassador to the U.N.<br/>I'll wear whatever the hell I want, thank you.<br/>However, I need a new pair of sunglasses, a particular, hard to find style.  I've searched high and low, but...I still haven't found what I'm looking for.",
      "created_at": "2005-11-19T01:14:54.000Z"
    },
    {
      "author": "Bono",
      "body": "Also, Dan, if you find yourself squinting and running into streetsigns, you should move to a place, a certain kind of place...a place where the streets have no name.",
      "created_at": "2005-11-19T01:16:32.000Z"
    },
    {
      "author": "Bono",
      "body": "Job position: <br/>I have this ranch out West where I take in mustangs from the range and try to break them.  Well, I don't personally; I pay people to do that, but I had a guy who recently injured himself by falling off of a particularly unruly stud.  So I now need to replace him.  So I will post it here first, before I head on over to Monster.com.  I ask you, Moxie readers, Who's Going to Ride My Wild Horses?",
      "created_at": "2005-11-19T01:19:59.000Z"
    },
    {
      "author": "nicole",
      "body": "Oh Bono. <br/><br/>",
      "created_at": "2005-11-19T01:22:38.000Z"
    },
    {
      "author": "Laurali",
      "body": "Nicole: You guys...you lollygag into the theater. You lollygag out of the theater. You lollygag to and from the cinebar. Do you know what that makes you? Dan?<br/><br/>Dan: Lollygaggers!<br/><br/>Nicole: Lollygaggers.",
      "created_at": "2005-11-19T01:25:48.000Z"
    },
    {
      "author": "--Corey Hart",
      "body": "I wear my sunglasses at night<br/>So I can, so I can<br/>Watch you weave, then breath your story lines.<br/>",
      "created_at": "2005-11-19T03:24:03.000Z"
    },
    {
      "author": "brian of moore",
      "body": "see... 99%<br/>.. you kids these days.. you have it so easy... with your *sunglasses*.. and your *indie movie theaters*.. your lazy! thats what i say... ",
      "created_at": "2005-11-19T03:50:48.000Z"
    },
    {
      "author": "nicole",
      "body": "I'm completely lost here.",
      "created_at": "2005-11-19T04:01:35.000Z"
    },
    {
      "author": "Rachel",
      "body": "You know what's great? I think I already pulled a \"Look! They have that at the Moxie!\" when I saw the flavored popcorn stuff at the Sucks-Teen. I was unaware that this was a take-home assignment, but hey -- mission completed.",
      "created_at": "2005-11-19T07:55:07.000Z"
    },
    {
      "author": "goodesquire",
      "body": "Dan and Nicole:  Would you please consider reserving the back row for people who want to make out during the movie?   ",
      "created_at": "2005-11-19T22:18:37.000Z"
    },
    {
      "author": "threadkiller",
      "body": "Good idea; alcohol plus corporate greed makes me randy.  No, I'm not a lawyer.",
      "created_at": "2005-11-19T22:32:58.000Z"
    },
    {
      "author": "Anonymous",
      "body": "Anonymous posters are annoying.",
      "created_at": "2005-11-20T00:14:40.000Z"
    },
    {
      "author": "Jordan",
      "body": "Yeah... I work as an Usher at the Campbell 16 - and I thought the same thing.  \"Why are they copying the Moxie?\"<br/><br/>But, get this - I've also heard they've got plans to start serving beer and other such alcoholic beverages.<br/><br/>Give me some stickers, though, and I'm sure I can make some magic happen.<br/><br/>I also find it strange that we're playing stuff like \"Good Night, And Good Luck\" there, right next door to movies like \"Saw 2\".<br/><br/>But yeah, the fact that they're changing up their policies to compete with you guys actually says a lot about the quality of your place.",
      "created_at": "2005-11-22T22:48:43.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
