{
  "id": 329,
  "title": "Perks of the job... literally",
  "body": "I was just outside changing the showtimes for tomorrow's movie on our marquee, right. As per usual, I was engrossed in the act of carefully suctioning each number with my enormous 18 foot suction cup pole when I heard the unmistakable mummerings of a group of drunken girls.\r\n\r\n\"Hey dude!\"\r\n\r\nI turned to see who was yelling at me, and there, only 5 feet away from me, was a drunk girl flashing her boobs at me. I tried to say something, but, like most guys, I just stood there, pole in hand, and stared at the girl's tatas. This continued for a good 8 or 9 minutes until she pulled her shirt up and said:\r\n\r\n\"Cheap thrill, huh!\"\r\n\r\nI nodded my head, and just as quickly as it had happened, it was over. The girl walked away, found her car, took off her pants and her underwear, threw on a pair of pajama bottoms, got into her car, and disappeared into the night.\r\n\r\nI hope this becomes a nightly occurrence.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-11-20T10:17:10.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "stood there... 'pole in hand'  \r\n\r\n...... ahh comedy\r\ni think thats more along the lines of 'perks of havinga business downtown that stays open late'",
      "created_at": "2005-11-20T10:34:24.000Z"
    },
    {
      "author": "Caleb",
      "body": "I guess she got in her pajamas before she left in case she forgot to when she got home?\r\n\r\nBy the way...if you ever need me to change the sign for you late at night when those drunk girls are roaming the streets I'm sure I could be available.",
      "created_at": "2005-11-20T10:57:57.000Z"
    },
    {
      "author": "erin",
      "body": "oh my sweet lord. im sorry dan. i was so so drunk. i didnt realize.... \r\n\r\nthats not funny. not at all.\r\n\r\nummm.\r\n\r\ndont you think its torchure to not tell us the next months movies until so late in the month? its really crule. i mean.... i have NO idea whats opening on the 7th of december. NO FRICKIN IDEA .... and its killing me.",
      "created_at": "2005-11-20T19:38:25.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<b>brian of moore says:</b>\r\n\r\n<i>stood there... 'pole in hand'</i> \r\n\r\nI saw this too, and couldn't stop laughing.  You owe me a new keyboard, Dan. \r\n\r\n",
      "created_at": "2005-11-20T19:42:45.000Z"
    },
    {
      "author": "--Jeff",
      "body": "She was probably waiting for you to throw some beads. \r\n\r\n",
      "created_at": "2005-11-20T19:46:45.000Z"
    },
    {
      "author": "Zach",
      "body": "Sounds romantic",
      "created_at": "2005-11-21T00:55:05.000Z"
    },
    {
      "author": "--Jeff",
      "body": "You know, the more I think about this, no one was there to confirm this awesomely cool \"story.\"  Nicole was suspiciously \"gone\" last night. We know you have a camera, yet we have no photographic proof of the \"alleged\" incident.   \r\n\r\nI call shenanigans.  \r\n\r\nFess up, Dan.  Or, as an Enron Exec would say: \"Ask Why.\" :)  \r\n",
      "created_at": "2005-11-21T01:36:59.000Z"
    },
    {
      "author": "Derek the local college student",
      "body": ".........................",
      "created_at": "2005-11-21T03:05:20.000Z"
    },
    {
      "author": "nathan springer",
      "body": "why is there no phlog for this?",
      "created_at": "2005-11-21T04:38:41.000Z"
    },
    {
      "author": "Al",
      "body": "Damn college girls.\r\n\r\nSo...what'd ya think?",
      "created_at": "2005-11-21T07:11:00.000Z"
    },
    {
      "author": "Grey Hodge",
      "body": "If Dan was lying about this, he would have lied about himself having a witty retort or a snappy comment. Since he was honest about being dumbfounded by a free show, he's probably telling the truth. Men + breasts == deer + headlights. Only in fiction is that not true.",
      "created_at": "2005-11-21T12:30:48.000Z"
    },
    {
      "author": "Nate",
      "body": "I do like me some tatas.",
      "created_at": "2005-11-21T20:30:19.000Z"
    },
    {
      "author": "evilvet",
      "body": "I remember when I was young, all the brand new fancy theatres would announce their presence by shining a couple of huge spotlights heavenward. Congratulations, you've arrived indeed.",
      "created_at": "2005-11-21T20:48:49.000Z"
    },
    {
      "author": "matt",
      "body": "for a second there i was wondering why she was trying to serve tapas in the middle of the night...",
      "created_at": "2005-11-22T02:38:37.000Z"
    },
    {
      "author": "Ian",
      "body": "Zomg.  Next time I see you you're getting a high five.",
      "created_at": "2005-11-22T22:15:15.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "Awesome! Congrats on the cheap thrill ;)",
      "created_at": "2005-11-23T01:37:17.000Z"
    },
    {
      "author": "Nate",
      "body": "Did I say I like me some tatas?",
      "created_at": "2005-11-23T03:04:41.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
