{
  "id": 33,
  "title": "Must work faster",
  "body": "It's looks as though the battle lines are being drawn. In the first corner, wearing tails and frilly lace, we have the <b>Criterion Crew</b> [ applause ], and in the second corner, wearing a denim jacket and a half scowl / half smirk, we have the <b>Moxie Mob</b> [ applause ]. To commemorate this epic battle, I had initially planned on unveiling a nice, little flash movie that highlighted some of the pros and cons of each side's stance. Unfortunately, due to my compulsive perfectionism, I was unable to finish it, which leaves me with a lot of nothing to say.<br/><br/>This post was only supposed to be a couple sentences long... you know, something like:<br/><br/>\"Hey everyone, I just spent the last 3 hours building this AMAZING flash movie that depicts the epic battle currently waging betwixt our potential theater names. I'd really be tickled if you'd <a href=\"#\" onClick=\"alert('Alas, this is only an imaginary link. Had I only worked faster this link would\\'ve pulled up a fantasitic movie to dazzle your eyes... but not your ears, because sound files eat up too much bandwidth. You know how it goes. *sigh*'); return false;\">take a look</a>. Thanks. Bye!\"<br/><br/>Now I don't know what to say. It's like that awkward moment on a first date when you pull up to your favorite restaurant only to find that it's closed for the evening due to a power outage, and your fly is undone. \"Thanks power outage,\"  you would most likely say. \"Thanks a lot.\"<br/><br/>I often wonder if this blog would make a good book someday... like a beginner's guide to starting your own art-house cinema (unabridged). Thankfully, it's posts like these that keep me head out of the clouds and my grammar sounding like that of a pirate. In parting, I'd like to leave you with a haiku that I'm going to make up as I type.<br/><br/><i>meandering post<br/>about art-house cinema<br/>ends with a haiku</I><br/><br/>No, that was too literal. Let me try again.<br/><br/><i>damn huge popcorn bags<br/>tempting all with its hugeness<br/>Nicole lifts her hand</i><br/><br/>Feel free to leave your comments, if any, in the form of a haiku.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-07-08T06:54:44.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "sara",
      "body": "where is the butter<br/>too many choices await<br/>red sea, cushy seats",
      "created_at": "2004-07-08T10:13:27.000Z"
    },
    {
      "author": "Gern C. Branston",
      "body": "All I need to know is: Will you be offering Jujyfruits?",
      "created_at": "2004-07-08T17:19:18.000Z"
    },
    {
      "author": "bjork24",
      "body": "jujy fruits are good<br/>pulling the fillings off teeth<br/>offer them we must",
      "created_at": "2004-07-08T17:35:23.000Z"
    },
    {
      "author": "Brandon Smith",
      "body": "lab work is boring<br/>chemical engineering<br/>while still in high school<br/><br/>see, smart folks like you.<br/>(usually haiku in threes<br/>this one is filler)<br/><br/>dont care about name<br/>i'd visit you anyway<br/>sure most feel the same",
      "created_at": "2004-07-08T21:04:07.000Z"
    },
    {
      "author": "WhimsyChick aka Isuckathaiku",
      "body": "I suck at haiku<br/>but Dan makes me laugh a lot<br/>so I will attempt<br/><br/>laugh at \"take a look\"<br/>laughing still at this whole post<br/>still suck at haiku<br/><br/>my attempt was made<br/>you always have my support<br/>comment makes no sense.",
      "created_at": "2004-07-08T21:12:47.000Z"
    },
    {
      "author": "elspeth",
      "body": "Bright groovy neon<br/>Beacon in the urban night<br/>Moxie, Moxie, Mox...",
      "created_at": "2004-07-08T21:44:30.000Z"
    },
    {
      "author": "bjork24",
      "body": "great comments thus far<br/>just got back from birthday lunch<br/>stomach is bloated",
      "created_at": "2004-07-08T21:55:38.000Z"
    },
    {
      "author": "coco",
      "body": "I can reed and right<br/>pay bills with my master card<br/>and sing the blues too",
      "created_at": "2004-07-08T21:58:04.000Z"
    },
    {
      "author": "J.W.Y. Latt",
      "body": "My fly is always<br/>down; the restaurant is closed<br/>for good. Think I'll score?",
      "created_at": "2004-07-09T03:57:01.000Z"
    },
    {
      "author": "anonymous",
      "body": "the mox (or crit) makes<br/>naught as long as it is dark<br/>to fool around, yes?<br/><br/>fire-bright marquee flash,<br/>cool cavern art-show motion,<br/>applause, drinks, and talk.<br/><br/>success, respect, funds,<br/>and something that instills pride.<br/>it's not in the name.",
      "created_at": "2004-07-09T06:57:23.000Z"
    },
    {
      "author": "Oz",
      "body": "Art house theater<br/>What oh what will your name be?<br/>Confusion settles",
      "created_at": "2004-07-09T20:48:27.000Z"
    },
    {
      "author": "Mr.T the Messiah",
      "body": "A good haiku must have a reference to nature, see if you can spot it:<br/><br/>Multiplex popcorn<br/>Makes breath and farts smell bad<br/>and leaves crumbs in groin<br/><br/>Geddit? Leaves, anyone? Anyone?",
      "created_at": "2004-07-11T04:42:19.000Z"
    },
    {
      "author": "mumzii",
      "body": "freedom to create<br/>take the world by happy storm<br/>warm, giggling raindrops",
      "created_at": "2004-07-13T16:32:26.000Z"
    },
    {
      "author": "é›ªæµª",
      "body": "èƒ½å¸®æˆ‘æ³¨å†Œä¸€ä¸ªGmailå—?è°¢è°¢<br/>æˆ‘ä¹Ÿéžå¸¸æƒ³ä¸Žä½ æˆä¸ºæœ‹å‹!",
      "created_at": "2004-07-21T01:21:25.000Z"
    },
    {
      "author": "Club Raisins",
      "body": "Funny website! PLease visit ours!",
      "created_at": "2004-07-23T22:01:35.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
