{
  "id": 330,
  "title": "Tired of seeing boobs",
  "body": "Two stories are coming out about this blog - one in GO! Magazine and one in 417 Magazine - so I thought it was time to make a new post. I wouldn't want a casual observer to think ALL of my posts were about girls flashing me... although it does happen... a lot. Seriously.\r\n\r\nSo anyways, GO! Magazine just wrote a stellar article on how this is probably the coolest blog on the face of the entire planet. However, I warned them that they shouldn't make such grandiose assumptions. \"While it may be true that my blog is the coolest on the face of the planet, I know of several others that are quite popular on the planet's other body parts.\" Boo yah! That was awesomely lame!\r\n\r\nAnyways, in all seriousness, GO! Magazine wanted a picture of me to accompany their story. I suggested they follow me around for a day and grab some pictures that portray me in an advantageous light. They took several shots of me rescuing a cat from a tree, directing traffic, and cleaning litter from Jordan Creek (the bar, not the actual creek). Unfortunately, all the shots were ruined thanks to the sporadic boob flashing that has become an hourly occurance for me. \"Don't worry,\" I said. \"I'll go home and take a few shots of myself.\" And so I did. Here they are:\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/112305/dan01_blog.jpg\" width=\"425\" />\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/112305/dan02_blog.jpg\" width=\"425\" />\r\n\r\nAfter staring at the pictures for hours on end, the editorial staff decided to use the most realistic of the two: the one of me on the beach with Benzo flashing the camera from atop my blazingly fast C64. Thank you GO! Magazine. You guys are AWESOME!\r\n\r\nIn other news, The Moxie just celebrated its TWO MONTH ANNIVERSARY on Monday. Woo hoo! Also, tomorrow is our first day off... since September 21st. That's 64 days without a break. Can you belive it? I can't. I seriously can't. It's un-freakin'-believable.\r\n\r\nOk, gotta run. A film's just about ready to let out.\r\n\r\nPS - We have a lot of great films coming up in December!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-11-24T06:16:19.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "erin",
      "body": "you know the origional bill gates picture....\r\ni totally thought he was foxy in it.\r\nbut damn dan....\r\nbill has NOTHING on you.\r\n\r\nhaahaa",
      "created_at": "2005-11-24T08:18:44.000Z"
    },
    {
      "author": "brian of moore",
      "body": "yups.. the bill gates one is just as hilariously sad/funny as that version\r\n\r\nso was there a big crowd at the opening of the animations?  did i mention i whored the walls with flyers in the smsu animation lab?.. i did? did i mention they now have it posted on the <a href=\"http://art-design.missouristate.edu/animation/home/\">animation website</a>  ... did i mention they update that like.. once every year? .. okay maybe per semester.. anyway i was surprised to see it listed on there\r\n\r\nno no... you dont have to praise me.. i was in the neighborhood... ... oh stop.. seriously im blushing.. ... youre welcome :-)",
      "created_at": "2005-11-24T10:12:41.000Z"
    },
    {
      "author": "Caleb",
      "body": "Everyone should go see Everything is Illuminated. It is GREAT!! ",
      "created_at": "2005-11-24T11:45:52.000Z"
    },
    {
      "author": "Jordan",
      "body": "Fab.  Almost... TOO fab.",
      "created_at": "2005-11-24T14:21:47.000Z"
    },
    {
      "author": "Derek the local college student",
      "body": "Yeah, Brian, I sat in your seat at the first showing of The Animation Show. Oh, didn't I mention? I <i>always</i> sit in your seat at The Moxie. Hehehe. Yeah, sucker. Anyway, Dan, I've decided to bring $20 next time I go so I can see just how realistic that shot of your sexy body really is ;-)",
      "created_at": "2005-11-24T23:11:55.000Z"
    },
    {
      "author": "erin",
      "body": "i always try to sit in brians seat too. its a good seat isnt it?!",
      "created_at": "2005-11-25T06:24:58.000Z"
    },
    {
      "author": "brian of moore",
      "body": "... i wish i could remember what it was like to sit there... its been far too long since ive had the chance.. seems the seat has been taken the last like 5 or 6 times ive went\r\n\r\nwell at least you kids get to enjoy it",
      "created_at": "2005-11-25T11:17:56.000Z"
    },
    {
      "author": "nicki",
      "body": "i heard a spot on 105.1(i think that's it... hard to remember when my drive to work lasts 1.5 minutes and i'm channel surfing that entire time) this morning about the moxie. yes'sir! 'twas about flying tiger (i think that be what it's called, right) \r\n\r\nanyway, i was excited!",
      "created_at": "2005-11-26T06:42:00.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Didja catch KY3's live shot from the side entrance yesterday (in the first segment, no less)?! YAY!\r\n\r\nI know for a fact they have a few Moxie fans who work there, though... *wink**wink* \r\n",
      "created_at": "2005-11-26T21:03:41.000Z"
    },
    {
      "author": "erin",
      "body": "i hear it was sold out last night. awsome!\r\n\r\nright after i tell nicole how my parents never will watch semi-indie films with me... they are going to try to go to tonights showing of flying tiger. WITHOUT me... what crap.",
      "created_at": "2005-11-26T21:35:09.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yesterday's show was sold out. Today's 11:30 show was sold out, and the 7:00 is super close to being sold out... and it's only 1:00! If you want tickets, I'd suggest buying them ASAP.",
      "created_at": "2005-11-26T23:57:13.000Z"
    },
    {
      "author": "Nate",
      "body": "To think that Tigers used to only crouch in art films.  They fly too!\r\n",
      "created_at": "2005-11-27T04:04:02.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
