{
  "id": 331,
  "title": "The Moxie is haunted",
  "body": "Recent events have led us to believe that The Moxie is haunted... by a phantom smell. In the back of the building, near what used to be the men's restroom, there is an unusual scent that keeps moving around. At first we thought it was natural gas (from my friend's butt), then we thought it was the other kind of natural gas, then we thought it was a leaky pipe, then we thought it was the water cooler, then the fire extinguisher, then the curtains above the restroom, then the ventilation system. Every suggestion led to a dead-end. No one can seem to pinpoint where the smell is coming from! One minute it's in the hallway, the next it's in the back of the Cinebar. I think it's a ghost of some sort. A very smelly, yet strikingly sensual, ghost.<br/><br/>On a completely different subject, we just started our final showing of FLYING TIGER - the film that was made in Stockton, MO (a little lake town about an hour South of Springfield). Three sold out shows in a row... INSANE! You'd be surprised how mean people can be when they find out a show is sold out. One gentleman, a law officer (complete with uniform), told us that he was surprised we could even stay open with so few seats. He was flippin' mad! We tried to explain to people that we could only show the film three times, due to the fact that FLYING TIGER was still on the festival circuit, but they didn't care. They wanted our blood; they wanted our first seven children; they wanted us to construct an additional auditorium for them to sit in; and, most disturbingly, they wanted the singing deer head that I bought myself at Wal-Mart. They were unrelenting, I tells ya! UN-RE-LENT-ING!<br/><br/>Both of the films in our \"Local Film Series\" have sold out. ROCK N' ROLL SPACE PATROL packed the house, and so did FLYING TIGER... thanks in large part to the promotional efforts of the respective film-makers. Is film-maker hyphenated? It seems weird having two \"m\"'s right on top of each other without some sort of protection. It's just not right... immoral even.<br/><br/>I don't know what I'm saying anymore. I better go.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-11-27T06:48:47.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "what you need is a basement... yes.. dig a basement.. dig TWO basements! two levels underground.. with two more screens!.. and then i can talk about how i saw some scary movie.. 20 feet below the moxie<br/><br/>..... yeah im not sure what im talking about either<br/>.. at least the smell would probably move to the bottom basement... ghosts like basements",
      "created_at": "2005-11-27T08:17:24.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<br/>If you have a ghost or a phantom, you need to appease it or something.  Have a special showing of...I dunno... <i>Ghostbusters</i>?  What would a foul smelling ghost want to watch, Ben Affleck movies aside? <i>Affleck, you the <b>bomb</b> in Phantoms yo!</i> <br/> ",
      "created_at": "2005-11-27T08:37:10.000Z"
    },
    {
      "author": "Matthew Martin (aka R.J. Jack MacReady Burton)",
      "body": "That's probably why I felt kind of lightheaded during Friday night's screening of \"The Animation Show\" (kind of smelled like cigarettes).",
      "created_at": "2005-11-27T09:50:35.000Z"
    },
    {
      "author": "mish",
      "body": "\"Is film-maker hyphenated? It seems weird having two \"m\"'s right on top of each other without some sort of protection. It's just not right... immoral even.\"<br/><br/>LOL",
      "created_at": "2005-11-27T09:55:50.000Z"
    },
    {
      "author": "duanekeys",
      "body": "I would say stockton is more North, than South of Springfield.  <br/><br/>Congrats on selling out, again.  Sounds like everything is going pretty well!",
      "created_at": "2005-11-28T00:01:44.000Z"
    },
    {
      "author": "Caleb",
      "body": "The smell returned?! That was the smell of Death! I think Death is paying a visit to the Moxie! Perhaps he just wanted to see The Animation Show.",
      "created_at": "2005-11-28T02:23:13.000Z"
    },
    {
      "author": "Mr. Wally",
      "body": "I think that assistant managers from Campbell Sucks-teen are sneaking in and planting dead rodents in the crawl spaces of the building.  And since they'd have to buy a ticket to get in that far, my guess is that they're the ones leaving at the intermission so as to avoid capture.<br/>Maybe.",
      "created_at": "2005-11-28T06:45:18.000Z"
    },
    {
      "author": "Jess",
      "body": "The double M joke was great...I read it twice and both times I let out a little giggle.  Nothing like a good double M joke after a 11 hour drive.  ",
      "created_at": "2005-11-28T07:53:10.000Z"
    },
    {
      "author": "MES",
      "body": "Usually if there's a smell in the projection booth at my work it's either:<br/>A) A dead mouse in the closet.<br/>B) A dead bird in the air conditioning.<br/>C) The rotting corpse ghost of Vincent Price.",
      "created_at": "2005-11-28T11:36:17.000Z"
    },
    {
      "author": "nathan",
      "body": "stockton is definitely north",
      "created_at": "2005-11-28T11:50:52.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<a href=\"http://img345.imageshack.us/img345/1043/anakin9ws.jpg\"><img src=\"http://img345.imageshack.us/img345/1043/anakin9ws.jpg\" border=\"0\" width=\"100\" alt=\"Image Hosted by ImageShack.us\" /></a><br/>\"<i>Any</i> place is South from a certain point of view.\"  <br/><br/> ",
      "created_at": "2005-11-28T19:04:54.000Z"
    },
    {
      "author": "bjork24",
      "body": "A Stocktonite told me it was South. I've never been, so I took his word for it.",
      "created_at": "2005-11-28T22:05:17.000Z"
    },
    {
      "author": "Fyse",
      "body": "There was a phantom smell in the house I was staying in in Edinburgh over the summer, which we eventually tracked down to a cupboard in one of the bedrooms. It turned out there was a vent from the sewage system (to prevent gas build-up) actually inside a cupboard in a bedroom. A sewage vent. In a cupboard. In a bedroom. Unbelievable.<br/><br/>(This is first time I've commented in AGES. I've been blurking all along though.)",
      "created_at": "2005-11-28T22:31:29.000Z"
    },
    {
      "author": "bjork24",
      "body": "\"blurking?\" You crazy Brits!",
      "created_at": "2005-11-28T22:33:10.000Z"
    },
    {
      "author": "Nate",
      "body": "In some countries it is good manners to blurk after a large meal. ",
      "created_at": "2005-11-28T23:10:13.000Z"
    },
    {
      "author": "Caleb",
      "body": "...as is farking.",
      "created_at": "2005-11-29T00:41:31.000Z"
    },
    {
      "author": "Matthew Martin (aka R.J. Jack MacReady Burton)",
      "body": "Sounds like a dead bird or a pipe problem. Run for your lives! P.S.: will I be redeemed for the fact I hated \"Flying Tiger\" (coming to Mirrormask and hopefully Junebug)?",
      "created_at": "2005-11-29T06:44:16.000Z"
    },
    {
      "author": "Fyse",
      "body": "Blurking wasn't just a typo, you know. Have you not heard it before? I came across the term on wardomatic.blogspot.com. Blurker is a term that specifically applies to people who read blogs without ever commenting. Neat, huh?",
      "created_at": "2005-11-29T08:28:28.000Z"
    },
    {
      "author": "bjork24",
      "body": "You learn something new everyday.",
      "created_at": "2005-11-29T11:14:27.000Z"
    },
    {
      "author": "Anonymous",
      "body": "Speaking of sell outs, I really enjoy the your theatre but I would think someone who runs an independant business and gripes about large scale competition would have the sense not to shop at wal mart. ",
      "created_at": "2005-11-30T23:16:53.000Z"
    },
    {
      "author": "bochan",
      "body": "I hesitate to be serious here, but your smell might be coming from a water heater, if you have one.  Many water heaters (especially electrics) have an anode in them which reacts to chemicals in the water and create a rotten egg/sulphur odor.",
      "created_at": "2005-12-02T01:00:17.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 16,
      "name": "Customers"
    }
  ]
}
