{
  "id": 332,
  "title": "Paris Hilton and Nicole Richie",
  "body": "If you received an e-mail from Info AT Moxie Cinema DOT com regarding nude pictures of Paris Hilton and Nicole Richie, a change of address, or registration confirmation, I hate to tell you, but it's not real. Here's what happened:<br/><br/><ol><li>John or Jonna Doe have a computer virus.</li><br/><li>They also have the most recent Moxie newsletter sitting innocently in their e-mail client's inbox.</li><br/><li>The virus spots the innocent newsletter and decides to use it's name to send thousands of spam e-mails via John/na's computer.</li><br/><li>Some of the e-mails end up being undeliverable so are automatically redirected to the spoofed e-mail address (i.e. Info AT Moxie Cinema DOT com).</li><br/><li>Dan wonders why he's receiving bounced e-mails for spam he didn't send.</li><br/><li>Dan realizes his e-mail address has been spoofed, so he traces the spam messages back to the originating IP and contacts the appropriate network administrator.</li><br/><li>The network administrator cuts off internet access to John/na's computer (sorry John/na!).</li><br/><li>John/na will eventual figure out that their internet access is down and call their provider, where they'll learn that they've been blacklisted until they remove the virus from their computer (again, sorry John/na).</li><br/><li>John/na will use a friend's computer to download <a href=\"http://www.lavasoftusa.com/software/adaware/\" target=\"_blank\">Adaware</a>, <a href=\"http://www.safer-networking.org/en/index.html\" target=\"_blank\">Spybot</a>, and <a href=\"http://www.spywareinfo.com/~merijn/downloads.html\" target=\"_blank\" class=\"broken\">Hijack This</a> and burn them all onto a disk, which they'll install onto their computer and remove the evil virus.</li><br/><li>John/na's internet access will be turned back on, allowing them to happily resume surfing the world wide web... including the German porn site that originally infected them with the malicious virus.</li></ol><br/>Woo hoo! The internet is a wonderful thing.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-11-30T02:30:45.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "Looks like everyone's having internet troubles today. My blog has been recieving TONS of spam comments today. I didn't get any interesting Moxie e-mails though...<br/><br/>Now back to watching House of Wax so I can see a pole go through Paris' head again and again and again!",
      "created_at": "2005-11-30T03:04:36.000Z"
    },
    {
      "author": "--Jeff",
      "body": "One word: Linux. That is all.<br/><br/>/dons flame retardant suit... ",
      "created_at": "2005-11-30T03:27:11.000Z"
    },
    {
      "author": "bjork24",
      "body": "And another word: Firefox.",
      "created_at": "2005-11-30T03:39:51.000Z"
    },
    {
      "author": "Nate",
      "body": "Geeks, geeks one and all.",
      "created_at": "2005-11-30T03:55:29.000Z"
    },
    {
      "author": "Nate",
      "body": "To clarify:  I myself am a dork, which is only a geek without the job prospects.",
      "created_at": "2005-11-30T03:56:46.000Z"
    },
    {
      "author": "Jess",
      "body": "WOW all this virus talk makes me think I need to practice safe surfing...and if I am practicing safe surfing what if there are holes in my protection??  Don't need an OOPS happening.  All this stuff I was never educated on all because parents..what that is a different topic...",
      "created_at": "2005-11-30T04:04:12.000Z"
    },
    {
      "author": "nicki",
      "body": "i heart firefox. with all my <3.<br/><br/>am not nerdy enough for linux though :(<br/><br/>wish i was. *sigh*<br/><br/>:D",
      "created_at": "2005-11-30T04:53:52.000Z"
    },
    {
      "author": "Big John",
      "body": "2046.<br/><br/>That's worth hundreds of awkward threadjacks.<br/><br/><br/>Wow.  Sweet.",
      "created_at": "2005-11-30T05:25:52.000Z"
    },
    {
      "author": "Big John",
      "body": "-also, Firefox is the r0X0r.",
      "created_at": "2005-11-30T05:26:44.000Z"
    },
    {
      "author": "Fyse",
      "body": "I had exactly the same thing happen to me last year, but was never sophisticated enough to trace the source.<br/><br/>Oh, and I was interested to read Caleb's been getting loads of comment spam too. Mine's been going crazy. Hundreds of 'em, all over the place. I was wondering, do these bots harvest blog URLs from the comment sections of other blogs?",
      "created_at": "2005-11-30T06:41:23.000Z"
    },
    {
      "author": "bjork24",
      "body": "Indeed they do, Fyse. Some spammers have programs that compile lists of blogs so they can automatically insert comment spam via the standard WordPress or Blogger forms. I used to get a lot, but I installed a few failsafes (i.e. see my guestbook).",
      "created_at": "2005-11-30T06:45:46.000Z"
    },
    {
      "author": "Derek the local college student",
      "body": "That's why I use a mac.",
      "created_at": "2005-11-30T07:43:22.000Z"
    },
    {
      "author": "Andy",
      "body": "Firefox has sucked for like two months now.  At least for me.  Anyone else getting slower-than-dial-up loading with Firefox and normal with IE/Netscape/various others lately?",
      "created_at": "2005-11-30T07:57:47.000Z"
    },
    {
      "author": "Dave",
      "body": "so... what was this about nude pictures of Paris Hilton and Nicole Richie?",
      "created_at": "2005-11-30T08:01:34.000Z"
    },
    {
      "author": "Aaron J Scott",
      "body": "Viva la Windows 98!",
      "created_at": "2005-11-30T09:59:42.000Z"
    },
    {
      "author": "Caleb",
      "body": "Yes - hundreds of spam comments on my WordPress blog. I've been blacklisting the I.P. addresses but it's not helping. What is going on?! It's the Apocalypse!",
      "created_at": "2005-11-30T10:22:24.000Z"
    },
    {
      "author": "Jonna",
      "body": "I'm not going to lie... I was excited to see my name replace \"Jane\" in this post, except that my namesake is stupid enough to get a virus.  And that makes my heart sad.  Good thing I go to my chiropractor tomorrow... you know how they like to hypnotise you.. We've gotten through a lot of my issues, but this is a whole new complex to sort out!  Thanks a lot, Dan.  I appreciate it.",
      "created_at": "2005-11-30T10:23:01.000Z"
    },
    {
      "author": "Jordan",
      "body": "Those Germans and their pornography.<br/><br/>With all the Viruses the people in that profession have to contend with, why toss computer viruses into the mix?<br/><br/>I just don't get it.",
      "created_at": "2005-11-30T12:23:11.000Z"
    },
    {
      "author": "evilvet",
      "body": "That's a fine technical explanation, Mr. Movie/Computer Guy. But it hasn't gotten me any closer to nudie pictures of Paris and Nicole.",
      "created_at": "2005-11-30T19:19:28.000Z"
    },
    {
      "author": "Nate",
      "body": "I think it's important that we use last names when discussing nudie pictures of Paris and Nicole.  If you know what I'm sayin'.",
      "created_at": "2005-11-30T19:26:46.000Z"
    },
    {
      "author": "Caleb",
      "body": "The mighty Spam-Karma 2 saved the day. Spam-Karma 1 just couldn't quite cut it.",
      "created_at": "2005-11-30T20:15:55.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<a href=\"http://img223.imageshack.us/img223/5531/parnic8mu.jpg\"><img src=\"http://img223.imageshack.us/img223/5531/parnic8mu.jpg\" border=\"0\" width=\"177\" alt=\"Image Hosted by ImageShack.us\" /></a><br/><br/><b>/unavailable for comment</b>",
      "created_at": "2005-11-30T22:30:43.000Z"
    },
    {
      "author": "john/na",
      "body": "Now we're getting somewhere!",
      "created_at": "2005-11-30T22:39:56.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i still have the internet.... <br/>thats because i only visit norweigian porn sites",
      "created_at": "2005-12-01T03:33:13.000Z"
    },
    {
      "author": "nikki",
      "body": "hey ,dis is nikki and i think i would use da middle fingure 2 flip sum1 off coz ....................its sooooooooo obvious !!!!",
      "created_at": "2006-07-10T15:10:26.000Z"
    }
  ],
  "categories": [
    {
      "id": 11,
      "name": "Techish talk"
    }
  ]
}
