{
  "id": 334,
  "title": "Freakish Moxie Balloons",
  "body": "One month ago today, November 3rd, 2005, the MFAS (Missouri Film Alliance of Springfield) celebrated their organization's first birthday at The Moxie. They brought hor'deurves, pretty table clothes, and a bouquet of balloons filled with so called \"extra helium.\" Apparently this \"extra helium\" was supposed to make the balloons stay afloat longer... and boy does it! One month since the MFAS gala, the balloons are still floating in the air above The Moxie deposit safe. I don't even think they've shrunk!<br/><br/>To test this so called \"extra helium,\" I sacrificed one of the balloons and inhaled its contents into my lungs. Immediately upon ingestion, a lifelong mole (who I had affectionately named King Bumby) turned into a Dot (you know, <a href=\"http://www.oldtimecandy.com/dots.htm\" target=\"_blank\" class=\"broken\">the candy</a>) and fell onto the floor. I picked King Bumby up, examined him for what seemed to be at least 2 or 3 seconds, and then proceeded to eat him. Now, I know what you're thinking - \"disgusting!\" - but you have to remember, King Bumby wasn't a mole anymore - he was a red Dot!<br/><br/>Here's a picture of the freakish balloons, along with our film-themed Moxie Christmas tree:<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/120305/freak_balloons.jpg\" width=\"425\" /><br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/120305/tree.jpg\" width=\"425\" /><br/><br/>We used film instead of garland... aren't we clever! Can you guess what the film is from? No? It's from RENT - a movie I'm going to rate as \"TERRIBLE\" although I haven't seen it. Nicole will surely hit me for writing that.<br/><br/>Anyways, back to the balloons. If you've seen the balloons and want to share your experiences, banal or not, I've created a <a href=\"http://www.moxiecinema.com/forum/index.php?action=vthread&forum=1&topic=78\" class=\"broken\">forum post</a> where you can feel free to tell your balloon stories. If you haven't seen the balloons yet, make sure to check them out next time you're in. I'll keep the forum post updated until the balloons die... if they ever do!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-12-04T09:04:04.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Matthew Martin (aka R.J. Jack MacReady Burton)",
      "body": "Where's the mole? I also noticed the balloons. I actually thought they were the opening in September.",
      "created_at": "2005-12-04T11:34:14.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i was there that night... <br/>i ate some of the hor'deurves<br/>... i dont know if i was allowed too...<br/>but i was really hungry<br/>and they looked really good....<br/>and as it turns out... they were really good<br/>did they have another meeting tonight?<br/>did i miss the food?  .. im so hungry..<br/><br/>ps- tonight i went to a different movie theater for the first time since the movie opened...<br/>i was invited to go see rent...<br/>.. everyone was talking throughout the movie...... there was no intermission and i had to go to the bathroom very badly.... i think i hurt myself...",
      "created_at": "2005-12-04T12:10:54.000Z"
    },
    {
      "author": "brian of moore",
      "body": ".... where is the edit button?<br/>'since the movie' == 'since the moxie'",
      "created_at": "2005-12-04T12:11:42.000Z"
    },
    {
      "author": "Caleb",
      "body": "What kind of theater doesn't have an intermission?!?! <br/><br/>Once I made a balloon animal. But it died. But there were hor'deurves at the funeral.",
      "created_at": "2005-12-04T12:46:18.000Z"
    },
    {
      "author": "Matthew Martin (aka R.J. Jack MacReady Burton)",
      "body": "The kind of theatre that believes in money over showmanship (70mm will make a comeback).",
      "created_at": "2005-12-04T15:02:36.000Z"
    },
    {
      "author": "erin",
      "body": "im trying to figure out if brian infact saw rent... or if its just a joke...",
      "created_at": "2005-12-04T19:44:15.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<i>ps- tonight i went to a different movie theater for the first time since the moxie opened...</i> <br/><br/>The first time I did this, I felt dirty; like I was cheating or something. I came back, fessed up to Dan and Nicole, hoped they would take me back, and prayed for make up sex. <br/><br/>Well, everything except for the last part. <br/><br/>Seriously, seeing a movie somewhere else sucks after the Moxie.  It's noisy, my bladder is used to the intermission, and they don't have Schlaflys or Fitz's for my non-Adult Beverage moods (which may have something to do with the whole Bladder Thing.   <br/><br/><b><i>Long Live the Moxie!</b></i>    <br/>",
      "created_at": "2005-12-04T20:55:44.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i did see rent<br/>and although i wont hit dan.. i do dissagree.. i thought it was quite good.. i do have trouble with people singing constantly ... but once i got over that.. it was good <br/>",
      "created_at": "2005-12-05T00:04:38.000Z"
    },
    {
      "author": "Derek the local college student",
      "body": "The only times since its opening that I've seen films anywhere other than the Moxie were when I went to the Ragtag and when I was with two girls, so I don't really feel bad about either of those. Are the calendars out yet?",
      "created_at": "2005-12-05T05:31:02.000Z"
    },
    {
      "author": "brian of moore",
      "body": "note: i went to see rent with two girls.. i also made the stipulation that if i were to go.. i had to get felt up by both at the same time.... sadly only one felt me up.. but i didnt want to push my luck.. so i accepted that as 'good enough'",
      "created_at": "2005-12-05T11:09:14.000Z"
    },
    {
      "author": "Nate",
      "body": "Metamorphing moles and eating them?<br/><br/>Dan, this is the weirdest thing you've ever posted.  Take a day off.",
      "created_at": "2005-12-05T19:50:32.000Z"
    },
    {
      "author": "Nate",
      "body": "As for \"Rent,\" I'm surprised that I've yet to see a critic's blurb along the lines of \"wait to rent Rent.\"  Or, \"Rent is not worth a rental fee,\" or some such uninspired slam.  I guess they resisted the temptation.  Ten points to anyone who comes up with one from a legitimate critic!",
      "created_at": "2005-12-05T19:52:59.000Z"
    },
    {
      "author": "Caleb",
      "body": "I haven't seen a movie at the Moxie in so long...I am having withdrawls. Seriously! Damn school keeping me out at night. I am coming later this week though! I swear!",
      "created_at": "2005-12-06T01:30:44.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Hey, I'm not exactly sure why, but my toddler was running around the living room this morning, chanting \"Moxie, Moxie, Moxie\"...",
      "created_at": "2005-12-06T23:09:39.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
