{
  "id": 335,
  "title": "Let there be light!",
  "body": "It's been a bad, bad day. You know the kind... where nothing seems to go your way. First thing this morning I found out that my iPod (my fourth if you've been keeping track) decided to finally bite the dust. Typically whenever my iPod breaks I just call Apple support and have them send me a new one, but I voided my warranty by switching the crappy Apple battery with one that would actually hold a charge for longer than 3 hours. Long story short, I successfully switched the battery and had everything working correctly, until suddenly, this morning, my iPod made a weird noise and displayed the dead iPod icon on the screen. Argh. I have the worst luck with MP3 players... especially iPods. I guess I'll have to rely on my trusty <a href=\"http://www.pezmp3.com\" target=\"_blank\" class=\"broken\">Pez MP3</a> player to hold me through until I find a suitable replacement.\r\n\r\nThen, on the way to the theater, Taco Bell messed up my order TWICE when repeating it to me over the intercom. Can you believe that?! Then, when we made it to the theater, I dropped my Taco Bell bag and all but ruined my sweet, sweet tostada (which they just put back on the menu after a 2 year hiatus). Then, while screening HOWL'S MOVING CASTLE, I discovered that the last theater did some MAJOR damage to the print so that it kept going in and out of focus for the first hour and fifteen minutes. We called Technicolor and they're sending us a new print, but it won't be here until tomorrow, which means I had to STAND in the projection booth and manually keep that bastard in focus. I'm telling you, it takes a lot to stand on a little ladder for two and a half hours and watch a genre of movie that you're not particularly fond of. Did I ever tell you how I don't really like anime? Well, I don't. Either way, HOWL'S wasn't TOO bad for an non-anime fan. At least the characters' eyes were somewhat close to proportional and there weren't any freaky fast moving backgrounds, which are the two aspects of anime I dislike the most.\r\n\r\nBut enough about me and my distaste for that particular genre of animation. Just because I don't like it doesn't mean it's not good. In fact, my taste in movies is a pretty good indicator of how well a film will do at The Moxie. For example:\r\n\r\n<b>NICOLE:</b> What about MIRRORMASK for December?\r\n<b>DAN:</b> That's fine, but I wouldn't pay to see it.\r\n<b>NICOLE:</b> Then we're definitely getting that one.\r\n<b>DAN:</b> Don't forget about JUNEBUG. It's one of the highest rated movies of 2005 and it already has a ton of Oscar buzz floating around Amy Adams.\r\n<b>NICOLE:</b> Ok, we'll do JUNEBUG too.\r\n\r\nFast forward a week - MIRRORMASK winds up being one of our best movies, and JUNEBUG breaks the record for the lowest attended movie of all time. I'm telling you, I'm like a movie prophet or something! I'm going to start not liking all of our movies from here on in.\r\n\r\nAnd finally, I'm proud to announce that we have lights on the West side of the building. If you've been holding off on coming to The Moxie for fear of being stabbed or mugged in our parking lot, fear no more. The new lights are so bright, in fact, that I'd give anyone a dollar* who could determine whether it was day or night by glancing out our door. Now the only thing you have to fear when parking in our lot is skin cancer. Woo hoo! I kid, I kid. I'm very happy to have a well-lit parking lot right next to our building. Very few downtown businesses can say the same, and for that I'm happy.\r\n\r\nAnd finally FINALLY, I have a little post in the works that is going to put this blog back on the path it was supposed to originally be on. I won't say much, other than that it's going to be AWESOME! Until then... don't get knifed.\r\n\r\n*not really",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-12-08T07:59:12.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Aaron J Scott, shivved",
      "body": "Too late.",
      "created_at": "2005-12-08T08:26:48.000Z"
    },
    {
      "author": "nicki",
      "body": "question: will the moxie sign ever be lit?\r\n\r\nI went to dinner downtown tonight, and while driving past on campbell, i happened to turn my head down that way, and if i didnt know you were there, i wouldnt have seen the place... :( a lit sign would do wonders for your libido.. i mean.. uhm... business!",
      "created_at": "2005-12-08T08:37:03.000Z"
    },
    {
      "author": "Andy",
      "body": "I basically went to the Moxie to get stabbed and mugged.  It's a shame y'all got those lights.",
      "created_at": "2005-12-08T08:38:12.000Z"
    },
    {
      "author": "nicole",
      "body": "So, if I'm in completely in charge of movie-making decisions...I'm debating about one. I have a crush on the lead actor, but that doesn't mean it will do well. Gah. I'll make a forum post about it.",
      "created_at": "2005-12-08T08:39:39.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yes, we are planning on lighting our current sign OR having a swanky neon marquee installed. It's still in the discussion stage.",
      "created_at": "2005-12-08T08:53:01.000Z"
    },
    {
      "author": "Luke",
      "body": "I commend you on your superb focusing skills. I was at the movie this afternoon....i mean evening, and i noticed the screen being a little fuzzy for the first couple of minutes, other than that i saw no problems. Bravo",
      "created_at": "2005-12-08T09:05:23.000Z"
    },
    {
      "author": "Tyler",
      "body": "If it's any consolation, I saw MirrorMask last night and wish I had seen Junebug instead.\r\n\r\nPlease don't forget to check on Tideland. I desperately want to see that.",
      "created_at": "2005-12-08T10:14:02.000Z"
    },
    {
      "author": "brian of moore",
      "body": "if its of no consolation, i saw mirromask and enjoyed it quite a bit (although i would have changed the ending up a bit) and i although i had some interest in seeing junebug.. im not beating myself up over missing it...  and i also enjoy anime... then again being an animation major i enjoy many styles of animation\r\n\r\nin other news.. today was quite the bad day for me too... even if my ipod didnt break... ",
      "created_at": "2005-12-08T10:32:04.000Z"
    },
    {
      "author": "Caleb",
      "body": "May I suggest a Creative Zen for your next MP3 player? It has built-in radio and a voice recorder (which I never use) and holds a nice amount of songs. It's cheaper than most and the batter lasts long. I've never had any problems with it. And I've even dropped it a time or two! Otherwise you could hold out for the new hush-hush Sony Walkman MP3 player coming out next year.\r\n\r\nI hate anime as well. However I do want to see Howl's Moving Castle. But only because it's Miyazaki. He's the only Japanese animator I like. Have you seen Spirited Away?",
      "created_at": "2005-12-08T21:05:41.000Z"
    },
    {
      "author": "Caleb",
      "body": "Yep it holds batter for pancake-making too. Forgot the mention that. The <i>batter</i> lasts long too.",
      "created_at": "2005-12-08T21:06:53.000Z"
    },
    {
      "author": "Caleb",
      "body": "I give up.",
      "created_at": "2005-12-08T21:07:09.000Z"
    },
    {
      "author": "Evan Erwin",
      "body": "I was knifed while reading this post. Damn you Moxie! ;)\r\n\r\nAlso, for some reason, I want to now call you Moxie Dan. Got a ring to it.",
      "created_at": "2005-12-08T21:44:30.000Z"
    },
    {
      "author": "Jennifer",
      "body": "Just thought I would mention that sometimes the iPods play dead, and they just need to be reset.  If you think this could possibly be the case, email Tom.  He recently had to do that to his and should be able to tell you how.",
      "created_at": "2005-12-09T01:12:12.000Z"
    },
    {
      "author": "Matthew Martin (aka R.J. Jack MacReady Burton)",
      "body": "I'm not surprised Junebug was the lowest-attended movie in the history of the Moxie. The movie wasn't even mentioned until late in the month. I didn't see it, but I think it's weird Amy Adams is getting so much praise despite not being the star of the movie (I mean the character isn't really advertised to really be part of the plot).\r\n\r\nBy the way, I liked MirrorMask and will be looking forward to a DVD with deleted scenes (I wanted more evil Helena!). Considering all of the fantasy fans (Gaiman and the Jim Henson name are pretty well-known with the high school crowds, my definition of cool, the freaks and geeks), it's not surprising it was a success.",
      "created_at": "2005-12-09T01:27:30.000Z"
    },
    {
      "author": "matt",
      "body": "i think i can help with two of your woes:\r\n\r\n1) get something other than an ipod.  you already know this, of course\r\n\r\n2) taco bell is not food.  as someone who dressed as morgan spurlock for halloween, you should know this too!  evn on a budget, you can make real, healthy food for the same cost (if not the same convenience) as taco bell, and you can yell only at yourself for messing up your own order!",
      "created_at": "2005-12-09T02:28:40.000Z"
    },
    {
      "author": "Derek",
      "body": "My iPod works fine. Sorry yours sucks. I already call you Moxie Dan. Is that not your name? I wanted to see Mirror Mask <i>and </i> Junebug, but was unable to make it this week. Sadness. As for Taco Bell, it is a good friend. Yes.",
      "created_at": "2005-12-09T03:10:26.000Z"
    },
    {
      "author": "Nate",
      "body": "Who doesn't like Amy Adams' character in Junebug?  I mean, her favorite animal is the meerkat!",
      "created_at": "2005-12-09T03:23:24.000Z"
    },
    {
      "author": "nicole",
      "body": "She has a charm bracelet with meer cats on them. And my ipod has never given me any problems. But now that I stopped working filing jobs and data entry jobs, I don't have much a chance to use it. \r\n\r\nAnd Matt - if Dan would listen to your advice on Taco Bell I would be oh so happy. I've cut it out of my diet completely, but he eats it almost every day!",
      "created_at": "2005-12-09T03:52:02.000Z"
    },
    {
      "author": "Caleb",
      "body": "Amy Adams' award buzz is for her <i>supporting</i> role. If Nicole Kidman can win Best Actress for only 30 minutes of screen time then I'd say Amy has a chance if her performance was good enough.",
      "created_at": "2005-12-09T03:52:40.000Z"
    },
    {
      "author": "Nate",
      "body": "Meerkat, Nicole.  MeerKAT.  I wikipeediddled it first so I wouldn't sound stupid.  Though \"mere cat\" is often how I refer to the lesser of  domesticated pets.",
      "created_at": "2005-12-09T03:54:57.000Z"
    },
    {
      "author": "june",
      "body": "I wanted to see junebug SOOOO bad but I don't live in Springfield and you didnt showit long enuff.  So ther.",
      "created_at": "2005-12-09T03:56:57.000Z"
    },
    {
      "author": "nicki",
      "body": "despite my knowledge of how disgusting taco bell really is... i still love it. :(",
      "created_at": "2005-12-09T05:25:25.000Z"
    },
    {
      "author": "mish",
      "body": "i havent heard such great things about ipods. well, i hear alot of hype, but my friend's scroll button broke numerous times, and some other crap that i didnt understand because i dont own one. \r\n\r\ni would never buy one. whose with me?!  http://ipods.freepay.com/?r=10415533\r\n\r\nshameless plug!",
      "created_at": "2005-12-09T11:00:21.000Z"
    },
    {
      "author": "DUG",
      "body": "SWEEEEEET!  I won't be mugged any more!  I have allready been shook down five times since you've been open...DAMN CIGARETTES!",
      "created_at": "2005-12-09T21:28:10.000Z"
    },
    {
      "author": "Jes",
      "body": "I love mere cats!!  And for Taco Bell...I am surprised you are still alive after eating there without a full belly of alcohol...because that is the only time Taco Bell is even considered food.  ",
      "created_at": "2005-12-09T21:48:45.000Z"
    },
    {
      "author": "erin",
      "body": "im like the tape dude in 'hello' from the animation show. im not neat enough for an mp3 player. nor wise enough for records.\r\n\r\n... im convinced mp3 players are leading to the rise of communisim.\r\n\r\n... but not really.",
      "created_at": "2005-12-09T22:54:14.000Z"
    },
    {
      "author": "Derek",
      "body": "Erin, that might just be considered blasphemy. Hmm.....",
      "created_at": "2005-12-10T03:55:31.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
