{
  "id": 336,
  "title": "Showing in select cities... including Springfield",
  "body": "We just found out from Paul, our awesome film booker, that Warner Independent has invited us to be a debut theater for Albert Brooks' new <strike>documentary</strike> comedy, <a href=\"http://www.imdb.com/title/tt0433116/\" target=\"_blank\">LOOKING FOR COMEDY IN THE MUSLIM WORLD</a>. Now when you hear \"showing in select cities\" you won't have to drive all the way up to Chicago to find a \"select city\"... at least for this film. The movie is scheduled for a limited release on February 10th, but we'll be showing it well before that. Woo hoo! Maybe if we do good with LOOKING FOR COMEDY, they'll keep us as a debut theater for even more of their films. Then the other distributors would follow suit, then Brad Pitt would proclaim The Moxie as the greatest theater ever during his next interview on Dateline NBC, then Angelina would lock herself in the vault, and then Bjork and I would have babies together! How sweet would that be? Let me answer for you: friggin' sweet!<br/><br/>Also, don't forget about the BEARDED CHILD FILM FESTIVAL tonight. It's going to be AWESOME! And for all you college students who are choosing to \"study\" instead of come to the theater, I've got news for you - secondary education is over-rated. Look at me, I'm an English major for Pete's sake! Peter Gabriel's sake, that is. Woo hoo! Shock the monkey and swing by the theater or else you'll risk getting a poor grade on your COOLNESS grade card!<br/><br/>Aside: I used to study a lot too. I understand. NOT!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-12-10T04:35:02.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "That is awesome news. And yes, I'm one of those opting to study this weekend. But I'm mainly studying for a film class if that counts for anything...",
      "created_at": "2005-12-10T05:51:43.000Z"
    },
    {
      "author": "Derek",
      "body": "I probably <i>should</i> be studying.....",
      "created_at": "2005-12-10T07:45:32.000Z"
    },
    {
      "author": "mish",
      "body": "i never thought i would say this but for the first (and hopefully LAST) day ever:<br/>8am finals > moxie<br/><br/><br/>i hate my life",
      "created_at": "2005-12-10T09:27:12.000Z"
    },
    {
      "author": "brian of moore",
      "body": ".. those kids you will supposedly have with bjork... <i>may</i> be yours... but it would take a paternity test to prove their not mine...",
      "created_at": "2005-12-10T10:28:03.000Z"
    },
    {
      "author": "brian of moore",
      "body": "dancer in the dark?<br/>more like dancer in my pants!!...<br/><br/>.... i.... ... nevermind... sorry",
      "created_at": "2005-12-10T10:28:58.000Z"
    },
    {
      "author": "matt",
      "body": "neat, but it's not a documentary, is it?  no, i don't think it is.",
      "created_at": "2005-12-10T11:04:46.000Z"
    },
    {
      "author": "Matthew Martin (aka R.J. Jack MacReady Burton)",
      "body": "Yes, Albert Brooks' new movie is coming to Springfield! It's a comedy, not a documentary. Next objective: the film Thank You For Smoking with Aaron Eckhart.",
      "created_at": "2005-12-10T12:23:23.000Z"
    },
    {
      "author": "Holly Fisher",
      "body": "OK, this has nothing to do with the post, but has anyone seen this?<br/><br/>http://progressive.stream.aol.com//aol/us/moviefone/movies/2005/marieantoinette_023756/marieantoinette_trlr_01_fhywet_dl.mov<br/><br/>It's the trailer for a new Sophia Coppola movie, Marie Antoinette. It's a period piece, for God sakes, but who's starring in it? Kirsten Dunst! Jason Schwartzman! WTF? And what music is playing throughout the entire trailer? New Order! Freaking New Order!<br/><br/>This had better be the most brilliant thing I have ever seen. Do you think Kirsten will dance on a bed in some ruffly panties?",
      "created_at": "2005-12-11T00:59:12.000Z"
    },
    {
      "author": "erin",
      "body": "what the crap is with this bjork loving? im confused.",
      "created_at": "2005-12-11T04:53:16.000Z"
    },
    {
      "author": "bjork24",
      "body": "I heart Bjork.",
      "created_at": "2005-12-11T05:24:15.000Z"
    },
    {
      "author": "brian of moore",
      "body": "... whats to be confused about?<br/>shes from iceland...<br/>ie: she has a sultry icelandic accent<br/>... and she makes great music<br/>and shes weird...<br/><br/>... and her name is bjork...<br/>and .. what dan said",
      "created_at": "2005-12-11T06:32:44.000Z"
    },
    {
      "author": "Derek",
      "body": "What about Sigur Rós? Hottness there? Also Icelandic, also great music, also weird. Hmm? Dan? Brian? Hmm?",
      "created_at": "2005-12-11T06:49:18.000Z"
    },
    {
      "author": "Caleb",
      "body": "Yipes. Marie Antoinette looks like it will have brilliant cinematography and visuals but geezus it feels like a freaking crap 80s film. However, that element does make it stand out from all the other hundreds of period piece movies out there. I'll wait for another trailer. That one makes me want to yak.",
      "created_at": "2005-12-11T06:53:19.000Z"
    },
    {
      "author": "Melinda",
      "body": "Bearded Child Film Festival.  Lordy.  It's been almost 24 hours since that experience, and I'm still feeling scrambled.  <br/><br/>LOVED IT!  <br/><br/>Love the Moxie.<br/>Love Bjork, too.<br/>Dancer In The Dark scrambled me.<br/><br/>Gonna eat some of The Other Dan's Honey.",
      "created_at": "2005-12-11T07:44:57.000Z"
    },
    {
      "author": "erin",
      "body": "she would probably be more sexy if she was from greenland. then i might understand...",
      "created_at": "2005-12-11T07:50:42.000Z"
    },
    {
      "author": "Matthew Martin (aka R.J. Jack MacReady Burton)",
      "body": "I also like Dancer In The Dark. I should buy \"Selmasongs\" (the soundtrack). Bjork is weird yet cool. Also any chance of getting \"Manderlay\" (Lars von Trier's new movie) when it comes out?",
      "created_at": "2005-12-11T08:32:45.000Z"
    },
    {
      "author": "Nate",
      "body": "I wonder if Sofia Coppola was a one shot.",
      "created_at": "2005-12-12T22:42:50.000Z"
    },
    {
      "author": "Rony",
      "body": "freetarot.info",
      "created_at": "2006-06-17T03:09:44.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
