{
  "id": 337,
  "title": "State of The Moxie #1 - September 2005",
  "body": "I'm sure many of you were waiting for a post like this one. Lying in bed night after night, you'd stare at your ceiling and wonder, \"when will Dan write a post - I mean a <i>real</i> post - about the inner workings of The Moxie? You know, like how many people attended, how well each movie did, and junk like that. When, ceiling, when?\" Perhaps your ceiling answered you back. Perhaps not. Either way, your pseudo-prayers have been answered. I give you:\r\n\r\n<b>State of The Moxie #1 - September 2005</b>\r\n\r\nBefore I jump into the details, let me hash out a few definitions for you.\r\n\r\n<ul><li><b>Weeks</b> - Weeks to us are not the same as weeks to most typical movie theaters. The majority of multiplexes premiere movies on Fridays, with the occasional holiday fare appearing on any given night of the week. Here at The Moxie, we premiere our films on Wednesdays. In the early days, people would turn out in force on Wednesday evenings to catch the newest flick we happened to be showing... now everyone hates us, so they don't come at all. *sigh* Ha ha! Just kidding! Or am I? Point being, our weeks go from Wednesday to the following Tuesday.</li>\r\n<li><b>Goal (aka Gold)</b> - A good night means we've hit \"goal.\" Goal is 25 people per show. If a certain day has three showings, then goal is... ? That's right: 75 people! If we hit goal, everyone's happy, if we don't, everyone's fired. Simple as that.</li>\r\n<li><b>Split / Solo weeks</b> - If only one movie is playing over a week's time, it's a solo week. If two or more movies are playing, it's a split week. Sometimes solo weeks are sprinkled with special showings that are only played for a few nights (i.e. local films, weekend late night films, mid-week specials).</li></ul>\r\nThat's about it. If you can't pick up the rest of my jargon, you should serioulsy consider reading through the archives. Now, are we ready? Woo hoo! Let's go!!!\r\n\r\n<b>WEEK 1</b> - September 21 - 27\r\n\r\n<b>Movies:</b> ME AND YOU AND EVERYONE WE KNOW\r\n\r\n<b>We:</b> 119 (75 goal) = +44\r\n<b>Th:</b> 42 (75 goal) = -33\r\n<b>Fr:</b> 88 (100 goal) = -12\r\n<b>Sa:</b> 117 (125 goal) = -8\r\n<b>Su:</b> 37 (100 goal) = -63\r\n<b>Mo:</b> 15 (75 goal) = -60\r\n<b>Tu:</b> 24 (75 goal) = -51\r\n\r\n<b>Week:</b> 442 (625 goal)\r\n\r\nOpening week was an exciting one... at least on opening day. There were several points during the week when Nicole and I thought, \"Shit!\" Then we remembered that we'd only been open for seven days and barely 2% of our target audience knew about us. Patience, as it seemed, was the key. Still, it really hurt to only get 15 on that first Monday... an all-time low record that would stand until last Thursday. Damn you snow. Damn you to hell!\r\n\r\nOther than the basic numbers, ME AND YOU AND EVERYONE WE KNOW seemed to be a good choice for an opening movie. It was low-budget enough to be considered an indie, and quirky enough to be completely different from anything else playing in Springfield. The audience reaction was good to moderately good.\r\n\r\n<b>WEEK 2</b> - September 28 - October 4\r\n\r\n<b>Movies:</b> ME AND YOU AND EVERYONE WE KNOW, MURDERBALL, and ROCK N' ROLL SPACE PATROL\r\n\r\n<b>We:</b> 57 (75 goal) = -18\r\n<b>Th:</b> 32 (75 goal) = -43\r\n<b>Fr:</b> 119 (100 goal) = +19\r\n<b>Sa:</b> 109 (125 goal) = -16\r\n<b>Su:</b> 44 (100 goal) = -56\r\n<b>Mo:</b> 36 (75 goal) = -39\r\n<b>Tu:</b> 118 (75 goal) = +43\r\n\r\n<b>Week:</b> 515 (625 goal)\r\n\r\nPatterns started to emerge during week two. First, it was obvious that Mondays, Thursdays, and Sundays were way off goal. Secondly, Sunday evening shows were a HUGE waste of money because very few people showed up, and even if they did we couldn't serve alcohol, which put a serious dent in our concession profit. By the end of our second week it was painfully obvious that something had to be done about the slow days. Unfortunately for us, October's schedule had already been set in stone, which meant we were stuck in the same show pattern as September. Late Sunday movies would have to continue until November.\r\n\r\nAs for the movies, ME AND YOU played the week out to weak attendance while MURDERBALL brought in all kinds of people. Everyone <i>loved</i> MURDERBALL (how can you not?), and it brought it a lot of new faces... although, to be honest, 90% of our audience would've been considered \"new faces\" at this point. ROCK N' ROLL SPACE PATROL, our first locally-made film, became our first sell out crowd on Tuesday, October 4th. It was AWESOME! To this day, all of our sell out crowds have been for locally-made films. Hmm.\r\n\r\nAfter two weeks, here's how our first two films fared:\r\n\r\n<ul><li>ME AND YOU AND EVERYONE WE KNOW: 515 tickets over 31 shows (17 per show)</li>\r\n<li>MURDERBALL: 380 tickets over 18 shows (21 per show)</li>\r\n<li>ROCK n' ROLL SPACE PATROL: 75 tickets over 1 show (75 per show)... duh!</li></ul>\r\nSo that wraps it up for Septemeber 2005. I'll be back soon with a recap of October, followed by November, and then, if I'm feeling particularly frisky, I might even throw in the first few weeks of December! Ow! HOTT! Now when you're laying in bed at night you can look at the ceiling, contemplate our weekly numbers, and wonder how we're able to stay open. HINT: we don't pay ourselves... and we only eat popcorn.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-12-12T09:39:02.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "i still vote me and you and everyone we know.. as the best movie ive seen at the moxie as of yet",
      "created_at": "2005-12-12T11:31:22.000Z"
    },
    {
      "author": "Caleb",
      "body": "Excluding documentaries I would definitely have to say Everything is Illuminated was my favorite Moxie film, followed by Me and You. Including documentaries, Murderball and Enron blow the rest of them out of the water. But that's just because I adore docs.",
      "created_at": "2005-12-12T12:17:41.000Z"
    },
    {
      "author": "erin",
      "body": "gosh. those figures have depressed me. i hope october gets sassier.",
      "created_at": "2005-12-12T19:55:03.000Z"
    },
    {
      "author": "Nate",
      "body": "I do like me some sassy figures.\r\n\r\nEveryone go see Howl's Mobile Home!\r\nIt's great!",
      "created_at": "2005-12-12T21:36:36.000Z"
    },
    {
      "author": "Stephanie",
      "body": "I am fascinated by the numers and can't wait to see Oct and Nov (seriously). Based on buzz I would have guessed that Broken Flowers and Junebug would have the highest ticket sales. Despite my intense anticipation for those two movies, I would also vote or Me You and Everyone We Know as the best so far, very closely followed by Happy Endings. \r\n\r\nOk, the real reason for my post is to ask -  Where for art thou Brokeback Mountain?  Will we see it at the Moxie? Will it be showing at one of the other evil theaters?  Will we be left out in the cold?  Capote?",
      "created_at": "2005-12-12T21:56:59.000Z"
    },
    {
      "author": "Melinda",
      "body": "Hey, that's weird!  Last night Quint asked me how many people were at the showing of 2046 I had just attended, and our conversation proceeded to get us all curious about figures and numbers and the desire for whopping financial success at The Moxie.  And now, here 'tis said info.\r\n\r\nThanks for the breakdown, Dan.  I'm even more curious now to see the October and November numbers.  The Aristocrats and Enron had to have made a difference, I'd think.\r\n\r\nAnywho... I probably spend too much money at The Moxie, but I'm not going to stop, and I'm going to keep prodding my friends to go, and go often.",
      "created_at": "2005-12-12T22:06:12.000Z"
    },
    {
      "author": "Derek",
      "body": "I just finished a semester of statistics, so I'm really enjoying this. Keep it coming. If I get bored, perhaps I'll do an analysis of correlation, lol. Just like any good Moxie fan should, I'll nerd out just for you, Moxie Dan!",
      "created_at": "2005-12-13T02:13:20.000Z"
    },
    {
      "author": "matt",
      "body": "that's some great information for those of us who are curious, but do you fear you might wind up disclosing too much?  i guess it's not straight-up financials, so it's somewhat removed.  i'm making a moxie spreadsheet now, though!",
      "created_at": "2005-12-13T02:25:46.000Z"
    },
    {
      "author": "--Jeff",
      "body": "I'm really wishing I had seen <i>Me and You...</i> when it played.  That was one of the only movies I <b>haven't</b> seen. :( \r\n\r\nStill in the lead for my favorite Moxie Movie:  <i>Proof</i> at #1, followed by <i> Saving Face</i>, and <i>The Animation Show</i>. \r\n\r\nOh, and <i>Happy Endings</i> to end this post. \r\n  ",
      "created_at": "2005-12-13T03:27:52.000Z"
    },
    {
      "author": "Nate",
      "body": "Murderball.  Enron.  Aristocrats.\r\n\r\nDisagree with me if you will, but right will you be not.",
      "created_at": "2005-12-13T04:35:23.000Z"
    },
    {
      "author": "Caleb",
      "body": "I have bought almost every movie that has played at the Moxie on DVD. ",
      "created_at": "2005-12-13T05:20:39.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<i>Murderball. Enron. Aristocrats.</i>\r\n\r\nForgot about The Aristocrats.  I've seen too many good movies at The Moxie to list them all. \r\n\r\nDamn you, Moxie.  Damn you and your excellent movies...",
      "created_at": "2005-12-13T07:01:18.000Z"
    },
    {
      "author": "Caleb",
      "body": "Let me rephrase my earlier comment: I have bought almost every movie <i>I have seen</i> play at the Moxie. ",
      "created_at": "2005-12-13T10:35:38.000Z"
    },
    {
      "author": "Ian",
      "body": "I like the numbers too, actually.  I wish you'd shown Everything Is Illuminated for more than the six days I was out of town.  I'm going to pout for the next two and a half hours before I come see both current features.",
      "created_at": "2005-12-14T03:25:05.000Z"
    },
    {
      "author": "Matthew Martin (aka R.J. Jack MacReady Burton)",
      "body": "Broken Flowers was probably the best one. For later months, in the words of Rufus: \"They do get better.\"",
      "created_at": "2005-12-14T08:10:13.000Z"
    },
    {
      "author": "michelle",
      "body": "thank you for hosting our engagement! I honestly couldn't think of a better place to have it--and you and nicole were sooooo great! thanks again!\r\n-Michelle Seifert (soon to be Houghton)",
      "created_at": "2005-12-14T09:52:17.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
