{
  "id": 338,
  "title": "The Moxie is romantic",
  "body": "We had our first wedding proposal here at The Moxie on Sunday night. The guy, Jeff, told his then girlfriend, Michelle, that he had a very special Christmas present for her... a private showing of one of her favorite movies (SAY ANYTHING) at The Moxie, her favorite movie theater in the WORLD. When they arrived, Michelle was under the impression that Jeff was simply giving her a really cool Christmas present, but what she didn't know was that Jeff had a big ol' diamond ring hidden in his pocket.\r\n\r\nWe gave Jeff and Michelle some complimentary concession goods and started up the film, with Michelle still none the wiser to what was about to unfold. Jeff, however, was way ahead of the game. He had copied the first hour and seventeen minutes of the movie, and then, during the famous scene when John Cusak holds the boombox above his head, Jeff spliced in himself, complete with a brown trenchcoat, holding a boombox above his head. Then the words: \"Michelle, will you marry me?\" splashed across the screen. I drew up the lights, Jeff dropped to his knee, and Michelle screamed with excitement.\r\n\r\nHow romantic is that? Before Jeff's little stunt, the most romantic gesture to happen at The Moxie was when I farted on Nicole's leg, pinched her butt, and ran away giggling. That was classic! Now Jeff has successfully made every guy who reads this (or at least those with girlfriends) feel nervous. How can they compete with a proposal like that? It even makes us married guys feel bad. After the proposal, I could see it in Nicole's eyes... she was wishing my proposal would've been more romantic. I don't know about you, but I think farting on someone's leg and throwing a ring at their head is pretty dang romantic!\r\n\r\nEither way, a BIG congratulations to Jeff and Michelle... the first couple to propose (and successfully at that) at The Moxie!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/121305/proposal.jpg\" width=\"425\" />",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-12-14T10:04:32.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "Congrats Jeff and Michelle. Jeff that was pretty damn clever. ",
      "created_at": "2005-12-14T10:57:27.000Z"
    },
    {
      "author": "justin springer",
      "body": "yey jeff and michelle!!! i am so happy for you guys!",
      "created_at": "2005-12-14T11:20:13.000Z"
    },
    {
      "author": "brian of moore",
      "body": "indeed.. gotta admit.. that is pretty awesome... kudos to him for whole splicing thing.. thats rad stuff... i wonder how nervous he was during the few minutes till that part came up... \r\n\r\nive been known to make cheezy romantic-ish animations for my lady..... well... when i had a lady..",
      "created_at": "2005-12-14T11:33:11.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Man, he's setting the bar pretty high for those of us with his namesake...\r\n\r\nIf you read The Blog: <b>Congrats, Jeff and Michelle!</b>\r\n\r\n--Jeff \r\n",
      "created_at": "2005-12-14T20:23:38.000Z"
    },
    {
      "author": "evilvet",
      "body": "Last night, alone by myself, I watched Forty Year Old Virgin (Unrated Version), in my apartment.  Does that count for anything?",
      "created_at": "2005-12-14T20:40:41.000Z"
    },
    {
      "author": "matt",
      "body": "I was going to propose in the same way, but with Oldboy where and I'd splice myself into the film eating a live ocotpus.  My plan somehow seems redundant now.",
      "created_at": "2005-12-14T20:46:12.000Z"
    },
    {
      "author": "michelle",
      "body": "It's THE michelle--\r\nOH BOY IT WAS ROMANTIC! I have made people cry with the story who don't even know him... guys, get out your creativity... but don't feel so badly, Jeff is part of the Skinny Improv, and has to be creative almost all the time for it. \r\n\r\nAnyway, again, Nicole and Dan--you guys are awesome! Thanks for being part of our engagement, I am excited to bring family and friends to \"the spot\" where it all took place.\r\n\r\nDan, farting is cute... (not really)",
      "created_at": "2005-12-14T20:50:12.000Z"
    },
    {
      "author": "Andy Karr",
      "body": "Wow.  That makes me hurt on the inside.  In a good way.\r\n\r\nI love Say Anything... what an excellent idea.",
      "created_at": "2005-12-14T22:28:53.000Z"
    },
    {
      "author": "Nate",
      "body": "Sheesh, that's nothing.  At the first showing of King Kong, last night at midnight, little did the audience expect that, at the climax, I had spliced in a scene of myself standing on top of a stack of boxes swatting at a model biplane.  I think nobody noticed, because with my shirt off I am very hairy.",
      "created_at": "2005-12-14T22:31:41.000Z"
    },
    {
      "author": "erin",
      "body": "its true! the moxie is for lovers....\r\n\r\nim never coming back now. NEVER!!",
      "created_at": "2005-12-15T00:39:41.000Z"
    },
    {
      "author": "Matthew Martin (aka R.J. Jack MacReady Burton)",
      "body": "How did you get a print of Say Anything? (or was it the DVD) Good movie, by the way. Also, did you ever learn that fart jokes get old pretty quickly?",
      "created_at": "2005-12-15T01:18:51.000Z"
    },
    {
      "author": "Jeff The Proposer",
      "body": "thanks for the comments. thanks for the moxie for helping out so much. \r\nI was going to splice myself into a california raisins commercial instead, but it was too hard trying to move in a clay costume. \r\ndan-if it makes you feel better, i think michelle may have farted when she was screaming. she told me it was the 'sweet aroma of matrimony.'\r\ni think it was the 'sweet aroma of frozen taquitos.'\r\nbut, thank you guys soo much. it worked out perfect!",
      "created_at": "2005-12-15T03:58:38.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ha ha! YES! Who says fart jokes get old fast? If they're good enough for Shakespeare, they're good enough for us. Taquitos... classic!",
      "created_at": "2005-12-15T04:09:04.000Z"
    },
    {
      "author": "jenn",
      "body": "hey there moxie people. this is jenn, michelle's sister--jeff's soon to be sister in law...strange.\r\ni watched the splice and i must say it was freaking good. i didn't fart though.\r\ncongratulations Jeff and Michelle. I am glad to call both of you family! ",
      "created_at": "2005-12-15T04:16:08.000Z"
    },
    {
      "author": "justin springer",
      "body": "michelle you are so lucky...those blonde eye brows are absolutely irresistable! ",
      "created_at": "2005-12-15T09:08:50.000Z"
    },
    {
      "author": "mish",
      "body": "look at michelle sportin the rock!",
      "created_at": "2005-12-15T10:17:32.000Z"
    },
    {
      "author": "Kelly",
      "body": "I have the oppertunity to work with Jeff and he is one special guy.  Michelle, you have a keeper!!!!!! Congratulations.",
      "created_at": "2005-12-15T22:02:41.000Z"
    },
    {
      "author": "Rachel",
      "body": "That is so great! I got teary just reading it...man.",
      "created_at": "2005-12-15T22:12:46.000Z"
    },
    {
      "author": "Michelle",
      "body": "oh my goodness, this is getting funny. And NO I DID NOT FART when he proposed.\r\n\r\njust how immature can we be?...\r\n",
      "created_at": "2005-12-15T23:35:53.000Z"
    },
    {
      "author": "Michelle",
      "body": "oh my goodness, this is getting funny. And NO I DID NOT FART when he proposed.\r\n\r\njust how immature can we be?...\r\n",
      "created_at": "2005-12-15T23:35:59.000Z"
    },
    {
      "author": "Michelle",
      "body": "oh my goodness, this is getting funny. And NO I DID NOT FART when he proposed.\r\n\r\njust how immature can we be?...\r\n",
      "created_at": "2005-12-15T23:36:08.000Z"
    },
    {
      "author": "Michelle",
      "body": "ONE MORE TIME>>>\r\nimmaturity is greatness.",
      "created_at": "2005-12-15T23:36:58.000Z"
    },
    {
      "author": "Ian",
      "body": "Yuck.  Girls.\r\nKeep the farts coming, man, Woo!",
      "created_at": "2005-12-16T04:28:32.000Z"
    },
    {
      "author": "Lora",
      "body": "WOW! What an awesome story.",
      "created_at": "2005-12-16T04:53:30.000Z"
    },
    {
      "author": "Zach",
      "body": "Very cool.",
      "created_at": "2005-12-16T11:00:45.000Z"
    },
    {
      "author": "Kate",
      "body": "Oh, awesome!  Very romantic, and yes, I did the bad thing and had my husband read this, too.  I think he's feeling a bit stressed right now, . . . .",
      "created_at": "2005-12-17T13:15:07.000Z"
    },
    {
      "author": "brian of moore",
      "body": "the moxie should join myspace.com\r\nall the hip indie bands have a myspace\r\nwhy shouldnt the moxie?\r\n... then again all the not so hip bands have a myspace too..... hmmm",
      "created_at": "2005-12-17T13:41:30.000Z"
    },
    {
      "author": "brian of moore",
      "body": "ps: <a href=\"http://www.myspace.com/smsuphish\">im not hip, nor am i in a band</a>",
      "created_at": "2005-12-17T13:42:32.000Z"
    },
    {
      "author": "Cindy H",
      "body": "Congrats,,Jeff and Michelle,,,\r\nSeems Jeff was worth the wait Michelle,,,\r\nJeff way to go guy!!!\r\nYou are definetly an Oringinal.\r\nThis is thr Koolest thing I've heard about in a long time.\r\n\r\nChelle,,Glad you didn't fart chic,,,lol ",
      "created_at": "2005-12-20T01:03:38.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    },
    {
      "id": 16,
      "name": "Customers"
    }
  ]
}
