{
  "id": 339,
  "title": "State of The Moxie #2 - October 2005",
  "body": "I've been working so hard on the new Moxie website that I completely lost track of time. I bet you guys were getting worried, weren't you! No? Really? Not even a little? Whatever. Can I make it up to you by divulging more of our attendance stats? Yeah. That's what I thought. September is water under the bridge, so let's jump straight into October, shall we:<br/><br/><b>Week 3</b> - October 5 - 11<br/><br/><b>Movies:</b> BROKEN FLOWERS, CINEMERGE FILM FESTIVAL, and SAVING FACE<br/><br/><b>We:</b> 72 (75 goal) = -3<br/><b>Th:</b> 51 (75 goal) = -24<br/><b>Fr:</b> 85 (75 goal) = +10<br/><b>Sa:</b> 160 (100 goal) = +60<br/><b>Su:</b> 57 (100 goal) = -43<br/><b>Mo:</b> 25 (75 goal) = -50<br/><b>Tu:</b> 78 (75 goal) = +3<br/><br/><b>Week:</b> 528 (575 goal)<br/><br/>This was BROKEN FLOWERS' first week at The Moxie. I remember being SO excited to have our first <i>somewhat</i> big movie with a big name actor. In fact, we held BROKEN FLOWERS in such high regards that we booked it for not one, but TWO solo weeks... a risky move for a 14 day old business. In retrospect, I now realize that our core audience wasn't nearly as developed as it should have been to support one movie on one screen for two whole weeks. The vast majority of our potential audience didn't even know we were open yet, and those that did were having a hard time finding us thanks to our incognito \"no sign for us\" appearance. Another factor working against us was BROKEN FLOWERS' ending. It wasn't one of those movies that you walk away from and say, \"I have to get all my friends to come see this.\" It left a lot of people feeling cold and disjointed. SAVING FACE was our first experiment with a short run screening. We had one screening on Tuesday, October 11th, and another on Wednesday, October 12th. Both screenings went over BIG and brought in a lot of new faces to the theater... a bunch of which would wind up becoming regulars. Hot nude Asian lesbians seemed to be a winning combination.<br/><br/><b>Week 4</b> - October 12 - 18<br/><br/><b>Movies:</b> BROKEN FLOWERS and SAVING FACE<br/><br/><b>We:</b> 82 (75 goal) = +7<br/><b>Th:</b> 41 (75 goal) = -34<br/><b>Fr:</b> 81 (100 goal) = -19<br/><b>Sa:</b> 88 (125 goal) = -37<br/><b>Su:</b> 60 (100 goal) = -40<br/><b>Mo:</b> 28 (75 goal) = -47<br/><b>Tu:</b> 65 (75 goal) = -10<br/><br/><b>Week:</b> 445 (625 goal)<br/><br/>During the second week of BROKEN FLOWERS, our booking error became more and more obvious. On Saturday, October 15th, we had our first \"dark show,\" which means no one - not a single soul - showed up to see the movie. However, you have to take into consideration that this particular \"dark show\" was an 11:45 pm showing of BROKEN FLOWERS. Who in their right minds would want to see a movie like BROKEN FLOWERS at 11:45 pm on a Saturday? No one, obviously. And to think, these were the good ol' days when we thought getting 88 people on a Saturday was as low as we could possibly sink... ha ha ha! That kills me! Especially when you consider that I'm writing this post during the slowest Saturday of ALL TIME! If we ever do worse than we've done today... I don't know what. But I'm getting off track here - I'll get to December's dismal numbers in due time. As for this particular week, we walked away with two important lessons: 1) we wouldn't do another two week solo run unless the movie was frickin' HUGE and we were at LEAST three months old (*cough* BROKEBACK MOUNTAIN *cough*), and 2) no more late night weekend movies unless we had a special cult film, or the regular movie would be able to draw in at least a dozen college students.<br/><br/><b>Week 5</b> - October 19 - 25<br/><br/><b>Movies:</b> GRIZZLY MAN and HAROLD AND MAUDE<br/><br/><b>We:</b> 38 (75 goal) = -37<br/><b>Th:</b> 54 (75 goal) = -21<br/><b>Fr:</b> 101 (100 goal) = +1<br/><b>Sa:</b> 124 (125 goal) = -1<br/><b>Su:</b> 36 (100 goal) = -64<br/><b>Mo:</b> 20 (75 goal) = -55<br/><b>Tu:</b> 36 (75 goal) = -39<br/><br/><b>Week:</b> 409 (625 goal)<br/><br/>GRIZZLY MAN, oh GRIZZLY MAN. What the crap, dude?! One of the most critically lauded documentaries of 2005, and suddenly NO ONE wants to go to the movies anymore. Nicole and I were at odds as to why we did so poorly with GRIZZLY MAN. She thinks it was because a lot of people thought the movie actually showed Timothy Treadwell getting eaten by bears, while I thought it was because we were having a bout of exceptionally beautiful weather (sunny and 70 for 20 days straight in late October), and the playoffs were in high gear, and the Cardinals were in the NLCS, and don't forget about Game 5! All of those factors added up to a shitty, shitty week. Thank grum for HAROLD AND MAUDE and its two near sell-out crowds. Without HAORLD ET MAUDE, we would've been sitting on the worst week EVER... until December. Man, I'm really building December up to look bad, aren't I? Good. Because it is.<br/><br/><b>Week 6</b> - October 26 - November 1<br/><br/><b>Movies:</b> GRIZZLY MAN, THE ARISTOCRATS, and NIGHT OF THE LIVING DEAD<br/><br/><b>We:</b> 72 (75 goal) = -3<br/><b>Th:</b> 75 (75 goal) = 0<br/><b>Fr:</b> 205 (100 goal) = +105<br/><b>Sa:</b> 141 (125 goal) = +16<br/><b>Su:</b> 108 (100 goal) = +8<br/><b>Mo:</b> 50 (75 goal) = -25<br/><b>Tu:</b> 42 (75 goal) = -33<br/><br/><b>Week:</b> 693 (625 goal)<br/><br/>Two words: THE ARISTOCRATS! Thank you, thank you, THANK YOU! This movie single-handedly pulled us out of the gutter and put us on the map. We saw so many new faces... it was remarkable. The movie was viral. One person saw it, then they'd bring a friend and see it again, then that friend would bring another friend, and so on and so forth. It was a big surprise, to tell you the truth. We knew THE ARISTOCRATS would do good, but we had no idea how sick and depraved our audience truely was! As expected, GRIZZLY MAN continued to suck the hind teat, but NIGHT OF THE LIVING DEAD pulled out two huge shows and helped push us over the top for our first \"above goal\" week in Moxie history. Lessons learned this week: vulgar comedy packs the house. Noted. (hint: we've got another one coming in January)<br/><br/>And with that, I'm off! Stay tuned for the mighty month of November, and then prepare yourself for the unbelievably slow weeks of December. Seriously. December has been a real suck-egg mule.<br/>",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-12-18T08:49:41.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "yeah.. uhm... december.. hmm.. 2046.. and mirrormask were great.. i thought.. and would have figured would have been busy... perhaps not?... hmm..  howl's moving castle wasnt?  ..hmm.. well im not much for animal flicks.. so.. uh.. but walmart? scandal? perhaps that should have had more play.. sadly ill be out of town during its next two showings.. and was working during the last one...  people seem to be looking forward to the squid and the whale...  .. i hope to see never been thawed.. tomorrow.. i dont think the trailer for that was too good.. i had to go to the website to really understand what it was about or what was going on... perhaps thats just me...",
      "created_at": "2005-12-18T13:34:08.000Z"
    },
    {
      "author": "Oz",
      "body": "I assume that \"goal\" includes some profit.  What is the number that JUST pays the bills for the Moxie and nothing else?  (i.e. no pay for you or Nicole, although I realize that's important.)  I guess what I'm wondering is how close is the Moxie to paying for itself.  Or really, how much debt are you going into?  You gotta stay open another year or so.  Next December, I could be coming out there!",
      "created_at": "2005-12-18T19:45:30.000Z"
    },
    {
      "author": "drtedd",
      "body": "  Have you enlisted the help of Missouri State's Small Business Development Center.  They are an excellent hometown resource, and are very helpful.  Rayanna Anderson has helped me out a great deal.  Give them a call!",
      "created_at": "2005-12-19T00:08:43.000Z"
    },
    {
      "author": "erin",
      "body": "i need to get my butt to the moxie.",
      "created_at": "2005-12-19T06:06:32.000Z"
    },
    {
      "author": "Jennifer",
      "body": "Tom and I feel awful about December numbers.  We had a babysitter; we were set to come to the Moxie for popcorn, cookies, and some great indie flick; we checked the website.  Howl's Moving Castle.  Sorry.  We couldn't do it.  We went to the scary place on South Campbell and saw The Lion, the Witch, and the Wardrobe.  We hope to see you soon.  ",
      "created_at": "2005-12-19T06:53:02.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'm not posting these numbers to make you guys feel guilty. Not at all. Nicole and I weren't so naive to think we'd have gang-buster business all year round. The movie business is feast or famine... it's cyclical. We knew that going in. I'm just posting the facts. The last thing I want is for people to be guilt-tripped into seeing a movie they don't want to see.",
      "created_at": "2005-12-19T07:17:02.000Z"
    },
    {
      "author": "Caleb",
      "body": "We know you're getting Looking for Comedy in the Muslim World in January, and now you have hinted at showing Brokeback Mountain, and I'm going to take a wild guess that your vulgar comedy in January stars someone who appeared in The Aristocrats and is about the wizardry of a prophet. Am I right?? ",
      "created_at": "2005-12-19T08:25:19.000Z"
    },
    {
      "author": "nicki",
      "body": "vulgar comedy! yesssss!<br/><br/>it's like crack. for perverts.",
      "created_at": "2005-12-19T08:47:02.000Z"
    },
    {
      "author": "Matthew Martin (aka R.J. Jack MacReady Burton)",
      "body": "It's the Sarah Silverman movie. Check filmjerk.com.",
      "created_at": "2005-12-19T08:48:32.000Z"
    },
    {
      "author": "brian of moore",
      "body": "agreed... either way... im going to have to see the sarah silverman movie... be it.. at the moxie... or via devious ways... so you might as well save me the guilt of obtaining it illegally.. and have it at the moxie :-)<br/><br/>and if thats the case... the janurary lineup is looking pretty dang spiffy",
      "created_at": "2005-12-19T11:17:05.000Z"
    },
    {
      "author": "Tyler",
      "body": "That sarah silverman movie is going to be great. I've been looking forward to seeing it for at least a year.",
      "created_at": "2005-12-19T12:04:10.000Z"
    },
    {
      "author": "Nate",
      "body": "If only Sarah Silverman were ridiculously hot.  If only...",
      "created_at": "2005-12-19T19:54:26.000Z"
    },
    {
      "author": "nicole",
      "body": "Before people jump to conclusions and get too excited...we're trying really hard for Brokeback Mountain, but it's just gotten too huge. And we've tried really hard for Capote, but the distribution company is placing too many demands that a small one-screen like us can't meet.<br/><br/>Hopefully Sarah Silverman can make you forget these woes.",
      "created_at": "2005-12-19T20:03:00.000Z"
    },
    {
      "author": "Caleb",
      "body": "Yes I figured Capote leaped out of its chance as I'm sure Brokeback Mountain will too. That's a good thing for those movies, bad thing for you. The Branson theater had Capote a while back but I didn't go. ",
      "created_at": "2005-12-19T20:43:09.000Z"
    },
    {
      "author": "brian of moore",
      "body": "as awesome as i consider sarah silverman to be... sometimes i pity her.... she went from dating david cross... someone so incredibly funny and awesome.... to dating jimmy kimmel... <br/><br/>that poor girl...",
      "created_at": "2005-12-19T22:00:11.000Z"
    },
    {
      "author": "Matthew Martin (aka R.J. Jack MacReady Burton)",
      "body": "Sarah Silverman is one strange person ever since she started going with Jimmy Kimmel, like Katie meeting Tom.",
      "created_at": "2005-12-19T23:58:44.000Z"
    },
    {
      "author": "Nate",
      "body": "Dammit.  Now I'm thinking Katie Holmes.",
      "created_at": "2005-12-20T00:52:31.000Z"
    },
    {
      "author": "Melinda",
      "body": "Okay, so I'm scrambling a thread here, but I was just listening to NPR Fresh Air, and David Edelstein (the film critic) listed his top 10 movies of the year.  Four, count 'em, four have been at The Moxie.  <br/><br/>#2 Junebug<br/>#4 You, Me, and Everyone We Know<br/>#6 The Aristocrats<br/>#8 Grizzly Man<br/><br/>You can listen to the whole interview at www.npr.org in the Fresh Air link.<br/><br/>Cool.  <br/><br/>",
      "created_at": "2005-12-21T02:39:47.000Z"
    },
    {
      "author": "Nate",
      "body": "Edelstein forgot to mention Stealth.",
      "created_at": "2005-12-21T03:35:35.000Z"
    },
    {
      "author": "Caleb",
      "body": "What does that man know? He put War of the Worlds as #5 on the list and tied The Skeleton Key in the #9 position! If he was trying to bring in some mainstream movies to his list he could have picked Cinderella Man or King Kong. I do declare.",
      "created_at": "2005-12-21T04:06:54.000Z"
    },
    {
      "author": "Nate",
      "body": "I declare as well!",
      "created_at": "2005-12-21T04:18:33.000Z"
    },
    {
      "author": "Matthew Martin (aka R.J. Jack MacReady Burton)",
      "body": "The Skeleton Key? What the hell? It had a dumb main character (Kate Hudson, your star is fading) and an ending that made no sense at all. I also didn't like War Of The Worlds.<br/><br/>Also, will Kiss Kiss, Bang Bang be coming next month? I've been wanting to see this forever and they cancelled the nationwide release for it.<br/><br/>Also, it's called Me and You and Everyone We Know. Dan also got the name wrong on the beginning of the site. Miranda July is beautiful and can't wait her next film/experiment/whatever (she's an artist first, then filmmaker).",
      "created_at": "2005-12-22T02:44:40.000Z"
    },
    {
      "author": "Nate",
      "body": "Yeah.  And it showed.",
      "created_at": "2005-12-22T03:09:23.000Z"
    },
    {
      "author": "bjork24",
      "body": "Where did I get it wrong?",
      "created_at": "2005-12-22T04:14:36.000Z"
    },
    {
      "author": "Matthew Martin (aka R.J. Jack MacReady Burton)",
      "body": "The main page, mentioning the theatre's opening.",
      "created_at": "2005-12-22T06:32:44.000Z"
    },
    {
      "author": "nicole",
      "body": "Kiss Kiss Bang Bang is on the horizon. ",
      "created_at": "2005-12-22T06:48:50.000Z"
    },
    {
      "author": "moxieperv",
      "body": "And then you and dan will order the movie.",
      "created_at": "2005-12-22T08:29:00.000Z"
    },
    {
      "author": "Matthew Martin (aka R.J. Jack MacReady Burton)",
      "body": "YESSSSSSSSSSSSSSSSSSSS!",
      "created_at": "2005-12-22T09:13:52.000Z"
    },
    {
      "author": "Caleb",
      "body": "Everyone needs to go see The Squid and the Whale. It's got the best script of any film I've seen all year, is very entertaining (need I mention hilarious?), and the acting is top-notch. Jeff Daniels deserves <i>something</i> for this film.",
      "created_at": "2005-12-22T19:54:16.000Z"
    },
    {
      "author": "Melinda",
      "body": "Me and You and Everyone We Do.<br/><br/><br/>Was that right?<br/><br/>Merry Christmas to all, and hope to see you at The Moxie weekly in '06.  We'll bump up those numbers, oh yes we will.  ",
      "created_at": "2005-12-23T07:30:32.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
