{
  "id": 34,
  "title": "Little Flash Movie",
  "body": "Hey everyone, I just spent the last 20 million hours (Nicole's estimate) building this AMAZING flash movie that depicts the epic battle currently waging betwixt our potential theater names. I'd really be tickled if you'd <a href=\"#\" onClick=\"window.open('/pix/flash/logomania.swf','flash','width=550,height=400'); return false;\">take a look</a>. Thanks. Bye!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-07-09T05:41:30.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "anonymous",
      "body": "oh dan, if only you had more time on your hands. :) seriously. hey, wanna make a flash intro to my site? i'll pay you a nice big thank-you. :p",
      "created_at": "2004-07-09T07:01:52.000Z"
    },
    {
      "author": "justin",
      "body": "I laughed, I cried,  I sacrificed all that is worth living for to view this precious Flash Movie.  I love you Dan.  I love you Nicole!  Let's have lunch.",
      "created_at": "2004-07-09T09:38:05.000Z"
    },
    {
      "author": "Newell",
      "body": "That was nifty-keen! I must say that after watching that little movie, I feel that it's a shame that Engelbert Humperdinck is already taken. That would be a kick ass name for a theater!",
      "created_at": "2004-07-09T09:51:19.000Z"
    },
    {
      "author": "John",
      "body": "I suppose I like Criterion, but I'm really partial to Bijou since that was the name of a cool theater in the town where I went to college.",
      "created_at": "2004-07-09T12:27:27.000Z"
    },
    {
      "author": "bjork24",
      "body": "The Engelbert Humperdinck name is a reference to our good friend, Eddie Izzard.",
      "created_at": "2004-07-09T17:34:33.000Z"
    },
    {
      "author": "Oz",
      "body": "That was extracalifrajulosdeexpialidotious!  Hey, maybe you should name the theater that!",
      "created_at": "2004-07-09T21:23:38.000Z"
    },
    {
      "author": "Carl",
      "body": "Loved the video, but with 20 million hours are you sure that you do not work for the government??  My vote is for Moxie, but believe that no matter how the voting goes the two of you should choose with what feels right to you.",
      "created_at": "2004-07-09T23:05:06.000Z"
    },
    {
      "author": "jason",
      "body": "heads up: from the archive page the movie link doesn't work. it's looking in /2004/07/flash/logomania.html. linking with the full url (http://urlblue.com/ etc etc) will fix it.",
      "created_at": "2004-07-09T23:09:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ah yes, so I see. Thanks!",
      "created_at": "2004-07-09T23:13:39.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "I like Moxie even more now that I've seen your interpretation of it. Criterion just doesn't feel like the kind of place you'd go to see the kinds of movies I'm guessing you want to show. (Donnie Darko, Being John Malkovich, Amelie...?) Or maybe I'm way off on the kinds of movies you want to show.<br/><br/>I also want to add that it's fun to see this other side of you, Dan.",
      "created_at": "2004-07-10T00:35:00.000Z"
    },
    {
      "author": "Wickwire",
      "body": "speaking on behalf of the simple minded folk.  We'll remember Moxie much better.  Lovely flash movie dah-ling, my what talent.  <br/><br/>P.S.  Eddie Izzard RULES doesn't he?",
      "created_at": "2004-07-10T00:35:17.000Z"
    },
    {
      "author": "Ali Ibsina",
      "body": "Eu cá gostei mais do CRITERION. Continua a fazer filmes em FLASH mas: \"don't give up your day job...\" :)",
      "created_at": "2004-07-10T01:59:00.000Z"
    },
    {
      "author": "Ali Ibsina",
      "body": "Let me translate:<br/><br/>I prefer CRITERION. I think you must go on making Flash Movies but \"não contes fazer disso o teu ganha pão!...\":)",
      "created_at": "2004-07-10T02:03:01.000Z"
    },
    {
      "author": "Newell",
      "body": "I realized that the Englebert Humperdinck thing was an Eddie Izzard reference. I've seen 'Dressed to Kill' a dozen times or more. I even went and saw Eddie live last year on his 'Sexie' tour. That was splendiferous.",
      "created_at": "2004-07-10T09:15:21.000Z"
    },
    {
      "author": "Anthony",
      "body": "Moxie - definitely.  Criterion is the name of Marco Pierre Whites restaurant in London and it's rubbish.  You can't associate your cinema with an overpriced pretentious restaurant.",
      "created_at": "2004-07-10T13:17:52.000Z"
    },
    {
      "author": "David Newman",
      "body": "Go Moxie!<br/><br/>We want Moxie! We want Moxie! We want Moxie!<br/><br/>How can you have the moxie to start your own indie theater - and NOT call it MOXIE?!?",
      "created_at": "2004-07-10T18:03:46.000Z"
    },
    {
      "author": "Marco",
      "body": "U really seem to have talent, and wot a great talent. Really good, seriously! Keep it up. Although just for fun, it is worth it. Excellent J-O-B.",
      "created_at": "2004-07-11T03:52:44.000Z"
    },
    {
      "author": "Mr.T the Messiah",
      "body": "Dude, that was better than a plate of jelly, and equal to Sean Connery's beard.  I vote Moxie, because Criterion has connotations of a flesh eating bacteria.",
      "created_at": "2004-07-11T04:34:54.000Z"
    },
    {
      "author": "Allison",
      "body": "While a nice name, Criterion, for me, just doesn't conjure up the golden days of cinema.  Plus, what would the college kids call it for short? \"Let's go to the Crit'!\"  Nah -- I like Moxie much better, especially after I saw \"The Roaring Twenties\" in Moxie's shadow.  Classic and yet spunky!",
      "created_at": "2004-07-11T08:58:41.000Z"
    },
    {
      "author": "Suller",
      "body": "Nice...<br/>ma arvan, et see täitsa tasub ära... igatahes edu teile... Good Luck (Y)",
      "created_at": "2004-07-12T01:44:38.000Z"
    },
    {
      "author": "Gern C. Branston",
      "body": "I loved it!  It was much better than 'Cats'.  I want to see it again & again...",
      "created_at": "2004-07-11T16:35:21.000Z"
    },
    {
      "author": "Jason",
      "body": "Hey, great site and good luck. I'm in advertising... trust me, it's a no brainer. Movies are supposed to be fun, not something that I have to wear a tie to. Criterion feels a little too stiff, while Moxie is a party. Moxie is it.",
      "created_at": "2004-07-11T17:09:13.000Z"
    },
    {
      "author": "Flora",
      "body": "heyy that's pretty cool. i'd say moxie. just cuz moxie reminds me of roxie (or was that her name?) from the movie 'chicago'...she's cool.<br/><br/>awesome site btw =)<br/>ciao",
      "created_at": "2004-07-12T03:01:34.000Z"
    },
    {
      "author": "michael",
      "body": "Enjoyed your little Flash animation and since my 11 year old son has been spending hours making 10 second epics with Flash just lately, I realise just how much work goes into them! Well done! Now all you have to do is master the \"layering\" and putting sound files on!<br/>As for the cinema names - I'm not keen on either. Criterion sounds like a baddie in  one of those terrible X-men comics and Moxie rhymes with Poxy!<br/>Our local cinema is called the Regal which is as good a name as any. Those names like Essoldo, Odeon, and Roxy seemed to have gone forever.",
      "created_at": "2004-07-16T17:47:46.000Z"
    },
    {
      "author": "bottleHeD",
      "body": "Heh, good work there!! That was surprisingly effective! I could have done with sound too, but what the heck!!",
      "created_at": "2004-07-18T11:07:25.000Z"
    },
    {
      "author": "enksat",
      "body": "Heyya!! Don't think you'll life forever, your time is limited don't do anything foolish like that guys just pray to Allah SWT! Remember you'll die!",
      "created_at": "2004-07-21T06:05:45.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
