{
  "id": 341,
  "title": "Ivy League",
  "body": "The projector is fully operational again, thanks in large part to the expansive knowledge of my Uncle Sonny. Instead of having the broken coupling retooled (i.e. completely rebuilt from scratch), he suggested I buy a pre-made coupling from a local industrial supply store. Two hours and $10.00 later, the projector is working better than it ever has. I'd say the new coupling has decreased motor noise by at LEAST 200%... maybe more. It's also increased my happiness by 300%, which is a lot considering it had already been increased by 700% after the birth of my first niece, Ivy. I'm running at 1000% happiness right now! I hope I don't get any on the screen.\r\n\r\nSo, come one, come all. The Moxie is back open for business!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-12-23T21:57:24.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Nate",
      "body": "\"I hope I don't get any happiness on the screen.\"\r\n\r\nThat is just disgusting, Dan.  Just disgusting.",
      "created_at": "2005-12-23T22:03:01.000Z"
    },
    {
      "author": "Caleb",
      "body": "LOL.",
      "created_at": "2005-12-23T22:12:17.000Z"
    },
    {
      "author": "Aaron J Scott",
      "body": "Well, I guess Ivy is better than Lemon...Congrulations to all of you, projector included!",
      "created_at": "2005-12-23T22:24:58.000Z"
    },
    {
      "author": "evilvet",
      "body": "In spite of a major equipment snafu, you are back in business in 12 hours time.  Very impressive.  All those years in the Apollo space program are still paying dividends.  Nice work and congratulations.",
      "created_at": "2005-12-23T22:50:43.000Z"
    },
    {
      "author": "Matthew Martin (aka R.J. Jack MacReady Burton)",
      "body": "Whooo-hooo!",
      "created_at": "2005-12-24T01:22:37.000Z"
    },
    {
      "author": "Ole",
      "body": "Uncle Sonny rocks.  I wish I was handy...",
      "created_at": "2005-12-24T02:06:01.000Z"
    },
    {
      "author": "Rachel",
      "body": "I like Ivy. Is she named after the main character in that raunchy movie \"Poison Ivy\"? You know the one with Drew Barrymore? I'm kidding, I'm kidding.",
      "created_at": "2005-12-24T07:06:14.000Z"
    },
    {
      "author": "Caleb",
      "body": "Perhaps Ivy will be very intelligent. Then she can go to a school in her own league.\r\n\r\nI know - lame.",
      "created_at": "2005-12-24T13:14:47.000Z"
    },
    {
      "author": "nicki",
      "body": "i... i want... <a href=\"http://www.brokebackmountain.com\">THIS</a>!!!\r\n\r\n*sniffle*",
      "created_at": "2005-12-25T01:54:06.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
