{
  "id": 343,
  "title": "Preshow slides",
  "body": "I'm not going to beat around the bush here. Our preshow ads, as funny as there are (were), are getting old. I threw together about a dozen of them way back in September, but haven't gotten around to making new ones for quite some time. So in the tradition of all things Moxie, I'm going to let the patients takeover the asylum... or some other such metaphor that equates to letting you build the ads yourself.<br/><br/>Just think, your work could be seen by tens of tens of people! Your voracious wit could be splitting up several people before every movie we show! What more could you ask for? A template, you say? Ok, here's a basic one for you: <a href=\"http://moxie.danchilton.com/pix/grum/122805/slide.psd\">PhotoShop template for Moxie slide</a>. That doesn't mean, however, that you need to limit yourself to the standard Moxie look. As long as the ad fits our size requirements and content approval we'll show it.<br/><br/>Here are the specifications:<br/><br/>Size: 1024 x 768<br/>Type: JPEG<br/>Send: slides [AT] moxiecinema [DOT] com<br/><br/>Slides that need to be made, but haven't been yet:<br/><br/>1. A slide discouraging cell phone use<br/>2. A slide discouraging talking<br/>3. A slide that subtly urges people to buy more concessions<br/>4. Funny movie trivia slides (see <a href=\"/posts/169\">here</a> for examples)<br/>5. A slide advertising the fact that businesses can buy ads for advertising... their business<br/>6. A slide about the moxie blog<br/><br/>If your slide passes the approval test (not too offensive, somewhat humorous, etc.), I'll reply to your e-mail and post your brilliant piece of slide artwork right here on the blog for all to see. This (preshow slide submission) will be included in the upcoming Moxie Website 2.0 as a standard feature, but I wanted to let you guys have the first crack at it. So knock yourself out, good readers.<br/><br/>PS - Sorry I haven't been posting as much lately. The end of the month tends to be a very busy time, especially when it's crammed with holidays and births. I'll post November and December's numbers in the near future.<br/>",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2005-12-29T04:40:43.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Johana",
      "body": "Hey, what's the deadline for this stuff? :o",
      "created_at": "2006-01-10T03:09:32.000Z"
    },
    {
      "author": "brian of moore",
      "body": "im sooo all over this<br/><br/>i suppose i need to redo my short circuit related ad..that i made way back when.. <br/><br/>but yes ill attempt a few of the above<br/>im off work tomorrow.. not much else to do.. :-)",
      "created_at": "2005-12-29T07:14:08.000Z"
    },
    {
      "author": "Stevie G",
      "body": "Hey Danno;<br/><br/>What font are you using on the template? I could look through list and try to match it, but I'm a lazyass.",
      "created_at": "2005-12-29T12:39:53.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Oh dear Lord.  I definitely need this like I need a hole in the head.  <br/><br/>I don't work as it <b>is</b>.  <br/><br/><i>c:\\Progra~1\\adobe\\photoshop\\photoshop.exe</i> :) <br/><br/>--Jeff ",
      "created_at": "2005-12-29T21:36:24.000Z"
    },
    {
      "author": "bjork24",
      "body": "I typically just use Arial Black, but any thick san-serif will do.",
      "created_at": "2005-12-29T22:26:17.000Z"
    },
    {
      "author": "Yoda",
      "body": "Dan likes his san-serifs thick.",
      "created_at": "2005-12-29T23:55:27.000Z"
    },
    {
      "author": "brian of moore",
      "body": "okay .. so i havnt made anything yet.. <br/>but i did make a snowman! <br/>in my lightwave 3D that is...<br/><br/><img src=\"http://www.uselessvoid.com/bored/3d/smallsnowman.jpg\"><br/><br/>",
      "created_at": "2005-12-30T14:45:58.000Z"
    },
    {
      "author": "Liz",
      "body": "Hey, isn't that one of Calvin's snowmen?",
      "created_at": "2006-01-02T05:46:38.000Z"
    },
    {
      "author": "brian of moore",
      "body": "yes .. yes it is.. assuming you come back to read this comment........ but yes.. im doing <a href=\"http://www.uselessvoid.com/stuff/2.jpg\">this</a> whole set of them.. ",
      "created_at": "2006-01-02T11:09:11.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
