{
  "id": 344,
  "title": "THREE",
  "body": "Three things to note:\r\n\r\n1) Tonight is The Moxie's 100th day of operation.\r\n\r\n2) One year ago today was our first full day in Springfield.\r\n\r\n3) HAPPY NEW YEARS TO ALL! Here's hoping that 2006 will be a wonderful year for The Moxie and all of its supporters! Thank you.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-01-01T05:47:36.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Steve Kirks",
      "body": "First Post!\r\n\r\nHappy New Year to Dan, Nicole, Benzo, (your dog, I forget the name--sorry!) and ther rest of the Moxie gang.  I love that you're in Springfield--my life is richer for it.",
      "created_at": "2006-01-01T07:08:18.000Z"
    },
    {
      "author": "mish",
      "body": "my life is the very opposite of richer since the moxie came.... if we are talking money wise.",
      "created_at": "2006-01-01T07:10:58.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Steve and Mish! Happy New Year to you both... now get off your computer and go have some fun!",
      "created_at": "2006-01-01T07:11:26.000Z"
    },
    {
      "author": "nicki",
      "body": "happy new year!!!\r\n\r\n\r\nand fun... what's that?",
      "created_at": "2006-01-01T11:14:24.000Z"
    },
    {
      "author": "bjork24",
      "body": "\"fun\" = the stuff you do when you're not reading this blog.",
      "created_at": "2006-01-01T13:07:28.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<b><font color=\"#0000FF\">Happy New Year!</font></b>\r\n\r\nHere's to the Moxie's continued domination as Springfield's Premiere Independent Cinema!  \r\n\r\nToday: Springfield. \r\nTomorrow: The World. :) \r\n",
      "created_at": "2006-01-02T00:24:40.000Z"
    },
    {
      "author": "Oz",
      "body": "Congratulations, Dan.  After reading your post, I couldn't help but think how amazing it is that you've actually done this.",
      "created_at": "2006-01-02T04:32:25.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Jeff and Oz!",
      "created_at": "2006-01-02T04:43:40.000Z"
    },
    {
      "author": "nicki",
      "body": "oh... i thought that was called \"work\"...",
      "created_at": "2006-01-02T04:55:33.000Z"
    },
    {
      "author": "erin",
      "body": "hey... did you see in the newsleader today they said indie flicks are out. and hollywood is back in for 06.\r\n\r\nsilly newsleader.",
      "created_at": "2006-01-02T06:37:57.000Z"
    },
    {
      "author": "Caleb",
      "body": "silly newsleader indeed. i think Go magazine should respond to that with a big article on how indie movies are \"in\" in 2006 and Hollywood is, yet again, \"out.\" \r\n\r\nhappy new year!",
      "created_at": "2006-01-02T08:58:57.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Out for '06:  Mainstream Newspapers.\r\n\r\nSeriously, the only thing saving the movie \"industry\" are the theatres like the Moxie who are providing a better atmosphere to enjoy indie films (which the public has now begun to realize are better than 90% of the crap from Hollywood). \r\n\r\nIf we lived in a city where movies cost more (NY and LA: about $12-$15 per person/per ticket for the cheap theatres; more for the premium joints) you'd want to make sure of a couple of things: The movie doesn't suck, and as few cell phones/babies/kids/dumbasses kept you from enjoying the movie.  \r\n\r\nInsert the smaller, privately owned independent cinemas with more control over the environment, movies, and prices.\r\n\r\nWatch for this trend to continue. \r\n",
      "created_at": "2006-01-02T09:39:02.000Z"
    },
    {
      "author": "evilvet",
      "body": "It's apparent that the Newsleader reads this blog, and enjoys what you do.  It's official...Nicole and Dan are HOT FOR 2006!",
      "created_at": "2006-01-02T19:20:36.000Z"
    },
    {
      "author": "Nate",
      "body": "The News Leader said what?!?  Every indication - and I mean EVERY indication - is that there is a growing appetite for more out-of-mainstream fare.  Driven by - and driving - all the innovations of internet: Netflix, downloads, movie clubs discussing things online.  Hollywood blockbusters are alive and well, but there is a more sophisticated moviegoing audience than there has EVER been.  I mean, all it takes to see this is to pull your head out of the sand and look around for Pete's sake.\r\nAnd, incidentally, the same technological innovations are what is currently driving newspapers into the ground, and will continue to do so for the next twenty years.",
      "created_at": "2006-01-02T21:48:39.000Z"
    },
    {
      "author": "bjork24",
      "body": "I think the News-Leader said indie films are \"in\" for 2006.",
      "created_at": "2006-01-02T21:59:35.000Z"
    },
    {
      "author": "evilvet",
      "body": "<a href=\"http://news-leader.com/apps/pbcs.dll/article?AID=/20060102/OPINIONS01/601020304/1006/OPINIONS\" target=\"_blank\">News-Leader link</a>",
      "created_at": "2006-01-03T00:01:37.000Z"
    },
    {
      "author": "nicki",
      "body": "the moxie is totally HOT",
      "created_at": "2006-01-03T00:28:28.000Z"
    },
    {
      "author": "nate",
      "body": "Oh.\r\n\r\nDisregard.",
      "created_at": "2006-01-03T09:35:01.000Z"
    },
    {
      "author": "Nate",
      "body": "That last was me; Nate.  Sorry, Dan.  I posted from the Mission Control mainframe.",
      "created_at": "2006-01-03T09:36:50.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
