{
  "id": 345,
  "title": "The best post thus far of 2006",
  "body": "I'm testing myself to see how quickly I can write this post. No glue in this one... just the main points. Here they come. Look out!<br/><br/><ol><li>The M.U.M.P.S. program will be unveiled later this week. The cards and stamps have been designed and are ready to be sent to the printer, who should hopefully be done with them before the week is up. The R.A.S.H.'s (Really Awesome Stamp Holder) are AWESOME, if I do say so myself.</li><br/><li>I'm still working on Moxie Cinema Online 2.0, and I think I can have it finished before the end of 2006. I'm not going to make it live until everything, and I mean EVERYTHING, is operational... unlike version 1.0 where only 40% of the links worked.</li><br/><li>Man, oh man. I've got some amazing ideas for posts rattling around in my noggin, but I can't seem to find the time to knock them out. It's already taken me 58 minutes to write this post, and the ones in my head are at LEAST 10 times as long! Don't worry though, they'll find their way out eventually. One of my resolutions was to find more time to devote to personal development... and by \"devote\" I mean \"drink\", and by \"personal development\" I mean \"Dr. Pepper.\" Mmm, sweet, sweet prune nectar.</li></ol><br/><br/>Uh oh, Nicole is ready to go to see our new niece, which means this post is over. Total time = one hour and twenty-three minutes. Looks like I need to add \"learn to type faster\" to my list of personal development tasks. That's okay, I'll just switch it out with \"start exercising\"... or better yet, \"stop eating at Taco Bell.\" Like I was ever going to do <i>that</i>!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-01-02T22:21:51.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Nate",
      "body": "We're on, like, 3.0 now, aren't we?  Which, by my reckoning, makes the next one 4.0, doesn't it?<br/>And also makes you kinda neurotic. ;)",
      "created_at": "2006-01-03T20:20:29.000Z"
    },
    {
      "author": "Caleb",
      "body": "But each version gets better and better so the next one should be amazing.<br/><br/>Now you can have a shirt that says \"DO YOU HAVE THE MOXIE RASH?\"",
      "created_at": "2006-01-03T21:22:58.000Z"
    },
    {
      "author": "Nate",
      "body": "I will not be satisfied until Moxie Online can give me a backrub.",
      "created_at": "2006-01-03T22:25:23.000Z"
    },
    {
      "author": "Nate",
      "body": "I will not be satisfied until Moxie Online can give me a backrub.",
      "created_at": "2006-01-03T22:25:24.000Z"
    },
    {
      "author": "Nate",
      "body": "Back to back backrubs, apparently.",
      "created_at": "2006-01-03T22:25:40.000Z"
    },
    {
      "author": "Jordan",
      "body": "I'm just looking forward to telling all my friends I have \"M.U.M.P.S.\".<br/><br/>So yeah.",
      "created_at": "2006-01-04T00:36:53.000Z"
    },
    {
      "author": "Anne",
      "body": "Does The Moxie have any resolutions for 2006??",
      "created_at": "2006-01-04T02:45:22.000Z"
    },
    {
      "author": "Nate",
      "body": "Everyone must go see Paradise Now.",
      "created_at": "2006-01-05T22:41:55.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
