{
  "id": 346,
  "title": "Your favorite Moxie movie of 2005",
  "body": "I meant to ask this early, but it slipped my mind. Quite simply, what were your favorite Moxie movies of 2005? For me, I'd say my favorites were, in order:<br/><br/>1. Murderball<br/>2. El Crimen Perfecto<br/>3. Enron: The Smartest Guys in the Room<br/>4. Me and You and Everyone We Know<br/>5. Never Been Thawed<br/>6. Proof<br/>7. The Untold Story of Emmett Louis Till<br/><br/>I'm assuming that JUNEBUG, THE WILD PARROTS OF TELEGRAPH HILL, and THE SQUID AND THE WHALE would have made it too, but like the majority of people in Springfield, I didn't have time to watch them. Out of all the movies we showed in 2005, I only had time to watch 14 out of the 26 all the way through. Typically I only get a chance to watch the first 10 minutes to make sure the sound and picture is okay, but after that... who knows if I'll get a chance to watch it all the way through. That's a definite new year's resolution for me: watch more of the movies we show.<br/><br/>And in case you forgot, here's a rundown of all the movies we played in 2005 (not counting special screenings - i.e. HAROLD & MAUDE, NIGHT OF THE LIVING DEAD, etc.):<br/><br/><ul><li>ME AND YOU AND EVERYONE WE KNOW</li><br/><li>MURDERBALL</li><br/><li>ROCK N' ROLL SPACE PATROL</li><br/><li>BROKEN FLOWERS</li><br/><li>SAVING FACE</li><br/><li>GRIZZLY MAN</li><br/><li>THE ARISTOCRATS</li><br/><li>LADIES IN LAVENDER</li><br/><li>PROOF</li><br/><li>HAPPY ENDINGS</li><br/><li>THUMBSUCKER</li><br/><li>ENRON: THE SMARTEST GUYS IN THE ROOM</li><br/><li>EVERYTHING IS ILLUMINATED</li><br/><li>THE ANIMATION SHOW</li><br/><li>FLYING TIGER</li><br/><li>MIRRORMASK</li><br/><li>JUNEBUG</li><br/><li>2046</li><br/><li>HOWL'S MOVING CASTLE</li><br/><li>THE WILD PARROTS OF TELEGRAPH HILL</li><br/><li>WAL-MART: THE HIGH COST OF LOW PRICE</li><br/><li>NEVER BEEN THAWED</li><br/><li>THE UNTOLD STORY OF EMMETT LOUIS TILL</li><br/><li>THE SQUID AND THE WHALE</li><br/><li>A PIANO BY CHRISTMAS</li><br/><li>EL CRIMEN PERFECTO</li></ul><br/>So, what were your favorites?",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-01-06T01:47:05.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Derek The local College Student",
      "body": "I only saw seven of them, which is unbelievably depressing, but I can honestly say I liked every one. The Aristocrats was hilarious, Ladies In Lavender was touching, Proof was really very good,  The Animation Show was quite enjoyable, Murderball was just plain awesome, and Broken Flowers was the highlight of the week when I saw it. Still, I think Me And You And Everyone We Know was probably my favorite. Of course, I really had a fantastic time at the blog readers prescreening I saw with Amelie. I'm a little bitter that I was in Germany the whole time The Squid And The Whale showed. Also, several other films were unfortunately timed with exams and whatnot. Nonetheless, The Moxie made my semester truly amazing, and I fully intend to continue to patronize your theater for a great while. Thank you Moxie Dan and Moxie Nicole! See you soon :-)",
      "created_at": "2006-01-06T19:29:41.000Z"
    },
    {
      "author": "Nate",
      "body": "Oh, man.  So many!  Let’s see...<br/><br/>Cheaper By the Dozen 2<br/>Supercross:  The Movie<br/>Stealth<br/>Aeon Flux<br/>The Legend of the Duke of the County known as Hazzard!<br/><br/><br/>It was such a great year for interesting films!",
      "created_at": "2006-01-06T19:57:34.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<b>Nate</b>:  What about: <br/><br/><i>Deuce Bigalow: European Gigolo</i><br/><i>Doom</i><br/>and <i>House of Wax</i><br/><br/>Can't leave out Best Comedy, Action, and Horror nominations...",
      "created_at": "2006-01-06T23:51:10.000Z"
    },
    {
      "author": "Nate",
      "body": "No, you got the categories wrong.  Deuce Bigalow:  European Gigolo is my nomination for Best Foreign Feature, while Doom is nominated for Best Adapted Screenplay from previously written material.",
      "created_at": "2006-01-07T01:44:54.000Z"
    },
    {
      "author": "Andy",
      "body": "5.  The Aristocrats<br/>4.  Me and You<br/>3.  Thumbsucker<br/>2.  The Squid and the Whale<br/>1.  2046<br/><br/>I didn't see all of those at the Moxie, unfortunately.  I live outside of the other side of town and have little to no money.  It's sometime hard to justify an 1/8 tank of gas and $6 over a trip down the road to Family Video.  That should change next semester, as I have been forced to take a night class in that area.",
      "created_at": "2006-01-07T03:18:58.000Z"
    },
    {
      "author": "Mickey the lost boy from the riverbanks of Office Max",
      "body": "Grizzly Man and The squid and the Whale are the two best movies I saw this year.",
      "created_at": "2006-01-07T03:41:09.000Z"
    },
    {
      "author": "Meagan",
      "body": "Wong Kar Wai outdid himself once again in the best moxie movie of the year: 2046<br/><br/>p.s. for all that care, he has just been named the president of the panel of critics at Cannes",
      "created_at": "2006-01-07T09:23:26.000Z"
    },
    {
      "author": "Joe Zephyrs",
      "body": "My 3 favorite films seen at The Moxie this year would have to be:<br/>- The Squid and The Whale<br/>- Thumbsucker<br/>- Broken Flowers<br/><br/>Surprisingly, my favorite novel since 2000 has been Everything Is Illuminated, and thus I would have liked to add the movie to the list also, but its kinda like comparing apples and orangewowchangedmylifebestdamnbookevers.<br/>Ya, i'd say that's a pretty good metaphor.",
      "created_at": "2006-01-07T21:36:29.000Z"
    },
    {
      "author": "Matthew Martin (aka Master RJ)",
      "body": "Best:Broken Flowers (my first) or Howl's Moving Castle<br/><br/>Worst:Flying Tiger (it's like a straight-to-video Roger Corman/New Concorde film)<br/><br/>Films Seen So Far:Broken Flowers, Grizzly Man, Proof, Enron:The Smartest Guys In The Room, Everything Is Illuminated, The Animation Show 2005 (the official title), Flying Tiger, MirrorMask, Howl's Moving Castle, The Wild Parrots Of Telegraph Hill, The Squid and The Whale<br/><br/>I also saw Me and You and Everyone We Know, Murderball, Saving Face, Ladies In Lavender and Wal-Mart:The High Cost Of Low Prices, but not at the Moxie.",
      "created_at": "2006-01-08T10:00:25.000Z"
    },
    {
      "author": "Laurali",
      "body": "I've seen quite a few but my top five for 2005 would be:<br/><br/>1. El Crimen Perfecto<br/>2. Murderball<br/>3. Aristocrats<br/>4. The Wild Parrots of Telegraph Hill<br/>5. Junebug/ Happy Endings<br/><br/>I also loved Never Been Thawed...",
      "created_at": "2006-01-09T19:41:28.000Z"
    },
    {
      "author": "Melinda",
      "body": "Whew boy, that's a tough question.  I don't think I can do 'em in order, and I did miss a few of the films shown so far, BUT:<br/><br/>Me and You and Everyone We Know<br/>Murderball<br/>Grizzly Man<br/>Aristocrats <br/>Enron<br/>Everything Is Illuminated<br/>El Crimen Perfecto<br/>DEFINITELY The Bearded Child Festival<br/><br/>Ah hell, I liked everything I've seen for one reason or another, but these are definitely my favorites.  <br/><br/>See you at Paradise Now tonight.  That one's gonna be intense.",
      "created_at": "2006-01-10T00:39:28.000Z"
    },
    {
      "author": "qd",
      "body": "junebug.",
      "created_at": "2006-01-11T21:29:36.000Z"
    },
    {
      "author": "Wanda",
      "body": "1.Everything is Illuminated<br/>2.Proof<br/>3.The Aristocrats<br/>4.Wild Parrots<br/>5.Ladies in Lavender<br/><br/>I'm seeing some amazing movies that I probably wouldn't otherwise see.  Thank you Moxie!",
      "created_at": "2006-01-14T02:39:20.000Z"
    },
    {
      "author": "nicole",
      "body": "I've only seen 16, plus half of a few. I think Me & You is still my favorite of the year, closely followed by Junebug and El Crimen Perfecto.",
      "created_at": "2006-01-06T02:00:34.000Z"
    },
    {
      "author": "matt",
      "body": "not that i saw any of them at the moxie :( , but my favorites from your very nice list were:<br/><ul><br/><li>Me and You and Everyone We Know</li><br/><li>The Squid and the Whale</li><br/><li>Murderball</li><br/><li>Happy Endings</li><br/></ul><br/>Kiss Kiss Bang Bang is unbelievably great, too, but you're showing that NOW!",
      "created_at": "2006-01-06T02:16:46.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "I also didn't see any of these at the Moxie, but my favorites were: Me and You And Everyone We Know, Broken Flowers, The Squid and the Whale, and Grizzly Man. Hopefully, I'll make it to Springfield this year to see a movie... at the Moxie, of course.",
      "created_at": "2006-01-06T02:27:12.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Hmmm...very difficult to list in order, since I liked some movies for different reasons. <br/><br/>I'll rate them by category:<br/><br/>Best Documentary:  <i>Enron</i><br/>Best Animated:  <i>The Animation Show</i><br/>Best Docu-comedy: <i>The Aristocrats</i><br/>Best Drama: <i>Proof</i><br/>Not on the list, but should be:  <i>Bearded Child Film Festival</i>   <br/><br/>If I <b>had</b> to pick one: <i>Proof</i> or <i>Animation Show</i> or <i>Bearded Child</i>.  <br/><br/>ARGH.  I can't pick just one. <br/> <br/>--Jeff ",
      "created_at": "2006-01-06T06:21:21.000Z"
    },
    {
      "author": "Caleb",
      "body": "1. Murderball<br/>2. Everything if Illuminated<br/>3. Me and You and Everyone We Know<br/>4. The Squid and the Whale<br/>5. Enron<br/>6. Happy Endings<br/>7. Saving Face<br/>8. The Aristocrats<br/>9. Broken Flowers<br/>10. Thumbsucker",
      "created_at": "2006-01-06T09:22:04.000Z"
    },
    {
      "author": "Caleb",
      "body": "IS Illuminated...IS!<br/><br/>(and I didn't see Junebug, 2046, or El Crimen Perfecto)",
      "created_at": "2006-01-06T09:23:55.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 10,
      "name": "Reviews"
    }
  ]
}
