{
  "id": 347,
  "title": "Customers say the darndest things, episode 2",
  "body": "Amazingly enough, the customers involved in this conversation are the exact same ones from <a href=\"/posts/309\">\"Customers say the darndest things, episode 1.\"</a> Didn't they learn their lesson the first time? I guess not.\r\n\r\n<b>GUY 1:</b> So, what's on the agenda for this month?\r\n<b>NICOLE:</b> Well, we have PARADISE NOW and KISS KISS, BANG BANG this week. Then we'll be starting SARAH SILVERMAN: JESUS IS MAGIC on Wednesday, and then-\r\n<b>GUY 1:</b> (<i>looking hopeful</i>) Wait, wait, wait. \"Jesus is magic,\" what's that about?\r\n<b>NICOLE:</b> It's a movie about one of Sarah Silverman's concerts, but with little skits and stuff thrown in.\r\n<b>GUY 1:</b> Hmmm. Are there many vulgarities?\r\n<b>NICOLE:</b> Uh, yes. She's known for being pretty perversive and vulgar.\r\n<b>GUY 2:</b> (<i>suddenly interested</i>) Is she a virgin?\r\n<b>NICOLE:</b> I don't know... but I doubt it.\r\n<b>GUY 2:</b> Oh.\r\n<b>GUY 1:</b> Ok. Well, we'll see you later.\r\n\r\n<i>GUY 1 and 2 exit</i>\r\n\r\nIn light of this conversation, I'm thinking about adding a \"Virgin meter\" in the info section for each movie. Something like this:\r\n\r\nPARADISE NOW - Virgins = 0\r\nKISS KISS, BANG BANG - Virgins = 2 (the two kids in the beginning)\r\nSARAH SILVERMAN - Virigins = 0\r\n\r\nI think that will help a lot of people make up their mind on whether they should watch the movie or not.\r\n\r\nOn another note, last night's late movie had a handful of drunk customers who were kind enough to do the following:\r\n\r\n<ol><li>Smash a beer bottle on the floor - This wasn't an accidental drop either. This bottle was smashed into pieces. I've dropped a bottle of beer, while standing, on our terrazzo and it didn't break. Think about it.</li>\r\n<li>Spit into the subsequent puddle of beer - How do I know it was spit? It looked, smelled, and tasted like the real thing.</li>\r\n<li>Bought a box of Jujy Fruits and proceeded to throw each and every black one into the puddle of beer, glass, and spittle - Racist and inconsiderate, a killer combination.</li>\r\n<li>Emtpy out all the other trash in their pockets into the cess pool - Gum wrappers, tickets, condoms, loose change, etc..</li></ol>\r\nAnd then, to top everything off, they walked right out the door without saying a word. The least they could say was, \"we made a little mess in the auditorium.\" But no! I asked them if they enjoyed the movie, they drunkenly wobbled their heads in a motion indicating \"yes,\" and then disappeared into the night. That's the equivilant of going to a restaurant, smashing a glass on the floor, and not telling anyone. It's called \"common courtesy\" you callous crotch critters!\r\n\r\nIf they ever come back... I'm going to do something. I don't know what, but it won't be \"service with a smile.\"",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-01-08T01:36:52.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Jed",
      "body": "Dan, I can always find them when I come back in the summer.....",
      "created_at": "2006-01-22T15:20:56.000Z"
    },
    {
      "author": "Andy",
      "body": "That sucks.\r\n\r\nI promise not to make a mess tonight during Kiss Kiss, Bang Bang.  Unless I laugh so much I shit myself.",
      "created_at": "2006-01-08T04:13:39.000Z"
    },
    {
      "author": "bjork24",
      "body": "Andy: that's already happened four times today.",
      "created_at": "2006-01-08T04:15:53.000Z"
    },
    {
      "author": "Aaron J Scott",
      "body": "Actually, I think \"Jesus is Magic\" prolly has a negative virgin rating. \r\n\r\nAlso, the green flavor of Jujy Fruits are worse than the black ones, because of of the green are lime. The others are mint, and a pretty bad version of mint at that. Ugh. I still loves them anyway.",
      "created_at": "2006-01-08T07:20:29.000Z"
    },
    {
      "author": "Matthew Martin (aka Master RJ)",
      "body": "What assholes. It sounds like the megaplex resident teenage cell-phone, PG-13 horror and \"American Pie\" consumers, but much more stronger and violent (possibly three times one plus two).",
      "created_at": "2006-01-08T10:03:49.000Z"
    },
    {
      "author": "brian of moore",
      "body": "you should charge them extra for everything.. then at intermission.. see if theyve made any sort of mess yet.. if so.. kick them out.. if not.. have a regular keep an eye on them.. or just kick them out during intermission anyway :-)\r\n\r\nas for the guy interested in virgins.. i would love to be there for one of these conversations... have these people actually watched any movies yet? its gott be pretty difficult for them to find a movie thats not filled with a vulgarity or two...  hopefully they saw howl's moving castle at least...",
      "created_at": "2006-01-08T12:01:31.000Z"
    },
    {
      "author": "justin springer",
      "body": "can i punch them in the throat? i would like to do that. or maybe gouge their eyeballs out with a spoon..or a spork. i would like that even more so. hmmm....",
      "created_at": "2006-01-08T13:33:29.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Dan: As for the drunks: kick 'em in the crotch.  That usually takes care of any future problems as well...\r\n\r\nBTW, To anyone who hasn't seen Kiss Kiss, Bang Bang yet:  <b><i><font color=\"#FF0000\">GO SEE IT RIGHT NOW</font></b></i>!!!!\r\n\r\nYes, this film deserves bold, italized, red font.  I think this is my new favorite movie at the Moxie and it's the first that will achieve the \"see it more than once\" award.  I'm going to drag anyone who'll listen to me along to  it as well.  I really don't see how this movie hasn't become a major studio release.  Not complaining, I'd rather have seen this at The Mox anyway...:)   \r\n\r\nAnybody else been to a movie more than once at the Moxie?",
      "created_at": "2006-01-08T20:04:09.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Ugh.  HTML hates me.  Some of that was <b>supposed</b> to be red, bold, and ugly.\r\n\r\n/closing tags is for smart people",
      "created_at": "2006-01-08T20:06:29.000Z"
    },
    {
      "author": "Holly",
      "body": "\"Callous crotch critter\" is totally replacing \"douchebag\" in my vocabulary.",
      "created_at": "2006-01-09T05:59:57.000Z"
    },
    {
      "author": "Laurali",
      "body": "Thank God I was there Saturday and not Friday...cause I know you would have thrown me right out.\r\n\r\nOf course, I would never let any of my drunken friends do any of that at the Moxie. (Perhaps at the Cine, but not the Moxie.)",
      "created_at": "2006-01-09T19:46:45.000Z"
    },
    {
      "author": "Alex",
      "body": "I enjoy reading your blog... keep it up guys! ",
      "created_at": "2006-01-18T02:02:33.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 16,
      "name": "Customers"
    }
  ]
}
