{
  "id": 348,
  "title": "State of The Moxie #3 - November 2005",
  "body": "Ok, enough of the \"regular\" blog stuff, let's delve back into the numbers, shall we? November was an excellent month for us - the best in our 3.5 month history, to be exact. Several factors contributed to this being a banner month:\r\n\r\n<ol><li>People were finally starting to hear about The Moxie, thanks to the continued coverage we were receiving in the press.</li>\r\n<li>In hopes of lifting our dismal Monday numbers, we started the Matinee Monday program - making all shows on Monday $5.00.</li>\r\n<li>We had a lot of bigger movies (i.e. PROOF, HAPPY ENDINGS, THUMBSUCKER, EVERYTHING IS ILLUMINATED) featuring several well-known actors.</li>\r\n<li>We had a successful cross-promotion with our neighbors, <a href=\"http://www.wellfedhead.com\" target=\"_blank\" class=\"broken\">Well Fed Head Books</a>, for EVERYTHING IS ILLUMINTATED.</li>\r\n<li>The weather was somewhat chilly (at times) and all the students were still in town.</li></ol>\r\nThose ingredients made for an awfully tasty November. Mmmm, mmmm, good. Ok, let's look at the numbers:\r\n\r\n<b>Week 7</b> - November 2 - 8\r\n\r\n<b>Movies:</b> LADIES IN LAVENDER and THE ARISTOCRATS\r\n\r\n<b>We:</b> 35 (75 goal) = -40\r\n<b>Th:</b> 59 (50 goal) = +9\r\n<b>Fr:</b> 87 (100 goal) = -13\r\n<b>Sa:</b> 109 (100 goal) = +9\r\n<b>Su:</b> 39 (75 goal) = -36\r\n<b>Mo:</b> 109 (75 goal) = +34\r\n<b>Tu:</b> 73 (75 goal) = -2\r\n\r\n<b>Week:</b> 511 (575 goal)\r\n\r\nNot since Week 6 had we come so close to meeting our 25 people per show goal, and it was all thanks to THE ARISTOCRATS. I'm telling you, that show packed them in like none other. LADIES IN LAVENDER, however, did horribly for us. We couldn't pay people to come watch it! Here's a quick example to give you an idea of how poorly it did: Friday, November 4th at 7:00 pm = 16 people; Saturday, November 4th at 7:00 pm = 21 people. That's puh-freaking-thetic!\r\n\r\n<b>Week 8</b> - November 9 - 15\r\n\r\n<b>Movies:</b> PROOF and HAPPY ENDINGS\r\n\r\n<b>We:</b> 30 (75 goal) = -45\r\n<b>Th:</b> 45 (75 goal) = -30\r\n<b>Fr:</b> 110 (100 goal) = +10\r\n<b>Sa:</b> 133 (125 goal) = +8\r\n<b>Su:</b> 70 (75 goal) = -5\r\n<b>Mo:</b> 72 (75 goal) = -3\r\n<b>Tu:</b> 84 (75 goal) = +9\r\n\r\n<b>Week:</b> 544 (600 goal)\r\n\r\nThis was Gyllenhaal week, with Jake in PROOF and Maggie in HAPPY ENDINGS. Both films were large wide release productions - PROOF moreso than HAPPY ENDINGS - and both had big name actors and actresses (i.e. Gwyneth, Hannibal Lector, Donnie Darko, Phoebe from \"Friends,\" Rosanne's ex-husband, John Ritter's son, MAGGIE GYLLENHAAL). These movies brought in all kinds of new faces, which is always a good thing. Other than that, it was pretty run of the mill. I used the \"Gyllenhaal Week\" joke at least 78 times during the course of the week.\r\n\r\n<b>Week 9</b> - November 16 - 22\r\n\r\n<b>Movies:</b> THUMBSUCKER and ENRON: THE SMARTEST GUYS IN THE ROOM\r\n\r\n<b>We:</b> 55 (75 goal) = -20\r\n<b>Th:</b> 66 (75 goal) = -9\r\n<b>Fr:</b> 64 (100 goal) = -36\r\n<b>Sa:</b> 116 (100 goal) = +16\r\n<b>Su:</b> 101 (75 goal) = +26\r\n<b>Mo:</b> 110 (75 goal) = +35\r\n<b>Tu:</b> 116 (75 goal) = +41\r\n\r\n<b>Week:</b> 628 (575 goal)\r\n\r\nIf only we had known ENRON was going to be so HUGE! When we scheduled this week, way back in mid-October, we thought for sure that THUMBSUCKER would bring in bigger numbers than ENRON. Little did we know that on the very day we opened both movies, ENRON would be named on the shortlist of Oscar-eligible documentaries AND our local newspaper, the Springfield News-Leader, ran a giant story about Enron, how it's changed the face of public companies, and a big juicy blurb about the movie. To top it all off, we made a big effort to e-mail all the business professors at MSU, Drury, Evangel, and OTC to let them know about the ENRON documentary. Long story short, ENRON quickly became our biggest movie of all time... even beating out THE ARISTOCRATS! The bad part was that we only had 10 showing of ENRON and 13 of THUMBSUCKER! If only we could turn back the clock and do 16 shows of ENRON and 7 of THUMBSUCKER. Oh well. Live and learn, I guess. Also of note, this week set a record of FOUR straight 100+ days.\r\n\r\n<b>Week 10</b> - November 23 - 29\r\n\r\n<b>Movies:</b> EVERYTHING IS ILLUMINATED, THE ANIMATION SHOW, and FLYING TIGER\r\n\r\n<b>We:</b> 58 (50 goal) = +8\r\n<b>Th:</b> Closed for Thanksgiving\r\n<b>Fr:</b> 182 (100 goal) = +82\r\n<b>Sa:</b> 209 (125 goal) = +8\r\n<b>Su:</b> 68 (75 goal) = -7\r\n<b>Mo:</b> 77 (75 goal) = +2\r\n<b>Tu:</b> 109 (75 goal) = +34\r\n\r\n<b>Week:</b> 703 (375 goal)\r\n\r\nThis week was phenomenal. Going into it, we didn't know what to expect. Having both worked at movie theaters before, Nicole and I knew it was busy on Thanksgiving and the few days following, but WOW! We didn't expect this kind of traffic. It was exhilerating, and made for a wonderful cliff to dive off of into the month of December. The movie/book cross-promotion with <a href=\"http://www.wellfedhead.com\" target=\"_blank\" class=\"broken\">Well Fed Head Books</a> went extremely well. So much so that we're constantly keeping our eye out for another movie that we can team up with again. THE ANIMATION SHOW did surprising well too. I was expecting a very niche (read: small) group of people to come, but thanks to a lot of word-of-mouth buzz and promotion at MSU's art department (thanks <a href=\"http://www.xanga.com/smsuphish\" target=\"_blank\">Brian</a>!) it did fairly well. I get giddy just thinking about this week. Heh heh heh. FLYING TIGER, November's local film, had three sold out shows and a LOT of mad Stocktonites who wondered how we could stay in business with such a small theater.\r\n\r\nSo, here's how our October (I forgot to mention them in the last State of The Moxie post) and November movies ended up:\r\n\r\n<ul><li><b>BROKEN FLOWERS:</b> 852 tickets over 46 shows (19 per show)</li>\r\n<li><b>SAVING FACE:</b> 120 tickets over 2 shows (60 per show)</li>\r\n<li><b>GRIZZLY MAN:</b> 427 tickets over 30 shows (14 per show)</li>\r\n<li><b>HAROLD AND MAUDE:</b> 88 tickets over 2 shows (44 per show)</li>\r\n<li><b>THE ARISTOCRATS:</b> 777 tickets over 24 shows (32 per show)</li>\r\n<li><b>NIGHT OF THE LIVING DEAD:</b> 115 tickets over 2 shows (58 per show)</li>\r\n<li><b>LADIES IN LAVENDER:</b> 206 tickets over 14 shows (15 per show)</li>\r\n<li><b>PROOF:</b> 385 tickets over 15 shows (26 per show)</li>\r\n<li><b>HAPPY ENDINGS:</b> 113 tickets over 6 shows (19 per show)</li>\r\n<li><b>THUMBSUCKER:</b> 268 tickets over 13 shows (21 per show)</li>\r\n<li><b>ENRON: THE SMARTEST GUYS IN THE ROOM:</b> 360 tickets over 10 shows (36 per show)</li>\r\n<li><b>EVERYTHING IS ILLUMINATED:</b> 316 tickets over 11 shows (29 per show)</li>\r\n<li><b>THE ANIMATION SHOW:</b> 164 tickets over 6 shows (27 per show)</li>\r\n<li><b>FLYING TIGER:</b> 223 tickets over 3 shows (74 per show)</li></ul>\r\nAll in all, it was a very good month... unlike December. But don't you worry, although I give out a lot of grief about how bad December was, we knew going in that it was going to be rough (thanks for the tip, Paul). Either way, that's another post for another day.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-01-09T02:40:17.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "erin",
      "body": "november was a sexy month. very sexy month.\r\ni bet december is the complete opposite of sexy. i bet its like.... really ugly. you souldnt even depress us with december. or maybe you should. guilt trip us.",
      "created_at": "2006-01-09T05:04:27.000Z"
    },
    {
      "author": "brian of moore",
      "body": "erin.. i was born in december.. thank you very much!... wait... was that your point?  im ugly?  god! why are you so mean to me!?\r\ni already talked to dan about how you wont ever go see a movie at the moxie with me.. \r\n\r\nahem.. anywho way to go november.. that kicks ass... maybe feburary can beat it..? .. im guessing janurary wont be quite as good .. seeing that most kids arent back for school yet.. but feburary?  .. feburary has valentines.. and people like to go to the movies on valentines.. right?  even the sad lonely single people........ like me!.. woo!\r\n\r\nbtw.. this math is confusing me:\r\n<b>Sa: 209 (125 goal) = +8</b>\r\nmore like.. plus 84.. assuming the 209 is right... geez that would be alot of people..\r\n\r\nbtw.. im willing to whore myself out to the msu art department on the behalf of the moxie.. anytime",
      "created_at": "2006-01-09T10:26:26.000Z"
    },
    {
      "author": "Stephanie",
      "body": "What did you think of Thumbsucker?  We really wanted to see it, but it was in limited release here...and we don't get many nights away.\r\n\r\nThank goodness for Netflix; if only the Moxie was a bit closer!",
      "created_at": "2006-01-09T10:37:21.000Z"
    },
    {
      "author": "Caleb",
      "body": "Thumbsucker was disappointing. But still worthy of being seen - especially at the Moxie! \r\n\r\nAnd I can only blame November's splendid numbers on myself as it is the month of my birth. But seriously, those numbers rock. And I hope you have many a more month like it! And at least now you will know how to better prepare yourself for next December. It's just a shame so many people missed out on The Squid and the Whale.",
      "created_at": "2006-01-09T22:22:42.000Z"
    },
    {
      "author": "Summer",
      "body": "So what are your thoughts about the summer, when the weather will be good and the students are out of school?  Any big promotional plans to keep people coming in?? ",
      "created_at": "2006-01-10T00:40:30.000Z"
    },
    {
      "author": "erin",
      "body": "thumbsucker was not disappointing caleb!! your dissapointing! (not really.)\r\n\r\ni think when school closes you should have after school specials!\r\nbut play those classic high school movies. ferris buller. fast times at ridgmont high.. etc. etc.\r\n\r\nor not.\r\n\r\n: )",
      "created_at": "2006-01-10T01:30:19.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'm sure we'll see a drop-off over the summer, but nowhere near what we saw in December, which, by all indications, was a perfect storm of unfavorable factors (students gone, people are busy, everyone's shopping, nasty weather, etc.).",
      "created_at": "2006-01-10T01:51:16.000Z"
    },
    {
      "author": "El Capitan Nate",
      "body": "Es La Tormenta Perfecta!",
      "created_at": "2006-01-10T04:07:33.000Z"
    },
    {
      "author": "Captain Obvious",
      "body": "The summer brings warm weather. ",
      "created_at": "2006-01-10T04:09:13.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<i>The summer brings warm weather.</i>\r\n\r\nThe perfect time to enjoy an ice-cold Adult Beverage in the air-conditioned climate of The Moxie!\r\n",
      "created_at": "2006-01-10T05:46:46.000Z"
    },
    {
      "author": "Captain Obvious",
      "body": "Jeff is right. And by right I mean correct.",
      "created_at": "2006-01-10T07:37:43.000Z"
    },
    {
      "author": "Summer",
      "body": "Dan--my understanding was that people go to see mindless summer movies (the big blockbusters) in the summer.  The moxie isn't about main-stream blood/guts/special effects, so will the moxie suffer when the active members of our community who constitute the moxie's audience are tugged in all directions by beautiful weather, the vacation season, travels to hometowns for the summer break, and all the other community events like free movies downtown?  What happens at the RagTag over the summer?  I would have thought summer would be worse than the winter break...",
      "created_at": "2006-01-11T02:45:49.000Z"
    },
    {
      "author": "bjork24",
      "body": "According to Ragtag, the summer months are quite spritely. People enjoy seeing movies during the summer, blockbuster or no. It's not the best time of the year, but it's nowhere near the desert of December. I've heard April and May are pretty bad too.",
      "created_at": "2006-01-11T02:49:07.000Z"
    },
    {
      "author": "erin",
      "body": "NOT APRIL!!!",
      "created_at": "2006-01-11T09:11:13.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
