{
  "id": 35,
  "title": "Moxie and more",
  "body": "<b><u>Part I - Moxie</u></b>\r\n\r\nAfter much conversation, debate, and pointless tickling, Nicole and I have decided to go with <b>The Moxie</b>. I apologize to all the <b>Criterion Cinema</b> fans out there, and, in condolence, offer you this brief explanation of our new choice.\r\n\r\n1. <u>Memorable</u> - When it comes down to it, <b>The Moxie</b> is short and snappy enough that no one should have problems remembering it.\r\n\r\n2. <u>Marketable</u> - As far as marketing goes, Nicole and I both agree that we can come up with more diverse and catchy ad campaigns with <b>Moxie</b> than we can with <b>Criterion</b>.\r\n\r\n3. <u>Marquee</u> - <b>Moxie</b> has fewer letters than <b>Criterion</b>, thus making it more economical if we ever decide to put up a huge neon marquee... and <b>Moxie</b> (13 points) is worth more than <b>Criterion</b> (11 points) in Scrabble too.\r\n\r\n4. <u>Mini</u> - Nicole wants a mini and she thinks \"The Moxie Mini\" sounds better than \"The Criterion Mini.\"\r\n\r\n5. <u>Atmosphere</u> - The name <b>Criterion Cinema</b> is almost too classy. Had we stuck with it, we would've been setting ourselves up for fall since it brings to mind an elegant, uptown theater, which is an image that we simply don't have the resources to maintain. <b>The Moxie</b>, on the other hand, is a bit more low key, more fun, more \"hey, this place is pretty cool\" and less \"oh my God, could this theater be any smaller? Jeeves, go fetch the car. We're leaving.\"\r\n\r\n6. <u>Correlation</u> - <b>Criterion</b> has too many movie-related connections: <a href=\"http://www.criterionco.com\" target=\"_blank\" class=\"broken\">Criterion Collection DVDs</a>, <a href=\"http://www.criterionpic.com\" target=\"_blank\">Criterion Non-Theatrical Film Distribution</a>, and the <a href=\"http://www.criteriontheater.com\" target=\"_blank\">Criterion Theater</a> in Bar Harbor, Maine. As far I know, we'd be the only theater called <b>The Moxie</b> in all of Christendom and non-Christendom too.\r\n\r\n7. <u>Domain Names</u> - www.CriterionCinema.com wasn't available, but www.MoxieCinema.com was, which, in reality, was the single most influential reason for going with <b>Moxie</b>. We had also considered the names <b>Google</b> and <b>Craigslist</b>, but just as with <b>Criterion Cinema</b>, those names were taken too.\r\n\r\nIt was a tough choice, but I think we've ended up with a name that better describes our business ethic and preternatural coolness. Of course, in the end, the name probably won't even matter. As long as we're able to povide unique concession items, excellent presentation, and a one-of-kind experience that can't be found anywhere else in Midwestburg, our name, no matter what it is, will become synonomous with having a great time while watching a great movie... and who could ask for anything more? I'd much rather have a great theater with a mediocre name than a mediocre theater with a great name, but now that we've choosen <b>The Moxie</b>, I think we're going to get the best of both worlds. Great name. Great theater. Yippee!\r\n\r\n<b><u>Part II - And More</u></b>\r\n\r\nEver since this blog was named a \"Blog a Note\" a little over a month ago, I've felt a growing pressure to write a new post every day of the business week. In the beginning, finding stuff to write about wasn't a problem at all. I had lots of topics to share with my new found readership - everything from concession profitability to booth equipment - but if I continue writing at this rate, I have a sneaking suspicion that the blog will veer sharply off the path I had originally intended it to take. Last week's posts teetered dangerously on the edge of superfluity, so I'm taking a step back, for safety's sake.\r\n\r\n\"This blog is intended to chronicle the process of developing, financing, starting, and maintaining a small, independently-owned, art-house theater.\" Instead of cracking under a self-imposed posting quota, I'm going to pull my sleeves up and jump back into the midst of making <b>The Moxie</b> a reality. Instead of writing a post when I really don't have anything new to say, I'll write an e-mail to a vendor or help Nicole finish the newsletter templates. I'd like to think that this blog made it to the \"Blogs of Note\" for its insightful content not its flash movies and haikus... although, I must admit, they were pretty awesome, weren't they?\r\n\r\nMy number one priority is opening this theater, and as long as I can stay focused and productive, there will be nothing that can stop us... What's that? Ok, that's true. A lack of money will \"deter\" us, but NOTHING will stop us. What? Don't be ridiculous. Sasquatches doesn't exist.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-07-11T23:06:10.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": ":: efrain ::",
      "body": "hey there, i recently joined this blog thing cuz i heard i might be offered a gmail account if i do, haha.\r\n\r\nanyway, i came across your blog, and not only do i love your design(and flash movie), i think it's cool to hear about your theatre!\r\ni'm into film too, and it's sounds like such a cool deal to start a theatre.  \r\n\r\nalright catchya later and good luck,\r\n:: efrain ::\r\nkindalikesorta.blogspot.com",
      "created_at": "2004-07-12T06:11:05.000Z"
    },
    {
      "author": "Kristine",
      "body": "Second to post, yay! I've been reading your blog for about a week now (and am currently reading the archives), and I must say that I think the Moxie is a great name. \r\n-Kristine",
      "created_at": "2004-07-12T09:43:01.000Z"
    },
    {
      "author": "AmeerHossein",
      "body": "Hello, you have a very cool weblog, I liked it very much. my weblog is not as cool as yours but I would be happy if you check it out.\r\nthanks\r\nameerhossein.blogspot.com",
      "created_at": "2004-07-12T09:53:42.000Z"
    },
    {
      "author": "justin",
      "body": "what about themoxie.com?",
      "created_at": "2004-07-12T18:57:07.000Z"
    },
    {
      "author": "bjork24",
      "body": "www.themoxie.com is taken.",
      "created_at": "2004-07-12T18:58:18.000Z"
    },
    {
      "author": "mo",
      "body": "you have a interesting blog with powerful posts.\r\ngood luck",
      "created_at": "2004-07-12T21:33:33.000Z"
    },
    {
      "author": "Luke",
      "body": "We understand Dan!  I love reading your blog every day, but the smart thing to do is to work on making The Moxie a reality...especially since this blog only exists because the idea of the Moxie exists.  Keep up the hard work.",
      "created_at": "2004-07-13T01:19:28.000Z"
    },
    {
      "author": "Naturelich",
      "body": "oh, and BTW: Moxie scores even better in German scrabble than Criterion does. I wonder if we can find out the scrabble language version in which it actually scores most points...",
      "created_at": "2004-07-13T02:14:26.000Z"
    },
    {
      "author": "Tim",
      "body": "Moxie, eh?  I'm going to need some time with this one, Dan.  \"Moxie\" the soft drink hasn't been good to me over the years.  Almost made me throw up once as a matter of fact.  Still, you can't argue with a good domain name.  Carry on.",
      "created_at": "2004-07-13T02:17:12.000Z"
    },
    {
      "author": "Newell",
      "body": "Post whenever you feel like it. It's your web log and, as you say, it continued existence is more or less determined by the existence of your theater. However often you decide to post, I will continue to read. It's a dream of mine to open a movie theater someday as well, and this makes for fascinating reading.",
      "created_at": "2004-07-13T03:19:03.000Z"
    },
    {
      "author": "Mina",
      "body": "This blog is great! You and Nicole are great! The Moxie is-you guessed it-great!\r\n\r\nI just started reading yesterday, and I'm addicted, I've read them all..and a Dickens too while I was it.\r\n\r\nIf you think its necessary to take a blog break, go for it, but hey, don't cut off the nonsense entirely, otherwise I may not have much to relate to.\r\n\r\nKeep us posted, and in due time post pics, links to website, etc. I'm about ready to leave Southeastburg and head for Midwestburg!",
      "created_at": "2004-07-13T12:32:16.000Z"
    },
    {
      "author": "mod",
      "body": "who is urlgreen anyway?",
      "created_at": "2004-07-14T02:26:45.000Z"
    },
    {
      "author": "bjork24",
      "body": "Who is URLgreen? or what is URLgreen?",
      "created_at": "2004-07-14T04:54:27.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 7,
      "name": "Lists"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
