{
  "id": 350,
  "title": "Rectifier sounds funny",
  "body": "Well, it looks like our rectifier has decided to bite the dust. What's a rectifier, you ask? It's a big metal box with lots of wires inside that modulates and sends electricity to the lamphouse, which houses the... you guessed it: the lamp. If the rectifier doesn't work, the lamphouse doesn't work, which means the lamp doesn't work, which means NOTHING works. No light, no picture. No picture, no movie(s). I'm waiting to hear back from our tech to determine what our next course of action will be.\r\n\r\nOk, I just heard back from my equipment dealer. He \"thinks\" he has a replacement rectifier in his warehouse. He's going to send a guy over to find out. If he does, I'll have to drive up to St. Louis tonight, pick up the rectifier in the morning, and then drive back and install it before the 4:30 show. If he doesn't have an extra rectifier... I don't know what we're going to do. Don't worry though, we've been through worse. Remember that time I almost died from eating pistachios? That was great.\r\n\r\nMy sincerest apologies to anyone who was planning on seeing a show today.\r\n\r\nUPDATE: They (our equipment dealers) have two more rectifiers in stock. Nicole and I are going to drive up early, early, EARLY tomorrow morning and pick them up. If all goes well, I should have the new rectifier rectified by 3:00 pm.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-01-18T03:57:11.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "--Jeff",
      "body": "Okay everybody.  The cats are away...\r\n\r\nPLAY!!!\r\n",
      "created_at": "2006-01-18T07:01:53.000Z"
    },
    {
      "author": "Ian",
      "body": "I'm totally going to do something...just as soon as I satisfy my hunger for pulpy sci fi...",
      "created_at": "2006-01-18T09:16:30.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
