{
  "id": 352,
  "title": "Rectification of the Vuldronaii",
  "body": "After a grueling 7 hour drive, we now have in our possession not one, but TWO working rectifiers. I pretended I was Said from \"Lost\" as I deftly sketched out a wiring schematic and marked each wire with a masking tape label. Red wire here, green wire there. Black wire here, tin foil there. \"She may not look like much, but she's got it where it counts, kid. I've added some special modifications myself.\" Woo hoo! The Moxie is back in business, boys!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-01-19T02:27:47.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Monkey",
      "body": "Hey, how much longer before you get the rss feeds going?  How about an rss feed for the current / upcoming showings?\r\n\r\nI want to publish your showings on my site to help promote the moxie but I need the feeds man!\r\n\r\nOn a related note, I'm an experienced php programmer/web developer and I'm willing to work for movie tickets!",
      "created_at": "2006-01-19T07:56:50.000Z"
    },
    {
      "author": "Maddy",
      "body": "it wasn't a projector--it was a camera to record all the crazy porn they are making while on the island",
      "created_at": "2006-01-19T08:15:36.000Z"
    },
    {
      "author": "brian of moore",
      "body": "Richard Dean Anderson is the only person that should be referenced in a situation like this",
      "created_at": "2006-01-19T13:35:03.000Z"
    },
    {
      "author": "Nate",
      "body": "Except that Dan was working with a complete rectifier; MacGyver never had anything more complex than a paperclip.\r\n\r\nNo, Dan's true MacGyveristic moment was when - with an oblivious audience - he kept the entire projector from flying apart with one of Nicole's hairbands.  Team Chilton!",
      "created_at": "2006-01-19T18:50:19.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Surely there's an A-Team reference we can use <i>somewhere</i>?\r\n\r\n/I pity the poor fool who uses it?",
      "created_at": "2006-01-19T18:58:39.000Z"
    },
    {
      "author": "Jennifer Harris",
      "body": "Glad to hear things are back in working order =0)",
      "created_at": "2006-01-20T00:00:56.000Z"
    },
    {
      "author": "Jennifer Harris",
      "body": "Also, we still want to have a Sanctuary of the Cinema Moxie night. We took your lead by using \"Grizzly Man\" as the first film of the semester. ",
      "created_at": "2006-01-20T00:03:48.000Z"
    },
    {
      "author": "Tim",
      "body": "Heh heh...nice Said reference.  :)",
      "created_at": "2006-01-20T03:15:50.000Z"
    },
    {
      "author": "Right Sayid Fred",
      "body": "I'm too sexy for this blog.",
      "created_at": "2006-01-20T06:14:19.000Z"
    },
    {
      "author": "Derek",
      "body": "Nate: What's a Chilton? I thought Dan and Nicole's last name was Moxie.",
      "created_at": "2006-01-20T08:37:28.000Z"
    },
    {
      "author": "Caleb",
      "body": "Patent pending.",
      "created_at": "2006-01-20T15:02:03.000Z"
    },
    {
      "author": "Nate",
      "body": "Wait...\r\n\r\nJurassic Park?",
      "created_at": "2006-01-21T00:28:10.000Z"
    },
    {
      "author": "Nate",
      "body": "Said Solo?  You are mixing your pop-culture metaphors.  What about Jack Bauer? Or Chief Engineer Scottie?",
      "created_at": "2006-01-19T02:30:47.000Z"
    },
    {
      "author": "bjork24",
      "body": "Actually, if you noticed, I deftly weaved together THREE pop culture references. SWEET!",
      "created_at": "2006-01-19T02:37:21.000Z"
    },
    {
      "author": "Maddy",
      "body": "Not to be picky, but it is Sayid.",
      "created_at": "2006-01-19T04:41:02.000Z"
    },
    {
      "author": "bjork24",
      "body": "Sayid? The ex Iraqi soldier? No, I'm not talking about him... I'm referring to Said, the projection tech who mills around in the background. His story has yet to be told, but I think I saw him building a 35mm projector out of a couple coconuts and Kate's underwear.",
      "created_at": "2006-01-19T05:22:12.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
