{
  "id": 353,
  "title": "Not enough H in the D",
  "body": "Two things:<br/><br/><b>First</b> - I have so many tasks to finish, I can't keep them all straight. They're all coming out of the closet! I'm sorry... I couldn't resist. That was a terrible joke. I've put a few down on paper, in a handy to-do format, but those rarely work for me. I always end up over-generalizing the task (i.e. \"Fix computer\" instead of \"fix this, then that, then this, then that\").<br/><br/>One of the biggest tasks that's been hanging over my head is finishing the new Moxie website. I sit down to start, but something more pressing always, ALWAYS comes up. It seems like the only way I can get things done these days is if I have a hard deadline to worry about. SO, the new Moxie website WILL be launched on February 1, 2006. No pushing the date back due to city mandated upgrades, lack of money, or any other similar excuses. It will be done over the next 10 days, or else I will do something... I'm not sure what.<br/><br/><b>Second</b> - We were named \"Best Movie Theatre Condiment\" by 417 Magazine. Pretty cool, eh? Here's how it appears <a href=\"http://www.417mag.com/articles/show_full_article/30\" target=\"_blank\" class=\"broken\">online</a>, and, I assume, in the magazine as well:<br/><br/><b>BEST MOVIE THEATRE CONDIMENT</b><br/><br/><i>Moxie Cinema’s popcorn seasonings</i><br/><br/>If you’ve yet to catch a flick at The Moxie, or if you haven’t followed the online blog chronicling the pressures a young couple must deal with to open an independent movie theater, we would encourage you to do so. (It’s just fun). But if you haven’t had the chance to sample one of their 12 popcorn flavors, well, we pity you. The Moxie offers flavors such as jalapeño, barbecue and nacho cheddar. The seasonings come from nomorenakedpopcorn.com and transform already stellar kernels (we’ve tried it plain, too) into a party for your mouth.<br/><br/>###<br/><br/>SWEET! We're moving on up... to the East side. Ok, something is drawing me away (as per usual). It's a giant pencil!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-01-21T06:36:17.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Ben Dillon",
      "body": "Ah, make it stop! I get enough bad jokes from my parents.",
      "created_at": "2006-01-21T06:56:59.000Z"
    },
    {
      "author": "erin",
      "body": "i get enough bad jokes from my parents. and teachers. teachers LOVE bad jokes. they LOVE them!!!",
      "created_at": "2006-01-21T07:59:32.000Z"
    },
    {
      "author": "Caleb",
      "body": "417 named their own website as Best New Website. LAME! At least they hit it on the money with the Best Movie Theatre Condiment. ",
      "created_at": "2006-01-21T08:02:07.000Z"
    },
    {
      "author": "Allison",
      "body": "Holy cow!  You have marshmallow and chocolate seasoning!!!  Is it REALLY REALLY GOOD???  Also, the nomorenakedpopcorn website only had 10 seasonings listed -- what are your other two?",
      "created_at": "2006-01-21T22:40:20.000Z"
    },
    {
      "author": "bjork24",
      "body": "On top of the 10 seasons that are available to the public, we have two \"special\" flavors made specifically for theaters: butter and caramel... and regular salt, so I guess that makes 13 flavors.",
      "created_at": "2006-01-21T22:50:27.000Z"
    },
    {
      "author": "Ian",
      "body": "I just read through that whole list with Mike, and to celebrate we're coming in tonight to watch a movie, any old movie, at the delicious Moxie!  I think Brian will be there!  I don't think Al Brooks looks funny, but we'll see!",
      "created_at": "2006-01-22T05:36:28.000Z"
    },
    {
      "author": "Gregory Holman",
      "body": "In response to Caleb: We're nothing if not accurate. [Insert smiley-face here.]<br/><br/>Anyway, thanks to Dan and Nicole Chilton for mentioning their editors' pick on the blog. And for the chocolate marshmallow. Went deliciously with <i>Looking for Comedy in the Muslim World.</i>",
      "created_at": "2006-01-24T10:46:53.000Z"
    },
    {
      "author": "monkey",
      "body": "Offer still stands for web design/programming. Will work for tickets. hint hint",
      "created_at": "2006-01-26T03:05:19.000Z"
    },
    {
      "author": "monkey",
      "body": "scratch that. tickets are awesome BUT...I would work even faster for moxie blend coffee.. it's the best coffee in the world!",
      "created_at": "2006-01-26T03:06:27.000Z"
    },
    {
      "author": "bjork24",
      "body": "I appreciate the offer Monkey, but I think I've got things covered from the web development end of things.",
      "created_at": "2006-01-26T03:43:34.000Z"
    },
    {
      "author": "Music fan",
      "body": "417 readers also picked Big Smith and M-Dock as top bands. Oh those are the best Springfield bands alright ... of 2001. At least they finally got a real group in there with Speakeasy, except that band moved out of town almost five months ago.",
      "created_at": "2006-01-28T05:45:17.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
