{
  "id": 354,
  "title": "I feel loved",
  "body": "This entry was originally posted on <a href=\"http://tapioca.retroflux.com\" target=\"_blank\" class=\"broken\">Nicole's blog</a>, and I thought (as per her suggestion) it would go good here:\r\n\r\nOur Moxie movie goers are great people. We had to cancel all our shows on Tuesday due to technical difficulties, so Dan and I put signs up on the door letting everyone know, headed for home (by way of picking up a pizza), and had an early night watching LOST…which turned in to a late night of LOST, but that’s a whole different story.\r\n\r\nSo today a lot of the people came in who were glad to see we were back open for business, but said they had been worried. Since I didn’t write on the sign why we had to cancel our shows, they were worried it had something to do with one of us, or worse, our dog. And when I said it was because of a piece of the projector, they said they were relieved it was something as simple as a piece of equipment.\r\n\r\nAwww! I’ve had a lot of fun over the past few months running the theater, but little sentiments like that make my year. And it’s only January!\r\n\r\nThanks Moxie movie goers!\r\n\r\n…although I guess this should probably be written on Dan’s blog, seeing as that’s where people go to find out about the latest and greatest…",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2006-01-24T06:56:13.000Z",
  "author": "Nicole",
  "comments": [
    {
      "author": "Jordan",
      "body": "I remember on Tuesday one of my friends called me and said (in near-hysterics) \"I think the Moxie's closed!\"\r\n\r\nMy natural response, \"It was a matter of time before there was nowhere left to go in Springfield\".  \r\n\r\nNeedless to say - though I'll say it anyway - it's nice to see you guys are still going strong.  \r\n\r\nOh, that, and I wish your dog the best.",
      "created_at": "2006-01-24T07:53:16.000Z"
    },
    {
      "author": "--Jeff",
      "body": "You guys can't just throw a sign on your door for a day and get rid of us <i>that</i> easy.  In fact, now that you're here, you can't leave. No one told you?  Sorry. It's like the Hotel California: <i>\"You can check-out any time you like, but you can never leave...\"</i>\r\n\r\nOh, and some of us lurk on your blog already, Nicole. Ugh, that sounded creepy.  You know what I mean. :)\r\n",
      "created_at": "2006-01-24T08:56:15.000Z"
    },
    {
      "author": "Derek",
      "body": "I gave my comment to Nicole because she wrote this entry. Man, you're such a thief. Wait a minute. This is a comment for you. Damn. You've thwarted me again with your craftiness, but I'll get you next time, Moxie  Dan!",
      "created_at": "2006-01-24T09:47:02.000Z"
    },
    {
      "author": "Caleb",
      "body": "Never underestimate the power of an informative blog post. Especially one about broken projector parts. Of course it helps if people read the blog to find out these things!\r\n\r\nI'm so excited you're getting Pulse!",
      "created_at": "2006-01-24T21:10:43.000Z"
    },
    {
      "author": "Nate",
      "body": "Also?  Never underestimate your enemies.",
      "created_at": "2006-01-24T23:18:01.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Also, also:  <a href=\"http://www.despair.com/idiocy.html\" target=\"_blank\">Never underestimate the power of stupid people in large groups.</a>  ",
      "created_at": "2006-01-25T00:18:50.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Oops.  Guess I should have added the 'target=\"_blank\"' to that hyperlink. Sorry. \r\nDan, Nicole?  A little help, maybe? ",
      "created_at": "2006-01-25T00:21:27.000Z"
    },
    {
      "author": "Nate",
      "body": "I am proud to say that I have been in that exact skydive formation before.  And, yes, get us around a keg later and we get a little stupid.\r\n\r\nMan, I used to love despair.com!",
      "created_at": "2006-01-25T01:35:46.000Z"
    },
    {
      "author": "erin",
      "body": "ooh. thats pretty funny. they actually have the real posters like that in the my traing room for my job.\r\ninspiring really.",
      "created_at": "2006-01-25T18:07:56.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Heh heh.  Kegs and skydiving. Fun, but NOT in that order, though. ;) \r\n\r\nBTW, Nate, were you the same Nate of <i>A Piano by Christmas</i>?  ",
      "created_at": "2006-01-26T01:25:05.000Z"
    },
    {
      "author": "Nate",
      "body": "No.  I do not know of this Nate of which you speak.\r\n\r\nBut that lindsey wannimihama-something? Keee-yoot.",
      "created_at": "2006-01-26T01:54:35.000Z"
    },
    {
      "author": "Derek",
      "body": "I went to high school with the cast of that movie. I wasn't really friends with any of them, but I had friends who were. Does that make me cool? No? Oh well :-(",
      "created_at": "2006-01-26T08:11:16.000Z"
    },
    {
      "author": "bjork24",
      "body": "Nate Black is the \"Nate\" from A PIANO BY CHRISTMAS. The omnipresent \"Nate\" is none other than disgruntled Moxie ex-employee, Nate R.. He kind of looks like me, but with a little less hair... and he's a LOT older than me. He's almost a geriatric.",
      "created_at": "2006-01-26T08:58:56.000Z"
    },
    {
      "author": "Nate",
      "body": "No, no, Dan.  Not omnipresent.  Omniscient.  OMNISCIENT.",
      "created_at": "2006-01-26T23:40:11.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
