{
  "id": 355,
  "title": "Moxie Theatre Lobby",
  "body": "Downtown Springfield is primarily known for three things: no parking, violent riots, and Robert E. Smith - folk artist extraordinaire. When he's not being confused for the lead singer of \"The Cure,\" Robert is busy painting the town with his vibrant child-like murals. His work is collected by various folk art museums and, most notably, the Clinton Library... located somewhere in Arkansas.\r\n\r\nSince becoming our second exhibited artist, Robert has become a fixture at The Moxie. On one particular occasion back in late November, Robert serenaded an audience of 60+ with Christmas carols. Did I mention that Robert is really old? It's true. He is. And I'm not talking 30 or 40 years old <i>old</i>... I'm talking late 70's old, which, thanks to multi-vitamins and fluoride infused tap water, is the new 40. Anyways, Robert's advanced age makes it all the more amazing that he's still such a prolific artist. Long story short, Robert E. Smith is an asset to Springfield... and he loves our Fitz's Root Beer and popcorn.\r\n\r\nNicole and I have purchased some of his art, and recently commissioned him to paint a scene depicting The Moxie. After several weeks of sketching and deliberating, Robert decided that he couldn't fit the entire theater on one canvas, so he made two. This is the first of the two part series:\r\n\r\n<a href=\"http://moxie.danchilton.com/pix/grum/012506/painting_big.jpg\"><img src=\"http://moxie.danchilton.com/pix/grum/012506/painting_small.jpg\" width=\"425\" /></a>\r\n\r\nClick the picture to enlarge it.\r\n\r\nTo sweeten the deal, each of Robert's paintings includes a handwritten story describing the action in the painting. The stories are in one giant block of text. No indents, no paragraphs, nothing. Just words. He also narrates the story onto cassette (complete with sound effects), but I don't have the capability to transfer cassette to digital. SO, here's the story, as Robert wrote it:\r\n\r\n<b>Moxie Theatre Lobby</b>\r\nBy Robert Eugene Smith\r\n\r\n<i>This painting, part one, is the Moxie Theatre Lobby outside of the auditorium where the movie is featured.</i>\r\n\r\nA few people have entered the lobby and are early arrivals before the movie starts. Norman Baxter and Julie Flangraves were two attendants behind the ticket counter and the popcorn machine on the ticket counter. Norman wore a green and red shirt. Julie wore a yellow coat and glasses. In the two small rooms behind the ticket counter and popcorn machine, Andrew, a black and white cat, walked around on the floor. There was a yellow ice box on one wall corner and a pink telephone sat on an orange table in an adjoining room. There was a yellow door with a red bottom that hung on an upper wall part. The door closed a passage between the two rooms when unfolded. Two ladies and two men stood outside in the theatre lobby not far from the ticket counter. Some soda, beer, and candy sat in a case below the ticket counter. There was Coca-Cola, Fitz Root Beer, Orange Soda, Budweiser beer, and Bud Light beer. Hershey's Duds candy, Jujy Fruit bar and Hot Tamales. The three men in the lobby: one man had black hair, wore a green sports shirt and red pants. Another man wore a red cap, had blonde hair, and wore a red and yellow shirt and blue pants. Another man had blonde hair, wore glasses, and a red and blue shirt and yellow pants. The two ladies: one lady wore a yellow t-shirt and blue pants. The other lady had blonde hair and wore a blue dress. The floor was a combination of pink and gray. The other part of the floor running on one side of the concession stand and leading to a door that opened out into the parking lot. That floor was of a gray color. A dog by the name of Bogart walked around and you could hear him barking. He got into the lobby by mistake on the side of the concession stand facing the floor that led out to the parking lot. There was a case of eggs that sat on the counter. There was a clock on the wall inside of the concession stand. Some pictures of some film celebrities hung on the wall that was by the door that opened into the movie auditorium.\r\n\r\nThe End\r\n\r\nI know what you're thinking, \"the two people behind the counter look like Dan and Nicole, yet they're not mentioned in the story.\" According to the filmmaker who's currently making a documentary about Robert, the reason why the workers are named Norman and Julie, and not Dan and Nicole, was simply because Robert didn't have a picture of us to work from. He painted the people from memory, but didn't think they looked enough like us to give them our names... yet Bogart seems to have made the cut (per my request). Either way, we're very happy with it and can't wait for part two.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-01-26T10:07:43.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "bwhaha.. that is the super raddest\r\n... teehee.. grinen perfecto\r\n\r\n\"julie\" looks kinda like velma from scooby doo.... only wearing yellow instead of orange.. \r\n\r\ndig it",
      "created_at": "2006-01-26T10:32:19.000Z"
    },
    {
      "author": "Caleb",
      "body": "Robert's the coolest. You should hang one in each bathroom.",
      "created_at": "2006-01-26T11:06:35.000Z"
    },
    {
      "author": "Jennifer Harris",
      "body": "awww, fun!",
      "created_at": "2006-01-26T19:37:34.000Z"
    },
    {
      "author": "ole",
      "body": "Would have loved to see his take on the SGFsoccer.com Cinebar sign :)",
      "created_at": "2006-01-26T20:20:12.000Z"
    },
    {
      "author": "Nate",
      "body": "Words, indented or no, cannot describe the awesomeness of this painting.\r\n\r\nIt makes the perfect wallpaper background for my computer this month.  (I hope that doesn't cheapen its artistic integrity).",
      "created_at": "2006-01-27T01:50:42.000Z"
    },
    {
      "author": "Derek from San Diego",
      "body": "That painting is rad. I think I will have to drive to Springfield again and steal it :). Glad to hear that the Moxie is kicking butt lately. Keep it up guys!",
      "created_at": "2006-01-27T03:58:22.000Z"
    },
    {
      "author": "Caleb",
      "body": "You've <b>got</b> to get <a href=\"http://www.apple.com/trailers/focus_features/brick/trailer/\"> this movie</a>.",
      "created_at": "2006-01-27T06:22:47.000Z"
    },
    {
      "author": "--Jeff",
      "body": "AMEN CALEB!!!!  \r\n\r\nI've been waiting (not really patiently) for March to roll around.  The buzz on this movie is huge since it played at Sundance (Last year, or was it two?). I guess they've been \"polishing\" it and playing it at Festivals until its major release.\r\n\r\nI've bugged Dan too many times about it, so I'm glad someone else is interested in seeing it too...",
      "created_at": "2006-01-27T08:16:07.000Z"
    },
    {
      "author": "bjork24",
      "body": "We started playing the BRICK trailer in front of NINE LIVES yesterday. Keep your fingers crossed!",
      "created_at": "2006-01-27T08:45:53.000Z"
    },
    {
      "author": "Matthew Martin (aka R.J. Jack MacReady Burton)",
      "body": "My favorite picture of his is the Batman one. Too bad it was about $400 dollars though.",
      "created_at": "2006-01-27T23:49:59.000Z"
    },
    {
      "author": "bjork24",
      "body": "That's the other one we purchased from Robert: Batman and Robin on the Beach. We didn't pay $400 though...",
      "created_at": "2006-01-27T23:53:31.000Z"
    },
    {
      "author": "brian of moore",
      "body": "in case anyone wants to go see breakfast on pluto.. but isnt too sure... i would have to stick it up there as one of the top five movies ive seen at the moxie so far.... it would probably only be #5  .. but ive seen alot of the moxie movies :-)  so yes.. go see it...",
      "created_at": "2006-01-28T01:41:28.000Z"
    },
    {
      "author": "Nate",
      "body": "Alright there, Ranky McRankerson.",
      "created_at": "2006-01-28T01:48:16.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i rank that comment as a 210831 \r\n\r\nbut its only that high.. because you didnt tYp3 i+ Lk tHi$",
      "created_at": "2006-01-28T07:27:19.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    },
    {
      "id": 16,
      "name": "Customers"
    }
  ]
}
