{
  "id": 356,
  "title": "I just split my fingernail in half",
  "body": "While I was busy rewinding part one of NINE LIVES, the index finger on my right hand decided it would wander off into the spinning metal vortex of the take up reel. Long story short (I'm fond of that saying, aren't I?), a large piece of metal on the reel gently lifted up my fingernail, kissed the quick, tore the nail in half, and then, ever so gingerly, laid the nail back down where it had originally been. It's amazing how such a small injury can totally incapicate me.\r\n\r\nIt hurts when I type.\r\nIt hurts when I click the mouse.\r\nIt hurts when I rewind films.\r\nIt hurts when I shovel popcorn.\r\nIt hurts when I lift reels.\r\nIt hurts when I open drinks.\r\nIt hurts when I scratch my butt.\r\n\r\nIt just plain ol' HURTS!\r\n\r\nStupid fingernail.\r\n\r\nOn a brighter note, our February calendar is finally complete. Here's the lowdown:\r\n\r\nFeb. 1-7  A HISTORY OF VIOLENCE\r\nFeb. 3-5   BE HERE TO LOVE ME: A FILM ABOUT TOWNES VAN ZANDT\r\nFeb. 8-14  BUBBLE\r\nFeb. 10-13 COACHELLA\r\nFeb. 14-15 MOOLAADE\r\nFeb. 15-22  DUMA\r\nFeb. 16-21  PULSE\r\nFeb. 22-28 WHITE COUNTESS\r\nFeb. 23-27  LOGGERHEADS\r\nFeb. 27-28  HEAVEN ON EARTH (with director Rick Minnich)\r\n\r\nSince the suxteen is bringing in CAPOTE and GOOD NIGHT, AND GOOD LUCK, we thought we'd round out the Oscar hopefulls with a revist of HISTORY OF VIOLENCE. Also, since it took suck a long time to finalize the schedule, we thought it would be a good idea to start off with a film that didn't need much promoting. Maybe if we're lucky we can convince Tess Harper to swing by for one of the screenings of LOGGERHEADS... keep your fingers crossed.\r\n\r\nSpeaking of fingers, mine is killing me.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-01-28T03:22:58.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Scott G.",
      "body": "It hurts when I taste your blood and pus in the popcorn. :)",
      "created_at": "2006-01-28T05:35:14.000Z"
    },
    {
      "author": "Scott G.",
      "body": "I'm sorry Dan, I shouldn't have typed that.",
      "created_at": "2006-01-28T05:39:13.000Z"
    },
    {
      "author": "brian of moore",
      "body": "coachella???\r\nas in that super rad festival that alot of people i know attended.. and i wasnt able to go? the one with all the bands that i love.... LOVE!.... \r\n... that coachella?\r\nhmm.. well at least ill get to see a movie about it\r\n\r\noh.. and ive heard many great things about a history of violence.. i didnt know if you guys would get it or not.. \r\nso thats very good to hear as well :-)\r\n\r\nnow parden me .. while i look up the rest of these movies.. to see what theyre about :-)",
      "created_at": "2006-01-28T07:41:36.000Z"
    },
    {
      "author": "Matthew Martin (aka R.J. Jack MacReady Burton)",
      "body": "Fingernail injuries make me cringe big time. To me, fingernails are really sensitive. Everyone, go see \"A History Of Violence\" (many probably already have). You won't be sorry! (Some may be against it going from the Palace and discount prices to you guys and regular prices though.)",
      "created_at": "2006-01-28T09:19:30.000Z"
    },
    {
      "author": "Aaron J Scott",
      "body": "I've performed removal of a hangnail on my big toe before. It was the same way – hurt when I walked, hurt when I sat, hurt when I was asleep – and then I realized the scabby thing was supposed to be under my toenail.\r\n\r\nI've also removed a couple of toenails on myself and one on another person. That didn't hurt quite as bad. They just needed to go.",
      "created_at": "2006-01-28T10:07:11.000Z"
    },
    {
      "author": "Aaron J Scott",
      "body": "PS those are all my gross toe stories.",
      "created_at": "2006-01-28T10:07:24.000Z"
    },
    {
      "author": "erin",
      "body": "removal of own toenail. really bad.\r\nremoval of someone elses toenail. super bad (and not in an 'i got soul' kinda way)\r\n\r\nhow could one be convinced to pull someone elses toenail? when i clip my neices finger/toe nails i get queazy.. thinking about how awful it would hurt her if i cut them too short. or didnt cut enough and the nail was sharp and got snagged. or if the toenail flys off after being clipped and gets her in the eye.....\r\n\r\nsorry about your finger dan. time heals all wounds.\r\n: )",
      "created_at": "2006-01-28T10:45:45.000Z"
    },
    {
      "author": "Caleb",
      "body": "Props to Erin for tying toenail removal with James Brown. \r\n\r\nAnd I don't know how well everyone will like A History of Violence, but I'm sure they'll love the nice pre-show slideshow ad for it!",
      "created_at": "2006-01-28T12:32:46.000Z"
    },
    {
      "author": "Aaron J Scott",
      "body": "Both cases of lost toenails (theirs and mine) were after long backpacking trips. It actually hurts worse if you try to leave it on there when it's all banged up and coming off like it was. Getting rid of it is actually kind of liberating...",
      "created_at": "2006-01-28T20:47:20.000Z"
    },
    {
      "author": "Dave",
      "body": "try crazy glue.* seriously.\r\n\r\nwhen i used to play a lot of guitar my fingernails would sometimes get torn away from the skin. i'd crazy glue it back down and good as new. learned that trick from stevie ray vaughan. i didn't learn it from him personally but i'd read he did that. it works.\r\n\r\n*use at your own risk and all that.",
      "created_at": "2006-01-28T22:03:50.000Z"
    },
    {
      "author": "Ummmm",
      "body": "Is the health dept. cool with you putting an open wound in the popcorn??  ",
      "created_at": "2006-01-28T23:59:16.000Z"
    },
    {
      "author": "Aprilcakes",
      "body": "Okay... because of Dave's Crazy Glue suggestion, I feel that I must add that Super Glue was originally invented for use by the military to hold wounds together when someone was injured in the battlefield.  So, I'm pretty sure it would be safe to use.  Did you know that the military also invented duck tape (now known as duct tape)? It was used to water-proof one's boots and such, hence the name \"duck\" tape. Following that rabbit trail a little further, I once heard that the Wal-Mart Supercenter on North Kansas Expressway was the \"duct tape capital of the United States\", apparently because they sell the highest volume of the stuff: how white-trashy is that? Ah, Springtown!",
      "created_at": "2006-01-30T02:36:06.000Z"
    },
    {
      "author": "nicki",
      "body": "OWWWWWW!!!\r\n\r\nhope it heals super-quick.\r\n\r\nif not, a margarita might help... the cold of the glass could numb the finger until the alcohol could!\r\n\r\n... mmm.... now i need one!",
      "created_at": "2006-01-30T02:55:03.000Z"
    },
    {
      "author": "Lotus",
      "body": "Poor Dan. I slammed my finger in the car door on Christmas morning in 1997. It never fulled healed. It was fun grossing everyone out; I could lift the nail halfway off of the nail bed. Good luck!",
      "created_at": "2006-01-30T10:40:36.000Z"
    },
    {
      "author": "Mr. Wally",
      "body": "I'm in the process of losing a toenail right now!  Someone stepped on my foot as I was playing basketball a few months ago.  It turned all black and stuff.  It's so cool.  It's my first one.",
      "created_at": "2006-01-30T19:44:45.000Z"
    },
    {
      "author": "Aristocrat",
      "body": "I would like to further explore the amount of time between the butt-scratching and the handling of food.  Is that wrong to know if you washed your hands in-between?  Should I bring some Purell?  <img border=0 href=\"http://www.centralsupplyco.com/pal.gif\">",
      "created_at": "2006-01-31T00:04:34.000Z"
    },
    {
      "author": "bjork24",
      "body": "Actually, I haven't handled the food (read: popcorn) since the incident. Nor will I until the bandage comes off.",
      "created_at": "2006-01-31T01:17:46.000Z"
    },
    {
      "author": "Mark",
      "body": "38 hits for 'long story short' on the Google search of the moxie site.\r\n\r\nHmm...\r\n\r\nM",
      "created_at": "2006-01-31T23:36:41.000Z"
    },
    {
      "author": "Ben",
      "body": "Not to take this off topic, but nice work on screening Bubble! I hope NATO doesn't try to burn your theater down :) The news reports say that you're supposed to get a cut of the dvd revenues. How is that working out for you (not that you can say since you haven't actually shown it yet). I'd love to know the particulars, as this is pretty groundbreaking (I think)",
      "created_at": "2006-02-03T13:53:21.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
