{
  "id": 358,
  "title": "Question of the day",
  "body": "Ok, the new website is 80% finished. Should I (a) go live tomorrow, as promised, with a few holes and fill them over the coming days, or (b) hold off until early next week when everything is hunky dory? Depending on your comments, I'll make the final decision around 3:00 pm CST. Good luck.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-02-01T11:36:38.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Jess",
      "body": "Go Live!! A few holes just makes the site cooler. Keep us on our toes, and makes you a non-promise breaker.",
      "created_at": "2006-02-01T18:22:08.000Z"
    },
    {
      "author": "Aaron J Scott",
      "body": "Are we going to stop frequenting the site or supporting the theater if you don't? Not likely. Take it at your own pace.",
      "created_at": "2006-02-01T18:54:28.000Z"
    },
    {
      "author": "Trench",
      "body": "While I agree with Jess, I'd also have to say patience is a virtue we are severely lacking \"in these here parts\".\r\n\r\nI'm anxious to see the new site, but as a webdev dude myself I'd have to say it's totally your call to make.  You are the only one that really knows what's ready and what isn't.\r\n\r\nWith that said, I'd like to throw a thought at you.\r\n\r\nI remember back in 2000-ish <a href=\"http://blender.org/cms/Home.2.0.html\">Blender</a> was unvieling its new site design (though I hate the software)and came up with an awesome way of doing so.  The unveiling took place over a seven day period.  Day one you think your eyes are screwing with you... there are tiny \"holes\" that have appeared in the layout.  Day two, the holes have gotten larger, looking as if acid were eating through the site... but, lo and behold, you could see bits of the new layout through the holes.  Each day more holes appeared, and those that were already there kept growing until, on day 7, the old layout had dissolved entirely, leaving us with a brand-spanking-new site.\r\n\r\nIt was a very cool transition, and one I obviously haven't forgotten.  Things like that stick with people.  And today the potential of creating an effect like that is even more profound, and much lower on the difficulty scale.  Think: div id=\"unveiling\" with a z-index of 1000.  The current design could still be functional... it would just appear as if, for lack of a better phrase, \"there were a glitch in the matrix\".  You could even use animated gif's to pull off some really bizarre shiz [see: the donnie darko site, as well as the requiem site... though,  they use flash, you wouldn't have to do that crap.  Screw flash.]\r\n\r\nMake people think Campbell 16 is hacking into your site.  Hell, have the site go completely down for a week while you put on a big production for us.\r\n\r\nWar of the Worlds meets MoxieCinema.com.\r\n\r\nYes, sir.\r\n\r\nI'm just tossing some ideas at you.  \r\n\r\nTheatre is good on <i>all</i> screens, eh?\r\n\r\nBest of luck.\r\n\r\nTotally looking forward to seeing what you've done.\r\n\r\n;)",
      "created_at": "2006-02-01T19:06:02.000Z"
    },
    {
      "author": "Laurali",
      "body": "I wouldn't mind a few holes in the site...",
      "created_at": "2006-02-01T19:46:23.000Z"
    },
    {
      "author": "Laurali",
      "body": "I wouldn't mind a few holes in the site...",
      "created_at": "2006-02-01T19:46:43.000Z"
    },
    {
      "author": "Jeremy",
      "body": "I think you should wait until everything is all ready.  You don't want someone's frist visit to the site to fall when things are still in \"pardon our dust\" mode... us blog readers are easy to please, but depending on how much you want the website as a whole to reflect you commercially, I would wait until you have it all ready to shine. \r\n\r\nTo appease your easy-to-please blog readers though, perhaps the delay in the  great unvieling could reward us with some spiffy new content. A new phlog? Some sort of quasi-exclusive interview? More Benzo?\r\n\r\nJust some ideas... Good luck with everything",
      "created_at": "2006-02-01T20:00:32.000Z"
    },
    {
      "author": "Jonathan T.",
      "body": "as far as the website goes, i'd say hold off till YOU are ready.  if it's not done in your eyes, then you're gonna be dwelling on it and rushing to get the new version up just to replace the unfinished one.  i don't know if that makes any since, but, i wouldn't rush it.  \r\n\r\ni'm a virgin commenter, but, i wanted to let you know i've been an avid reader of your posts since i discovered your blog.  i've read all of your posts chronologically up to October 2004.  i'm hoping to have time today to delve into more of your wisdom.  i too have a dream of opening a small theater in the downtowon of my Southeastville.  i originally wanted it to be a second run theater, but am now starting to lean towards an indie spot.  \r\n\r\njust wanted to say i enjoy your posts.  your wisdom and experience have given me mucho inspirado.  gracias!  ",
      "created_at": "2006-02-01T20:36:28.000Z"
    },
    {
      "author": "Aristocrat",
      "body": "Being a programmer myself, I understand this issue from both sides.  Think of the triangle (fast, cheap, bug free).  We all know you can only have 2, so choose wisely.  It has been my experience that most people choose fast and cheap.  Here is where the question about your site comes in...  Most people expect there to be bugs or holes.  It is the nature of the beast.  So, my vote is for you to go live on schedule and say to heck with the complainers!  You can get it done by tomorrow, right?",
      "created_at": "2006-02-01T20:56:04.000Z"
    },
    {
      "author": "matt",
      "body": "wait.  people who go live with holes often tend to lack the motivation to fix said holes later.  wait until it's all done.",
      "created_at": "2006-02-01T21:34:32.000Z"
    },
    {
      "author": "Matthew Martin (aka R.J. Jack MacReady Burton)",
      "body": "Wait. The problem with the current site is that things aren't up yet. Wait until everything is up.",
      "created_at": "2006-02-01T22:32:40.000Z"
    },
    {
      "author": "Derek",
      "body": "I'd say wait. If you get it up early but it's still not completed, people will assume it'll never be done (based on experience with the current design), and lose interest. It needs to be finished before it's launched.",
      "created_at": "2006-02-01T23:06:19.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "I think it's best to wait. But if you're missing a feature when you DO go live, don't link or mention it on the site. Wait till it's done, then integrate it.",
      "created_at": "2006-02-01T23:57:58.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Go live...we're been waiting a long time for this!",
      "created_at": "2006-02-01T23:58:02.000Z"
    },
    {
      "author": "erin",
      "body": "patients is a virtue.",
      "created_at": "2006-02-02T00:01:49.000Z"
    },
    {
      "author": "erin",
      "body": "this has nothing to do with the topic... but. can you tell who febuary's artist is? their medium? etc?\r\n\r\n: )",
      "created_at": "2006-02-02T00:03:14.000Z"
    },
    {
      "author": "Aristocrat",
      "body": "Huh?  Get it up early?  That reminds me of when I was 13...  A cool breeze and .... {Censored Content}  Ahhhh...  The memories!",
      "created_at": "2006-02-02T00:38:00.000Z"
    },
    {
      "author": "--Jeff",
      "body": "As much as I'd like the instant gratification of seeing the new site NOW, wait.  It'll make the wait that much sweeter. \r\n\r\nOr some other stupid cliche like that.\r\n",
      "created_at": "2006-02-02T01:57:48.000Z"
    },
    {
      "author": "Tammy Kirks",
      "body": "I vote for waiting. Might as well roll it out with a big bang rather than a small fizzle. We'll still be here next week!",
      "created_at": "2006-02-02T02:17:40.000Z"
    },
    {
      "author": "Andy",
      "body": "Good choice.",
      "created_at": "2006-02-02T02:35:40.000Z"
    },
    {
      "author": "bjork24",
      "body": "Wait we shall. I'll have some preview shots for you in a bit, though.",
      "created_at": "2006-02-02T02:42:15.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i agree with above... whenever i create websites (for myself at least... not so much when making sites for clients) .. i tend to put up an incomplete version.. and never get around to finishing everything i want.. so in this case i agree with waiting until its finished.. \r\n\r\noh.. and in regaurds to trench: FLASH IS AWESOME! .. in my opinion.. if you know what you are doing.. you can always make a better website in flash :-) \r\nps- no no.. dont get me wrong... reread what i said 'assuming you know what you are doing' .... it just so happens most people dont.. thats all",
      "created_at": "2006-02-02T03:23:12.000Z"
    },
    {
      "author": "nicole",
      "body": "Noooooo! That means even MORE time on the computer. You all should be telling him the current website is fine just the way it is and that he should concentrate on things besides silly websites.\r\n\r\nHe listens to you, dear Blog readers.\r\n\r\nSigh. I guess I should have known what I was getting myself in to...",
      "created_at": "2006-02-02T04:06:41.000Z"
    },
    {
      "author": "Trench",
      "body": "<b>brian of moore:</b>  I'm a W3C webstandards asshole.  Flash is not cool, for many reasons, the primary one being it is owned.  By Adobe.  The more people use Flash the more of the virtual web (space) Adobe owns.  Flash has it's place, I'm not completely disregaurding it, but it's place is in the form of small embeds, not full blown sites.  \r\n\r\nDo you use Firefox?  Anything but IE?  Are you used to tabbed browsing?  I'm guessing not because flash *completely* kills the right click context menu.  And that is just retarded.  As a webdev hustler we have to get out of the \"I'm going to take over the user's browser\" mentality.  The user, at all times, should fuggin' have control of their browser.  It's a commandment on a tablet somewhere.\r\n\r\nAlso, code and scripting should be viewable to anybody wishing to view it.  Adobe/Macromedia says otherwise.  \r\n\r\nAll of this out of the way, I'll have you know I'm Flash Certified.\r\n\r\nI know my shit, luv.\r\n\r\n<3\r\n\r\nPS  Having went on my little rant, I do hope I haven't offended you, Dan, if the new design is indeed Flash.  Judging from the nice clean current design, I'm kinda doubting it will be though.  Trench has the faith in The Dan.",
      "created_at": "2006-02-02T05:09:59.000Z"
    },
    {
      "author": "Caleb",
      "body": "PHP kicks Flash's ass.",
      "created_at": "2006-02-02T06:11:34.000Z"
    },
    {
      "author": "Nate",
      "body": "Wow!  I totally understand what everyone is talking about!\r\n\r\nAnd by \"totally understand,\" of course I mean \"have no f***ing clue.\"",
      "created_at": "2006-02-02T19:40:30.000Z"
    },
    {
      "author": "AD Prison Guard",
      "body": "NO TOUCHING!\r\n\r\ntoo obscure?",
      "created_at": "2006-02-06T02:08:27.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 11,
      "name": "Techish talk"
    }
  ]
}
