{
  "id": 36,
  "title": "Pop goes the vendor",
  "body": "Pop. Soda. Coke. Devil's water. Whatever you call it, it's mmm, mmm good. Nothing takes the bite out of a 111 degree day (that was the heat index in St. Louis at 1:00 PM today) like a good ole teeth-numbing, cavity-enthusing, headache-causing, stool-darkening glass of fizzy POP. That's right, I called it pop, and I bet between 40% to 50% of the rest of you do too. Missouri is one of the few states where the soda / pop war is still being fought... vehemently.\r\n\r\nWith the run-up to the election, you find a lot of people asking similar questions: republican or democrat, was invading Iraq right or wrong, should we keep jobs in America or send them to India, is stem cell research moral... but here in Missouri you're more likely to hear:\r\n\r\n<b>Guy 1</b> - (<i>lifts glass to the sky</i>) Hey you!\r\n<b>Guy 2</b> - Who, me?\r\n<b>Guy 1</b> - Yeah. What's this called? (<i>nods his head towards the skyward glass</i>)\r\n<b>Guy 2</b> - Uh, nodding your head towards a skyward glass.\r\n<b>Guy 1</b> - No. I mean, what's the liquid called <i>within</i> my skyward glass?\r\n<b>Guy 2</b> - I don't know. I can't see it way up there.\r\n<b>Guy 1</b> - Oh. Sorry. (<i>lowers glass</i>) Look. What is it?\r\n<b>Guy 2</b> - Hmmm, it's dark. Fizzy. (<i>tastes the concoction</i>) Mmm, that's teeth-numbingly refreshing! It has to be soda!\r\n<b>Guy 1</b> - You bastard! (<i>smashes the glass over guy 2's head</i>) It's pop! POP! Say it!\r\n<b>Guy 2</b> - Never! AHHHHHH!\r\n\r\nMissouri has an isogloss that meanders all throughout the state, separating the good pop people from the not-so-good soda people... and then there's the hillbillies who only wear one-strap overalls and spend their days smoking corn cob pipes and drinking moonshine from a brown jug marked XXX. You know the ones. They don't have a word for pop, just a dazzlingly complex series of grunts and head nods that indicate their desire for a sugary sodey (SO-dee) pop.\r\n\r\nHere's an additional list of words that you may or may not say rightly or wrongly:\r\n\r\nvacuum (wrong) / sweeper (right)\r\nend of the bread loaf (wrong) / the heel (right)\r\nbreakfast, lunch, or dinner (wrong) / supper (right)\r\ntornado (wrong) / brown, weird lookin' cloud (right)\r\nsee-saw (wrong) / teeter-totter (right)\r\npail (wrong) / bucket (right)\r\nsack (wrong) / bag (right)\r\nsloppy joes (wrong) / yum-yums (right)\r\n\r\nThe list could go on and on, but the real reason for this post was not to prove that everything I say is right, but to express my disgust with the regional Coke distributor - COKE being the brand-specific beverage, not the non-specific pop name... you hear me, Texas. I've called this guy at least 15 times in the last month and he will NOT call me back. I contacted the good people at Fitz's Root Beer Company here in St. Louis, and they responded to me within in minutes. Not weeks, not days, not even hours... minutes. Specifically - 18 minutes. Very impressive.\r\n\r\nIn a perfect world, we'd serve all kinds of specialty and domestic pops at our Cinebar. If someone doesn't want to try a non-traditional pop, I think we should have a few of the old standards on hand to insure the patron's satisfaction (i.e. Coke, Diet Coke, Dr. Pepper, etc.). We may end up buying all of our pop through a wholesale grocer, which would mean we could serve Pepsi and Coke products, along with a whole bevy of specialty brands, without worrying about ruffling our distributor's feathers. Personally, I love Dr. Pepper, and I don't know what I'd do if I had it readily available to me in syrup form.\r\n\r\n<b>For immediate release:</b>\r\nJuly 13th, 2005\r\nMidwestburg, USA\r\n\r\nA young man was found dead late last night in what looks to be another pop-induced overdose, the third such incident in under two months. Witnesses say that the co-owner of The Moxie, a Midwestburg art-house theater known for its unique concession items and one-of-a-kind atmosphere, was drinking heavily as Tuesday night's films \r\ndrew to a close. \r\n\r\n\"Yeah, he was standing over there in the corner slurping on a bag of Dr. Pepper syrup. [His wife, Nicole] tried to grab it away from him by offering some yum-yums, but he wouldn't give it up. He was blabbering on about something or the other... didn't get the last heel at supper, or something like that. I don't know, I couldn't hear him anymore.\" \r\n\r\nLaw officers are afraid that the incident may incite another barrage of soda / pop related violence throughout the Midwestburg metropolitan area, and urge all citizens to remain silent if asked which linguistic variation they prefer. \"It's pretty obvious that this never would've happened had people not been calling it soda,\" said Bobby Joe Rawlings, a local corn pipe vendor. \"It's just sad. Real, real sad.\"",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-07-14T03:14:27.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Newell",
      "body": "As far as I'm concerned it's soda, dag gum it! Pop is for sissies! There... I said it.",
      "created_at": "2004-07-14T07:59:55.000Z"
    },
    {
      "author": "John",
      "body": "I grew up (in the Pacific Northwest) saying pop until one summer I visited Southern California and heard everyone saying soda. I thought that was so cool that I went back and started saying soda just because.\r\n\r\nNow I live in Southern California and I say pop.",
      "created_at": "2004-07-14T11:25:36.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "It's pop! Soda would be a not-so-close second. If you're calling it Coke, you should be shot.",
      "created_at": "2004-07-14T12:29:50.000Z"
    },
    {
      "author": "Fyse",
      "body": "I hate to tell you guys, but actually it's neither. (and that's neither pronounced nEYEther as well.) In reality, I think you'll find it's called 'fizzy drink'. Ah well, I guess you say tomato and I say potato (or something like that...)",
      "created_at": "2004-07-14T15:07:49.000Z"
    },
    {
      "author": "Nicole",
      "body": "It's soda. When I first moved to the midwest, I had no idea that people really used that term. I thought it was only said on shows like Andy Griffith. Dan, you're a hillbilly. Sorry.",
      "created_at": "2004-07-14T16:21:10.000Z"
    },
    {
      "author": "ImmunetoCalgon",
      "body": "Some call it coke, some call it soda and some call it soda.  Just don't make it a diet?  I mean what's the freaking point?  And low carb coke?  Come one, live a little...\r\n\r\nBTW:  I call it soda - I was raised in Hannibal where the war rages on.",
      "created_at": "2004-07-14T18:27:47.000Z"
    },
    {
      "author": "Stephanie Bunn",
      "body": "Thank Gawd for another POP drinker; living in Tennessee, I get baffled looks when I ask what kind of POP a restaurant has in stock...I'm originally from PA, but that doesn't mean anything.  Western and Eastern PA might as well be two different states!\r\n\r\nHave you ever heard of http://www.sodapopstop.com/?",
      "created_at": "2004-07-14T19:40:56.000Z"
    },
    {
      "author": "Mathias",
      "body": "Sweet sweet Pepsi! Pop! god damn you all! :)",
      "created_at": "2004-07-14T20:00:30.000Z"
    },
    {
      "author": "hot toddy",
      "body": "GREAT post. First time visiting this blog (it was listed on the blogs of interest section in Blogger) and I will be back for more. Great job!",
      "created_at": "2004-07-14T20:00:44.000Z"
    },
    {
      "author": "Belle",
      "body": "When I lived in Georgia everything, including Sprite, Dr. Pepper, Tab, and Fanta, was COKE.  Now I live in Pepsi's Home in the Carolinas and people still call it Coke.  The difference in this state is that various cracker snack products, including Van-O-Lunch, Nip-Chees, and Captain's Wafers, are called NABS.  \r\n\r\nUsage: \"All I had for lunch was a coke and a packa Nabs\".",
      "created_at": "2004-07-14T21:21:10.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "Belle, I travel to Georgia annually and I have to say that the Coke thing drives me mad!\r\n\r\n'What would you like to drink?\"\r\n\"Coke.\"\r\n\"What kind?\"\r\n\"What do you mean what kind? Like flavors or something?\"\r\n\"We have Coke, Sprite and Dr. Pepper.\"\r\n\"Uh, I thought I asked for Coke...\"",
      "created_at": "2004-07-14T21:29:53.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yep, people who say COKE for everything are real weirdos, my wife included.\r\n\r\nAnyone have suggestions for what kind of POP we should serve? Any favorites? Regional or domestic?",
      "created_at": "2004-07-14T21:45:57.000Z"
    },
    {
      "author": "Ben",
      "body": "It would be cool if you served root beer from a local company in bottles. I don't know if it would be available where your theater is, but there is a great root beer called Lost Trail, made by the <a href=\"http://www.louisburgcidermill.com/index.html\">Louisburg Cider Mill</a> in Louisburg, KS.\r\n\r\nBy the way, it's totally POP!",
      "created_at": "2004-07-14T22:09:30.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ben - I've never heard of Louisburg Cider before. I think we're definitely going to serve Fitz's out of St. Louis, but I'm always open to learn about more.",
      "created_at": "2004-07-14T22:14:35.000Z"
    },
    {
      "author": "Jana",
      "body": "So, are you a true St Louisan or are you an \"import?\"  Those of us who were born and raised here say \"soda\" and \"vacuum\" with the \"vacuum cleaner\" (although my grandmother used to call it a vacuum sweeper)\r\n\r\n\"yum-yums?\"  I've never heard that one...",
      "created_at": "2004-07-15T05:27:18.000Z"
    },
    {
      "author": "whittler",
      "body": "It's all too much for me. I'm sticking to Sarsparella - the closest soft drink to beer.",
      "created_at": "2004-07-15T08:09:37.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yes, St. Louisians are known for saying soda, but I was born and raised in Midwestburg, where POP is king.",
      "created_at": "2004-07-15T09:39:47.000Z"
    },
    {
      "author": "Oz",
      "body": "I'm glad you asked what types of SODA you should serve, because this is a topic that annoys me to no end.  Okay, I'd say that about 75% of the women I know drink diet SODA, and not everyone wants diet Coke (or diet Pepsi).  There is an entire world out there of diet SODA.  Diet Dr. Pepper is a big favorite, and let's not forget diet Sprite, which makes people happy because it is diet AND decaffinated.  So please, have a little diet variety.  Something like 30-40% of your customers will drink diet SODA, so make them happy by giving them a choice.  My recommendations are diet Coke (of course), diet Sprite, and diet Dr. Pepper.\r\n\r\nOh, and if you want to be a hipster, I LOOOOOVE Jones SODA (www.jonessoda.com).  You could get that, too.  BTW, Jones makes a great diet black cherry SODA.",
      "created_at": "2004-07-15T16:32:18.000Z"
    },
    {
      "author": "Shannon",
      "body": "I hate to tell you this, but sloppy joes (slop, sloppy joes) are also called YIP-YIPS in the St. Louis area.  That's what my grandma always made for us on Saturday afternoon.  Don't ask me!\r\n\r\nSoda / Pop doesn't really matter, but it would be SO cool to be able to get some SKI soda / pop without having to drive across the river.  It comes from the Excel Bottling Company in Breese, Illinois.  Like Squirt, but different.",
      "created_at": "2004-07-15T19:16:57.000Z"
    },
    {
      "author": "Sam",
      "body": "Why does it matter? It's soda by the way and what the hell is a yum-yum? Hey what is your problem with Texas? Just because we speak correctly doesn't mean you have to be jealous and try to make up your own horrible language. Just kidding interesting read though. I've noticed the differences in words between Texas and Utah I think I might just post them. Ok well keep up the good word.",
      "created_at": "2004-07-16T03:54:15.000Z"
    },
    {
      "author": "Max-Ray",
      "body": "I'm originally from Milwaukee, which I'm told is a pocket of Soda-people in a state of Pop-people.  So I say Soda!  Us Milwaukee-ites also say \"bubbler\" for a drinking fountain.\r\n\r\nAnd as for sack and bag?  There's actually a difference (or so I learned from a local in Minnesota).  A bag has a flat bottom, like a grocery bag, while a sack does not, like those slim bags you get for greeting cards or magazines.",
      "created_at": "2004-07-16T20:10:52.000Z"
    },
    {
      "author": "Tim",
      "body": "Ah yes, the horrors od dealing with Coke.  My friend decided the fountain mix of CO2 vs. syrup was off at the Ohio theater he managed.  He called Coke and requested a very simple attachment for the spigot that allows for changing of the mix.  They informed him that only the Coke drivers have those.  The driver shows up two weeks later and says \"drivers don't carry those, call the office.\"  Weeks later, after a strenuous tug o' war between the office and drivers, he finally gets the part delivered.  Coke sucks to deal with.",
      "created_at": "2004-07-16T20:16:53.000Z"
    },
    {
      "author": "Kameron",
      "body": "Heh, I remember the severe beatings I got when I moved from Iowa to the Pacific Northwest and tried asking for a \"soda.\" ;)",
      "created_at": "2004-07-20T00:11:31.000Z"
    },
    {
      "author": "Jill",
      "body": "Why not call it soda pop? Then you'll really sound like a weenie.",
      "created_at": "2004-08-02T03:47:26.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 14,
      "name": "Dialogue"
    }
  ]
}
