{
  "id": 360,
  "title": "Albert Pujols is my friend",
  "body": "I had a meeting with our Anheuser-Busch distributor this morning to discuss our involvement with AB's new online ordering system for retailers. As it turns out, The Moxie will be the first business in the ENTIRE COUNTRY to test the new system. Not Wal-Mart. Not Costco. Not Google. Moxie Cinema, baby. M-O-X-I-E!<br/><br/>In exchange for letting me be the first beta tester, I'm going to provide them with an analysis of my experience (basic stuff). So, as you can plainly see, the entire fate of the Anheuser-Busch empire now rests in the capable hands of The Moxie. If I fail, AB will fall, Natalie Lite will disappear, no one will make funny Super Bowl ads, the Cardinals will start their season at Google Stadium, Tony La Russa will be replaced with Sergey Brin, and Albert Pujols will have no other choice than to move down to Springfield and sling popcorn at The Moxie.<br/><br/>No pressure.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-02-03T23:01:59.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Nate",
      "body": "Eckstein rewinding a film reel, Molina in the booth cursing at the projector because he's been shocked again, and Carpenter clumsily stumbling his way through the introduction: (\"and...uh...there's recycle bins for you to put your trash...and stuff...at intermission.  Oh, there's an intermission...) <br/><br/>*sound of lone audience member clapping*",
      "created_at": "2006-02-03T23:40:25.000Z"
    },
    {
      "author": "Nate",
      "body": "Afterwards, Nicole holds out a stack of paper towels and toilet paper to Edmonds.  The height difference is substantial.<br/><br/>Edmonds, broom and dustpan in hand, looks down at the ground and sighs, \"Bathrooms again?\"<br/><br/>Nicole nods silently.",
      "created_at": "2006-02-03T23:42:59.000Z"
    },
    {
      "author": "monkey",
      "body": "and this guy is left without his favorite beverage and not much left of his favorite team except for the shirt which he will wear daily while protesting and holding a witty \"anti-moxie\" sign....<br/><br/><img src=\"http://monkeypics.20after4.net/morans4jl.jpg\" width=\"250\"/>",
      "created_at": "2006-02-04T01:45:21.000Z"
    },
    {
      "author": "monkey",
      "body": "Hey, if your beta testing goes well is there a chance that we might see \"V for Vendetta\" at the moxie one day?",
      "created_at": "2006-02-04T01:51:23.000Z"
    },
    {
      "author": "Tim",
      "body": "Good luck, son.  We're all counting on you.",
      "created_at": "2006-02-04T01:53:23.000Z"
    },
    {
      "author": "nicki",
      "body": "dang. i missed the pink :(",
      "created_at": "2006-02-04T02:36:42.000Z"
    },
    {
      "author": "brian of moore",
      "body": "rad.. <br/>my brothers pizza place is doing something similar... or.. not so similar.. but supposedly the first restaurant outside of vegas to get touchscreen monitors at every table so people can order their food.. get refills.. order desert.. as well as watch movie trailers.. order movie tickets for the nearbye theaters.. and other random cool stuffs<br/>and its all free for him.. seeing that he is the first.. as well as companies showing ads on the screens...",
      "created_at": "2006-02-04T04:22:58.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Well, <b>monkey</b>, I thought I'd make a more Moxie-related Moran Man. <br/><br/><a href=\"http://img345.imageshack.us/my.php?image=moxmorans8nf.jpg\" target=\"_blank\"><img src=\"http://img345.imageshack.us/img345/6318/moxmorans8nf.th.jpg\" border=\"0\" alt=\"Free Image Hosting at www.ImageShack.us\" /></a><br/><br/>Alliteration aside, can you tell I'm bored?<br/>",
      "created_at": "2006-02-04T04:44:26.000Z"
    },
    {
      "author": "Mark Mahy",
      "body": "I thought that guy walking around the warehouse this morning looked familiar. Don't let the A-B empire fail- I need the job!",
      "created_at": "2006-02-04T09:20:14.000Z"
    },
    {
      "author": "Broken Furniture",
      "body": "Oh for the love if god don't bring Albert Pujols here!! in St. louis its common knowledge that he has to eat babies in order to keep his batting average up. Once the babies have been eatten they reanimate as Zombie babies. The city of St. louis has the infrastucture to handle an army of zombie babies. To suggest that springfield has the same capcity, that my friend is absurd.",
      "created_at": "2006-02-05T17:44:54.000Z"
    },
    {
      "author": "monkey",
      "body": "Coming soon to the moxie:<br/><br/><img src=\"http://wiedi.elbone.net/misc/bilder/cinema.jpg\" width=\"200\" />",
      "created_at": "2006-02-06T03:10:47.000Z"
    },
    {
      "author": "bjork24",
      "body": "Monkey: keep your pictures under 200px please.",
      "created_at": "2006-02-06T03:44:22.000Z"
    },
    {
      "author": "Caleb",
      "body": "Since when did it become kosher to post pictures in the comments? I find it annoying. Anyone else agree?",
      "created_at": "2006-02-06T07:03:00.000Z"
    },
    {
      "author": "--Jeff",
      "body": "It probably wouldn't be too hard for Dan to filter large pictures out of the comments <b>Caleb</b>, to save dial-up users grief, but I think when used correctly (small thumbnails linking to larger pictures) they don't <i>hurt</i> anything nor do they detract from the original intent of the Comments, which is to gauge reactions to the blog entries.  And sometimes, reactions can best be shown in pictures rather than words. <br/><br/>If you're against them because of some humor-impaired, text-only reason, then the clear choice of browser is: <a href=\"http://lynx.browser.org\">lynx</a>.  <br/><br/>I guess I feel strongly because I'm a blatant offender of the Picture Rule. I have no problem with text-only, though,  if that's the general consensus...<br/> <br/> <br/>",
      "created_at": "2006-02-06T20:41:18.000Z"
    },
    {
      "author": "Nate",
      "body": "The correct term is not \"humor-impaired\", but \"differently-humored.\"",
      "created_at": "2006-02-06T21:55:45.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Yeah, that didn't come out like I thought it would.  \"Differently-humored\" is <i>much</i> better.  Is the true PC version \"Humor-Challenged?\" ",
      "created_at": "2006-02-07T00:05:36.000Z"
    },
    {
      "author": "Caleb",
      "body": "Maybe it's just the fact that the same picture has been posted three times now that is annoying. And there's no \"rule\" to my knowledge, I just find it annoying altogether, but that's just me. Maybe if the pictures were actually funny then I'd like them?",
      "created_at": "2006-02-07T00:15:13.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<i>Maybe it's just the fact that the same picture has been posted three times now that is annoying.</i><br/><br/>I just photoshopped \"Go Moxie\" into <b>mine</b> (a lame attempt at humor, a shameless Moxie plug, and Brownie Points.)<br/><br/>But I do see your point.  Humor is not always seen by all. <br/>",
      "created_at": "2006-02-07T00:23:54.000Z"
    },
    {
      "author": "Nate",
      "body": "You grouchies,  looks like somebody has a case of the Mondays!",
      "created_at": "2006-02-07T01:22:28.000Z"
    },
    {
      "author": "Scott G.",
      "body": "Go Royals 2006 baby!!!!!!",
      "created_at": "2006-02-07T06:12:38.000Z"
    },
    {
      "author": "AD Prison Guard",
      "body": "<i>You grouchies, looks like somebody has a case of the Mondays!</i><br/><br/>I was going to post a picture of the Chotchkie's Guy with Flair, but thought twice about it.  <br/><br/>And, yeah. Some pizza shooters, shrimp poppers, or some extreme fajitas would take care of my Mondays....",
      "created_at": "2006-02-07T06:33:57.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
