{
  "id": 361,
  "title": "Don't say I never taught you anything",
  "body": "Nicole and I strolled around MSU's campus today, plastering Moxie calendars wherever we could. I even snuck a few into the backpacks of sleeping students. Psh. Slackers. Being on campus reminded me of an old time-saving trick that I'm going to pass on to my high school and college student readership.<br/><br/>Ok, let's say you have a paper due. Big paper, small paper, whatever - it doesn't make a difference. Now, on the eve of the paper's due date something will inevitably come up that is more important than finishing said paper (i.e. new episode of \"Lost\", a cool movie at The Moxie, sleep). When this happens, you will be faced with 3 choices: 1) ignore the temptation and finish the paper, 2) indulge in the temptation and stay up extra late to finish the paper, or 3) indulge in the temptation, get a good night's rest, and finish the paper in the next day or two. Of course, choice #3 is the obvious answer, but how can this be done? Let me tell you.<br/><br/>+ + + + + + + + + + + +<br/><br/>But not yet.  Why not? Because this is Justin, Dan's <a href=\"http://www.shovelglove.com/\">shovelgloving</a> friend and Moxie employee. You might recognize me as that one guy who isn't Dan.  You know... the one that mumbles during his introductions and recieves liquid-fire hot popcorn oil directly into his eyeball on a weekly basis.  Dan's up front helping customers and I - being such a wonderful employee - am sitting in the back, relaxing, drinking a beer.  I wandered back here and saw that Dan was in the midst of writing a blog post when I decided to hijack it.  So here I am.  But before you get too riled up about a Moxie employee drinking on the job and slacking off: I'm not actually on the clock.  I don't even work tonight.  I'm waiting for Dan to get off (his only night off of the week!) so we can head down to <a href=\"http://pattonalleypub.com/\" class=\"broken\">Patton Alley</a> to drink some beers, eat some burgers, and smoke some imaginary cigarettes.  You see, we were supposed to play poker tonight - we play <i>every</i> Monday night - but our other friend, Doug (whose house we play at), is sick or something.  Pretty ridiculous.  Well, that's about all you'll hear from me for now.  I'll give it back to Dan.  It'll be interesting to see how he criticizes my writing.  I bet he mentions my overuse of dashes and italics, and blames (i.e. <i>fires</i>) me for the severe drop off in Moxie Blog readers.  The <i>bastard</i>.  I should really start wearing eye protection while scooping the corn.<br/><br/>+ + + + + + + + + + + +<br/><br/>Seriously now. This is Dan again. Sorry about that (the whole Justin thing). Where was I? Oh yes, the old college trick.<br/><br/>Ok, so your paper's due in less than 8 hours, but the latest Moxie movie is begging for you to come see it. Here's what you do. Write at least 1/4 to 1/2 of your paper in Word (or Open Office if you're cool), then save it in another format (i.e. Works or Lotus Notes). Find the file and change the extension back to Word's proprietary \".DOC\"... now try to open it in Word. If you can easily read your work, you need to keep trying. Eventually the extension switching will result in a completely corrupted file, with little bits of your completed work (remember the 1/4 to 1/2 I told you to write) showing up amongst the gobble-dee-gook. Once you've acheived this, attach the file to an e-mail and send it along to your professor. The next day, when everyone is handing in their assignment, casually mention that you e-mailed yours to the professor. One of two things will happen: either (a) the professor will not have checked his or her e-mail, buying you TWO extra days, or (b) they'll say something like: \"I couldn't get the file to open. Could you resend it to me?\"<br/><br/>That's when you act shocked and say, \"absolutely! I'll send it to you tonight.\" Voila! You've bought yourself an extra 24 hours AT LEAST. I have a bunch of other tips, but this one seemed to work the best throughout college. Give it a shot, but don't tell anyone who you learned it from.<br/><br/>Now, don't say you never learned anything from reading The Moxie Blog! Ok, back to work on M.O.E. 2.0.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-02-07T09:40:19.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Nate",
      "body": "\"Scooping the corn.\"<br/><br/>Such a lovely turn of phrase.",
      "created_at": "2006-02-07T18:57:50.000Z"
    },
    {
      "author": "Maddy",
      "body": "As a teacher, I am afraid...very afraid.<br/><br/>But don't worry, I won't tell anyone.",
      "created_at": "2006-02-07T19:10:19.000Z"
    },
    {
      "author": "Nate",
      "body": "Better than \"Scorning the poop,\" I guess.<br/><br/>Man, it's still early.",
      "created_at": "2006-02-07T19:11:18.000Z"
    },
    {
      "author": "monkey",
      "body": "as a former student, I wish I had discovered the moxie blog like 6 years ago... ;)",
      "created_at": "2006-02-07T19:14:48.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Best blog post ever.  <br/><br/>The only excuses I had in school:  Math:  My abacus broke.  English:  My typewriter broke.  Reading:  The dog ate my book. <br/><br/>The Moxie blog would have been a welcome relief...",
      "created_at": "2006-02-07T19:48:25.000Z"
    },
    {
      "author": "Jess",
      "body": "That trick does't work if you have evolved biology teachers that know all the tricks...in both grad and undergrad I have been required to turn in a hard copy and an e-mailed copy.",
      "created_at": "2006-02-07T19:50:45.000Z"
    },
    {
      "author": "Jennifer",
      "body": "Ha!  This one has never worked on me, either, because I warn students on day one if they email it to me and it won't open up then they are screwed.  And if it is emailed to me after class time, it is late.  I'm a bitch of a teacher.",
      "created_at": "2006-02-07T20:31:59.000Z"
    },
    {
      "author": "Laurali",
      "body": "Where were you with this advice when I was a college student? Oh yeah. That's right, you were still in kindergarten. Ya slacking whippersnapper!",
      "created_at": "2006-02-07T20:42:24.000Z"
    },
    {
      "author": "Aristocrat",
      "body": "I found crying like Patrick Swayze in \"Red Dawn\" or sleeping with the teacher helpful.  Maybe why I spent that summer at \"space camp\"...  Gotta get strong emotionally somehow!  Now, I listen to Kenny Chesney, drive an over-the-road big-rig and fight daily with my monkey!  Okay, that was all a lie (except Kenny Chesney).",
      "created_at": "2006-02-07T20:45:36.000Z"
    },
    {
      "author": "bjork24",
      "body": "BTW: this trick DOES NOT work with electronic filing of your taxes!",
      "created_at": "2006-02-07T21:55:54.000Z"
    },
    {
      "author": "Caleb",
      "body": "Funny you should post this today. Last night I was facing the same dilemma. I of course chose option 3 and stayed up late to watch <i>Forty Shades of Blue</i> (which kinda sucked by the way, except for Rip Torn's performance), without having prior knowledge of your advice. Instead of knowing I could try such a great idea I was forced to skip class and finish my paper. <br/><br/>So Dan, once again, something that could have been brought to my attention YESTERDAY!",
      "created_at": "2006-02-08T00:14:23.000Z"
    },
    {
      "author": "nicki",
      "body": "wow. what a great trick. but if i recall, my professors required hardcopies too. email of assignment was due by midnight on the due day, hard copy of the same exact thing due in class at the next meeting. but still, a very very good idea. <br/><br/>one of these days i'm going to be late for work, and tell my boss i got stuck in traffic (which will be awesome if she believes me... for i live across the street from work, and my coworkers can see me walk to work).<br/><br/>i'm not sure what that had to do with anything.. just wanted to share my \"brilliant idea\" :)",
      "created_at": "2006-02-08T02:41:05.000Z"
    },
    {
      "author": "Jenny",
      "body": "Aristocrat, are you even on the same planet?  And what is UP with the name?  Are you trying to say you're as filthy as those gas-bag comedians?  I didn't understand them and I certainly don't understand you!!!!  Grow up, okay?",
      "created_at": "2006-02-08T02:42:38.000Z"
    },
    {
      "author": "Caleb",
      "body": "Aristocrat is really a celebrity in disguise. One who appeared in the film. It's....SARAH SILVERMAN!",
      "created_at": "2006-02-08T09:52:27.000Z"
    },
    {
      "author": "Aristocrat",
      "body": "Forrest Gump: I love you, Jenny!",
      "created_at": "2006-02-08T19:39:17.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
