{
  "id": 362,
  "title": "Help us feed",
  "body": "Here's the deal: Nicole and I don't eat right. We spend between 10 to 14 hours a day at the theater, which makes it extremely difficult to fit in well-rounded meals that don't include popcorn as the main ingredient. One of my new year's resolutions was to eat healthier and cut out Taco Bell from my diet, but then that portable thing came back on the menu. You know the one: tostada shell with beans and meat and sour cream and nacho cheese, wrapped up in a grilled soft tortilla. So. Good.<br/><br/>We try to eat at least one meal per day, and that's usually lunch... somewhere other than our house. Today we ate at Hardee's. Yesterday we didn't eat lunch, but Justin and I ate at Patton Alley (their burger - $10 after customizations - is by far the greatest burger in Springfield). It's like a cycle: Taco Bell, Hardee's, Wendy's, Jimmy John's, Patton Alley (the burger), Springfield Brewing Company (beef stew), Chic-fil-a, etc.. Seriously, what else can we do? And what makes it worse is that we don't have the money to be eating out everyday, even if it is only one meal.<br/><br/>Something has to give before my heart does.<br/><br/>What should we do? During my one month \"eat healthy\" campaign, I dined on Clif Bars and my own propritary trail mix. Now all I eat is 75% cocoa dark chocolate... and Taco Bell (did I already mention that?). My heart is burning right now. Let's dissect it further:<br/><br/>When it comes to food, there are three key factors: cost, convenience, and healthiness. Taco Bell is convenient and cheap, but far from healthy. St. Louis Bread Company is healthy and somewhat convenient, but it's definitely not cheap for a sandwich joint. Patton Alley burgers are neither healthy, convenient, or cheap, but MY GOD are they good! Why can't healthy food be cheaper? Seriously. Mama Jean's Health Food Store is about to bankrupt us! Someone needs to make a fast-food health store. Calling Trader Joe's!!!<br/><br/>Ok, my lack of nutrition is forcing me to stop writing. I'm having a hard time formulating sentences and keeping my thoughts in check... and my hands are hurting. Please help us not die. PLEASE!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-02-08T08:41:31.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Andy",
      "body": "I believe you have a freezer, that's #1.<br/>#2)  Get a microwave.<br/>#3)  Hot Pockets.",
      "created_at": "2006-02-08T09:22:00.000Z"
    },
    {
      "author": "--Jeff",
      "body": "You seek The Grail. ",
      "created_at": "2006-02-08T09:58:28.000Z"
    },
    {
      "author": "Caleb",
      "body": "Didn't Justin break the microwave? Or did you fix it? And since I have this same problem of eating out too much and not being able to afford it and being addicted to those Taco Bell tostada things (which I didn't know they had brought back until Justin was eating one tonight), then I am curious to see people's suggestions too. However, Hot Pockets are the DEVIL! <br/><br/>(Am I going to quote a line from an Adam Sandler movie in every comment now?)",
      "created_at": "2006-02-08T09:58:51.000Z"
    },
    {
      "author": "nicole",
      "body": "Err...I never ate at Hardees...",
      "created_at": "2006-02-08T11:00:38.000Z"
    },
    {
      "author": "justin",
      "body": "microwave? broke? i did nothing of the sort!",
      "created_at": "2006-02-08T17:43:43.000Z"
    },
    {
      "author": "Jes",
      "body": "Hot pockets are not healthy!! And I aggree with they are the devil.  Nor are most of the frozen foods.  Take it from a person who's whole life has revolved around eating healthy.  My suggestion is take you lunch to work...which would mean finding time to grocery shop and prepare something.  But if you go to kraftfoods.com they have many quick and healthy ideas for lunch/dinner.  And if you to the tab \"Healthy Living\" and then click on \"Meal and Fitness planner\" it even makes out a weekly menu for you with a shopping list you can print off.  IT IS ALL FREE! And to be healthy you should eat more than one meal a day...that is problem number one.  ",
      "created_at": "2006-02-08T18:55:05.000Z"
    },
    {
      "author": "whitty",
      "body": "You could buy an uber expensive lunch box like I did and bring your lunch/dinner to work.See the trick is that the lunch box is so expensive I feel all kinds of guilt if I don't use it.",
      "created_at": "2006-02-08T18:56:07.000Z"
    },
    {
      "author": "Scott G.",
      "body": "Try one of those healthy meal deals that are delivered to your house (or Work) once per day.  Maybe you could trade meals for advertising, free tickets, or other Moxie perks",
      "created_at": "2006-02-08T18:57:19.000Z"
    },
    {
      "author": "Aaron J Scott",
      "body": "Panera is not that healthy, either. They give the illusion of health, but check their stats ... not so pretty. Sub Shop ($3 sammiches!) is a block away from you, but it's only good for lunch. Wellspring (also only good for lunch) is a couple blocks away, but it can get pricey pretty quick. I'm with Andy, minus the third point – yr gonna hafta bring yr food. Make some stuff at home that'll last for a few days – that's what my dad does. Saves you some bucks, too.<br/><br/>I counted it up yesterday and I probably get somewhere around 1000 calories a day. Woo hoo, starvation diet!",
      "created_at": "2006-02-08T19:01:24.000Z"
    },
    {
      "author": "Dave",
      "body": "Have you thought about going to one of those cooking classes where you cook 10-15 meals at a time, and freeze them all for later?  Something like http://www.supersuppers.com.  Sure, it takes a few hours to go cook all the meals, but it's a lot of fun and much more healthy than eating fast food all week!<br/><br/>",
      "created_at": "2006-02-08T19:13:55.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Dan, your key factors: <i>cost, convenience, and healthiness</i> are right on target.  The problem is (as you've found) that you can only choose two, and I think most of us will agree that we've been down the same road.<br/><br/>At one point I was about 20 pounds lighter than I am now, and I was cooking most of my meals at home.  That says something.  I think.  <br/><br/>If you can stand to eat leftovers (which I can't) or to bring stuff to work (which I can't) or to freeze stuff and reheat it (which I can't) you'll be better off than I was.  You need to cook at home, then bring stuff to work.  <br/><br/>If you're looking for recipes, check out <a href=\"http://www.askmen.com/sports/foodcourt/index.html\">AskMen's FoodCourt</a> section for recipes and ideas.  Yeah, I know.  The site is generally geared towards men, but food  (for the most part) is not a gender thing.  And of course, for the best recipes, there's always The Master: <a href=\"http://www.foodnetwork.com/food/show_ea\">Alton Brown.</a><br/><br/>If you want to count any of those calories, (among MANY other things) <a href=\"http://www.fitday.com\">Fit Day</a> is your website. Free, but you have to register.  <br/><br/>That's all I have right now. <br/>",
      "created_at": "2006-02-08T19:20:12.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Sheesh, sorry for the novel.<br/>",
      "created_at": "2006-02-08T19:20:39.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "Shoot, I'll come down and cook for you guys enough food for a year and then you can freeze it and reheat it. Ok. I'm coming down. ",
      "created_at": "2006-02-08T19:28:11.000Z"
    },
    {
      "author": "Nicole",
      "body": "The key to eating healthy is planning ahead! You should sit down every week and plan your schedule. Then make a list of meals and ingredients based on this schedule. Go to the grocery store and do not deviate from the list. Stick to your meals! If you need to eat out once in awhile...plan it. It will give you something to look forward to. And yes, I agree with those who suggested taking your food to work. Three meals a day is equally important!  ",
      "created_at": "2006-02-08T19:41:27.000Z"
    },
    {
      "author": "bjork24",
      "body": "Woo hoo! So many good suggestions. My stomach and overall health thanks you!",
      "created_at": "2006-02-08T19:43:07.000Z"
    },
    {
      "author": "matt",
      "body": "salads.  salads are really cheap and easy to prepare.  <br/><ol><br/><li>get yourself a nice big bag of salad greens--they come pre-washed and cut.</li><br/><li>get yourself one or two vegetable fixin's.  i usually have an onion and a cucumber or carrots, maybe apple</li><br/><li>get one container of something dry and crunchy--croutons are the obvious choice, but nuts work too, as do chow mein noodles, uncoocked ramen noodles broken up, etc</li><br/><li>get yourself some pre-prepped protein.  you can find prepared tofu that's already spiced and cooked, packages of pre-cooked, pre-sliced chicken or turkey, or hell, tubs of bbq beef brisket</li><br/><li>pick out a dressing you like</li><br/><li>toss, put in a tupperware or similar bowl, take to work</li><br/></ol><br/>trust me, this is more satisfying than you might think, and you can change up the options daily. ",
      "created_at": "2006-02-08T19:55:19.000Z"
    },
    {
      "author": "Laurali",
      "body": "I wish I could help but if it weren't for my husband I'd be living on microwave popcorn, beef jerkey and diet cherry coke.",
      "created_at": "2006-02-08T20:23:05.000Z"
    },
    {
      "author": "Dave Montalvo",
      "body": "just eat clams. you can shuck them behind the counter and give the shells out to the customers as door prizes.",
      "created_at": "2006-02-08T20:48:04.000Z"
    },
    {
      "author": "nicole",
      "body": "The problem also lies in Dan. I make mediterranean vegetable mixes, beef stew, macaroni and cheese...all sorts of stuff. But half the time, he just wants his Patton Alley Burger.<br/><br/>And then for breakfast *I* usually eat something, even if it's raisin toast, orange juice, and coffee - but Dan's...er...busy. The other day, I made us blackberry muffins, and smoothies at least a couple times a week (when we have bananas).<br/><br/>I just have to stick up for myself. And I went grocery shopping last night on my night off.",
      "created_at": "2006-02-08T21:16:07.000Z"
    },
    {
      "author": "bjork24",
      "body": "Don't listen to her! Nicole only cooks for herself and hits me with the lid to the blender whenever she gets a chance. She's so mean! She also makes me eat Bogey hairballs.",
      "created_at": "2006-02-08T21:21:05.000Z"
    },
    {
      "author": "Nate",
      "body": "Nicole does make a mean Mediterranean vegetable mix.<br/><br/>And Patton has good burgers.  Maybe even the best.  But \"by far\"?  <br/>Ebbets HAS to be up there...if not equal then close behind.",
      "created_at": "2006-02-08T22:15:27.000Z"
    },
    {
      "author": "Amanda",
      "body": "I know it is chick food but I always buy a container of cottage cheese and a small can of fruit when I'm hungry away from home. Super cheep...like 2 bucks and lots of great protien etc...",
      "created_at": "2006-02-08T22:45:19.000Z"
    },
    {
      "author": "Aristocrat",
      "body": "Try Meals In Thyme...  http://www.mealsinthyme.com/  They're on S. National...  There are several other places.  You might be able to schedule something with your patrons (those who like to cook --not me) to trade in a ticket for a meal...",
      "created_at": "2006-02-08T22:54:54.000Z"
    },
    {
      "author": "Luke",
      "body": "OK, this may be a little selfish but I want to go ahead and thank Jes for mentioning kraftfoods.com.  I checked out the planner and thought it was brilliant.<br/><br/>Dan, I have the same problem that you have.  Working as an accountant this time of year, you do not get much spare time for things like cooking and shopping so I end up with quick and cheap...and unhealthy all the time.<br/><br/>But I really like the suggestions on the kraft foods site, and the personalization is a great touch.  I think I'm going to give that a try!",
      "created_at": "2006-02-08T23:27:39.000Z"
    },
    {
      "author": "Dave Adams",
      "body": "Have you had Nonna's meatloaf melt sandwich? Or Maria's fried tacos? They're healthy, right?",
      "created_at": "2006-02-08T23:51:40.000Z"
    },
    {
      "author": "nicole",
      "body": "I get the monthly Kraft Foods magazine. They do have good suggestions.",
      "created_at": "2006-02-09T00:30:48.000Z"
    },
    {
      "author": "Jes",
      "body": "I feel so special that somebody took my advice! :) Kudos to Luke!  Try the Shrimp-in-Love Pasta recipe from that site if you like shrimp. <br/>",
      "created_at": "2006-02-09T00:38:04.000Z"
    },
    {
      "author": "Caleb",
      "body": "People actually eat cottage cheese? I always thought they sold it for when people you don't like come to dinner and you serve it they will never come for dinner again. Or maybe they sell it for use as a great gag gift. Or maybe they want you to feed it to the pigeons?",
      "created_at": "2006-02-09T00:39:54.000Z"
    },
    {
      "author": "Nate",
      "body": "Dude, I LIVED on cottage cheese for much of my childhood.",
      "created_at": "2006-02-09T00:51:48.000Z"
    },
    {
      "author": "--Jeff",
      "body": "I'm with <b>Caleb</b> on this one.  I thought cottage cheese was: <br/><br/>1.  The end result of a dare. <br/>2.  What they spray on the tarmac to keep a plane from bursting into flames.   <br/>3.  The base for a <i>Fear Factor</i> \"delicacy\". <br/><br/>Who knew. ",
      "created_at": "2006-02-09T01:14:02.000Z"
    },
    {
      "author": "Nate",
      "body": "What can I say?  I could never turn down a dare.  We lived near a puzzlingly accident prone airport.  And I grew up with little Joey Rogan next door.",
      "created_at": "2006-02-09T01:29:35.000Z"
    },
    {
      "author": "Moran",
      "body": "BEE healthy.  Eat your honey.",
      "created_at": "2006-02-09T03:09:04.000Z"
    },
    {
      "author": "Melinda",
      "body": "One of my favorite meals:<br/><br/>Cottage cheese all mixed up with torn-up spinach leaves, crumbled Fritos, sliced tomato, black pepper, and sometimes roasted sunflower seeds.<br/><br/>The Fritos really complete it.",
      "created_at": "2006-02-09T03:52:32.000Z"
    },
    {
      "author": "Allison",
      "body": "Easy, cheap, and healthy, and since you like Mexican food: Black Bean Burritos.  This recipe makes about 6 servings (by that I mean six good sized meals) so for the amount of food it makes, it's cheap.  And it only takes about 30 min to prepare and cook:<br/>http://www.cs.umass.edu/~allison/bbb.txt<br/>",
      "created_at": "2006-02-09T04:19:25.000Z"
    },
    {
      "author": "tim",
      "body": "-invest in a rice cooker. <br/>-make a couple different toppings, tofu, chicken, beefs, veggies, freeze them. <br/>-invest in some Soy Vey and Thai Garlic chilli sauce<br/>-mix it up and enjoy.<br/><br/>who gets sick of rice?<br/>if it gets boring,<br/>you could make little <br/>rice balls like they have<br/>in pokemon ",
      "created_at": "2006-02-09T09:56:16.000Z"
    },
    {
      "author": "Whimsy Chick",
      "body": "Quick, easy, cheap, and healthy.<br/><br/>- hard boiled eggs (as is or in egg salad)<br/><br/>- tuna fish (on crackers or bread)<br/><br/>- peanut butter or cheese on crackers<br/><br/>- yogurt cups<br/><br/>- fruit (fresh or dried)<br/><br/>- veggies (cut 'em up ahead of time and store them in a big storage bag; then grab and go)<br/><br/>- cereal with milk (breakfast, lunch, or dinner around here)<br/><br/>Being the huge bread and dairy lover that I am, I know how unappealing fruits and veggies sound when you're really hungry for something hot and hearty. But I've found that if I force myself to eat the fruits and veggies first, I always feel satisfied.",
      "created_at": "2006-02-09T20:10:54.000Z"
    },
    {
      "author": "Caleb",
      "body": "I'm surprised no one has said the most obvious answer yet.<br/><br/>Ramen. Plain and simple.",
      "created_at": "2006-02-09T21:04:40.000Z"
    },
    {
      "author": "Jes",
      "body": "Ramen is not healthy; high sodium and low nutrients. Just cheap and convenient.  <br/>",
      "created_at": "2006-02-09T21:43:53.000Z"
    },
    {
      "author": "Rachel",
      "body": "Also, not necessarily healthy is the alternative of buying some \"fun\" foods at Deals. You can get your fix of snack foods and frozen dinners and everything is $1. Save the rest and eat healthy! Then you won't feel so guilty for snacking every once in a while... I also picked up some soy nuts and trail mix the last time I was there. Lots of good stuff if you take the time to look around.",
      "created_at": "2006-02-09T22:52:56.000Z"
    },
    {
      "author": "Melissa",
      "body": "I really am going to come and visit soon.  Maybe I could help you out.  You could do some crockpot cooking-- very hip.  Plug it in in the backroom.  Whip up some delicious soups.  I remember when you guys used to cook most nights-- things like pasta with olive oil and sauteed mushrooms.  That sounds really good actually.  I'm going to go find some food.  Ohhh. . . check out the cookbook, How to Cook without a Book by Pam Anderson (not that one). ",
      "created_at": "2006-02-10T02:00:12.000Z"
    },
    {
      "author": "nicki",
      "body": "if shopping at deals or any other dollar store... be sure to check for expiration dates... a lot of the stuff has the encoded expiration dates... and is probably nearing the end of it's shelf life... that's just been my experiences there :)",
      "created_at": "2006-02-10T02:27:47.000Z"
    },
    {
      "author": "Caleb",
      "body": "A little maggot never hurt anybody. <br/><br/>I think Melissa hit the nail on the head: soups. There are thousands of recipes and her mentioning of this \"crockpot\" contraption is genius. Soup is healthy too. This is what you should begin making. Plus you have all the seasonings you would ever need for soup right on the counter! I'll be expecting a warm cup of minestrone on Saturday. ",
      "created_at": "2006-02-10T03:38:53.000Z"
    },
    {
      "author": "Nate",
      "body": "Mmmmmm....chocolate marshmallow minestrone.",
      "created_at": "2006-02-10T03:44:25.000Z"
    },
    {
      "author": "nicole",
      "body": "Melissa is the best registered dietitian I know!",
      "created_at": "2006-02-10T04:48:16.000Z"
    },
    {
      "author": "Derek",
      "body": "I was considerably better looking when the Moxie opened. Not that I blame the most wonderful theater in the history of time, since I started putting on weight before my first movie there (before it even opened - yesssss!). I've figured out the cheap and convenient parts, what with the refrigerator filled with stuff from Wal-Mart next to my desk, which is below my bed. However, I feel your pain on the subject of health.",
      "created_at": "2006-02-10T08:44:12.000Z"
    },
    {
      "author": "monkey",
      "body": "Two words [err, 3]:<br/><br/>apples + peanut butter",
      "created_at": "2006-02-12T14:46:03.000Z"
    },
    {
      "author": "Jamie",
      "body": "What do we do?  Buy stuff from Trader Joe's.  Sorry!  But what I suggest for you is... follow Melissa's advise.  We use the crockpot all the time.  It is best for those days when you have NO time, also on a day off, you can make something in the crockpot and freeze it.  AND... since you guys get the kraftfoods magazine, try some of that stuff, we just had the cream of broccoli soup on the first few pages, SUPER GOOD!  All you need is a little bread to dip.  NOT popcorn!  ",
      "created_at": "2006-02-12T18:54:37.000Z"
    },
    {
      "author": "UBF",
      "body": "You could always hook up with a small palce like Marco's pizza and sell pizza by the slice for him (he would provide the warmer and deliver the food and you could work it out to where you would get free food. Change it up with different places on different nights. Maybe get together with a downtown caterer  and work out some deal. California rolls can be made for very little $ and people will shuck out the $$$ for them. Wine w/ popcorn or wine w/ gourmet finger food? Veg tray, crackers and hummus, rye bread rolls w/cream cheese and sliced meat (1 loaf rye bread, 1 block cream cheese, 2 paks wafer slice meat =$3.00 = 15 orders w5 rolls per order, sell for $2.00 each = $30.00) Bump up the quality of edibles and word will get around. The 1st friday art galleries do it, so can you!! ecobent@yahoo.com could help you out, he likes to barter.",
      "created_at": "2006-02-18T02:45:44.000Z"
    },
    {
      "author": "Amy",
      "body": "Bring fruit with you to work! I started eating FIVE servings of fruit a day, and now I can bench press your whole family.<br/>Seriously, don't you remember the dining halls where I used to eat peanut butter and Lucky Charms sammiches? Not anymore!",
      "created_at": "2006-02-16T20:46:53.000Z"
    },
    {
      "author": "UBF",
      "body": "oops,http://www.urbanbikerfreako.tripod.com",
      "created_at": "2006-02-18T03:02:01.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
