{
  "id": 363,
  "title": "Rats and popcorn",
  "body": "We had our first surprise health inspection a couple days ago... and we PASSED! Zero critical violations, and only 167 minor ones - 166 of which were for me scratching my butt while the health inspector talked to us. It's amazing how well a carefully placed pile of popcorn can hide a <a href=\"http://en.wikipedia.org/wiki/Rat_king\" target=\"_blank\">rat king</a>.\r\n\r\nOn a side note: the website will be down at some point over the weekend, which means by Monday there's gonna be a new sheriff in town... and it ain't Sawyer. Thanks for your patience, freckles.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-02-11T04:08:41.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Laura",
      "body": "Oh my.  The rat king is something I hope never to encounter.  I'm going to have nightmares about tightly wound rat tails.  I did enjoy the Lost reference.  Sawyer is a badass.",
      "created_at": "2006-02-11T04:54:47.000Z"
    },
    {
      "author": "Nate",
      "body": "Sawyer is a psycho.  Charlie has crossed from \"screwed up over Claire and heroin withdrawal\" to \"full blown Evil.\"  But Tragic Evil.  Like the fat kid from \"The Stand.\"\r\n\r\nBut, yes, your Lost reference made up for that disgusting image of intertwined rats.",
      "created_at": "2006-02-11T04:59:15.000Z"
    },
    {
      "author": "Caleb",
      "body": "So I have some interesting Lost trivia for you all. I guess it's a goof really. I just got my sister addicted to the show and she's been watching the DVDs of season 1. I was watching one of the episodes where Locke finds out about Charlie's drug problem and he's trying to help him overcome it. Well I was shocked to hear Charlie say something to the effect of: \"If I stop taking them I'll go back to being Dominic.\" HUH? How could they not catch that one in editing? I'll try to go figure out which episode it was for you all. \r\n\r\nOh, and congrats on the inspection. And the rat king. ",
      "created_at": "2006-02-11T09:49:12.000Z"
    },
    {
      "author": "bjork24",
      "body": "I caught the red herring in the last episode... the \"Owl Creek Bridge\" book that Locke was paging through. Finally, my English degree paid off!",
      "created_at": "2006-02-11T09:51:30.000Z"
    },
    {
      "author": "Matthew Martin (aka R.J. Jack MacReady Burton)",
      "body": "Oh no! I have a fear of rats, and it's a family thing! (Though watching the 2003 \"Willard\" in the theatre didn't hurt. Must have been the friendly confines of Crispin Glover.)",
      "created_at": "2006-02-11T10:53:14.000Z"
    },
    {
      "author": "Broken Furniture",
      "body": "if you have a rat king problem its best to call in the teenage mutant ninja turtles. they'll know what to do.",
      "created_at": "2006-02-11T12:36:00.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<i>Like the fat kid from \"The Stand.\"</i>\r\n\r\nM-O-O-N, that spells this site needs more references from <i>The Stand</i>...",
      "created_at": "2006-02-11T19:16:08.000Z"
    },
    {
      "author": "Nate",
      "body": "I tried to think of other \"Tragic Evil\" examples.  It's a pretty archetypal character in fiction: the guy who just wants to be loved, but no one will so he rises to power and oppresses everyone.  I've always thought that was a pretty powerful character arc.  But I can't think of any right now.  Don't say Darth Vader; it only counts if you know the story from the beginning (what I'm talking about anyway.)  Or Carrie, because she just flips out at the end.\r\n\r\nC'mon pop-culture fiends!",
      "created_at": "2006-02-11T23:43:43.000Z"
    },
    {
      "author": "Matthew Martin (aka R.J. Jack MacReady Burton)",
      "body": "Hannibal Lecter?",
      "created_at": "2006-02-12T01:46:36.000Z"
    },
    {
      "author": "nicole",
      "body": "The kid from The Incredibles (Jason Lee's voice)?",
      "created_at": "2006-02-12T02:42:43.000Z"
    },
    {
      "author": "Derek",
      "body": "1. I love the Moxie blog has turned into a Lost forum.\r\n\r\n2. I also immediately thought of the Turtles with the Rat King thing, but am ashamed at the lack of Indiana Jones references in relation to rats.\r\n\r\n3. Smeagol perhaps? Cain from the Genesis story? My roommate said Hitler, but I don't think I'd go that far, lol. Anyway, um, yeah.",
      "created_at": "2006-02-12T04:54:05.000Z"
    },
    {
      "author": "Caleb",
      "body": "The Phantom of the Opera?",
      "created_at": "2006-02-12T05:22:35.000Z"
    },
    {
      "author": "Nate",
      "body": "Smeagol, of course!  One of the greats.\r\n\r\nThe Phantom of the Opera is evil?  I just thought he pranced around and sang Andrew Weber songs, which is probably worse.",
      "created_at": "2006-02-13T18:56:23.000Z"
    },
    {
      "author": "Aristocrat",
      "body": "Dan, I think next time I come in, you will have to sit me down and tell me everything you know about Lost...  Maybe I have missed something.  ...And I thought I knew about this kinda stuff!!!!",
      "created_at": "2006-02-13T21:54:05.000Z"
    },
    {
      "author": "hermitess",
      "body": "\"It's a pretty archetypal character in fiction: the guy who just wants to be loved, but no one will so he rises to power and oppresses everyone.\"\r\n\r\n\r\nGeorge Bush?  Saddam Hussein?    Oh wait, I only *wish* that were fiction.",
      "created_at": "2006-02-16T04:29:55.000Z"
    },
    {
      "author": "Monkey",
      "body": "next time I come to the moxie I expect to see an official rat king flavor of popcorn, if it's not there I'm not buying popcorn. haha!\r\n\r\nthanks for the wikipedia link, I never even heard of such a thing!",
      "created_at": "2006-02-14T15:04:06.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
