{
  "id": 365,
  "title": "Valentine's Day and female circumcision",
  "body": "People stayed away from GRIZZLY MAN because they thought it would show Timothy Treadwell being devoured by bears. Now it seems as though people are staying away from MOOLAADE because they think they're actually going to be confronted with female circumcision, which, of course, isn't the case. It's a shame that more people won't come see this movie. <a href=\"http://en.wikipedia.org/wiki/Ousmane_Sembene\" target=\"_blank\">Ousmane Sembene</a> movies are few and far between in this part of the country.<br/><br/>And for those of you who are wondering why we'd even consider playing a movie like this on Valentine's Day... well, to be totally honest with you, there wasn't much else to choose from, so we decided to try something different. We collaborated with the V-Day and \"Stop the Violence\" campaigns at both MSU and Drury, and the multicultural center at MSU to incorporate Black History Month. Oh well. Sometimes you win some, sometimes you lose some... and sometimes you have to pin all your hopes for a good month on PULSE - OPENING TOMORROW!<br/><br/>And don't get me wrong here. I'm not trying to guilt trip you guys into coming to our theater, I'm just trying to key you in to a really wonderful movie. That's my job... and my livlihood.<br/><br/>PULSE - OPENING TOMORROW!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-02-15T09:11:15.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nicole",
      "body": "I wanted to watch Pulse this afternoon so I could have the rest of the day to think about it and not be scared by the end of the night. But here's something weird: when we were running it to make sure it looked ok, I was holding a water bottle, and, I am not lying, it flew out of my hands and hit the wall and fell to the floor.<br/><br/>How's that for scary. The phantom smell also hates water bottles.",
      "created_at": "2006-02-16T04:25:11.000Z"
    },
    {
      "author": "Monkey",
      "body": "Yeah I really should come see a movie.. to be honest though none of the movies on the current/recent calendar seem that appealing to me. Too classy I guess. Is springfield speaking with silence, saying \" want more aristocrats-style trashy stuff.\"  hehe, I know that I do~",
      "created_at": "2006-02-16T06:26:16.000Z"
    },
    {
      "author": "erin",
      "body": "i wont be seing pulse. no. no. and no. sorry. i prefer not to be scared shitless. but i REALLY wanted to see moolaade. really really really. but the moxie hates me and scheduals times that just wont work.",
      "created_at": "2006-02-16T02:40:19.000Z"
    },
    {
      "author": "Laurali",
      "body": "If I weren't so tired I come see Moolaade tonight. I will come see Pulse...but I'm coming to an afternoon showing so I don't have to go home in the dark.",
      "created_at": "2006-02-16T03:53:16.000Z"
    },
    {
      "author": "Monkey",
      "body": "The thing is, Moolade was the one that stood out as really good so I totally missed the boat on that.",
      "created_at": "2006-02-16T06:26:54.000Z"
    },
    {
      "author": "Caleb",
      "body": "Can anyone else believe they're making a SEQUEL to The Aristocrats? Don't get me wrong, I loved the first one, I just don't think it's in need of a sequel. Howabout a new joke? Maybe that's what they'll do.<br/><br/>As far as the movies being classy, I dunno. Bubble was definetely <i>not</i> classy. Pretentious, maybe, but not classy. It was a joy-spirited take on murder. Sort of. Besides Pulse, I am really looking forward to Loggerheads. Maybe it's just because I find Bonnie Hunt hysterical (anyone share in my feelings on her? anyone ever see her short-lived very-funny sitcom? am I alone here?), but I think the storyline sounds pretty interesting too. But Duma is definitely going to be your runaway hit of February. I can feel it in my spots...",
      "created_at": "2006-02-16T07:55:53.000Z"
    },
    {
      "author": "nicole",
      "body": "I hope you're right about Duma, Caleb!",
      "created_at": "2006-02-16T08:46:04.000Z"
    },
    {
      "author": "--Jeff",
      "body": "I'm torn on <i>Pulse</i>.  Is it a gratuitous violence kind of scary, or creepy look-behind-your-back kind of scary?  <br/><br/>Definitely not into the former, but I could be persuaded to see the latter...",
      "created_at": "2006-02-16T08:46:08.000Z"
    },
    {
      "author": "Monkey",
      "body": "I'm thinking it's the latter. ",
      "created_at": "2006-02-16T14:29:32.000Z"
    },
    {
      "author": "brian of moore",
      "body": "interesting.. i much prefer the look behind you kind of scary<br/>.. violence and gore.. do nothing for me<br/>thus .. ill be there tonight!",
      "created_at": "2006-02-17T00:12:10.000Z"
    },
    {
      "author": "nicole",
      "body": "I think this one is a slower-paced psychological thriller. The kind that creeps you out two days later. But I still haven't seen it yet...",
      "created_at": "2006-02-17T01:10:54.000Z"
    },
    {
      "author": "Caleb",
      "body": "I feel ashamed. I opted for some Scarlett Johannson instead, at that evil place that shall remain nameless. I'd come see it tonight but alas, I have class. But I AM seeing Pulse this week or weekend. I wouldn't miss it.",
      "created_at": "2006-02-16T02:21:39.000Z"
    },
    {
      "author": "Rachel",
      "body": "I need a new blog... I'm (gasping) desperate...",
      "created_at": "2006-02-25T21:32:49.000Z"
    },
    {
      "author": "Rachel",
      "body": "I need a new blog... I'm (gasping) desperate...",
      "created_at": "2006-02-25T21:32:49.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
