{
  "id": 366,
  "title": "March Madness",
  "body": "Fact: weekday matinees are deadly slow - usually bringing in less than 10 people. In the beginning we thought a 4:30 show would attract the older, retired crowd and a few wayward college students with lopsided class schedules. Our first quarter statistics told a very different story. As it turns out, most people are working during our matinee shows, and those that aren't working are doing something that doesn't include coming to our theater. Let's look at the hard numbers:\r\n\r\n+ Weekday Matinees, excluding Friday, average about 10 people per show... and that's being generous. Tickets are matinee price ($5.00), which means we make $50 per showing. Take away our typical 40% to 50% distribution fee, and we've made about $27 per matinee showing.\r\n\r\n+ Predictably, concessions are also the lowest during matinees - hovering in the neighborhood of $12 to $15 combined. The low turnout obviously contributes greatly to the pitiful concession take, but so does the time of day. Most people are gearing up for dinner, so why would they ruin their appetite with popcorn?\r\n\r\nSo each matinee showing, Monday through Thursday, brings in roughly $40. Not very impressive, eh? I bet you can see where this is leading... March is going to be a little light in the matinee department. Four matinee slots, Monday through Thursday, are taking a month-long vacation in March. They might come back in April, or they might not. Obviously, if a movie is big enough, or geared towards the older demographic, then we might toss a few extra matinees out there, but otherwise... it's just not worth our time.\r\n\r\nThis isn't the first time we've pruned back showtimes either. If you remember correctly, we dropped the Sunday late show (9:00 slot) way back in November, and our Sunday numbers increased as a result. Will the same thing happen for our already dismal weekday numbers? Only time will tell. And speaking of time, it looks like we're going to have a few extra hours on our hands during the week. What should we do with all this new found freetime? Start another business? Sleep later? Eat lunch AND dinner? Or, as my mom suggested, get a \"real\" job? Who knows. The endless opportunities boggle the mind.\r\n\r\nIn final support of our decision, you'd think our newest movie, DUMA, would be a good choice for a weekday matinee. What with it being a family-friendly, highly-acclaimed film from a respected director, we thought it might very well entice more than our average 10 people for today's matinee. Can you guess how many we had? One. And he's not even a kid. In fact, he had no idea what DUMA was about. He occasionally drops by to see a movie, regardless of what's playing, simply because, in his own words, \"he wants to support our theater and be surprised by our film selection.\" That's the spirit!\r\n\r\nNow I sound bitter and resentful, of which I'm neither. I better stop writing before it's too late. To make amends, maybe I'll finally get around to posting December's numbers tomorrow. That'll put everyone in a good mood!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-02-17T04:50:16.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "bjork24",
      "body": "Good eye, Caleb. The logo will change, on certain days, to commemorate various events. For instance, today marks the 17th anniversary of the release of one of my all-time favorite movies: Bill and Ted's Excellent Adventure. Excellent!",
      "created_at": "2006-02-17T11:23:25.000Z"
    },
    {
      "author": "Scott G.",
      "body": "What would happen if you offered a free matinee now and then?  Would that bring in enough people to generate enough concession sales to make it worthwhile?",
      "created_at": "2006-02-17T17:40:53.000Z"
    },
    {
      "author": "bjork24",
      "body": "I really don't think so, Scott. Like I said, it has a lot to do with the time of day (right before dinner). We had three free showings of the Wal-Mart documentary back in December, and the one that fell on the 4:30 slot was the weakest in concession.",
      "created_at": "2006-02-17T21:01:10.000Z"
    },
    {
      "author": "Amanda",
      "body": "Since opening my bookstore last July I haven't had the opportunity (or the courage?) to cut back hours...I keep increasing them. Personal life? What's that? Unfortunately we don't have popcorn here to live on so it's just coffee and the accompanying jitters...",
      "created_at": "2006-02-17T22:08:45.000Z"
    },
    {
      "author": "erin",
      "body": "smart.",
      "created_at": "2006-02-17T09:47:44.000Z"
    },
    {
      "author": "Caleb",
      "body": "Hahaha...December numbers...good mood...right. I think scrapping the M-Th matinees is a good idea. You can always use the extra time to screen the movies you get that sometimes you never have time to see, or watch other recommended films in your very own theater. \r\n\r\nOh, and I must be blind or something but I just noticed the miniature Bill and Ted by the logo. Most excellent.",
      "created_at": "2006-02-17T11:12:49.000Z"
    },
    {
      "author": "Nate",
      "body": "Yikes.  Those are scary matinee numbers.  Hopefully those moviegoers will all make the leap into the evening, and you guys get a few extra hours away from the Moxie!\r\n\r\nI love the concept of regularly changing the Moxie logo, Google-style.",
      "created_at": "2006-02-17T22:14:03.000Z"
    },
    {
      "author": "Stephanie",
      "body": "I certainly understand your decision, but that really bums me out.  I try to hit a weekday matinee once a week. Maybe matinees in the summer would do better?",
      "created_at": "2006-02-17T22:31:44.000Z"
    },
    {
      "author": "Stephanie",
      "body": "I can't get my login to work, so I am asking this question here.  As I mark off my Oscar nominee list the only two major category movies that think haven't been here at all are Mrs Henderson Presents and Transamerica.  Any chance we will see either at the Moxie before Oscar day?\r\n",
      "created_at": "2006-02-17T22:48:35.000Z"
    },
    {
      "author": "duanekeys",
      "body": "Have you had any luck renting out the space for events? ",
      "created_at": "2006-02-18T03:33:11.000Z"
    },
    {
      "author": "Jrowe",
      "body": "I know something you could fill you free afternoons with....skyrockets in flight.",
      "created_at": "2006-02-18T04:52:25.000Z"
    },
    {
      "author": "bjork24",
      "body": "Stephanie: Transamerica will be here before the Oscars.\r\n\r\nDuane: We've had a few rentals, but they've all been late night bashes. No one has rented it out for a business meeting or anything during the day... yet.",
      "created_at": "2006-02-18T06:42:40.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
