{
  "id": 369,
  "title": "The big wheels keep on turning",
  "body": "Justin just bought a new video camera, so he's taken to filming everything he sees... including stuff at work. Here's a good one of me rewinding part two of DUMA. He also wants me to add that this was just a test run, and he only had three shots to work from... but in reality, Justin worked on that 10 second clip for 18 hours and culled it down from 30 minutes of source footage.<br/><br/><object width=\"425\" height=\"350\"><param name=\"movie\" value=\"http://www.youtube.com/v/pksWS5hFTig\"></param><embed src=\"http://www.youtube.com/v/pksWS5hFTig\" type=\"application/x-shockwave-flash\" width=\"425\" height=\"350\"></embed></object><br/><br/>If you can't get the embedded player to work, you can also see <a href=\"http://www.youtube.com/watch?v=pksWS5hFTig\" target=\"_blank\">the film on YouTube</a>. Depending on the reaction he gets from this trailer, Justin may or may not be releasing a short film about a typical day at The Moxie.<br/><br/>NOTE: Check out the awesome scar on the back of my head.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-02-20T22:19:57.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "...and to defend my hugely expensive purchase of the new camera, the quality YouTube recompresses at is far inferior to the actual quality of the camera.  So don't think I went and spent a million dollars on a webcam-quality camera.  YEAH!",
      "created_at": "2006-02-20T22:22:41.000Z"
    },
    {
      "author": "bjork24",
      "body": "And despite what it looks like in the film, I actually DO have lips.",
      "created_at": "2006-02-20T22:29:39.000Z"
    },
    {
      "author": "seesquared",
      "body": "Yes you do Dan....yes you do!!!!",
      "created_at": "2006-02-20T23:32:55.000Z"
    },
    {
      "author": "brian of moore",
      "body": "that might be the most awesome post ive seen on here<br/>that should be shown during opening credits<br/>and yes youtube quality sucks... but i wont ask why you didnt export it in a different format and just throw it on the server... bandwidth issues i assume",
      "created_at": "2006-02-20T23:49:00.000Z"
    },
    {
      "author": "Nate",
      "body": "I feel like I should be hearing the voices of Mr. Rogers and Mr. McFeely speaking over the clip, explaining that this is how people rewind movie reels.",
      "created_at": "2006-02-21T00:17:22.000Z"
    },
    {
      "author": "Werner Herzog",
      "body": "And what haunts me, is that in all the reels that Chilton ever rewound, I discover no kinship, no understanding, no mercy. I see only the overwhelming indifference of centrifugal force. And torque.  To me, there is no such thing as a secret world of the film reels. And this blank disc speaks only of a half-bored interest in fingernails. But for Dan Chilton, this reel was a friend, a savior. <br/>",
      "created_at": "2006-02-21T00:23:29.000Z"
    },
    {
      "author": "Werner Herzog",
      "body": "Oh, someone is shooting at us. We must go.<br/>",
      "created_at": "2006-02-21T00:24:38.000Z"
    },
    {
      "author": "bjork24",
      "body": "What looks like playfulness, may actually be an act of desperation, as Chilton rewinds deep to the end of the reel in hopes of retreiving dead salmon carcasses.",
      "created_at": "2006-02-21T00:39:33.000Z"
    },
    {
      "author": "Carl",
      "body": "Dan was truely in the moment. Total Zen.  Love it and hope to see more.",
      "created_at": "2006-02-21T05:13:36.000Z"
    },
    {
      "author": "erin",
      "body": "i did enjoy this. very much so.<br/><br/>: )<br/><br/>for some reason it reminded me of the machinist. dont ask me why. for i do not know...",
      "created_at": "2006-02-21T06:04:20.000Z"
    },
    {
      "author": "erin",
      "body": "everyone stop making fun of herzog and grizzley man!!! <br/><br/>its breaking my heart. i LOVED that movie you jerks!",
      "created_at": "2006-02-21T06:10:25.000Z"
    },
    {
      "author": "Caleb",
      "body": "Why does one reel look bigger than the other? Optical illusion? Or is Dan really just spinning it that fast? <br/><br/>Justin - what program did you use to edit this splendid epic film that should be entitled <i>Lord of the Moxie: Fellowship of the Reel</i>? And when will <i>The Two Tickets</i>  and <i>Return of the Projector</i> be released?",
      "created_at": "2006-02-21T12:05:25.000Z"
    },
    {
      "author": "justin",
      "body": "Adobe Premier 2.0",
      "created_at": "2006-02-21T20:16:38.000Z"
    },
    {
      "author": "justin",
      "body": "And no definitive plans have made for the sequal, but I'd expect plenty of odd little ditties to arise in the near future.",
      "created_at": "2006-02-21T20:18:00.000Z"
    },
    {
      "author": "nicole",
      "body": "Ha ha, I can't stop watching it! It makes me laugh.",
      "created_at": "2006-02-21T09:28:32.000Z"
    },
    {
      "author": "mish",
      "body": "best. movie. ever.",
      "created_at": "2006-02-21T09:52:21.000Z"
    },
    {
      "author": "mish",
      "body": "Adobe Premier 2.0 thank you ....:)",
      "created_at": "2006-04-10T21:20:12.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
