{
  "id": 37,
  "title": "Attack of the clones",
  "body": "I just wanted to draw everyone's attention to some AWESOME blogs that I found online today. They all share a similar theme, but I bet you can't guess what it is...<br/><br/>+ <a href=\"http://iranfilter.blogspot.com/\" target=\"_blank\" class=\"broken\">Cool Blog 1</a><br/>+ <a href=\"http://bulten.blogspot.com/\" target=\"_blank\" class=\"broken\">Cool Blog 2</a><br/>+ <a href=\"http://students.wharton.upenn.edu/%7Edsrodrig/\" target=\"_blank\" class=\"broken\">Cool Blog 3</a><br/><br/>Weren't those great? I really like the design they're using... I wonder if I can make my blog look like that? Sigh. If only. I e-mailed the owner of <a href=\"http://students.wharton.upenn.edu/%7Edsrodrig/\" target=\"_blank\" class=\"broken\">Cool Blog 3</a> and told him what an AWESOME site he had. I love cheap imitations.<br/><br/>If you're considering ripping off my blog design, would you at least take the time to remove the [ about ] blurb. It took me a long time to write that blurb, and I hate seeing it trotted all over the net like some kind of cyberspace hussy. We can't ALL be intending to chronicle the process of developing, financing, starting, and maintaining a small, independently-owned, art-house theater, of which the majority of the names, of both people and places, are fictitious.<br/><br/>Since we're on the subject of shameless hacks, I'd like to point out another blatant copy of this site - <a href=\"http://www.berkana.net/urlgreen\" target=\"_blank\" class=\"broken\">urlgreen</a>. This site, unlike the ones listed above, was built in jest by my good friend Rex. If you look closely, you'll notice that he's replaced key words to make me look like a complete idiot, which, surprising, isn't all too difficult. Well, that's all I wanted to say. I feel better now.<br/> <br/><span style=\"font-weight: bold;\">[ Update 07.16.04 @ 10:28 am ] </span>- I think the owner of <span style=\"font-weight: bold;\">Cool Blog 3</span> had a change of heart and decided to take his site down. He wrote me an e-mail stating that \"imitation was the sincerest form of flattery,\" to which I <span style=\"font-style: italic;\">should</span> have responded with \"yes, but stealing my HTML/CSS code is the sincerest form of taking a crap on all the hard hours I put into creating a unique looking site.\" Instead, I responded with \"I suppose,\" which is short for \"I suppose... ass!\" Either way, <span style=\"font-weight: bold;\">Cool Blog 3</span> is down, but for how long? We'll just have to wait and see what design he's using once he resurfaces.<br/><br/><span style=\"font-weight: bold;\">[ Update 07.26.04 @ 05:58 pm ] </span>- Yet another <a href=\"http://sobhaneh.blogspot.com/\" target=\"_blank\" class=\"broken\">Cool Blog</a> to add to the list. I'm the only one who's keeping track at this point, but that's okay. At least this guy switched the color scheme.<br/><br/><span style=\"font-weight: bold;\">[ Update 08.04.04 @ 10:43 pm ] </span>- When will end! <a href=\"http://princessrepulsive.blogspot.com\" target=\"_blank\" class=\"broken\">Yet another blog</a> has succumbed to the lure of this blog's whorish design.<br/><br/><span style=\"font-weight: bold;\">[ Update 08.04.04 @ 10:48 pm ] </span>-<a href=\"http://wwww.fotolog.com.cn/default.jsp\" target=\"_blank\" class=\"broken\">Here's</a> an interesting take on my design. At least they altered it to fit their needs... although, the \"comment\" button is a direct link back here. Hmmm.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-07-15T22:49:11.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "dok",
      "body": "wow... don't tell me.. they're the clones... hahahahahaha!",
      "created_at": "2004-07-15T23:13:58.000Z"
    },
    {
      "author": "Ben",
      "body": "Your design is just so cool that they couldn't help but rip it off. It's just sad that they couldn't at least change it a little bit; they had to full-on steal the thing.<br/><br/>You have to love the third blog that says \"Its new so theres still some rough edges to smooth out but other then that, its not too shabby ah?\"",
      "created_at": "2004-07-16T01:14:42.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "Well, your blog is damn nice looking, Dan. There's no getting around that. Hey, they kept a link to my blog on their rip-offs, so maybe I should thank them? LOL",
      "created_at": "2004-07-16T01:29:37.000Z"
    },
    {
      "author": "Fyse",
      "body": "Well, they say the sincerest form of flatter is imitation, so I guess you ought to feel chuffed?! Your site design is pretty bloody cool, after all. And the custom built comment system? Very nice.",
      "created_at": "2004-07-16T01:41:03.000Z"
    },
    {
      "author": "bjork24",
      "body": "These comments make it look as though I'm fishing for compliments, which I most certainly am not. I'm fishing for some unbridled anger directed towards these unchuffed scallywags... but compliments never hurt anyone... or have they? I'll have to look into that.",
      "created_at": "2004-07-16T01:52:06.000Z"
    },
    {
      "author": "Silver",
      "body": "hmm well I worked too hard on my own site to jack your design, so no worries there. <br/><br/>Refering to the post before this one - I live in Texas, and yes everyone here calls it coke, as in the general term for soda. I'm sure it annoys and confuses people to no end; although a lot of people do say soda, too.",
      "created_at": "2004-07-16T02:00:24.000Z"
    },
    {
      "author": "Fyse",
      "body": "Well, if it's unbridled anger your looking for, might I suggest a bit of good ol' effigy burning? Or maybe we (your loyal readership) should exact revenge for you? (Since the owner of a respectable independent cinema shouldn't be seen to be publicly flaying people <i>too</i> often...). Oh, one more thing. How did you find these charlatans?",
      "created_at": "2004-07-16T04:03:48.000Z"
    },
    {
      "author": "Oz",
      "body": "Did you notice that Blog 2 has \"cinema24 | blog\" in the top box?  Classic.",
      "created_at": "2004-07-16T04:07:44.000Z"
    },
    {
      "author": "bjork24",
      "body": "I found the offending parties while I was browsing through referring sites.",
      "created_at": "2004-07-16T04:36:09.000Z"
    },
    {
      "author": "sandra",
      "body": "CB3 page is no longer available.<br/>CB2 is your text and everything? geesh.<br/>CB1 -- hmmm let's all leave comments on his photo / cinema blog.<br/><br/>Amazing.",
      "created_at": "2004-07-16T09:02:21.000Z"
    },
    {
      "author": "Jeremy",
      "body": "Cheep pedlers of tat!",
      "created_at": "2004-07-16T14:04:24.000Z"
    },
    {
      "author": "Gern C. Branston",
      "body": "No fair!  I wanna develop, finance, start, and maintain a small, independently-owned, art-house theater!  :(<br/><br/>And I want a swell Exorcist-green blog template, too....",
      "created_at": "2004-07-16T16:52:31.000Z"
    },
    {
      "author": "Fyse",
      "body": "Well, this might amuse you. Curious about how much the popular blogs figure on search engines, I put 'cinema 24' into Google. The first few results are unrelated, but then I find a link to urlblue.com.<br/><br/>And what gem of perfectly formed prose has it selected to advertise your blog? \"...crotch? What then, I ask? What then? That's all.\"<br/><br/>I feel this will win you more readers than you could possibly handle...",
      "created_at": "2004-07-16T18:41:49.000Z"
    },
    {
      "author": "bjork24",
      "body": "\"...crotch? What then, I ask? What then? That's all.\" That's a very succinct description of this site. Google is incredible.",
      "created_at": "2004-07-16T18:57:45.000Z"
    },
    {
      "author": "Tim",
      "body": "What in the name of Thor's mighty hammer Mjolnir are these people doing?  Did they get a class assignment to create a blog, and they tossed yours up there hoping for an easy \"A\"?  Or are they genuinely hoping to start their own theaters?  Bizarre.  Anger?  Yeah, definitely.  I hope their shirt sleeves get caught in the fan belt of their rusted old Chevy Citations.  Bastards.",
      "created_at": "2004-07-16T20:12:39.000Z"
    },
    {
      "author": "Oz",
      "body": "I just wanted to say that I find it funny that Blog 3 was done by a Wharton student.  As a Penn student myself, I can tell you that we all hate the Wharton school kids.",
      "created_at": "2004-07-17T04:25:09.000Z"
    },
    {
      "author": "elspeth",
      "body": "Get used to it. The Moxie will have umpteen copycat cinemas mimicing (sp?) its style. There are many scallywags (chuffed and unchuffed) out there who are incapable of having an original thought but who know class when they see it.<br/>e",
      "created_at": "2004-07-17T06:31:15.000Z"
    },
    {
      "author": "Mermaid",
      "body": "hey, it's not that big of a deal. imitation IS a form of flattery. it's weird how you don't seem to get that other people are not so nerdily skilled with making page designs as you are, maybe you could help them out or something?? according to the section on your site called \"shameless ploy\" you seem to like helping yourself, or others, or whatever, at least it looks like you want money; you like people to kiss your ass and suck up to you, so why is it so bad they are stealing your design? it seems obvious that what they have is not original. Cool Site 2 seems to be a sattire on whatever it is that you write about. I find it funny, personally... well that's all I have to say. have fun.",
      "created_at": "2004-07-17T08:42:49.000Z"
    },
    {
      "author": "bjork24",
      "body": "Well, Mermaid, Site 2 isn't exactly satirical... it's the result of someone cutting and pasting my code and then posting it without bothering to change anything. I hope you feel better after your tirade. Please come back and visit.",
      "created_at": "2004-07-17T08:56:31.000Z"
    },
    {
      "author": "mod",
      "body": "how we just dont get some people's behaviour eh? ahahahaha...but that's funny enough to tell tho' how the 'cool blog 2' didnt change any single thing on it. and doesnt it has the link to amazon also? well, i dont understand how the amazon donation system works but is it possible the 'cool blog 2' was trying to cash in some money to its own account by using ur 'journey to the dream theater' stories? have u checked it out?",
      "created_at": "2004-07-17T12:04:39.000Z"
    },
    {
      "author": "aster",
      "body": "its a shame your hard work is pooped.  the least they could do is donate =/ i would ask you first then maybe see if i should donate in exchange for your template. don't people have etiquette these days?",
      "created_at": "2004-07-18T00:40:06.000Z"
    },
    {
      "author": "bottleHeD",
      "body": "Hah! Urlgreen is great!! Lol, wicked!",
      "created_at": "2004-07-18T11:11:53.000Z"
    },
    {
      "author": "bottleHeD",
      "body": "The idiots at http://iranfilter.blogspot.com/ didnt even bother changing the \"about\" stuff.<br/><br/>But what the heck is cool blog 2? Except for the url, everything's the same...",
      "created_at": "2004-07-18T11:14:13.000Z"
    },
    {
      "author": "squeak",
      "body": "lol @ ripoff sites. <br/><br/>mimicery may be the highest form of flattery but why in the hell would someone want to recreate your site at another url? I'm trying to figure that one out, where is the benefit (to them) in creating for all intents and purposes a \"mirror\" site. Has to be a way using javascript to disable browsers from viewing source code, downloading of pages etc <br/><br/>I agree with everyone else - the drool factor on the site design is very high.",
      "created_at": "2004-08-01T00:20:54.000Z"
    },
    {
      "author": "awe",
      "body": "2 of those blogs are giving a 404 forbiden page..:(",
      "created_at": "2005-06-23T11:21:45.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 11,
      "name": "Techish talk"
    }
  ]
}
