{
  "id": 370,
  "title": "State of The Moxie #4 - December 2005",
  "body": "Well, I guess I've made you guys wait long enough... it's finally time to delve into our December numbers. I know it was barely two months ago, but December seems like a far gone memory in the mind of The Moxie, especially since February is trying hard to steal away the title of \"Worst Month Ever.\" Unlike February, however, December had all kinds of excuses for being a terrible month: students were studying for finals then heading out of town, people were broke from holiday shopping, everyone was rushing around. We did, however, sell a TON of gift certificates. In fact, during the third week of December our gift certificate sales surpassed our gross ticket and concession sales... COMBINED! Pretty impressive, eh? Well, it won't be after you see the numbers we posted that week.\r\n\r\nOk, enough of my yakkin'... let's jump right in, shall we:\r\n\r\n<b>Week 11</b> - November 30 - December 6\r\n\r\n<b>Movies:</b> JUNEBUG and MIRRORMASK\r\n\r\n<b>We:</b> 44 (75 goal) = -31\r\n<b>Th:</b> 16 (75 goal) = -59\r\n<b>Fr:</b> 92 (100 goal) = -8\r\n<b>Sa:</b> 98 (100 goal) = -2\r\n<b>Su:</b> 56 (75 goal) = -19\r\n<b>Mo:</b> 75 (75 goal) = 0\r\n<b>Tu:</b> 34 (75 goal) = -41\r\n\r\n<b>Week:</b> 415 (575 goal)\r\n\r\nWe immediately knew something was wrong when we noticed that JUNEBUG was having a hard time bringing in more than 10 people per show. JUNEBUG was supposed to be one of our crowning gems of the month, along with THE SQUID AND THE WHALE, but no one was coming. Despite all the requests we had, despite all the awards buzz, despite the glowing reviews, no one came to see this wonderful movie. Surprisingly, MIRRORMASK carried this entire week with a respectable 25 people per show average. JUNEBUG limped through with an average of 11 people per show, including TWO shows where no one showed up at all. Shame on everyone who missed JUNEBUG. Shame on you! Myself included.\r\n\r\n<b>Week 12</b> - December 7 - December 13\r\n\r\n<b>Movies:</b> HOWL'S MOVING CASTLE, 2046, and THE BEARDED CHILD FILM FESTIVAL\r\n\r\n<b>We:</b> 35 (75 goal) = -40\r\n<b>Th:</b> 13 (75 goal) = -62\r\n<b>Fr:</b> 103 (100 goal) = +3\r\n<b>Sa:</b> 77 (100 goal) = -23\r\n<b>Su:</b> 42 (75 goal) = -33\r\n<b>Mo:</b> 64 (75 goal) = -11\r\n<b>Tu:</b> 58 (75 goal) = -17\r\n\r\n<b>Week:</b> 392 (575 goal)\r\n\r\nThe slippery slope of December continued with a paltry turnout for both HOWL'S and 2046. A few die-hard Miyazaki fans trickled in, but the majority of our audience stream had all but dried up. We were hoping that a family-friendly cartoon like HOWL'S would entice in a few new faces, but we wrong. This week marked our first visit below the 400 line in attendance, and the beginning of a practice we like to call \"ALL PART-TIMERS STAY HOME WHILE DAN AND NICOLE TRY TO SALVAGE THEIR SINKING THEATER.\" Had it not been for THE BEARDED CHILD FILM FESTIVAL bringing in two decent crowds on Friday, we wouldn't have hit goal ONCE. As far as records go, the 13 people we received on Thursday (which had THREE shows, by the way) holds the record for the lowest attended day in our history. It was a fun week.\r\n\r\n<b>Week 13</b> - December 14 - December 20\r\n\r\n<b>Movies:</b> THE WILD PARROTS OF TELEGRAPH HILL, WAL-MART: THE HIGH COST OF LOW PRICE, THE UNTOLD STORY OF EMMETT LOUIS TILL, and NEVER BEEN THAWED\r\n\r\n<b>We:</b> 23 (75 goal) = -52\r\n<b>Th:</b> 68 (75 goal) = -7\r\n<b>Fr:</b> 30 (100 goal) = -70\r\n<b>Sa:</b> 39 (125 goal) = -86\r\n<b>Su:</b> 27 (75 goal) = -48\r\n<b>Mo:</b> 94 (75 goal) = +19\r\n<b>Tu:</b> 73 (75 goal) = -27\r\n\r\n<b>Week:</b> 354 (625 goal)\r\n\r\nGood ol' lucky week thirteen. It seriously makes me sick to my stomach when I think back on it. And if you think 354 people isn't that bad, wait until I subtract all the free tickets for the WAL-MART documentary! During the third week of December, we had 160 paying customers. Just stop for a minute and think about that. I seriously started wondering how much worse it could possibly get. Had people completely lost the urge to see good movies? The only way we could get people through our doors was to lure them in with free tickets, and even then it was difficult. I mean, we were showing FOUR different movies in the span of ONE week and this was the best we could do! I'm almost 100% certain that we'll be closed during this week in 2006. I can't even talk about it anymore. It makes me sick!\r\n\r\n<b>Week 14</b> - December 21 - December 27\r\n\r\n<b>Movies:</b> THE UNTOLD STORY OF EMMETT LOUIS TILL, NEVER BEEN THAWED, THE SQUID AND THE WHALE, and A PIANO BY CHRISTMAS\r\n\r\n<b>We:</b> 40 (100 goal) = -60\r\n<b>Th:</b> 41 (50 goal) = -9\r\n<b>Fr:</b> 151 (100 goal) = +51\r\n<b>Sa:</b> 41 (75 goal) = -34\r\n<b>Su:</b> Closed for Christmas\r\n<b>Mo:</b> 81 (100 goal) = -19\r\n<b>Tu:</b> 64 (75 goal) = -11\r\n\r\n<b>Week:</b> 418 (500 goal)\r\n\r\nThank you END OF THE HOLIDAY SEASON! As soon as Christmas rolled up, our numbers immediately changed, which proves, at least for me, that Santa Claus really does exist. Thursday's numbers should've been stronger, but the projector coupling had <a href=\"/post/340\">other plans</a>. Even still, THE SQUID AND THE WHALE did what no other movie could throughout the entire month of December: bring people in. A PIANO BY CHRISTMAS did incredibly well too, selling out its slot on the Friday before Christmas. Speaking of Christmas... it felt good to have another day off. Really, really good. We needed it after this month.\r\n\r\n<b>Week 15</b> - December 28 - January 3\r\n\r\n<b>Movies:</b> THE SQUID AND THE WHALE and EL CRIMEN PERFECTO\r\n\r\n<b>We:</b> 45 (75 goal) = -30\r\n<b>Th:</b> 82 (75 goal) = +7\r\n<b>Fr:</b> 94 (100 goal) = -6\r\n<b>Sa:</b> 65 (75 goal) = -10\r\n<b>Su:</b> 42 (75 goal) = -33\r\n<b>Mo:</b> 75 (75 goal) = 0\r\n<b>Tu:</b> 35 (75 goal) = -40\r\n\r\n<b>Week:</b> 438 (550 goal)\r\n\r\nNot much to talk about here. Our convalescence continued due in large part to the success and growing buzz over THE SQUID AND THE WHALE. I'd like to say that EL CRIMEN PERFECTO did incredibly well too, but it didn't (at least compared to THE SQUID). I, however, REALLY enjoyed it! And isn't The Moxie just a big Netflix for Nicole and I that we happen to share with the rest of Springfield? You see, even crappy months like December wind up with happy endings... (that would've been a great joke for November, when we actually played HAPPY ENDINGS). Unfortunately, I don't think February is going to change course this week... but you never know.\r\n\r\nSo, here's a title by title run-down of why most distributors think our theater is the lowest grossing single screen in the nation:\r\n\r\n<ul><li><b>JUNEBUG:</b> 136 tickets over 12 shows (11 per show) </li>\r\n<li><b>MIRRORMASK:</b> 279 tickets over 11 shows (25 per show)</li>\r\n<li><b>HOWL'S MOVING CASTLE:</b> 188 tickets over 14 shows (13 per show)</li>\r\n<li><b>2046:</b> 117 tickets over 7 shows (17 per show)</li>\r\n<li><b>BEARDED CHILD FILM FESTIVAL:</b> 87 tickets over 2 shows (44 per show)</li>\r\n<li><b>THE WILD PARROTS OF TELEGRAPH HILL:</b> 113 tickets over 16 shows (7 per show)</li>\r\n<li><b>WAL-MART: THE HIGH COST OF LOW PRICE:</b> 194 tickets over 3 shows (65 per show)</li>\r\n<li><b>THE UNTOLD STORY OF EMMETT LOUIS TILL:</b> 25 tickets over 5 shows (5 per show)</li>\r\n<li><b>NEVER BEEN THAWED:</b> 64 tickets over 5 shows (13 per show)</li>\r\n<li><b>THE SQUID AND THE WHALE:</b> 610 tickets over 29 shows (21 per show)</li>\r\n<li><b>EL CRIMEN PERFECTO:</b> 129 tickets over 9 shows (14 per show)</li></ul>\r\nAnd that's all there is to say about December, folks.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-02-21T22:32:23.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Ole",
      "body": "From today's Michael Brother's column on Big Smith:\r\n\r\nIf you're interested in seeing \"Homemade Hillbilly Jam,\" it's showing at 6:30 p.m. Sunday as part of the True/False Film Festival in Columbia. Call (573) 442-8783 or go to www.truefalse.org.\r\n\r\nThe band says it wants the film to screen here. Plans are in the works, but nothing solid has been nailed down yet.\r\n\r\nWho else but The Moxie!\r\n",
      "created_at": "2006-02-24T05:13:23.000Z"
    },
    {
      "author": "Ole",
      "body": "I'm curious about the demographics of your attendees - college kids, the late 20's \"Boogies\" crowd, the academics, etc. Who's bringing in the most $$ from attendance and concessions?  Does the day of the week affect the mix?\r\n\r\nI'd love to see some retrospectives, maybe a Sunday night series that features the All Time 100 films, or something like showing the six Star Wars flicks beginning with prequel 1 so we see the story in chronological order rather then the order they were made.  Or make that Wednesday night so I can buy a drink and move openings to Thursdays!",
      "created_at": "2006-02-23T23:11:33.000Z"
    },
    {
      "author": "Scott G.",
      "body": "It would be cool to know how many gift certificates are cashed versus how many you never hear from again.  I hear the number of unused certificates is staggeringly high.  So don't stagger when you see the numbers ",
      "created_at": "2006-02-23T05:39:13.000Z"
    },
    {
      "author": "Amanda",
      "body": "*Sniff Sniff* I am so sorry you had a crappy month. I know the feeling but now I'm mostly feeling guilty because my December was insanely great. We actually made double our goal... I swear from now on to go to at least one movie a week during December at our local independent theater as penance.",
      "created_at": "2006-02-21T23:52:15.000Z"
    },
    {
      "author": "Amanda",
      "body": "Oh and I just read up on the Cinebar annual auction...I think you should put the proceeds toward your retirement fund but that's just me...",
      "created_at": "2006-02-21T23:54:35.000Z"
    },
    {
      "author": "Derek",
      "body": "Oh, that's rough. I'm thinking this year I should stay in the country just so I can see a bunch of movies at The Moxie. Wow.",
      "created_at": "2006-02-22T00:19:27.000Z"
    },
    {
      "author": "Caleb",
      "body": "Oww...",
      "created_at": "2006-02-22T01:50:45.000Z"
    },
    {
      "author": "brian of moore",
      "body": "hmm...\r\nhopefully the film festival will help march turn out as a stupendous month\r\n\r\nill make some calls.. see what i can do",
      "created_at": "2006-02-22T07:46:30.000Z"
    },
    {
      "author": "mish",
      "body": "\r\nhow many gift certificates did you sell?",
      "created_at": "2006-02-22T11:05:20.000Z"
    },
    {
      "author": "bjork24",
      "body": "A lot.",
      "created_at": "2006-02-22T20:35:15.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
