{
  "id": 371,
  "title": "Check Your Pulse",
  "body": "(please note: This is Nicole! The blog now has bylines, so you might be seeing more stories from me!)\r\n\r\nSo, uh, PULSE…\r\n\r\nRaise your hand if you saw it. Now keep your hand raised if you understood it? Or understood why the critics loved it so much?\r\n\r\n“More frightened than I’ve ever been in a movie theater,” says someone from Time Out New York. We deduced he must have had a gun pointed to his head while watching the film. Because although it had its creepy moments, it certainly wasn’t frightening. Maddening, maybe. Confusing. Pretentious. A little abstract. But frightening? What was truly frightening was the response from the audience.\r\n\r\nWe had at least a dozen people walk out of this film. We had three walk out on THE ARISTOCRATS, none on SARAH SILVERMAN, and one guy who had enough of Timothy Tredwell’s whining that he felt his time would be better spent chatting with Justin about Alaska. But twelve people! That’s a record, and hopefully it won’t be matched in quite some time.\r\n\r\nWhen we chose this movie, we did so because the American remake is coming out this summer, it fit a genre we hadn’t explored yet, the preview was cool, and <a href=\"http://www.metacritic.com/film/titles/pulse\" target=\"_blank\">the reviews were glowing</a>. Those pretentious reviews. They’re so hard to gauge. \r\n\r\nI picked BREAKFAST ON PLUTO because I have a massive crush on Cillian Murphy (and ironically, I never got to see the movie). But after we booked it, I felt sick to my stomach because I knew it would be the end of The Moxie. Nobody would come because they would read the reviews, which were below average, and that would make us shut our doors for good.\r\n\r\nSurprisingly, though, we had a nice turnout for the film, it brought in new faces, and we had people say it was one of their favorites yet. Yay for Cillian! So what was wrong with the critics? It was the same with HAPPY ENDINGS, EVERYTHING IS ILLUMINATED and PROOF. Average reviews, great audience reaction. So who knows what to expect.\r\n\r\nI imagine this sort of thing (PULSE) might happen again in the future – we pick our movies based on a culmination of things: industry buzz, blog reader’s suggestions, how good looking the lead actor is…and yes, reviews and ratings on Metacritic. So without seeing it, it’s hard for us to know if it’s any good. Plus, what’s one person’s opinion? I love the movie HACKERS. Find someone else who does (alright, it’s time to put the hands down).\r\n\r\nSo, while I don’t think we need to apologize for showing a film (we don’t blame our friends at Springfield 8 for showing THE MATRIX RELOADED), the part of me that wants to please everyone is begging for forgiveness. I promise the next show you see here will be amazing! We have a stellar lineup for March, and the rest of February isn’t too shabby either. No existential J-Horror flicks, at least.",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2006-02-23T09:03:31.000Z",
  "author": "Nicole",
  "comments": [
    {
      "author": "--Jeff",
      "body": "/op --Jeff \r\n/topic #moxieblog Should have seen Pulse, but had the flu last week\r\n/q\r\n\r\n/misses irc a little, but not much.  Back in The Day, it was only for trading warez and talking tech...\r\n",
      "created_at": "2006-02-24T00:45:42.000Z"
    },
    {
      "author": "nicole",
      "body": "Oh good grief. NERDS.",
      "created_at": "2006-02-24T01:36:34.000Z"
    },
    {
      "author": "Nate",
      "body": "Yeah.  Like, TOTAL nerds.\r\n\r\nLess obscure tech references, more references to the dark lord Sauron.\r\n\r\nThat should do the trick.",
      "created_at": "2006-02-24T01:59:43.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Sauron?  Mordor?\r\n\r\n<a href=\"http://img469.imageshack.us/my.php?image=rockmordor6nx.jpg\" target=\"_blank\"><img src=\"http://img469.imageshack.us/img469/1049/rockmordor6nx.th.jpg\" border=\"0\" alt=\"Free Image Hosting at www.ImageShack.us\" /></a>\r\n\r\n",
      "created_at": "2006-02-24T02:34:19.000Z"
    },
    {
      "author": "--Jeff",
      "body": "I tried to help myself.  I said I wasn't going to post any more pictures in the Comments.  \r\n\r\nI'm weak.  \r\n\r\n<i>Bannination ensues for --Jeff?</i>",
      "created_at": "2006-02-24T02:37:09.000Z"
    },
    {
      "author": "Nate",
      "body": "Oh how I love that picture.",
      "created_at": "2006-02-24T02:52:50.000Z"
    },
    {
      "author": "--Jeff",
      "body": "I will continue to post pictures, when appropriate. \r\n",
      "created_at": "2006-02-24T03:41:54.000Z"
    },
    {
      "author": "Caleb",
      "body": "I REALLY hope you guys get this...\r\n\r\nhttp://www.apple.com/trailers/sony/artschoolconfidential/\r\n\r\nDid you guys watch Ghost World yet?",
      "created_at": "2006-02-24T05:14:55.000Z"
    },
    {
      "author": "Caleb",
      "body": "Oh, and I forgot Mortar! \r\n\r\nHa! **shrinking away in shame after such a lousy comeback**",
      "created_at": "2006-02-23T20:09:43.000Z"
    },
    {
      "author": "Nate",
      "body": "Isn't Mortar where the dark lord Sauron resides?\r\n\r\nI believe it also sometimes features in the lyrics of Robert Plant.",
      "created_at": "2006-02-23T20:40:57.000Z"
    },
    {
      "author": "Brandon",
      "body": "I enjoy \"Hackers,\" Nicole.  It was a favorite of mine in fourth grade when the coolest thing in the world to do was create your own chat room on mIRC.  I had \"bots\" that kicked people out if they swore... and banned them, if I was feeling it that day.  Heh.",
      "created_at": "2006-02-23T23:41:58.000Z"
    },
    {
      "author": "Caleb",
      "body": "Glad Dan doesn't kick us off here for swearing. I'd be in a shitload of trouble.\r\n\r\n<i>*** Caleb was kicked from #moxieblog by Dan (Please Don't Swear)</i>",
      "created_at": "2006-02-23T23:46:46.000Z"
    },
    {
      "author": "bjork24",
      "body": "/s irc.moxiecinema.com\r\n\r\n/j #moxiechat\r\n\r\nmsg [dan-24] You are cool!",
      "created_at": "2006-02-24T00:23:03.000Z"
    },
    {
      "author": "Caleb",
      "body": "That sucks it sucked. It sucks I missed it too, but now that I hear it sucked it doesn't suck that I missed it. Aw shucks.\r\n\r\nThat was the corniest thing I've ever written on here. Glad to see Nicole writing a post! I believe I'm liking this mixture of writing styles.  Nicole = informative with honesty. Dan = informative with insanity. Don't worry, the two go hand in hand.\r\n\r\nAs far as movie suggestions from blog readers, I have a couple, though I'm sure you've already looked into them. Ask the Dust and The Real Dirt on Farmer John. And Brick of course, for the hundredth time. Oh and I hear there is this new J-Horror movie called \"Loft\" by this Kurosawa guy...",
      "created_at": "2006-02-23T12:39:47.000Z"
    },
    {
      "author": "Nate",
      "body": "Dust, Dirt, and Brick?\r\n\r\nThose are very \"constructive\" suggestions, Caleb.\r\n\r\n\r\nHa! **touching my shoulder with a finger and making hissing noise**",
      "created_at": "2006-02-23T19:25:44.000Z"
    },
    {
      "author": "Molly",
      "body": "Breakfast on Pluto was the first film I saw here, and I've been addicted to the place ever since.  I also came to see the movie for the unbelievable attractiveness of Cillian Murphy, so good call on that one Nicole!",
      "created_at": "2006-02-24T07:41:21.000Z"
    },
    {
      "author": "mish",
      "body": "keep the pictures coming. i made one of them a profile pic on xanga... the one with the guy thats holding the sign that says \"get a brain morons\" and \"go usa\"\r\n\r\noh, i love it so.",
      "created_at": "2006-02-24T09:32:00.000Z"
    },
    {
      "author": "Zac",
      "body": "I would use rottentomatoes as a gauge before metacritic, if it is fresh it usually is pretty good, and j-horror sucks anyways, so what can you do.",
      "created_at": "2006-02-25T00:59:12.000Z"
    },
    {
      "author": "Zac",
      "body": "p.s. Sean Bean is the man",
      "created_at": "2006-02-25T00:59:56.000Z"
    },
    {
      "author": "Finy",
      "body": "watched it on dvd yesterday, fell asleep 30 minute into the movie, had to get up and search online to find out what was going on...yeah slow, confusing, and a little creepy...",
      "created_at": "2006-02-25T10:42:11.000Z"
    },
    {
      "author": "disappointed",
      "body": "I can't believe you're apologizing for Pulse.  That was in my top 3 moxie movies ever.\r\n\r\nChrist, if I wanted shiny Hollywood movies I've got a handful of big theaters here in town to choose from.  Shame on you for that post.\r\n\r\nI guess big hollywood crowd-pleasers are what bring in the cash.  Have fun with that.",
      "created_at": "2006-02-27T04:21:36.000Z"
    },
    {
      "author": "bjork24",
      "body": "disappointed: I'm sorry you feel that way. Perhaps you should have expressed your enjoyment after seeing the film, or on the forum even. If you had, that would've made you the ONLY person to do so. Instead, you've chosen to anonymously express your distaste and imply that we start showing \"shiny Hollywood movies.\" What else can I say?\r\n\r\nPerhaps: \"you're welcome\" for showing a film that you loved so much you put it in your top 3; \"you're welcome\" for showing a film that you wouldn't have had an opportunity to see anywhere else in Springfield; \"you're welcome\" for giving you a medium where you can anonymously bash us for expressing our sincere remorse for showing a movie that 99% of our audience disliked.\r\n\r\nIt's not my job to make all the people happy all the time... it's my job to run a big projector that shows movie. Like it or leave it.",
      "created_at": "2006-02-27T04:46:12.000Z"
    },
    {
      "author": "Jan",
      "body": "My daughter and I enjoyed Pulse.  Granted, we had a lot of questions and post-movie discussion - but what a treat that is compared to a typical movie outing.  We actually considered a second viewing to assist our assessment, and might still if we ever have the opportunity.  I agree that \"frightening\" was a misleading adjective, but don't abandon your genre exploration.",
      "created_at": "2006-03-01T03:46:34.000Z"
    },
    {
      "author": "nicole",
      "body": "No worries - just because we had a less than perfect experience with one film doesn't mean we give up entirely with that genre. I'm glad there were some people out there who enjoyed it - as a business owner, watching people walk out during each presentation rips at my heart. We love bringing in these unique films that cause discussions, but if people are walking out (and potentially not coming back), that's bad for us as a business.\r\n",
      "created_at": "2006-03-01T08:32:21.000Z"
    },
    {
      "author": "Kate",
      "body": "Just wanted to say that tomorrow will be my first visit to Moxie.  I have been trying to get there for awhile but life just keeps getting in the way.  BUT tonight when I saw that you were going to show TransAmerica I just had to make room in my busy schedule.  I also love, love, love that you can purchase tickets on-line AND that there is no additional fee...like other movie theaters in town (I won't mention any names).  I can't wait till tomorrow!  ",
      "created_at": "2006-03-05T06:25:05.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 16,
      "name": "Customers"
    }
  ]
}
