{
  "id": 372,
  "title": "True / False Film Festival 2006",
  "body": "I'm going to be attending the <a href=\"http://www.truefalse.org/home.htm\" target=\"_blank\">True / False Film Festival</a> in Columbia, MO over the weekend... alone. How pathetic is that? I'm going to sit through 13 movies over three days with just me and my sock puppet, Marvin Blando. I was thinking about doing a day-by-day account of the films I see, but who am I kidding... no one reads the blog on the weekend. I think I'll just collect notes and then write a T/F summary on Monday or Tuesday.\r\n\r\nIf you're interested, this is the itinerary I'm going to <i>try</i> to stick to:\r\n\r\n<b>FRIDAY:</b>\r\n+ SICK\r\n+ IN THE HEART OF THE GAME\r\n+ FUCK\r\n\r\n<b>SATURDAY:</b>\r\n+ BLACK GOLD\r\n+ THE DEVIL AND DANIEL JOHNSTON\r\n+ THE LAST SUPPER\r\n+ \"Filmmaker's Fete\" - meet & greet\r\n+ FAVELA RISING\r\n+ WHY WE FIGHT\r\n+ A/K/A TOMMY CHONG\r\n\r\n<b>SUNDAY:</b>\r\n+ AMONGST WHITE CLOUDS\r\n+ AWESOME: I FUCKIN' SHOT THAT\r\n+ STREET FIGHT\r\n+ HOMEMADE HILLBILLY JAM\r\n\r\nI wanted to see THE REAL DIRT ON FARMER JOHN, but it runs up against the Filmmaker's Fete... and who am I to turn down a free dinner with a bunch of wiley documentarians? I'm also skipping a free \"Of Montreal\" concert at The Blue Note to see WHY WE FIGHT and A/K/A TOMMY CHONG. Despite how much I love \"Of Montreal,\" I really can't stand seeing live shows... with the exception of Bjork and Radiohead, who I'd see any where at any time. Judge me if you must.\r\n\r\nAs for The Moxie, it's going to be in Nicole's capable hands over the weekend. If you drop in to see THE WHITE COUNTESS or LOGGERHEADS, be sure and tell her what a wonderful job she's doing. I'm a little nervous about leaving our baby, but I feel better knowing that momma's in the house... and Nicole will be there too.\r\n\r\nThe best part about all of this, of course, is that I get to eat at Lion's Choice... until I vomit. That, and I'm staying in a Motel 6. Woo hoo for economy rooms!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-02-24T08:51:49.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Ben Dillon",
      "body": "I did some voltunteer work for True/False, thereby earning a pass for the festival, so I'll also be spending my entire weekend seeing movies alone. I might wear my Moxie shirt on Saturday, so if you happen to see a scrawny guy sporting one, feel free to say hello. (I suppose you know what I look like from my \"Moxie Shirt Adventure\" photos.) I'll be going to the Of Montreal show on Saturday night, but I may try to see <i>Why We Fight</i> beforehand and just hope I don't miss their set.\r\n\r\nI have yet to eat at Lion's Choice, but if it's vomit-inducing good, I don't know why I've been waiting.\r\n\r\nAnd I'm sure Motel 6 is better than the \"Econo Lodge.\"",
      "created_at": "2006-02-24T09:48:00.000Z"
    },
    {
      "author": "brian of moore",
      "body": "when you come back be prepared to describe every movie in perfect detail.. and act out the interesting parts....  for those of us that couldnt make it to such a thing\r\nand while youre there.. say hi to my media 120 teacher",
      "created_at": "2006-02-24T13:56:34.000Z"
    },
    {
      "author": "Scott G.",
      "body": "i read the blog on the weekend :)",
      "created_at": "2006-02-24T17:13:48.000Z"
    },
    {
      "author": "Nate",
      "body": "What, precisely, are your issues with live shows?\r\n\r\nJust curious.",
      "created_at": "2006-02-24T20:10:34.000Z"
    },
    {
      "author": "bjork24",
      "body": "I like my music polished and manufactured, not improvised and off-key.",
      "created_at": "2006-02-24T20:39:26.000Z"
    },
    {
      "author": "Caleb",
      "body": "You can tell how truly talented a band/musician is based on their live performances. ",
      "created_at": "2006-02-24T21:25:48.000Z"
    },
    {
      "author": "Nate",
      "body": "Well, \"talent\" can also mean talent at songwriting, which usually happens when no one's watching.\r\n\r\nAnd \"live\" does not necessarily mean \"improvised.\"  You are thinking of the word \"Phish.\"\r\n\r\nSo ha!  I am much, much smarter than both of you put together.  And taller.  And skilled at curling and other various, obscure European winter sports.",
      "created_at": "2006-02-24T21:29:14.000Z"
    },
    {
      "author": "Nate",
      "body": "For example:  Coldplay in St. Louis.\r\n\r\nLive.  Not improvised.  Definitely not improvised.\r\n\r\nAnd it goes the other way too.",
      "created_at": "2006-02-24T21:31:49.000Z"
    },
    {
      "author": "bjork24",
      "body": "You're not taller than me.",
      "created_at": "2006-02-24T21:41:08.000Z"
    },
    {
      "author": "Nate",
      "body": "What the hell are doing up and responding to comments before noon, anyway?",
      "created_at": "2006-02-24T21:42:49.000Z"
    },
    {
      "author": "Nate",
      "body": "Taller than you \"put together.\"  That was implied.\r\nYou or Caleb could not very well stand on the other's shoulders.  Neither of you is that coordinated; I've seen you scoop popcorn.\r\n\r\nWe could, however, stack the two of you like cordwood.  \r\n\r\nThus, with this arrangement, I would be taller.",
      "created_at": "2006-02-24T21:45:57.000Z"
    },
    {
      "author": "tim",
      "body": "HEY! Of montreal has really rad live shows! they always have a couple cover songs, one year they covered rappers delight, and another year they belted out come sail away, PLUS! Puppet shows!!!  seriously, its a much better time then \"why we fight\"  \r\nwhose only purpose is to piss you off and make you feel utterly helpless. Embrace the invincible military-industrial complex and go see a fun show! ",
      "created_at": "2006-02-25T01:33:17.000Z"
    },
    {
      "author": "Caleb",
      "body": "Whoa! You OBVIOUSLY missed the time Dan stood on my shoulders and juggled flaming torches while I gave the introduction to a movie. And it was for Duma no less! \r\n\r\nAnd girls don't care about curling skills or popcorn-scooping skills. Girls want a guy with great skills, you know, like nunchuck skills, bowhunting skills, computer hacking skills...all of which I am fluent in. I don't know about Dan though.\r\n\r\nAnd by talent I meant performance talent I guess. I agree about songwriting skills. Some of the worst-sounding bands have written great lyrics, while some of the best-sounding bands have written stupid lyrics. Don't ask me to name any examples of this theory though.",
      "created_at": "2006-02-25T01:33:59.000Z"
    },
    {
      "author": "Nate",
      "body": "But by songwriting I meant more than lyrics too.  The melody, rhythm and all that, the song itself in other words, has to be written as well.  In fact that's more what I was talking about.  I like all of it, but I'm a music guy before I'm a lyric guy.\r\n\r\nSome of the best songwriters, musical composers, etc., step out of the studio and are crap, because they are not showmen.",
      "created_at": "2006-02-25T01:55:09.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Speaking of...uh, Of Montreal. I just came across this page and noticed that halfway down the page under \"The Early Four Track Recordings\" is the greatest song title I've ever seen.\r\n\r\nhttp://www.relativetheoryrecords.com/blog/2006/02/24/of-montreal/",
      "created_at": "2006-02-25T10:05:19.000Z"
    },
    {
      "author": "brian of moore",
      "body": "there are certain types of music that should most often be listened to via a CD/mp3 or what have you.... not .. that those types of bands shouldnt occasionally be seen live.... the experience is definately worth it...\r\n\r\nbut... there are other types of bands that should be seen live if you get the opportunity... and could be much better live than listening to a cd.........  yes improvisational music can be very good...  ie.. jazz\r\nand yes jamband music\r\n\r\neditors note: phish was good... pre-2002 they shouldnt have came back after the first 'hiatus'\r\n",
      "created_at": "2006-02-25T15:22:38.000Z"
    },
    {
      "author": "tim",
      "body": "every song on the early four track recordings is dustin hoffman...\r\nmy two fav songs: dustin hoffman needs a bath and, dustin hoffman gets a bath. if anyone is into legit mp3's it looks like selections from the of montreal catalog are onle $4.50 on itunes right now!  \r\n\r\nneat! \r\n\r\n",
      "created_at": "2006-02-25T23:35:49.000Z"
    },
    {
      "author": "Caleb",
      "body": "Yet <i>another</i> movie suggestion from me...\r\n\r\n<a href=\"http://www.apple.com/trailers/independent/lonesomejim/trailer/\">Lonesome Jim</a>",
      "created_at": "2006-02-26T09:39:00.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "Of Montreal was amazing tonight. They played the intro to \"The Final Countdown\" leading into Lysergic Bliss, I believe.\r\n\r\nI'd elaborate more, but I'm tired. Goodnight.",
      "created_at": "2006-02-26T12:52:25.000Z"
    },
    {
      "author": "CJ",
      "body": "I'm at the true/false im festival this weekend too.....I saw This film is not yet rated this afternoon and why we fight later today and plan to go see american blackout and the big questions tomorrow.",
      "created_at": "2006-02-26T12:56:34.000Z"
    },
    {
      "author": "tim",
      "body": "dude!!! how was \"this film is not yet rated\"!??\r\ndid it earn its NC-17?",
      "created_at": "2006-02-26T13:17:29.000Z"
    },
    {
      "author": "Jeremy",
      "body": "please tell us how the screening went at Awesome I Fuckin Shot That ...",
      "created_at": "2006-02-27T12:43:38.000Z"
    },
    {
      "author": "CJ",
      "body": "This film is not yet rated was pretty good and really bought out the truth abt the MPAA, hence the reason y this is called true/false film festival....haha....i was so glad that they picked Kirby Dick to receive the true vision award for the festival......the movie is definitely a must see and is definitely one of the best ones ive seen this year",
      "created_at": "2006-03-08T08:26:15.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
