{
  "id": 373,
  "title": "True / False = False",
  "body": "My 13 film marathon was a bust. I went up to Columbia on Friday afternoon, watched SICK: THE LIFE AND DEATH OF BOB FLANAGAN and THE HEART OF THE GAME (FUCK was sold out). After watching THE HEART OF THE GAME, I went to a filmmaker / passholder party and stood in the corner drinking beer... then Nicole called from the theater. There had been an accident - two accidents, in fact - that resulted in a reel falling off the projector during a movie.<br/><br/>Thankfully the reel wasn't able to fall all the way to the ground due to the recessed ceiling we built to accomodate the height of the projector. Had it not lodged itself against the wall, it would've fallen onto the sound rack and pulled the entire projector head along with it. Needless to say, it was the largest non-failure accident in our history. Nate did a great job getting the show back on the road (thanks Nate!), but I knew I still needed to come back.<br/><br/>I left early Saturday morning from Columbia and was back in Springfield before our first show. I spent the rest of the weekend at the theater, as per usual. Fun, huh?!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-02-27T22:01:34.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "Derek - that's really funny today especially because the Google ad on the comment page is for donations to help Katrina victims. <br/><br/>Damn those pornographic charities!!",
      "created_at": "2006-03-01T00:11:41.000Z"
    },
    {
      "author": "Nate",
      "body": "I once dated a girl at Evangel, and if I was in her dorm room the door had to be open and we could not both sit on the bed at the same time.",
      "created_at": "2006-03-01T01:38:53.000Z"
    },
    {
      "author": "evilvet",
      "body": "Although you missed out on seeing the movie \"FUCK,\"  it sounds to me you quoted it all weekend long.  Dont ya love small business?  See you soon.",
      "created_at": "2006-03-01T02:17:01.000Z"
    },
    {
      "author": "Derek",
      "body": "All your google ads are blocked on Evangel's network under the heading, \"Adult Content.\" Man, I need to find a new school, hahaha.",
      "created_at": "2006-02-28T20:59:22.000Z"
    },
    {
      "author": "Caleb",
      "body": "Oh my god! That really really sucks. The safety clamp though?! That's like one of the first things you do. Anyway, sorry you had to miss out on all those movies. What was the other accident? Or was that both of them - (1) the reel crashing and (2) the audience having to wait on the movie to get threaded up again? ",
      "created_at": "2006-02-28T00:42:24.000Z"
    },
    {
      "author": "bjork24",
      "body": "Kenny: WHY WE FIGHT starts on the 29th of March and runs for a week! Woo hoo!",
      "created_at": "2006-02-28T05:04:54.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "I'm sorry you had to miss the festival. It was a good time, indeed.",
      "created_at": "2006-02-28T07:34:43.000Z"
    },
    {
      "author": "--Jeff",
      "body": "If it's any consolation, Dan, I ate chili and drank beer all day Saturday.  It isn't?  <br/><br/>Seriously, sorry to hear about your weekend (The Firing in particular).  Trump makes it seem so heartless and easy...<br/>",
      "created_at": "2006-02-28T08:16:40.000Z"
    },
    {
      "author": "Kenny White",
      "body": "Dan,<br/><br/>You missed out big time.  That sucks.  I'm the \"Moxie patron\" who sat next to you during Sick.  I know that you already have plans to bring a few of the movies from the festival to Springfield, but I am begging you to please bring \"Why We Fight\" to the Moxie.  There were lots of great movies over the weekend - \"The Devil and Daniel Johnson\", \"Chalk\", \"This Film is not yet Rated\",\"The Trials of Daryll Hunt\" - but \"Why We Fight\" had more people thinking and talking all weekend than any other movie.  I have seen a lot of anti war movies, but this one did the best job of giving a complete round picture of the multiple facets of the issues around defense spending.  Springfield is full of people that need to have a starting point for the dialogue that this movie encourages.  It doesn't just attack Republicans alone, in fact the heroe of the movie is Dwight D. Eisenhower, it attacks our system of national defense, the behavior of our congress and executive branch for the last 45 years and our acceptance of the new foreign affairs policy in this country since 9/11.  Please bring it in.  I will personally fill one showing with friends and family that I'll beg, plead and pull to the theater even if I have to pay their way myself.  Discussion afterwards has to be the goal.  Do what you can.  I feel that you may be our only hope of getting this powerful movie to this area.<br/>I'll torture you with tales of the festival next time we make it in to the theater.  You missed a good one.",
      "created_at": "2006-02-28T05:01:05.000Z"
    },
    {
      "author": "brian of moore",
      "body": "you got Punk'd!",
      "created_at": "2006-02-28T02:17:07.000Z"
    },
    {
      "author": "Nate",
      "body": "Nicole was the one that had to face the angry, vegetable-throwing crowd.<br/><br/>Actually they were not angry.  They were very patient and kind.  And the vegetables they threw were quite nutritious.",
      "created_at": "2006-02-27T22:49:47.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
