{
  "id": 374,
  "title": "Moxie A Go-Go",
  "body": "It's not listed on the online calendar yet, but there's a new event series debuting in March... MOXIE A GO-GO. Basically, it's a portable version of The Moxie that can go anywhere at anytime. Think of it like a hot Moxie injection! Mmmm. Lion's Choice roast beef.\r\n\r\nHere's how I explained it on our calendar: \"Keeping with our mission of offering unique cinematic experiences to the Springfield community, The Moxie is proud to announce our latest film series, MOXIE A GO-GO. Think of it as a portable Moxie experience that can be shown anywhere. Our inaugural event will be dinner and a film in the Pavilion room at Mille's on 313 S. Jefferson. Tickets are $20 per person, and can be purchased at our box office or at Mille's on the day of the event. The film, LE PLACARD (THE CLOSET), is a hilarious French comedy starring the versatile Daniel Auteuil (also seen this month in CACHE) and the always jovial Gerard Depardieu. Auteuil stars as Francois Pignon, a very bland accountant in a rubber factory who is about to be fired. To save his job he pretends, very poorly, to be gay. Depardieu, a womanizing homophobe, hates Pignon and tries to get him fired anyways. Pignon falls in love with a female executive and hilarity ensues! Don't miss your chance to see this one... and enjoy some great food from Millie's!\"\r\n\r\nTechnically speaking, Moxie a Go-Go is our state-of-the-art 3,000 lumen digital projector, a 10' portable draper screen, and an amazing sound system donated to us from the good people at <a href=\"http://www.slsloudspeakers.com/\" target=\"_blank\">SLS</a>. Assuming that our inaguaral event goes well, you might see between 2 to 4 Moxie a Go-Go apperances per month. We've been contacted by several businesses that are interested in hosting an event, but they're all downtown. I'd really, really, REALLY like to extend our reach to the south side of town, where few people even know we exist... or even futher out - Republic, Willard, Fair Grove, Billings! I'm thinking the parking lot of Campbell Suxteen would be a good spot!\r\n\r\nCan anyone think of a good location on the south side of town? What about some good movie-themed dinners and/or events? For instance, the 35th anniversary of THE GODFATHER at an Italian restaurant (obvious!); or LIPSTICK & DYNAMITE: PISS & VINEGAR: THE FIRST LADIES OF WRESTLING in an old boxing ring with a real female wrestling tournament afterwards. There's so many possibilities. Let's hear them!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-03-01T09:05:58.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nathan springer",
      "body": "arbys kicks the crap out of lions choice, and i will fight anyone that thinks otherwise.",
      "created_at": "2006-03-01T09:47:09.000Z"
    },
    {
      "author": "Laura",
      "body": "Mr. Yen's on south National has a banquet room.  I went to a cabaret-review-theater thingy there a few years ago. ",
      "created_at": "2006-03-01T10:25:22.000Z"
    },
    {
      "author": "Caleb",
      "body": "I'm very angry right now. I was writing a nice long comment full of wonderful suggestions and then I go to click on a new tab and I accidentally clicked on my link to <a href=\"http://www.woot.com\">Woot</a> on my bookmarks toolbar, thus erasing all which I had written. Never again will that creativity be achieved. That will teach me to use Firefox. I will try this again, though not in as great humorous detail...\r\n\r\nPulp Fiction Night @ Ziggies (have a dance competition and everything. Maybe. At least make them serve $5 milkshakes)\r\n\r\nSe7en Night @ Italian Joint (they can only serve spaghetti sauce though. And lots of it!)\r\n\r\nLegend of 1900 @ Ernie Biggs (there is a great piano duel scene in this movie and you could do an intermission where you have a real-life piano duel)\r\n\r\nThe Princess Bride @ Anywhere (you can poison some drinks and then have a fun game of switcharoo and see who lives, and afterwards everyone can have a good laugh)\r\n\r\nDuck Soup @ ...um... (apparently that's what Springfield needs. A soup joint. I think the Mudhouse should start it. Call it the Mud Bowl. I should call them...until then, postpone this one.)\r\n\r\nChinatown @ Pythian Castle (they do murder/mystery dinners there all the time. Maybe you could get them to do one tying in with this film)\r\n\r\nBest in Show @ Petsmart (bring your pets!)\r\n\r\nOldboy @ Haruno (make sure they serve octopus. anyone who's seen this film knows what I'm talking about)\r\n\r\nThe Silence of the Lambs @ Springfield Federal Medical Center (hopefully in the insane ward. And serve lambchops)",
      "created_at": "2006-03-01T10:47:44.000Z"
    },
    {
      "author": "Caleb",
      "body": "And you may think some of those are jokes, but they're really not. [evil laugh]",
      "created_at": "2006-03-01T10:50:47.000Z"
    },
    {
      "author": "tim",
      "body": "you could show UHF at a tv station and everyone could eat twinkie wiener sandwiches. wouldnt that be awesome if you guys were watching a movie in the background of some nightly news program while they were broadcasting... maybe. \r\n\r\nreally, rooftop screenings are a good time. you guys should just find excuses to do that in the summer.   ",
      "created_at": "2006-03-01T11:41:49.000Z"
    },
    {
      "author": "Caleb",
      "body": "Chicago in Chicago!",
      "created_at": "2006-03-02T12:44:20.000Z"
    },
    {
      "author": "Nate",
      "body": "Cool Runnings at Rasta Grill?\r\n\r\nBatman at the Springfield Underground?\r\n\r\nJumanji at the Dickerson Park Zoo?\r\n\r\nOffice Space in my office?\r\n\r\num....\r\n\r\nThe Birdcage at Flame?\r\n\r\n",
      "created_at": "2006-03-02T06:16:36.000Z"
    },
    {
      "author": "Nate",
      "body": "Cocktail at ICON.",
      "created_at": "2006-03-02T06:17:37.000Z"
    },
    {
      "author": "Derek",
      "body": "Breakfast Club in a school (go south with Glendale or Kickapoo).\r\n\r\nTeenage Mutant Ninja Turtles in a sewer.....or at Springfield Underground or something.......whatever.\r\n\r\nStar Wars at a conservatory. Do we have one of those? Maybe the Discovery Center. Better yet, in space. I see no problems with this.\r\n\r\nBack To The Future in 1955. I bet that would go over really well. Or maybe in the square, hosted by the DMV. That seems likely.\r\n\r\nEternal Sunshine of the Spotless Mind at a neuroscience research center. No? What about a psychiatrists' office? No? Okay, well, what about hosted by the psychology department of a school? There are a bunch of those.\r\n\r\nCatch Me If You Can or Airplane! at the airport. Actually, a whole series could be done there. At night, after planes are no longer coming in or taking off, movies could show on runways. In no way would there be a security problem with this. Not ever.\r\n\r\nClue The Movie in a really big house. Or a ballroom. Maybe just a hall. Okay, I'm going to stop now before the bad Clue-related jokes take over my thoughts for days. It might be too late.\r\n\r\nThat short from The Animation Show about the FEDS in a grocery store.\r\n\r\nStop me at any time here.\r\n\r\nSomething in a recital hall. I don't know what movie would be good for this, but I like the idea of watching a film at Clara Thompson Hall or the Barnett Recital Hall or something.\r\n\r\nI think Die Hard would be a good one for a rooftop. Maybe the top of a parking garage. Or the top floor of Hammon's Tower. there are a lot of places that would be good for watching Die Hard.\r\n\r\nRambo in the woods.\r\n\r\nRocky at a meat-packing place.\r\n\r\nThe Cutting Edge at the ice park......What? Okay, maybe the Mighty Ducks......What? *Sigh* Shut up.\r\n\r\nDonnie Darko anywhere. Find a pervert's house. Whatever.\r\n\r\nWas that too much? Sorry. I got excited.",
      "created_at": "2006-03-02T07:28:54.000Z"
    },
    {
      "author": "Nicole",
      "body": "Does the $20 at the Mille's event include anything else other than admission?",
      "created_at": "2006-03-01T19:16:33.000Z"
    },
    {
      "author": "matt",
      "body": "you need to show Three Extremes at a dim sum restaurant!  Well, maybe not.  Old Boy at a place that sells octopus?  Check out the Alamo Drafthouse's website for the kinds of things they do in Austin.  Lord of the Rings marathon with meals at all the traditional hobbit eating times comes to mind!  They have a lot of crazy ideas, and their Rolling Roadshow is probably the coolest non-traditional movie thing I've ever heard of anyone doing.  Close Encounters projected with Devil's Tower in the background?!  ",
      "created_at": "2006-03-01T20:09:01.000Z"
    },
    {
      "author": "bjork24",
      "body": "Nicole: the $20 admission covers your ticket and dinner. The only thing you'll have to pay for, if you so choose, is drinks at the cash bar.",
      "created_at": "2006-03-01T21:29:15.000Z"
    },
    {
      "author": "--Jeff",
      "body": "If we watch <b>anything</b> at at TV station (I know one in particular with a bunch of Moxie fans ;) ) it'll be <a href=\"http://www.imdb.com/title/tt0092699/\">Broadcast News.</a> A classic TV movie.  \r\n\r\nOr <a href=\"http://www.imdb.com/title/tt0357413/\">Anchorman.</a>  \r\n\r\nJust kidding. \r\n\r\nI like ALL of Caleb's ideas.  Count me in. \r\n\r\nAnd yeah, we need a LotR Dinner Movie.  Potatoes for Everybody! \r\n\r\n<a href=\"http://imageshack.us\"><img src=\"http://img494.imageshack.us/img494/1218/potaytoes1if.gif\" border=\"0\" width=\"104\" alt=\"Image Hosted by ImageShack.us\" /></a> ",
      "created_at": "2006-03-01T22:06:52.000Z"
    },
    {
      "author": "Amanda",
      "body": "Sweet! Now that your on the GO-GO you can travel to all the out-of-the-way places that your blog readers live! Boise is looking forward to your showing of The Princess Bride in one of our famous downtown underground tunnels.",
      "created_at": "2006-03-01T22:30:53.000Z"
    },
    {
      "author": "Buttercup",
      "body": "But...but what about ROUS-es?",
      "created_at": "2006-03-01T23:19:02.000Z"
    },
    {
      "author": "Wesley",
      "body": "Rodents of Unusual Size?  I don't believe they exist.",
      "created_at": "2006-03-01T23:19:37.000Z"
    },
    {
      "author": "Large, scary looking ROUS",
      "body": "Raarrgh!!",
      "created_at": "2006-03-01T23:20:09.000Z"
    },
    {
      "author": "nicki",
      "body": "do we have a date for the event? or am i blind and missing it? :)",
      "created_at": "2006-03-02T01:09:37.000Z"
    },
    {
      "author": "bjork24",
      "body": "March 24th... you're not blind; I'm just forgetful.",
      "created_at": "2006-03-02T01:20:42.000Z"
    },
    {
      "author": "Amy",
      "body": "Perhaps Touche?  Little snotty but has the space for it.  Also, I LOVE the idea of perhaps Sideways at Pairings or Winestyles.  Too much fun for that tie in!",
      "created_at": "2006-03-02T05:57:03.000Z"
    },
    {
      "author": "nicki",
      "body": "my eyes jumped ahead as i read that... i saw \"march 24th... you're blind\" and almost got mad. then i re-read it :D haha",
      "created_at": "2006-03-02T04:27:15.000Z"
    },
    {
      "author": "Laura",
      "body": "\"Three Amigos\" at Tres Hombres?  Anyone?  Seriously.",
      "created_at": "2006-03-02T05:15:39.000Z"
    },
    {
      "author": "erin",
      "body": "coffee and cigarettes at someplace that serves coffee!\r\n\r\nive never seen 'do the right thing' but i know it involves a pizza place. so... do the right thing at a pizza place!\r\n\r\nclose encounters of the 3rd kind. and we will only be served mashed potatos!!\r\n\r\nokay. im bad at this. i admit.",
      "created_at": "2006-03-02T05:35:47.000Z"
    },
    {
      "author": "Kenn White",
      "body": "Argentina's has an upstairs bar for hosting parties.  Upscale restaraunt with south side clientele.  There has to be a movie tie in somewhere there.  ",
      "created_at": "2006-03-04T16:47:14.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
