{
  "id": 375,
  "title": "Dan is a panty waste",
  "body": "After spending over a month of pleading, negotiating, and flat out pandering for our March line-up (which, if you haven't noticed, is our strongest month of all time), it kind of breaks my heart to see so few people show up. Some might view our calendar as just a \"list of movies,\" but those 7 or 8 films are debated over, fought for, and weighed against so many others... so to us, it feels like the fate of The Moxie hangs in the balance at the onset of each new month. Our viablity is tied to the films we choose. Sometimes we lose (February), and sometimes we win (January). That's how small businesses work. Even still, after having fought so hard to get all of the Oscar-nomintated short films to play here, it kind of stings when only 5 people show up. Who knows, maybe the animated shorts will do better later tonight... but I somehow doubt it. As you can see, February has put me in quite a funk. Here's hoping that March can pull me out.\r\n\r\n<b>Update:</b> No one showed up for the animated Oscar shorts. Our first \"dark show\" of the month.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-03-02T07:56:18.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "i think i may have made a msu facegroup for the moxie before caleb did... his just has a much more catchy name\r\n\r\n\"i heart the moxie\" rolls off the tongue better than \"The Moxie is open, so my nights no longer are\"\r\n\r\ni guess im not too good at marketing",
      "created_at": "2006-03-03T01:17:40.000Z"
    },
    {
      "author": "nicki",
      "body": "i was going to come to one of the shorts last night... but i was just way too tired/stressed after work. the first week of the month is never fun for bankers... and friday the third is coming up... *shrill scream of terror*",
      "created_at": "2006-03-02T19:15:07.000Z"
    },
    {
      "author": "Caleb",
      "body": "Haha, I've learned my lesssons about starting a sentence with \"I saw this great <i>French</i> film the other day...\" around these parts. People seem to instantly go on the defensive and lose all respect for your taste in film. This is an interesting debate in sociological theory. I think humans will always fear that which we don't understand. Most Americans, in general, could care less about the arts. Americans are Phillistines!\r\n\r\n(Heh, if I posted this somewhere on IMDB I would be flamed to death, but I feel much safer in the pages of The Moxie Blog)",
      "created_at": "2006-03-02T19:17:29.000Z"
    },
    {
      "author": "Laurali",
      "body": "Chris & I really want to see both of these but we are on a strange schedule for the next ten weeks. We'll try to come tonight if we can manage it.",
      "created_at": "2006-03-02T19:38:13.000Z"
    },
    {
      "author": "seesquared",
      "body": "...and by  \"strange\" , the schedule that my wife refers to is that i finally have a job to force me to leave the house each day,  instead of  holding the couch down for the last 8 weeks....then yes we now have a strange schedule, but we WILL be there for the 9:10 tonight.   My new employment has a ugly view out of almost every window of the Evil Empire's Death Star (Cin16),  I don't think I could continue to work there if I did not support the Moxie as much as I could in the month of Oscar.  Thank you Dan and Nic for bringing movies to Springfield that the big 8 or 16 won't!",
      "created_at": "2006-03-02T20:14:52.000Z"
    },
    {
      "author": "Random Redneck",
      "body": "You gon' git you sum dis feelm? Beat dat ther' Suxteen to it? \r\n\r\nhttp://www.apple.com/trailers/sony_pictures/talladeganights/\r\n\r\nAwful sorry no linkin' clicker. Ain't got no sense fer HTTP codin' or whatever dat ther' stuff is.",
      "created_at": "2006-03-02T13:05:13.000Z"
    },
    {
      "author": "girlwithamoviecamera",
      "body": "Dan,\r\n\r\nbreaks my heart, too. those are all first rate films, i'd love to watch them!!! :(\r\n\r\nfirst thought upon reading your post was \"maybe they're just in the wrong country.\" \r\n\r\ni was in paris a couple of weeks ago and was soooo moved by the french appreciation of quality films. they all sit in religious silence during screenings, not a single shuffle/movement even during slow films like suwa's \"un couple parfait.\" and they sit still through the end credits. just about amazing. i was in teeny tiny movie theatres with no concession stands that would always fill up with spectators even during retrospectives of, say, obscure foreign auteurs from the 50s...\r\n\r\ni think the american public is too used to a certain kind of film and sees unconventional and/or foreign films as too much of an effort. i mean, even my dad, who's italian and in the 60s would organize screenings of Pasolini films, now asks me to borrow films from my collection \"so that he can fall asleep.\" he almost snatched from my hands antonioni's \"l'avventura\" but i refused to lend it to him for such crass purposes.\r\n\r\ni think your mission is really noble and i hope it will educate the public, introduce them to some challenging films.\r\n\r\nyou have my best wishes :)",
      "created_at": "2006-03-02T16:51:08.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i used up a few of my outlets...\r\n\r\ni nominate caleb to plaster something on facebook",
      "created_at": "2006-03-02T11:04:03.000Z"
    },
    {
      "author": "brian of moore",
      "body": "oh.. and i also have animation class tomorrow\r\nso ill be sure and mention it to everyone in there",
      "created_at": "2006-03-02T11:05:02.000Z"
    },
    {
      "author": "Rob",
      "body": "Damn! How freakin' cool would that have been for me to be alone in the theatre for my own private screening of the animated shorts.  The reason I don't come more than twice a month is because I hate crowds of people.\r\n\r\nTotally there this weekend, tho.  I really appreciate you bringing in those short films.",
      "created_at": "2006-03-02T11:55:14.000Z"
    },
    {
      "author": "Caleb",
      "body": "I feel bad now cause I was going to come tonight but I got out of night class and was exhausted so I went home. But you wouldn't have made any money off me for a ticket anyway. I woulda bought a beer though!\r\n\r\nI am going to send mass messages to everyone in my \"I Heart the Moxie\" group on Facebook about this month's schedule. \r\n\r\nOh, and I watched Pulse and I was impressed. I can definitely see why some people may not like it but I found the horror to be creepy as hell (psychological terror actually creeps me out whereas jumpy stuff I jump and then laugh at it). I really liked the message behind the whole movie with the strong theme of loneliness. I think it'd be a great choice for a film class to study and analyze. And I bet MSU's main film studies professor will show it in the future because he loves Asian cinema. ",
      "created_at": "2006-03-02T12:39:48.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i got your back",
      "created_at": "2006-03-02T08:41:13.000Z"
    },
    {
      "author": "Rachel",
      "body": "gasp. there has to be something you can do. set up some huge publicity stunt. If 50 people come you and nicole will do it in front of the crowds.",
      "created_at": "2006-03-02T09:44:38.000Z"
    },
    {
      "author": "Kenn White",
      "body": "I'll be there on Sunday.  I really want to see the Shorts, but I had surgery today.  If any way possible I want to see the Shorts on Sunday.\r\n\r\nSmall business definitely has it's ups and downs.  I know first hand that it gets kind of scary sometimes.  Hang in there, because the positives far outweigh the negatives.  What kind of advertising do you guys do?  I talk up your place all the time, but find that a lot people don't know what I'm talking about.\r\n\r\nWhen can we buy into the dinner and a movie?  \r\n\r\n",
      "created_at": "2006-03-02T10:58:08.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "I would have come if I were in Springfield. I would have really liked to see those shorts. It's a shame that you made them available and no one showed up.",
      "created_at": "2006-03-02T10:58:54.000Z"
    },
    {
      "author": "nicole",
      "body": "I have extremely high hopes for March. Our schedule is a little more accessible than it was in February. As much as I liked what we showed in February, I don't think all of Springfield is quite ready for it yet. We'll try again in a few more months with the more obscure art-house films (featuring, you know, genital mutilation and concert documentaries).\r\n\r\nPlus, Dan and I have put on our thinking caps and have come up with some fun promotions that I think people will enjoy. \r\n\r\nThanks for all the nice comments today, though! It's so easy to focus on the negative, and we're very fortunate to have the support we do have. Otherwise, we wouldn't have lasted two months without you all. And we're on our way to six months now!\r\n\r\nOk. I'll stop being mushy and start cleaning the house now.",
      "created_at": "2006-03-02T23:19:48.000Z"
    },
    {
      "author": "Nate, who really should be working,",
      "body": "I created a Facebook Moxie group for OTC.  \"Inspired by\" Caleb.",
      "created_at": "2006-03-02T23:30:48.000Z"
    },
    {
      "author": "Cassy",
      "body": "i came to the moxie twice last month....im just now getting into the whole short films and independent films....i saw pulse....it was really an interesting film i mean it wasnt scary but it made me scared....i liked it.....i will try and come to the shows more though.\r\n\r\nlater all\r\n",
      "created_at": "2006-03-02T22:46:01.000Z"
    },
    {
      "author": "brian of moore",
      "body": "the word spreads like wildfire...\r\npeople are reposting my bulletin/post\r\nits the latest craze...",
      "created_at": "2006-03-02T22:53:10.000Z"
    },
    {
      "author": "evilvet",
      "body": "If, as Caleb suggests, one has the (mis)fortune of being the only one in the theatre during a screening, would you maybe fast forward past some of the dialog if it was too mushy or hard to follow?  And rerun some of the cool stuff like knife scenes and explosions?  That'd be cool.",
      "created_at": "2006-03-02T20:54:55.000Z"
    },
    {
      "author": "Monkey",
      "body": "well I was gonna go last night, but I totally fell asleep ..;(\r\n\r\nI'm getting sick, I don't think I should bring that into your lovely theatre...  I really want to see the animated shorts though!",
      "created_at": "2006-03-02T22:17:51.000Z"
    },
    {
      "author": "Caleb",
      "body": "Brian - when I made my group I did a group search of \"moxie\" before I made it so I wouldn't be making a duplicate group and no such groups existed. So alas, I was the first. But I like your group name better.",
      "created_at": "2006-03-03T10:24:45.000Z"
    },
    {
      "author": "Godfrey and Stella",
      "body": "Dan and Nicole.... we are so sorry for NOT coming to the Animated shorts show...  we had opportunity and didnt'.... .now I feel bad!.  We live an hour away so seldom get to come by, but we LOVE what you are doing.    I feel like a dick for not supporting you on one of the few times I could have and that one was when my fat little butt could have made a modest difference.   Please don't give up.  I promise to come by more often!",
      "created_at": "2006-03-04T20:23:43.000Z"
    },
    {
      "author": "Kreuk or not",
      "body": "I am so sorry to hear that no one showed up. I only found out that the Moxie was offerring these showings AFTER the oscars. Rest assured, now that i know where to find your schedules i'll be in at least twice a month. (also i promise to bring a date and buy a glass of wine and anything you have from tea bar and bites because that place is my fav!)\r\nlooking forward to cache tonight!",
      "created_at": "2006-03-17T23:51:51.000Z"
    },
    {
      "author": "brian of moore",
      "body": ".... i too did a search for 'moxie' before making my group\r\nso that *I* would not be making a duplicate group\r\n\r\n.......... there is only one thing left to do\r\n... we must fight to the death\r\n... (and by fight... i mean drink) (and by death i mean whoever passes out first)",
      "created_at": "2006-03-20T05:05:35.000Z"
    },
    {
      "author": "Amy",
      "body": "I would like to add something to this conversation.  My hubbie and I come to the Moxie quite often (We are in queue for meeting our goal of every movie this month) and maybe aren't the typical Moxie customer, being the 8-5ers that we are.  I REALLY wanted to see these movies and I know there were some scheduling conflicts because of the film festival, but they were WAY too late for us.  When we come in the week, we come to the 7:00 show.  And yeah, one of them was late on a Saturday, but I get up at 7ish even on the weekend out of pure habit.  I wished you had shown them more than once or maybe in the afternoon or early evening, because I was really disappointed in not being able to see them.  And I know you can't make everyone happy, but I think the time issue may have played a bigger part than realized.  There are a lot of \"I was exhausted\" posts on here.",
      "created_at": "2006-03-25T18:31:06.000Z"
    },
    {
      "author": "Amy",
      "body": "K, so now I feel like an ass, because as I was looking at the March calendar for Matador, I noticed that they were there Sunday afternoon.  I SWEAR, I never noticed that!",
      "created_at": "2006-03-25T18:32:38.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
