{
  "id": 376,
  "title": "Pity parades are for losers",
  "body": "First off, let me apologize for last night's pity post. I was really bummed out over our super shitty February, and was hoping (quite naively) that our luck would change along with the new month. When it didn't, I hit a HUGE low. I won't delve into the gritty details, but Nicole and I ended up having a long conversation where I ended up sounding like the world's biggest defeatist, which is something that has never happened before in relation to The Moxie. Needless to say, we both went to bed with stress-induced stomach aches.\r\n\r\nAnd that's when I had <i>the</i> dream.\r\n\r\nFrom what I remember, I was at the Lion's Choice in Columbia (the one I didn't get to go to over T/F weekend) and I was ordering a roast beef combo meal. Instead of handing me the regular meal, they gave me a box filled with a variety of meats, from which I had to pick and choose what I wanted to put on my sandwich... and then I woke up. As you can see, the dream had little to do with our current situation and more to do with the fact that I haven't eaten in three days. Whether the dream had a point or not, I woke up revived and refreshed. The dark clouds had parted and I was ready to tackle every problem I could find... including why I had woken up with my underwear on backwards.\r\n\r\nThe first thing I did was change the title of yesterday's post to \"Why must you hurt us so?\" to \"Dan is a panty waste.\" Seriously though, complaining about a bad month on the blog was one of the stupidest thing I could've done. The people who read this blog are already coming into the theater (if they live in or around Springfield), and the last thing I want to do is make them (you) feel bad if you haven't been in in awhile. While guilt-tripping might work on Nicole when I don't want to take out the trash, it's not an effective form of marketing for The Moxie.\r\n\r\nOk, now let me rewind a bit... what problems do we need to tackle to make The Moxie a success? To properly answer that question we need to figure out what factors made February such a bad month. \r\n\r\n<b>Scheduling</b>\r\n\r\nAfter speaking with Paul, our booking agent, and hearing it from several other people, I think our first problem in February was our film selection. Looking back, it seems that our films were a bit too ecclectic for the market. We were showing films that weren't being played anywhere else in the Midwest (MOOLAADE, LOGGERHEADS, COACHELLA), which sounds good on paper, but doesn't really bring in the crowds. I think as our audience expands over time, smaller films like these will become more viable, but right now we need something with a little more draw. As Paul put it, \"your February calendar would've had a hard time drawing crowds in San Francisco, let alone Springfield.\"\r\n\r\nNow, don't go accusing us of selling out, because we're not about to do that. Even if we wanted to start showing huge movies, which we don't, Campbell Suxteen and Springfield Great would beat us up and down the \"booking\" court. We can't compete at that level, which makes it difficult to find something that 1) Campbell won't snipe from us, 2) has a big enough \"hook\" to draw in audiences, and 3) wants to work with our little 75 seat theater. There's an entire post waiting in the wings about the fine art of booking a single screen cinema - it's not as easy as simply being the first to ask for a movie - but I'll get to that at a later time.\r\n\r\nJust know this: every film we're showing in March has a \"hook.\"\r\n\r\n<b>Accessibility</b>\r\n\r\nThe accessibility of our films can be approached from several angles: levity, cost, and promotion. Let's look at each in turn: (For all those people who don't like long posts, I'm sorry)\r\n\r\n<i>Levity</i>\r\n\r\nI could've used another word to describe this, but I've always had a thing for the word \"<i>levity</i>,\" which basically describes the \"heaviness,\" or lack thereof, of our film's subject matter. In February nearly every one of our films were HEAVY: cafe violence, self-destructive musicians, white trash dollmakers, female circumcision, existential horror films extrapolating on the theme of loneliness in an over-connected world, the Japanese invasion of China, AIDS, Branson, etc.. There were a few happy notes in there (DUMA and COACHELLA), but I think they were hampered by the otherwise HEAVY line-up. March has a strong mix of HEAVIES and LIGHTIES, so hopefully everyone can find something to watch.\r\n\r\n<i>Cost</i>\r\n\r\nIf people don't like spending money on movies, then that obviously creates another barrier between them and us. It might seem assumptive, but I think there's a perceived sense that our theater is expensive, when in reality our admission is exactly the same as Campbell Suxteen and Springfield Great's, and our concessions are cheaper by 50% or more across the board. So, we're going to try something new. It may work, and it may not, but that's why it's called \"experimenting\"... or at least that's what my dealer told me. MOXIE BULK PASSES: 10 movies for $50. It may not seem like much, but if it helps break down the cost barrier, and creates an added sense of accessibility to our theater, then it's a-okay in my book. I'd much rather have 30 people at $5.00 a pop than 10 at $8.00. We'll should be rolling those out in the next week or so.\r\n\r\n<i>Promotion</i>\r\n\r\nIf people still don't know we exist, that creates another obvious barrier to our theater, and our films. In a town with a metropolitan area of just under 400,000 people, it's hard to imagine NOT being able to find enough butts to fill our 75 seat theater. I mean, we only need 0.0001875% of that population to sell out a show! That's barely 1% of 1%! So, we need to think of ways to let these people know we exist. Our advertising budget is currently invested in our weekend newspaper ad and NPR sponsorships, so we need to think of FREE ways to advertise. Whenever we have a movie that ties in with a college subject (even if it's a stretch), we contact as many faculty and organizations as we can; we send out press releases to all of our media contacts; we distribute our calendar near and far... but we have to do more! MOXIE A GO-GO isn't going to make us much money, but it will help promote our theater. The south side is a particularly tough egg to crack, especially since many think downtown is crime-ridden and devoid of any and all convenient parking.\r\n\r\nWhat we need are spots on local news programs and at special events. I'm thinking \"The Moxie Show\" on NPR would do just fine. It's not like anyone really needs THREE HOURS of classical music everyday.\r\n\r\nSo that about does it. Again, I'm sorry for yesterday's post. This blog really needs to learn when to keep its damn mouth shut, that's for darn sure. I know the transparency of our business model is one of the features that make the blog so enjoyable, but I think I'm going to be adding a little opacity to the blend. After all, it's just not sexy if you show it all.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-03-03T05:10:06.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Maddy",
      "body": "We appreciate your candor, Dan, but I guess I would like to know just how bad it is.  I mean... are you considering shutting down?  Because I don't live in Springfield, but I just may have to move back there if you think it would keep y'all afloat.",
      "created_at": "2006-03-03T05:40:50.000Z"
    },
    {
      "author": "Scott G.",
      "body": "Dan, let me ask a silly question.  Would posting bills for the shows like the bars do on the kiosks do anything for your exposure and putting butts in the seats?  Maybe putting some in places other than colleges might help?  I guess that might be your core market, but maybe getting flyers in other parts of town would get some new blood there.  Print fake dollar bills like the religious flyers, cuz people will pick them up thinking its a dollar bill :)",
      "created_at": "2006-03-03T06:03:05.000Z"
    },
    {
      "author": "Nate, who really should be doing his homework,",
      "body": "You guys have always kind of been an inspiration, but never more so than now.\r\n\r\nAs someone who has indulged in more than a little self-pity from time to time, it shames me to see how fast, and with how much force, you pull yourself out of it.  You could have at least let yourself wallow in it for just a couple days.\r\n\r\nDan, you DEFINE the term \"solution oriented.\"  I thought I knew what that meant, but what I knew was a corporate catch phrase.\r\n\r\nGod speed to you good sir and madam!\r\n\r\nNow March on!",
      "created_at": "2006-03-03T06:21:03.000Z"
    },
    {
      "author": "Amanda",
      "body": "Congratulations for the positive mood swing. My experience these last few weeks has been tough too and I was going to post a super self-pitying reply to your last post...now I'm glad I didn't cause then I'd be a panty-waist too...Best of Luck Dan and Nicole! You inspire me!",
      "created_at": "2006-03-03T06:41:39.000Z"
    },
    {
      "author": "Ole",
      "body": "Best post you've ever done. Kick some ass young man!",
      "created_at": "2006-03-03T08:41:18.000Z"
    },
    {
      "author": "Whimsy Chick",
      "body": "I think you're being too hard on yourself, Dan. The Moxie is your baby, and it should be expected that you're going to feel a little down once in a while when it's not meeting your expectations. I really admire the way you've been able to turn your mood around so quickly.\r\n\r\nI wish I had some brilliant marketing advice for you. I'll let you know if something comes to me in a dream.",
      "created_at": "2006-03-03T09:17:19.000Z"
    },
    {
      "author": "brian of moore",
      "body": "theres nothing wrong with a little guilt tripping... i say..\r\ni dont know how many people ive talked too that say things like\r\n'gee willikers mr.. i sure have planned on going to the moxie.. it sure seems like a swell place... but i just havnt gotten around to it'\r\n\r\ni then guilt trip them until they are in the fetal position",
      "created_at": "2006-03-03T10:28:10.000Z"
    },
    {
      "author": "Caleb",
      "body": "Dan & Nicole,\r\n\r\nSince you both are always couped up in your lovely little theater you don't get out much. It's ok, we all know it. You two are hermits who smell of popcorn and elderberries. While those seats aren't always filled now, I think you're on your way to achieving that for the future. Time will prove this, but getting the word out is what it takes, and you guys have the best word-of-mouth marketing campaign in Springfield right now, hands down. When people go, even once, they immediately fall in love with it. \r\n\r\nYou have no idea how many times I've heard random people mention the Moxie. I'll be sitting in class and hear students talking about a movie they saw, or about going there this weekend, or just talking about the Moxie. Nearly every single one of my media professors from this semester and last have mentioned the Moxie at one point or another, and usually say something about the \"great young couple who own it.\" Some of them even offer extra credit for going to the Moxie and then writing a paragraph about the film. \r\n\r\nRespect and loyalty from consumers are the base of the most successful of businesses and most honorable of businesspersons. And you guys are definitely not lacking. ",
      "created_at": "2006-03-03T10:50:58.000Z"
    },
    {
      "author": "carney",
      "body": "Actually, every single weekday there's FIVE hours of classical music between morning edition and fresh air, not to mention the few more hours most nights after all things considered (not counting tuesday night world of opera).  And yes, I can recite the entire KSMU schedule monday thru sunday.  Except Sunday mornings.  Those are weird.\r\n\r\n\"The Moxie Show\" on NPR would almost make up for Tom going corporate and leaving the station.",
      "created_at": "2006-03-03T11:06:03.000Z"
    },
    {
      "author": "brian of moore",
      "body": "its true....\r\nif i thought you two had any freetime.. \r\nid try to hang out with you... \r\ni mean.. hey.. im only like a half a year older than dan\r\n..... im cool.. im hip.. to the half a year younger than me crowd\r\n\r\nbut then i realize that when me and my friends try to think of something to do... my only suggestion is usually to go to the moxie.... for some reason i dont think thats what you would want to do in your off time",
      "created_at": "2006-03-03T23:12:40.000Z"
    },
    {
      "author": "Tammy Kirks",
      "body": "Hi Dan and Nicole! I can understand your feeling a bit low after a bad Feb and an even worse intro to March. Glad you've worked things out. Just wanted you to know that before the Moxie opened, I hadn't been to an actual theater movie for quite some time. I hated the crowds, seats, price, etc. Since you opened, I've attended more shows at Moxie than I had for about three years. So while you might not see my face often enough, you at least gave me faith in the theater system. Go Moxie! See you in March!",
      "created_at": "2006-03-03T19:29:44.000Z"
    },
    {
      "author": "Derek",
      "body": "It seems that every Moxieblogpost must have a comment which agrees with whatever Caleb said. Well, here it is.....\r\n\r\nYou guys really do have fantastic word of mouth. I don't know anybody who's been to the Moxie and didn't love it. I saw my Statistics professor in Proof last semester and a few weeks later, he talked about the film (and the theater) in class. All of my friends think you are the two most amazing people in the world. We may not make it in as often as we'd like to because of time and monetary constraints, but in our hearts we're there every day.\r\n\r\nThat may have been the cheesiest thing I've ever said. I apologize. The point is, I want to have your babies.....What?",
      "created_at": "2006-03-03T19:53:58.000Z"
    },
    {
      "author": "Nate, who at this point should just be fired,",
      "body": "Dan has explicitly stated that he will not hang out with anyone older than him.  \r\n\r\nLike, I even asked.  \r\n\r\nI said, \"Dan!  Dan!\" *running after him*\r\n\r\nAnd he said, \"Yes?\" *reluctantly slowing*\r\n\r\n\"Will you hang out with me?\"\r\n\r\n\"Like now?\"\r\n\r\n\"Well, I mean, we could get beers or something.  Later.  The 'ol brewskis.\"\r\n\r\n\"Hmmmm....\" he said, stroking chin, and eyeing me.  \"How old are you again?\"\r\n\r\n\"Um....\" *counting on my hands* \"...28 - no, wait.  29.  Yeah 29 this year.\"\r\n\r\n\"Hmmm...29.\r\nNo.  No, that won't do at all.\"\r\n\r\n\r\nAnd that's it.  He walked off.\r\n\r\nAnd THEN Lindsey Jacobellis walked by.  And I went running after her.  \"Hey!  Hey Lindsey!\"\r\nI have a huge crush on Lindsey Jacobellis.",
      "created_at": "2006-03-03T23:47:46.000Z"
    },
    {
      "author": "Melinda",
      "body": "Ohhhhhhh, I LOVE the 10 for $50 idea!!  I think that it would boost your concession sales, also.  If my show is paid for already, it wouldn't be such a wallet-ouch to purchase popcorn AND chocolate (mmmmmm), or a more expensive glass of wine, or two glasses of wine so I can get drunk and Dan can comment on how well I handle my inebriation.  Yeah!\r\n\r\nLong live The Moxie!\r\n\r\nBy the way, it looked like attendance wasn't too bad for both Short sets last night.  The live action shorts were really good (well, they're Oscar-nominated.... duh).  A couple were funny, two were killer heartbreakers, and the last one was just screwed up.  Oh, and two of them have NUDITY!  If you like boobs, you've GOT to see Cashback.",
      "created_at": "2006-03-04T00:08:59.000Z"
    },
    {
      "author": "Melinda",
      "body": "I have a question for ya.  I understand that you don't have to do a reel change for the films that are on DVD, but would it be possible to pause it or something to allow for a brief intermission?  \r\n\r\nIntermission = concession purchases.\r\n\r\nAnd a happy bladder.",
      "created_at": "2006-03-04T00:21:06.000Z"
    },
    {
      "author": "Andy",
      "body": "You guys should hand out flyers at concerts.  For example, tonight there will be no less than 100 pretentious emo kids (myself included) watching The Outlaw Sea and The Psalters at The Belmonte.  I would guess that about half of these kids would do anything to make themselves look more hip and trendy.  And we all know that indie cinema is the epitome of hip and trendy.  Hand out flyers with phrases like \"cult phenomenon\" and \"underground hit\" and the kids will come in droves.",
      "created_at": "2006-03-04T00:35:53.000Z"
    },
    {
      "author": "Monkey",
      "body": "dude...I am totally dragging myself out to see the shorts... I'm kinda sick so hopefully I will get better soon, I don't want to expose everyone to what I have.",
      "created_at": "2006-03-04T01:45:59.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<i>If you like boobs, you've GOT to see Cashback.</i>\r\n\r\nI gotta say, Cashback wasn't a bad short at all. :)  I kinda lost my train of thought after the boobs started and totally forgot what it was about, but it was excellent.  I remember that.  \r\n\r\nSeriously, <b>all</b> of the shorts were good (goes without saying, they ARE nominated for Oscars), and for anyone who hasn't seen them yet, GO NOW.   (<i>The Last Farm</i> will win, BTW.)\r\n\r\nAnd after you do, I've got a story about a cow with gas...;) ",
      "created_at": "2006-03-04T02:17:41.000Z"
    },
    {
      "author": "brian of moore",
      "body": "nate - \"And THEN Lindsey Jacobellis walked by. And I went running after her. \"Hey! Hey Lindsey!\"\r\nI have a huge crush on Lindsey Jacobellis.\"\r\n\r\nso.. dont leave us hanging.. how did it turn out?\r\n...theres nothing hotter than snowboarder girls...\r\n\r\ni would have a beer with you..\r\nactually thats not true.. i would have a white russian\r\ni dont like beer",
      "created_at": "2006-03-04T05:08:36.000Z"
    },
    {
      "author": "Lynn",
      "body": "I know the feeling after trying a business downtown, and it is tough competition with the rest of Springfield.  I tried every possible thing I could afford, along with spending a few hours a week at SMSU pinning up posters on every bulletin board on campus, not the mention all the hand crafted posters, which I am proud to say, some people just took them home and displayed them on the refrigerator.  I would be glad to take them to work and put them on every bulletin board at work and am also willing to put them up at MSU, Drury, Evangel, OTC, or any place you want.  I will provide the thumbtacks.  It is great exercise, since I now have a desk job.  We can talk about it later, I will be glad to put up 50-75 flyers.  I can't say it will do any good, they may end up on someones refrigerator.  I will light a candle for the theatre, I need to find the correct saint, and will be there sometime this weekend for at least one great movie. Thank you both for your great effort and sacrifice, we need you in Springfield for many years to come.  Lynn",
      "created_at": "2006-03-04T20:33:53.000Z"
    },
    {
      "author": "Derek",
      "body": "Good luck with Evangel, Lynn. I've tried. If it's not approved by the administration, you can't hang it up. I put up a couple in some places without the proper stamp, and they were taken down by \"the man\" within a day. They won't approve it because the Moxie shows R-rated movies, which Evangel does not condone :-P I keep a copy of the schedule (front and back) on the door to my room, but that's about as much advertising as I've been able to pull off around here.",
      "created_at": "2006-03-04T21:17:40.000Z"
    },
    {
      "author": "nicole",
      "body": "Thanks as always, Derek. I've been asked to donate a few tickets for the Evangel Jr / Sr Banquet...So they must like us somewhat!",
      "created_at": "2006-03-04T22:10:44.000Z"
    },
    {
      "author": "wanda",
      "body": "I too was not a regular movie goer.  In fact I can't remember the last 'regular movie' I saw.  BUT I love the Moxie.  Don't know why.  I have tried to convince everyone I talk to they need to go.  I can claim a little success.  And, I don't listen to NPR.  Don't even know where it is on the dial.  So all your patrons aren't the snooty kind. lol  My point is, don't just limit your advertising to NPR or downtown.  Try other radio stations and other places to put your flyers.  And keep your heads up.  It takes a while to get any business going.  One of these days you'll look fondly on these struggles as you are telling your grandchildren about the time nobody showed up (and sold out shows will be the norm).",
      "created_at": "2006-03-05T23:31:09.000Z"
    },
    {
      "author": "Finy",
      "body": "Targeting college crowd, there is a certain social network which is popular among college students here in town. May be advertise on that once a month, when the new calendar goes up? It cost as little as $13",
      "created_at": "2006-03-06T04:06:10.000Z"
    },
    {
      "author": "Jennifer",
      "body": "Dan, I'm glad to hear you are feeling a little better.  I was worried about you guys after your last post.  You know Tom and I would be there more often if it weren't for these three ankle biters running around here.  I do try to spread the word as much as I can, and I'm thinking of trying to work something into my ENG 101 classes at OTC.  Extra credit is against my religion, but maybe it could just be an assignment of some sort . . .",
      "created_at": "2006-03-07T04:06:25.000Z"
    },
    {
      "author": "Yansen",
      "body": "Ole is right, really good post... kicks ass!!!",
      "created_at": "2006-03-09T02:09:13.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
