{
  "id": 377,
  "title": "Intermission Impossible",
  "body": "I can't claim that joke as my own... one of our customers, Shad, made it up.<br/><br/>Anyway, here's Justin's latest installment in the \"Life at the Moxie\" short short short film series. If you notice yourself in the video, please direct your lawsuit to Justin.<br/><br/><iframe width=\"425\" height=\"318\" src=\"http://www.youtube.com/embed/WxbEt6af7A0?rel=0\" frameborder=\"0\" allowfullscreen></iframe><br/><br/>That's a 12 minute intermission condensed down to 1 minute and 30 seconds. Pay particular attention to the piece of hair jutting out of Nicole's head. She'd really appreciate that.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-03-05T08:47:21.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "For those curious: it's a 14 minute clip of an intermission (who said we don't give you enough time to pee?) sped up to 9 times the original speed, and set to Aphex Twin's <i>4</i>.",
      "created_at": "2006-03-05T08:54:34.000Z"
    },
    {
      "author": "bjork24",
      "body": "Justin doesn't know what he's talking about. That intermission was only 12 minutes and 118 seconds.",
      "created_at": "2006-03-05T08:56:48.000Z"
    },
    {
      "author": "erin",
      "body": "my FAVORITE. and i mean FAVORITE part. is when nicole rolls her head and sholders. ide say that was the highlight.<br/><br/>and of course the hair jutting out of her head.<br/><br/>: )",
      "created_at": "2006-03-05T09:00:21.000Z"
    },
    {
      "author": "nicole",
      "body": "Yeah...",
      "created_at": "2006-03-05T09:10:54.000Z"
    },
    {
      "author": "brian of moore",
      "body": "dammit.. erin took my line<br/>.. it is rather interesting though<br/>someone rolling their head that fast.... looks dangerous<br/><br/>is that camera always up there?<br/>i dont pay enough attention",
      "created_at": "2006-03-05T11:27:03.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Heh heh.  We were the group of lollygaggers that hung out safely behind the popcorn machine, talked loudly about which films were going to win the Oscars (negating our ability to win the Moxie drawing), bothered Nicole and Dan, and snuck back in just as Transamerica started back up.   I was that one guy with that one shirt.  You know.  That guy.  Yeah, that was me. <br/> <br/>Ironically, for someone who doesn't really notice little things, I pointed out the camera to Peggy and told her it was probably part of the new \"security measures.\"   This was a <b><i>much</b></i> better use of it, though! <br/><br/>The head roll thing was hilarous.    <br/><br/>Nice work, Justin! ",
      "created_at": "2006-03-05T20:32:53.000Z"
    },
    {
      "author": "justin",
      "body": "Thanks.  I'm surprised nobody mentioned the camera.  I thought up until now that nobody even saw it.  You can see me glance up there every so often.  Having your brand new, expensive camera perched 15 feet in the air on a wobbly tripod sure does make you nervous.",
      "created_at": "2006-03-05T20:35:38.000Z"
    },
    {
      "author": "--Jeff",
      "body": "A good <a href=\"http://www.bhphotovideo.com/bnh/controller/home?O=NavBar&A=FetchChildren&Q=&ci=386\">Bogen/Manfrotto  </a>tripod and head won't set you back too much money.  I assume it has the same thread size as a still camera, so you can use it for that if you have one.<br/><br/>WELL worth it if you use the camera enough...",
      "created_at": "2006-03-05T21:00:33.000Z"
    },
    {
      "author": "justin",
      "body": "I'd like to get a new tripod for sure, but can't justify spending the money on it now, since I just got the camera. ",
      "created_at": "2006-03-05T21:47:49.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Yeah, I hear that.  God knows I've spent WAY too much on my camera, lenses, tripod, film, processing, darkroom accessories when I decided processing was too much, etc...<br/><br/>Hobbies suck the money right out of you over an extended period of time.  :) <br/>",
      "created_at": "2006-03-05T21:58:23.000Z"
    },
    {
      "author": "Al",
      "body": "After Dan's recent posts, I expected a homeless man to wander by and pee on the wall, with maybe a drunken student passing out as he waited for a small popcorn.",
      "created_at": "2006-03-05T22:27:38.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<i>After Dan's recent posts, I expected a homeless man to wander by and pee on the wall, with maybe a drunken student passing out as he waited for a small popcorn.</i><br/><br/>I see the next movie already forming...<br/><br/>In fact, you could further it along by having a \"Free Beer Night\", showing a racous movie and filming the results.   <br/><br/>Replacement for Matinee Monday?",
      "created_at": "2006-03-05T22:46:37.000Z"
    },
    {
      "author": "nicole",
      "body": "We've had a fabulous weekend - thank you MO Film Fest and Transamerica!",
      "created_at": "2006-03-05T23:57:11.000Z"
    },
    {
      "author": "Caleb",
      "body": "CRASH?! WHAT THE!!!<br/><br/>Hollywood SUCKS!",
      "created_at": "2006-03-06T09:35:27.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<i>CRASH?! WHAT THE!!! </i><br/><br/>Stunned.  You know, I've been listening to the Buzz Mill the last couple of weeks talking about Crash, but this movie came from nowhere and stunned half of America.  <br/><br/>Dazed. ",
      "created_at": "2006-03-06T09:56:53.000Z"
    },
    {
      "author": "Caleb",
      "body": "I respect its message and respect how it sort of went from indie to bigtime so easily, but Paul Haggis only got popular because of Clint Eastwood. It was a good film but not a great one (like all the other nominees) and didn't deserve to even be in the running in my opinion. I am shocked. If they weren't going to pick Brokeback, at least pick one deserving of it (Good Night, and Good Luck or Capote perhaps?)",
      "created_at": "2006-03-06T12:12:45.000Z"
    },
    {
      "author": "justin",
      "body": "I honestly thought Crash was not a good movie when I watched it.  Not horrible, but not good.  Very mediocre.",
      "created_at": "2006-03-06T18:11:43.000Z"
    },
    {
      "author": "--Jeff",
      "body": "I would have been much happier with GN, GL winning...<br/><br/>And I was shocked, SHOCKED, that <i>Six Shooter</i> won Live Action.  It beat out both <i>The Last Farm</i> (my choice) and <i>The Runaway</i>.  Wow.  <br/><br/><i>Six Shooter</i> was funny, well shot, and had a pretty good story, but <i>The Last Farm</i> had all of those qualities in excess.  <br/><br/>And what was up with <i>9</i> and <i>The Mysterious Geographic Explorations of Jasper Morello</i> being denied in the Animation category?  I was sure that one of those would win (not having seen Pixar's entry.) <br/><br/>I don't know, the Oscars screwed me this year.   <br/><br/>At least John Stewart was a riot.  The \"\"Martin Scorsese: 0. Three 6 Mafia: 1\" line killed me... ",
      "created_at": "2006-03-06T21:29:51.000Z"
    },
    {
      "author": "Nate",
      "body": "And after the montage of socially relevant films:<br/><br/>\"And none of those things was ever a problem again.\"<br/><br/>I don't know about this year's Oscar wins, but I won't get into it here.  Instead, I will bitch about them in person while I monopolize ten minutes of Dan and Nicole's time as I loiter near the popcorn seasonings.<br/><br/>Justin, that was freakin' awesome, massive cowlick, head roll and all.  I want to play with your camera, if you know what I mean.<br/>I saw several people I know.  Small town.  Small Moxie community.  <br/>Sadly, still no Lindsey Jacobellis.  Dan implied that she's probably already slept with half the Olympic Village anyway.",
      "created_at": "2006-03-06T21:57:07.000Z"
    },
    {
      "author": "Nate",
      "body": "THE INSPIRATION BEHIND OSCAR’S BEST SONG WINNER SPEAKS,<br/>IN WHICH HE DESCRIBES EXACTLY JUST HOW HARD IT CAN BE, OUT HERE, FOR HIM<br/><br/>You know, maybe you don’t know this, maybe you have been sheltered from the realities of this world, but let me disillusion you:  It can be hard out here.  For someone like me, I mean.  A purveyor of the ladies, I mean.<br/><br/>First, there’s rent.  It ain’t cheap, that’s for shiz.  So I gotta get my money for the rent, if you know what I mean.<br/><br/>Then, there’s the car payment on my Cadillac.  Now, I know what you’re thinking.  Cadillac?  Surely I can cut back, maybe drive a Ford Escort hatchback or something.  But this Cadillac is not some spring chicken.  It’s over 15 years old, and let me tell you, the gas mileage on it is terrible.  Which brings me to that other large expense:  GAS MONEY.<br/>Man, when you are cruising up and down the strip with three ho’s in the back looking for some johns in a 15 year old Cadillac, you burn through some unleaded right quick.<br/><br/>So, to sum up:  Rent.  Cadillac.  Gas Money.<br/><br/>It’s hard out here…<br/>For, you know, a pimp and all.<br/>",
      "created_at": "2006-03-06T22:16:39.000Z"
    },
    {
      "author": "Caleb",
      "body": "Nate that was one of the best comments on here in a while. I had a good laugh.",
      "created_at": "2006-03-06T23:22:30.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 16,
      "name": "Customers"
    }
  ]
}
