{
  "id": 378,
  "title": "The Dark Art of Booking a Single Screen Cinema",
  "body": "This post has been waiting in the wings for far too long. I've seriously been trying to write it for well over four months, but every time I start to type, something more pressing comes along... like an iron, set to full steam! That, my friends, is comedy gold. So, as the title suggests, today's topic will be \"The Dark Art of Booking a Single Screen Cinema,\" but before I go on at length about the fineries of film \"felection\" (I had to maintain alliteration... at all costs!), let me spit out a few side notes:\r\n\r\n1. The Oscars were strange, to say the least. Who would've predicted that CRASH would win? Not me. That's all.\r\n\r\n2. We had a tie for the winner of our Oscar poll. Both scored an impressive 10 out of 12, but neither of them correctly predicted the live action short film winner (SIX SHOOTER? Come on!), which meant we had to draw the winner at random. After an intense game of \"pick which hand the winning ballot is in,\" the winner was chosen and contacted. I'm not sure if she wants her name mentioned on the blog, so I'll just direct my congratulations to M(r)s. Winner McWinnington.\r\n\r\n3. This weekend has been INSANE! We had THREE sold out shows for TRANSAMERICA - one on Friday, one on Saturday, and one on Sunday - and it doesn't show any sign of letting up! Thank you TRANSAMERICA! Thank you CAPS LOCK!\r\n\r\nOk, let's get into the good stuff, shall we?!?!?! Remember, punctuation is our friend!!!!!11\r\n\r\nBooking films is hard work... especially when you have to schedule an entire month at one time. Most theaters book on a week-by-week basis, which frees them up to carry over films that preform well and drop those that don't. However, this sort of \"on-the-fly\" scheduling comes at a cost. If your movies are changing every seven days, you have to make darn sure your audience knows what's playing, which makes daily advertising a necessity. I won't go into all the pros and cons of the various types of scheduling - <a href=\"/post/16\">I did that nearly two years ago</a> - I just wanted to set the stage for my explanation of why many distributors hate working with \"calendar house\" theaters like The Moxie.\r\n\r\nOne word, six syllables: inflexibility. Good for steel beams and corsets, bad for gymnasts and movie theaters. Our inability to hold movies longer than our predetermined run has cost us a few titles in the past. For example, when CAPOTE opened in limited release way back in early October, we were all over it. We put in our bid early and hoped for the best. Unfortunately, since the film was so new, and the prints so limited, the distribution company would only let us play it if we agreed to a four week exclusive engagement - meaning we could show nothing but CAPOTE for the entire month of November (death for a single-screen theater). On top of that, they didn't want us to print a calender for the preceding month, so THEY could make the final decision of when we stopped playing THEIR film. We baulked at their demands (obviously) and decided to hold off until more prints were released. Nothing changed in December or January, but February was starting to look promising. CAPOTE had expanded its print run and would now be available in the smaller markets. Again, for the third month in a row, we expressed our sincere interest in showing film, but unfortunately it was too late... once the Oscar nominations were announced in late January, Campbell Suxteen swept in and stole it from us. Of course, they had no problem throwing it on one of their smaller screens and playing it for a month... they, unlike us, have the flexibility to do that. To add salt to our already oozing wounds, Campbell also stole GOOD NIGHT, AND GOOD LUCK right from under us, and didn't even wind up showing it in February... like we had planned!\r\n\r\nWhat a sad story, eh? Oh well. What can you do? Competition is competition. Life goes on. No use crying over spilled milk. Live and learn...\r\n\r\nDamn you Campbell... damn you to hell!\r\n\r\nRight... so where was I? Oh yes, the typical timeline of a film booking. Here's how most people think we book films - or, should I say, here's how my highly over-generalizing mind's eye <i>assumes</i> most people think we book films:\r\n\r\n<b>Customer:</b> You should show MATCH POINT. I really want to see that.\r\n<b>Moxie:</b> Ok. (calls distribution company) Hi, we'd like to show MATCH POINT.\r\n<b>Distributor:</b> You would? Great! We'd love to have it shown in your market. When would you like to show it?\r\n<b>Moxie:</b> How about March 10th through the 24th.\r\n<b>Distributor:</b> That would be fine. We'll have it shipped to you by the 9th. Thank you for your interest in our film!\r\n<b>Moxie:</b> You're welcome. Have a wonderful day.\r\n<b>Distributor:</b> Likewise. Bye bye.\r\n<b>Moxie:</b> Good bye. (turns to customer) I have good news!\r\n<b>Customer:</b> Yeah?\r\n<b>Moxie:</b> MATCH POINT will be starting on the 10th.\r\n<b>Customer:</b> That's fantastic! You've earned my continued business yet again!\r\n\r\nIf only it were that easy... earning someone's continued business. Here's how a more typical booking goes:\r\n\r\n<b>Customer:</b> You should show MATCH POINT. I really want to see that.\r\n<b>Moxie:</b> Ok. (calls distribution company) Hi, we'd like to show MATCH POINT.\r\n<b>Distributor:</b> Don't you know it's a Monday?! We don't book on Mondays. (hangs up)\r\n<b>Moxie:</b> (stunned) Oh my.\r\n\r\nNEXT DAY\r\n\r\n<b>Moxie:</b> (calls distribution company) Hi, we'd like to show MATCH POINT.\r\n<b>Distributor:</b> Oh really? What is your theater's capacity?\r\n<b>Moxie:</b> Seventy-five.\r\n<b>Distributor:</b> Ha ha ha ha ha ha ha (hangs up)\r\n<b>Moxie:</b> Damn! (calls another distributor) Hello, we'd really like to show BROKEBACK MOUNTAIN.\r\n<b>Distributor:</b> Ok, we can do that.\r\n<b>Moxie:</b> Woo hoo!\r\n\r\nNEXT DAY\r\n\r\n<b>Distributor:</b> Hi, is this Moxie?\r\n<b>Moxie:</b> Yes, this is Moxie.\r\n<b>Distributor:</b> Campbell wants BROKEBACK MOUNTAIN, and they have more seats than you, so... have a good day.\r\n<b>Moxie:</b> Damn! (calls another distributor)\r\n\r\nAnd on and on and on. If Campbell wants a movie that we're trying to show, they will get it. No contest. It's a shitty policy, but distributors are looking at the bottom dollar, not the ambiance between two venues. Campbell can throw a movie into one of its smallest auditoriums and play it six or seven times a day, and that's what distributors like to hear. Who cares if more people would turn up to see it at The Moxie... seats equate to box office revenue, and when there's only so many prints to go around... you know the rest.\r\n\r\nNot surprisingly, Campbell has woken up over the last couple months and started fighting us for several films. I have mixed feelings about this: I'm glad smaller films are getting shown in Springfield, whether it's at our theater or somewhere else (although I'd obviously prefer it to be at ours); I'm mad that Campbell is stealing our movies, but at the same time I'm flattered that they consider us enough of a threat to snipe from us (and steal our idea for popcorn flavors); if we weren't around, do you think Campbell would still be focusing (even slightly) on bringing in smaller films? Seriously?\r\n\r\nWe'll see how the dynamic changes when (if ever) the supposed Hollywood 14 opens two blocks North of us. Will Campbell still be taking sucker punches at us, or will they need to focus on their new, bigger adversary? Competition being what it is, I still have respect for the ol' suxteen. At the end of the day, we're all in the same boat... even if ours is a lot less gaudy than theirs.\r\n\r\nWasn't this post supposed to be about booking? I've totally lost my way, and now I'm hopelessly mired in some offshoot rant about Campbell. How did that happen? Let me try, one last time, to give a concise breakdown of the factors that go into whether or not we get a film:\r\n\r\n<ul><li><b>Type of release -</b> If it's in limited release, our chances are slim to none for getting it on the break (close to its release date). Occasionally we're honored with a spot on the top tier (ala LOOKING FOR COMEDY), but most of the time we have to wait for the film to do it's victory march up and down the coasts.</li>\r\n<li><b>Number of prints -</b> If there are only 10 prints of the film, you can bet we won't be getting it within the first 3 or 4 months of release. This is usually the case when a film is still on the festival circuit. Just because a cool film shows at Sundance or SXSW doesn't mean it's available to commercial theaters.</li>\r\n<li><b>Borderline films -</b> They're kinda big (budget over $5,000,000), but yet they're kinda art-house (witty, smart, stylish, provocative, etc.) - these films form the battlefield that separates us from Campbell Suxteen... expect more major battles to flare up over the next few months.</li>\r\n<li><b>Trust and size -</b> Some distributors simply don't trust us. They think our theater is too small for their movies, and even if we're the only venue in the Springfield market actively pursuing their film... it doesn't matter. They'd rather save their prints for towns that have larger theaters and more established payment histories.</li></ul>\r\nWell, that about does it for me. We found a pair of underwear (a thong) in the hallway tonight.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-03-07T10:17:54.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "erin",
      "body": "umm. bad time to ask this question but.......\r\n\r\ndoes anyone know what movie it was that this guy clamis he can sniff (not look at it) underwear and know what color of hair the owner of the undies had.\r\n\r\ni want to say the big lebowski. but i know thats not right..\r\n\r\ni keyword searched \"underwear sniffer\" at IMBD. but that didnt work.\r\n\r\nhummm...\r\n\r\noh and..  yeah. booking movies. im glad you work so hard for us! thank you.\r\n: )",
      "created_at": "2006-03-07T19:08:27.000Z"
    },
    {
      "author": "nicole",
      "body": "That sounds familiar to me, too...",
      "created_at": "2006-03-07T19:37:34.000Z"
    },
    {
      "author": "justin",
      "body": "That movie was <a href=\"http://www.imdb.com/title/tt0096378/\">Vibes</a>.  Jeff Goldblum was the panty sniffer.",
      "created_at": "2006-03-07T19:41:35.000Z"
    },
    {
      "author": "Steve Kirks",
      "body": "Dan:\r\n\r\nThanks for the post--it really helps with my perspective.  I think I've learned a few things but most of all it seems that butts in seats equals power with distributors.  I haven't been to see as many movies as I should at the Moxie due to fear--what if I don't like it?  My fear factor is generally unfounded, I'm sure, but the descriptions in the Moxie newsletter/RSS feed don't do very much to encourage me to plant my butt in the seat.\r\n\r\nI'm a customer that wants to hear from people who've seen the movie before I go.  That's true for any venue, any theater.  I choose to only go to the Moxie for the atmosphere first and the content second.  Heck, I'd go if you were only showing uncensored Family Guy episodes that I had seen hundreds of times.  That's because I know and can control my biggest concerns: atmosphere and content quality.\r\n\r\nBack to the descriptions...\r\n\r\nI recognize as a consumer, I have a responsibility to dig a little deeper after reading the Moxie newsletter to see what I can find out about these films.  I'll vow to do more of that in the future.  Do you and Nicole get a chance to see these films before they are shown?  Can you give us a \"rundown\" of what you think?\r\n\r\nDan, I'm invested in you and Nicole as movie people who happen to run a theater.  If you review a movie that you're showing, say you don't like a it but point out the strong points, you're starting the conversation.  You're encouraging me to \"get my butt in the seat\" and form my own opinion.  Remember that due to the content you're showing and the location of the theater, your audience is (likely) more intelligent than the average moviegoer.  Try engaging their brain before they hit the door.  Once they're here, the movie will do the rest.\r\n\r\nFinal note:  partial RSS feeds suck.  Give Moxie customers a way to access full feeds somehow.  I read every one of your weblog posts and the constant click through is tedious.  If you're concerned about stats, try Feedburner.\r\n\r\nSteve\r\n\r\nPS:  If this sounds like a rant, I'm sorry.  If I didn't care, I wouldn't write.",
      "created_at": "2006-03-07T19:51:32.000Z"
    },
    {
      "author": "nicole",
      "body": "Oh yeah...and Dan forgot to mention...we have great help from a man named Paul when it comes to booking films. He is very creative and has been in the business long enough to know what works and what doesn't for a single-screen theater. Plus, he's seen a ton of the movies at film fests, where we don't have that option at the moment. He and his theater have been great mentors.\r\n\r\nJust thought I'd throw that in there.",
      "created_at": "2006-03-07T20:03:42.000Z"
    },
    {
      "author": "--The Todd from Scrubs",
      "body": "<i>We found a pair of underwear (a thong) in the hallway tonight.</i>\r\n\r\nThey're mine.  Sorry about that. \r\n\r\n<a href=\"http://imageshack.us\"><img src=\"http://img466.imageshack.us/img466/2320/thetodd15mo.jpg\" border=\"0\" width=\"250\" alt=\"Image Hosted by ImageShack.us\" /></a>\r\n\r\n--The Todd",
      "created_at": "2006-03-07T20:09:10.000Z"
    },
    {
      "author": "Oz",
      "body": "Very interesting.",
      "created_at": "2006-03-07T20:13:43.000Z"
    },
    {
      "author": "Senator Bluto Blutarski",
      "body": " Over? Was it over when the Germans bombed Pearl Harbor?  Glad to hear that your luck has turned on the high heels of Transamerica.",
      "created_at": "2006-03-07T20:20:55.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Who are these \"distributors\" Dan?  Gimme their numbers and we'll create a campaign letting them know how poorly their films are being  played and marketed in the <i>other</i> theatres in Springfield.\r\n\r\nSeriously, this sounds like typical Hollywood Movie Distributor Crap.  It's only unfortunate that they (being Hollywood in general) won't recognize what killed \"going out to see a movie\" until it's too late.  They rant about piracy and low theatre turnout and then turn a blind eye to the innovation/tranformation in theatre development.  Not understanding that people don't <b>want</b> to listen to cell phones go off, children crying, or high school kids talking, they refuse to believe that smaller niche theatres are the way of the future.  Instead, they bury their head in the sand, tell their Distrubutors to sell to the highest bidder (with the highest profit margins) and continue what they think is the best thing. \r\n\r\nIt's not, and they can't see it for all of the dollar signs in their eyes. \r\n\r\nSheesh.  Sorry about the rant.  If I had tinfoil, I might have starting making a hat.  I'll get back to work now. \r\n\r\n ",
      "created_at": "2006-03-07T20:24:19.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Ironically, the Portly One himself, George Lucas, believes the death of the big budget movies like Star Wars are no more. \r\n\r\n<a href=\"http://www.nydailynews.com/front/story/397167p-336664c.html\">Click Here</a> for the story at New York Daily News if you care. \r\n\r\nFrom the article:  <i>\"In the future, almost everything that gets shown in theaters will be indie movies,\"</i> Lucas declared. <i>\"I predict that by 2025 the average movie will cost only $15 million.\"</i>  \r\n\r\nFunny how an indie film is $15 mil.  We shot on in college for much less... :) ",
      "created_at": "2006-03-07T20:32:39.000Z"
    },
    {
      "author": "Nate",
      "body": "No, that was my pair of thongs.  And I agree about the idiocy of distributors and their blind eyes.  They're blind in more ways than that, but oh well.  I sincerely believe it's their own graves they dig.\r\nAnd, hypothetically, god forbid, if C16, were to drive The Moxie out of business, you can bet those niche films would dry up pretty darn fast.  It's bizarre - it means they're competing for a segment of the market that they didn't care about before, and - should they suddenly become the victors - would immediately cease to care about thereafter.  Competition is competition, I agree, but that's just viciousness that actively works to lower our quality of life.\r\n\r\nAnd seems to me like someone needs a LOT of encouragement before pulling the trigger to see a movie.  Seems like a funny thing to \"fear,\" not liking a movie.  And it seems a lot like a very, very timid life based solely on the validation of others.\r\n\r\nSorry for the thorniness, but that was an incredibly irritating thing to read.",
      "created_at": "2006-03-07T20:38:19.000Z"
    },
    {
      "author": "Nate",
      "body": "That last paragraph sounds funny.  I was being vague, but not really.  By \"someone\" I meant the earlier comment.",
      "created_at": "2006-03-07T20:40:58.000Z"
    },
    {
      "author": "Caleb",
      "body": "I agree with you Nate. It's a shame people can't decide things for themselves anymore.",
      "created_at": "2006-03-07T21:05:42.000Z"
    },
    {
      "author": "Steve Kirks",
      "body": "Nate:\r\n\r\nI'm facing the reality of modern life where I have plenty of options on what to do with my free time.  My \"fear\" is that I won't enjoy spending my free time at a particular movie versus spending time doing something I already know is fun/relaxing/engaging/whatever.  Take restaurants for example.  Do you walk in to just any restaurant to eat a meal?  Do you possibly read the menu online, talk about it with others who have been there and even read a restaurant review in the paper before going?  How much convincing to you need before you try anything new in life?  Don't define \"fear\" by traditional methods.\r\n\r\nThe point isn't that if I need my ass kissed before I give Dan and Nicoloe $8 for a ticket.  The real issue is with so many options for entertainment (TiVo'd shows, conversation over coffee, video games) I need to be more engaged by the Moxie before I'll move my \"butt\" from one seat to another.  Dan's weblog engaged me during the Moxie startup, but I'm finding that I'm not being pulled in for the movies.  Here's a suggestion:  user movie reviews from regulars.  Use their experience to pull me in and make me want to be part of the Moxie community and a Moxie regular.\r\n\r\nAs far as your \"timid\" comment about me, it's out of line.  If you wouldn't say it sitting across a table from me in the same room, you shouldn't say it all.\r\n\r\nSteve\r\n\r\nPS -- Dan, I promote the Moxie at every opportunity, talking about the environment, the popcorn and most of all, the people who make it happen.  I do it because I believe your and Nicole's vision and the quality of your character, not because I'm a movie buff or indie film fan.\r\n",
      "created_at": "2006-03-07T21:25:18.000Z"
    },
    {
      "author": "evilvet",
      "body": "Steve, et al:\r\n\r\nA long time ago, when I was a student in Columbia, I worked at The Blue Note, which is an incredible live music treasure, back when it was a warehouse off of I-70.  There were people who would pick and choose the shows that they wanted to see, having a pretty good idea what they would hear and expect, and stay home or do other worthwhile things if what they had read or heard didn't necessarily strike their fancy.  There were others, however, that utilized the venue in an entirely different manner.  They were the ones who would walk up, pay their 8 to 10 bucks, get their hand stamped then ask, \"Who's playing?\" before strolling into the void.  These devotees were loyal and adventurous, and knew that on any given night magic might happen.  They were also the heart and soul of The Blue Note  One night they may see the Belairs for the millionth time, an unknown SoCal band named Red Hot Chili Peppers, a reggae act direct from Jamaica, a jazz act like Sun Ra and his Arkestra...or they may see a real clunker.  That was part of the adventure.  Unless you got beer spilled on you or worse, you were guaranteed an experience, based on the creative and well informed bookings of Richard King, the proprietor.\r\n\r\nYou get the analogy.  Perhaps The Moxie should be approached in the same way.  Either go in informed, or just find out when the show starts.  Show up.  You may see the next great sleeper or a documentary about genital mutilation.  Hopefully, whichever method will provide for an enjoyable time and you'll go away having enjoyed the experience.  Far be it for me to say, but that may be the ideal approach, someone who plunks down the change, buys a bag of popcorn and a beer, then asks, \"So, what's playing?\"\r\n  \r\n",
      "created_at": "2006-03-07T21:59:09.000Z"
    },
    {
      "author": "Steve Kirks",
      "body": "evilvet:\r\n\r\n*Now* I'm engaged!  It's takes a different kind of key to unlock everyone's enjoyment and this may be mine!  Ah, the pure randomness of it all, the adventure and exhilaration of not quite knowing what will hit the screen when the lights go down.\r\n\r\nWow....\r\n\r\nNow I've got a reason to *crave* going to the Moxie.\r\n\r\nThanks!\r\n\r\nSteve",
      "created_at": "2006-03-07T22:05:54.000Z"
    },
    {
      "author": "Nate",
      "body": "[i]As far as your \"timid\" comment about me, it's out of line. If you wouldn't say it sitting across a table from me in the same room, you shouldn't say it all.[/i]\r\n\r\n\r\nActually, I probably would.  I’d probably say it with a wink and a smile, but I’d still say it.  You can ask people who know me, some of whom have posted here, about my unfortunate lack of social tact.  It can exhibit itself on blogs or across tables.\r\n\r\nYou obviously care enough to write detailed posts, Steve, so I don’t question you on that, and this is a pretty light hearted website, so I don’t want to turn it in to instapundit.  But this is a discussion worth having, so I’ll respond to your response and leave it.  Promise.\r\n\r\nActually, Steve, I don’t need a lot of prompting to try a new restaurant.  Spontaneous visits to new restaurants are one of my favorite things to do.  Again, ask my friends!  Maybe I drive by it, or I’ve heard one or two things about it.  But that’s about it.  \r\nNew downtown steakhouse?  Sold!  It’s a steakhouse!  It’s a house with steaks!  It’s downtown!  Who needs anything else?  Pacific Rim fusion?  What the hell’s that?  Who cares!  Pile up my plate with some Chilean Sea Bass you crazy Ocean Zen you!\r\n\r\nYou see?  I kinda feel the same way about movies, the “options of modern life” notwithstanding.  Options are just that.  Options to choose, and I don’t need to synthesize several sources of research (citing them in an MLA formatted bibliography of course) before making a leap.\r\n\r\nBut this is all beside the point.  In your first post, however you may wish to clarify it later, you give a pretty clear impression that the worst thing in the world would be for you to see a movie that you didn’t absolutely love.  You say you want opinions from multiple people:  your friends, customer reviews on the blog, reviews from Dan and Nicole.  This is even after you say, “My fear factor is generally unfounded, I'm sure.”  \r\nYes, I understand your flexible use of the word “fear,” but we are talking about the same effect, in any case.  \r\n\r\nIf you didn’t mean to sound stricken by paralysis, I apologize.  My post was aggressive.  But…well…you did.  Sound stricken by paralysis, I mean.\r\n\r\nI’ve eaten at bad restaurants and I’ve seen bad movies.  None of it was truly wasted time.  It’s how I know what the good ones are.\r\n\r\nI liked evilvet’s memories of the Blue Note, and the implied comparison, but I don’t think anyone’s asking you to be the “heart and soul” of the Moxie, should you choose not to.  In your first post, however, you seem to be asking a lot from people before you decide to see a movie there.  You want to give the impression that it is the lack of information that is the only reason you’ve stayed away, but for some reason I doubt that’s it (there are also other tireless promoters of the theatre that have been so gosh-golly-gee thrilled that it’s here that they’ve made it a habit, knowing that some movies will suck, some will be good, and a few will be through the roof great.) \r\n\r\nYou don’t have to make it a habit, but gosh, there have been, like, what, close to 50 movies so far?  Jesus, see one already.  I will personally, to your face I mean, buy you a Fitz’s root beer or an Oatmeal Stout.  Those are two of my favorites, anyway.  YOU may want to research it first!  ;-)\r\n\r\nI can drop a whole bunch more smiley emoticons if it helps.  \r\n;-) ;-) ;-)\r\n",
      "created_at": "2006-03-07T22:17:33.000Z"
    },
    {
      "author": "Nate",
      "body": "[i]Why doesn't this italicize properly?[/i]\r\n\r\nDamn you Dan!  Damn your crazy html!",
      "created_at": "2006-03-07T22:18:40.000Z"
    },
    {
      "author": "brian of moore",
      "body": "<i> why does *this* italicize properly?</i>",
      "created_at": "2006-03-07T22:25:40.000Z"
    },
    {
      "author": "brian of moore",
      "body": "... for future reference the brackets [i] .... those arent actually html ... most often referred to as BBcode... \r\nhtml code uses the greater than and less than signs:  &lt;i&gt;  ",
      "created_at": "2006-03-07T22:36:59.000Z"
    },
    {
      "author": "Nate",
      "body": "Excuse me.  Are you Lindsey Jacobellis?\r\n\r\n\r\nI thought not.\r\n\r\n\r\nI am not talking to anyone right now unless they are Lindsey Jacobellis.",
      "created_at": "2006-03-07T22:43:51.000Z"
    },
    {
      "author": "Steve Kirks",
      "body": "Hi all.  This is the real Steve Kirks.  The people responsible for being Steve Kirks in previous posts have been sacked.",
      "created_at": "2006-03-07T22:53:46.000Z"
    },
    {
      "author": "bjork24",
      "body": "If nothing else, The Moxie is quite adept at sparking conversations...",
      "created_at": "2006-03-08T01:16:00.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Those responsible for sacking the people who were supposed to sack Steve Kirks, have also been sacked.",
      "created_at": "2006-03-08T01:18:01.000Z"
    },
    {
      "author": "--The Wonder Llama",
      "body": "The directors of the firm hired to continue the comments after the other people had been sacked, wish it to  be known that they have just been sacked. The comments have been completed in an entirely different style at great expense and at the last minute.",
      "created_at": "2006-03-08T01:23:10.000Z"
    },
    {
      "author": "Derek",
      "body": "Dan: Indeed. Especially conversations about how awesome The Moxie is.\r\n\r\nYou're very popular. When I read this post last night after a late dinner, there were no comments. Now, after a late lunch today, it's absurd how much enjoyable discourse there is to read. I'm very impressed.",
      "created_at": "2006-03-08T01:39:19.000Z"
    },
    {
      "author": "Just Doesn't Seem to Get it Guy",
      "body": "Dan, thanks for the informative post.  Can't wait to come to The Moxie.  Do you think you could book Match Point?  That'd be awesome.",
      "created_at": "2006-03-08T02:57:58.000Z"
    },
    {
      "author": "Caleb",
      "body": "I don't know about all this. But I DO know research doesn't always help. I saw War of the Worlds this summer based on my love for the original radio play and on none other than movie reviews. Critics for the most part seemed to love it (73% on Rotten Tomatoes). So I gathered some friends and went. That was definitley 2 hours of my life completely wasted. Shame on you Spielberg. He could learn something from Peter Jackson, methinks. Make a big budget special FX movie and have a good story on top of it? WOW!\r\n\r\nThis seems like the wrong post to mention this on, but I hope you guys get <i>Paris, je t'aime</i> this summer or next fall.",
      "created_at": "2006-03-08T08:15:23.000Z"
    },
    {
      "author": "Derek",
      "body": "Caleb's right. I'm not sure what he's right about specifically, but something in that fairly short comment was accurate. Probably a few things, actually.",
      "created_at": "2006-03-08T10:24:02.000Z"
    },
    {
      "author": "nicki",
      "body": "right, i was livid for like a week after war of the worlds.\r\n\r\ni'm still slightly peeved about it when someone brings it up. :(\r\n\r\ni need to make it a goal to go back to the moxie this month. i've neglected you, dan and nicole!",
      "created_at": "2006-03-08T21:15:19.000Z"
    },
    {
      "author": "Robotech_Master",
      "body": "Do you guys only try to book \"first-run\" movies? Or will you pull in some older stuff too? I can't admit to being terribly interested in any of the movies I've read that you have been showing. What about getting some of the older stuff that I know still has prints circulating? Hong Kong movies like God of Gamblers, Chinese Ghost Story, Green Snake, Ashes of Time, etc., anime titles like Miyazaki's great works (subtitled, of course), other foreign films like the works of Juzo Itami or Akira Kurosawa, cult classics like The Wall or This Is Spinal Tap (or even some of the less-renowned follow-ups that the Tap trio did, like Best In Show or A Mighty Wind), Fearless Vampire Killers, etc.? Even just as a once-in-a-while alternative to your \"normal\" programming they might generate some interest.",
      "created_at": "2006-03-08T22:48:18.000Z"
    },
    {
      "author": "Caleb",
      "body": "Short Circuit Festival, baby!",
      "created_at": "2006-03-08T23:11:16.000Z"
    },
    {
      "author": "Johnny 5",
      "body": "Number 5 is alive!",
      "created_at": "2006-03-08T23:17:43.000Z"
    },
    {
      "author": "bjork24",
      "body": "Robotech: You must be new here... The Moxie shows older stuff at least once a month. The problem is, we always lose money when we show older prints. We book older movies like HAROLD & MAUDE, NIGHT OF THE LIVING DEAD, NAPOLEON DYNAMITE, and HEDWIG & THE ANGRY INCH more as a means for luring in new faces than anything else. Showing them more than once a month would be cost prohibitive.",
      "created_at": "2006-03-08T23:27:05.000Z"
    },
    {
      "author": "Nate",
      "body": "But the name, \"Robotech Masters\", is great!  No one remembers that show.  If someone busts out \"Invid\", or \"Zentraedi\", this geek just might lose it.",
      "created_at": "2006-03-09T00:22:33.000Z"
    },
    {
      "author": "Robotech_Master",
      "body": "Ah, I see.\r\n\r\nBut I'm not interested in any of <i>those</i> movies either! Show something I wanna see (as referenced in my prior posting :) and I'll come right down!\r\n\r\nI do have to say your location is great. With the exception of a couple of uptown and downtown routes, you're effectively on every bus route in town. :)",
      "created_at": "2006-03-09T01:36:35.000Z"
    },
    {
      "author": "Robotech_Master",
      "body": "P.S. - I searched your site but I don't see anything listing what you've got scheduled in the next few weeks. Is there such a place and I missed it?",
      "created_at": "2006-03-09T01:38:28.000Z"
    },
    {
      "author": "Robotech_Master",
      "body": "Never mind, just found it, in the \"Films\" section. (Though a suggestion: a list of showtime that lists every showtime and every film in one long list would be good, so that I could tell at a glance what was coming up over the next week/weeks.\r\n\r\nAnd geez, I wish I'd known about you guys a few months ago when I see now that you <i>were</i> showing things I would have been interested in.",
      "created_at": "2006-03-09T01:45:29.000Z"
    },
    {
      "author": "Robotech_Master",
      "body": "Hm.  Never mind, found that too.\r\n\r\nI should shut up before I make myself look any worse. :P",
      "created_at": "2006-03-09T01:51:04.000Z"
    },
    {
      "author": "Yoda",
      "body": "If only a calendar there was, yes,  yes!",
      "created_at": "2006-03-09T01:51:58.000Z"
    },
    {
      "author": "nathaniel carroll",
      "body": "I know you just posted a huge thing about the pains of ordering movies, but I wanted to ask about this one anyway:\r\n\r\nThe Devil and Daniel Johnston\r\nhttp://www.sonyclassics.com/devilanddaniel/trailer.html\r\n\r\nIf you can't show it @ the Moxie, then let's rent it on DVD and watch it sometime.\r\n\r\nxoxo,\r\nnc",
      "created_at": "2006-03-09T11:27:44.000Z"
    },
    {
      "author": "Caleb",
      "body": "Nathaniel when are you going to give Dan & Nicole one of your CDs to play at the Moxie?!",
      "created_at": "2006-03-09T11:51:46.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i saw pink floyd at the pyramids...\r\n.. uh.. maybe that was the dead...\r\ni saw both bands with a guy named tim.. so i get them confused\r\n... no.. no i saw pink floyd at the laserdome\r\n... but the band wasnt there.. just the music....\r\n\r\n..... shine on you crazy diamonds\r\n\r\n(5 cool points for anyone that gets it)",
      "created_at": "2006-03-09T12:35:23.000Z"
    },
    {
      "author": "Frank",
      "body": "Freaks N Geeks brian of moore?",
      "created_at": "2006-03-09T20:01:34.000Z"
    },
    {
      "author": "nicole",
      "body": "The Devil and Daniel Johnston is on our wish list. So is the Neil Young documentary. But so far our track record with music-related films has been pretty poor (Townes Van Zandt, Coachella...but both were in February).",
      "created_at": "2006-03-09T20:50:31.000Z"
    },
    {
      "author": "Caleb",
      "body": "Movie suggestion: <i>The Heart is Deceitful Above All Things</i>. It looks...uh...twisted? It starts March 10 so I figured maybe you guys could get a copy by May perhaps? It's based on a book so you could probably do a cross-promotion with Well Fed Head like you did with <i>Everything Is Illuminated</i>. ",
      "created_at": "2006-03-10T04:19:29.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 14,
      "name": "Dialogue"
    }
  ]
}
