{
  "id": 379,
  "title": "From zero to busy in 12.8 seconds",
  "body": "I just wanted to drop a note letting everyone know that my brain is a pile of mush right now. I've been trying to write something meaningful for the last four days, but we've been so busy with TRANSAMERICA crowds, MOXIE A GO-GO preparation, moving out of our house, and finding underwear in the lobby that I've hardly had time to sit in front of my computer for longer than an hour at a time... which is saying a lot for me.\r\n\r\nNicole has the ability to write posts too, but she's afraid that no one will think she's funny. Of course, anyone who has had the pleasure of seeing her \"we need more customers dance\" would disagree, but that's what she <i>thinks</i> none-the-less.\r\n\r\nOn a side note, Justin - in his eternal search for reasons to use his new camera - has hatched a new scheme known simply as \"MoxieTV.\" If he can keep to his shooting schedule, which would require Nicole and I to wake up before noon, he'll unveil the first episode sometime on Tuesday. I won't say anything more than that... except that it may or may not involve something really funny... or really NOT funny. You see, my mind has turned to total mush. That's all.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-03-11T04:42:52.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nicole",
      "body": "My \"We-Need-More-Customers\" Dance is HOT.",
      "created_at": "2006-03-11T05:04:12.000Z"
    },
    {
      "author": "Derek",
      "body": "I need to see this.",
      "created_at": "2006-03-11T07:18:32.000Z"
    },
    {
      "author": "--Jeff",
      "body": "\"MoxieTV\" needs to be a reality show (maybe on Public Access?).  But not the kind where you eliminate people. \r\n\r\nStart off the show with the \"We-Need-More-Customers\" Dance and you have a hit. \r\n",
      "created_at": "2006-03-11T08:22:31.000Z"
    },
    {
      "author": "Al",
      "body": "Nicole, \r\n\r\nNot only would I love to see your dance, why do you think anyone feels Dan is funny?",
      "created_at": "2006-03-11T10:43:56.000Z"
    },
    {
      "author": "Caleb",
      "body": "I've seen \"the dance\" and it is indeed hysterical. And it works! And Nicole that one post you wrote a while back was great, a nice change from the mush-mindedness of Dan.\r\n\r\nOh and, Dan and Nicole, let's not forget who guessed correctly on how many people we would have tonight. 101! Go me! Nicole's guess of a measly 100 was way off, and Dan's guess of 102 was simply outrageous.",
      "created_at": "2006-03-11T12:46:06.000Z"
    },
    {
      "author": "nicole",
      "body": "It does work. Except in February. I haven't tried it yet in March.",
      "created_at": "2006-03-11T20:43:49.000Z"
    },
    {
      "author": "Allison",
      "body": "why are you moving out of your house?  what house are you moving into?  I hope it's not a cardboard box under the freeway... Similarly, I hope you're not actually moving into the back room of the Moxie!",
      "created_at": "2006-03-11T20:45:39.000Z"
    },
    {
      "author": "nicole",
      "body": "Don't worry - it's not a cardboard box under the freeway or behind the Moxie...i'm not going to give away our new address over the internet (I've already made that mistake before), but I will say this: we're going to have a garage sale!\r\n\r\nThis is kind of fun waking up before Dan. I get to answer all the blog comments.\r\n\r\nTake that, Dan! Ha ha ha.",
      "created_at": "2006-03-11T20:52:34.000Z"
    },
    {
      "author": "erin",
      "body": "you guys are going to live in the red(ish) bathroom. arent you? its big enough for a bed... and a bogey.",
      "created_at": "2006-03-12T09:59:49.000Z"
    },
    {
      "author": "brian of moore",
      "body": "but why? youve only lived there a year ish? right\r\n... is it haunted?\r\noh oh.. i love ghost stories!.. tell me one!\r\nbefore you give the keys to whoever.. \r\ncan i come over and meet a ghost!?\r\nthat would be rad... \r\nmaybe i could do an investigation like those guys from TAPS\r\nbring a bunch of electronic measuring equipment device things\r\nno stupid phsychics.. we dont do crap like that in TAPS\r\n\r\nI tend to find you both highly amusing...\r\nyou just have different delivery styles\r\n\r\n",
      "created_at": "2006-03-12T21:43:55.000Z"
    },
    {
      "author": "brian of moore",
      "body": ".... no seriously i can spell psychics\r\n\r\ni just woke up.. leave me alone",
      "created_at": "2006-03-12T21:45:03.000Z"
    },
    {
      "author": "--Jeff",
      "body": "[i]no stupid phsychics.. we dont do crap like that in TAPS[/i]\r\n\r\n<a href=\"http://imageshack.us\"><img src=\"http://img530.imageshack.us/img530/8659/mperrin4ze.jpg\" border=\"0\" width=\"183\" alt=\"Image Hosted by ImageShack.us\" /></a>\r\n\r\nSlykicks?!!  Gorgyles?!! ",
      "created_at": "2006-03-12T22:53:25.000Z"
    },
    {
      "author": "--Jeff",
      "body": "^&(*&^%#.  Forgot where I was.  Should be \"'s\" \r\n\r\nI suck at the HTML. ",
      "created_at": "2006-03-12T22:56:19.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Dammit.  You can't quote brackets.  I <b>quit.</b>",
      "created_at": "2006-03-12T22:57:31.000Z"
    },
    {
      "author": "Caleb",
      "body": "Ha! I've seen that video where she completely goes off her rocker. That's one of the funniest things I've ever seen, yet sad to think there are really people like that in America. In fact I know a few of them!",
      "created_at": "2006-03-12T23:44:58.000Z"
    },
    {
      "author": "erin",
      "body": "caleb... you ARE one of them.",
      "created_at": "2006-03-12T23:48:29.000Z"
    },
    {
      "author": "Caleb",
      "body": "How dare she? How DARE she? Well, in <a href=\"http://video.google.com/videoplay?docid=5464505634137914176&playerMode=embedded\">this video</a>, the woman that the lady is SCREAMING about is ERIN!",
      "created_at": "2006-03-12T23:51:16.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<i>Ha! I've seen that video where she completely goes off her rocker. That's one of the funniest things I've ever seen, yet sad to think there are really people like that in America. In fact I know a few of them!</i>\r\n\r\nIt's funny and scary at the same time.  And, yes, I know people who are <i>close</i> to being that bat-sh*t crazy too.  Sad, really. \r\n\r\nI'm glad I'm so \"dark-sided.\" ",
      "created_at": "2006-03-13T03:29:23.000Z"
    },
    {
      "author": "erin",
      "body": "now caleb, that just isnt true!\r\n\r\nim glad im \"dark-sided\" too.",
      "created_at": "2006-03-13T04:07:18.000Z"
    },
    {
      "author": "Caleb",
      "body": "I like how \"upon further review\" she decided to keep the money.",
      "created_at": "2006-03-13T06:38:34.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<i>I like how \"upon further review\" she decided to keep the money.</i>\r\n\r\nTells a lot without telling much...",
      "created_at": "2006-03-13T19:12:25.000Z"
    },
    {
      "author": "brian of moore",
      "body": "agreed on all counts\r\n\r\ni felt really bad for those poor kids..\r\nwasnt one of them getting their own place with the money?\r\ni hope so",
      "created_at": "2006-03-14T01:15:08.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
