{
  "id": 38,
  "title": "Mid-July update",
  "body": "It's been awhile since I updated everyone on the progress we've been making on the theater, so today's post will remedy that. As we speak, the building's owners, Andrew and Doug, who also happen to be our primary investors, are beginning the process of gutting and renovating the building where the theater will be housed, but before work can commence, they need to gather several comparable bids from local subcontractors in order to obtain the construction loan. However, due to the busy summer months, subcontractors don't have a lot of time available for bidding on new jobs, which is putting a slight delay on the construction schedule.\r\n\r\nThe costs of transforming the 5,000 square foot building into a two-screen art-house theater will be passed on to Nicole and I through our lease agreement with Andrew and Doug. This agreement will essentially tie our financial risks together - Doug and Andrew will want to see a return on their building and construction investment, and Nicole and I will want to see the business succeed so we can repay the debt to Andrew and Doug - which means we will need to form a partnership or an LLC or some such combination of interests. As time progresses, Nicole and I will eventually buy out Andrew and Doug's portion of the business.\r\n\r\n*** <span style=\"font-weight: bold;\">SIDE NOTE:</span> Two gentleman just showed up at our door asking for information about our neighbor. As it turns out, she's being investigated by the FBI for running a computer scam and embezzling over $100,000 from someone in Arizona! Nothing makes you feel quite as safe as living above a criminal. I hope we're home when she gets busted. ***\r\n\r\nWe've also been working and reworking the floorplan with an architect from Midwestburg. I'll devote an entire post to this subject at a later time... I have AutoCAD pictures and everything!\r\n\r\nOnce the theater is fully-renovated and ready to roll, it will be up to Nicole and I to procure the final loan for equipment costs. We're hoping that the equipment will act as collateral for the loan, thus taking a lot of pressure off the fact that Nicole and I don't have many assets, but in the case that it doesn't, Andrew and Doug have again generously offered us their help. In all likelihood, the equipment loan should only be around $50,000 to $75,000, which, in relation to the rest of the project costs, isn't too much. If all goes well, we shouldn't have too hard of a time swinging it ourselves.\r\n\r\nCurrently, Nicole and I are in the midst of contacting various vendors for our initial inventory purchase. We're thinking that it might be better to work with a wholesale grocery distributor rather than a brand name vendor for obvious reasons like not having to deal with competing vendors, only needing to place one order with one company, etc., etc.. As always, our normal work hours make it difficult to get a hold of people during the day, so we have to utilize e-mail for the majority of our communications.\r\n\r\nAs you all know, <span style=\"font-weight:bold;\">The Moxie</span> is our new nom de plume, which means we're going to need a new logo. We could use the one that we had commissioned for <b>Criterion Cinema</b>, but I'm not so sure that it fits with our new image. I'm thinking I might try something wild and crazy with the design... I might do it myself. I might not. I might post a call for logo designs right here on the blog... I haven't decided yet, but as soon as I do, you'll be the first to know.\r\n\r\nI've stopped building the website for the theater until we have a better idea of what our brand / theme / logo will look like. Once we get that nailed down, the web design will recommence. The same goes with Nicole's newsletter designs, but not to as great an extent.\r\n\r\nWe went to the St. Louis Film-makers Showcase last Wednesday to get some ideas for when we eventually get to the point of doing something similar at our theater. Independent film-makers, in general, are a very\r\n lively and optimistic group of people. Their enthusiasm for film has a way of rubbing off on you, which is always a good thing. If we're still around in November, we have every intention of attending the St. Louis International Film Festival.\r\n\r\nWell, that's about it for now. Cinema 24's ride on the \"Blogs of Note\" list is just about ready to come to an end. It was certainly fun while it lasted, and I'm glad to have had the opportunity to share this process with a new group of film lovers. Yippee!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-07-18T01:03:09.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Oz",
      "body": "LOL  Quite possibly, but you're going to do it.  I never thought you'd have the balls for it.  Not you, personally, but you as a general you, as I don't think most people would take the risk that you and Nicole are taking.  So go on with your bad self!  I'm waiting patiently for the announcement of the Moxie's location so I can plan a visit....",
      "created_at": "2004-07-18T03:43:46.000Z"
    },
    {
      "author": "Silver",
      "body": "Yay! Can't wait to see how all your hard work pays off.",
      "created_at": "2004-07-18T07:46:55.000Z"
    },
    {
      "author": "Oz",
      "body": "This is great.  I have to admit, at the beginning of your blog, it seemed like opening an art house theater might just be a dream.  I mean, it seems like an impossibly difficult AND risky thing to do.  But now it seems like you guys are on the verge.  Congratulations!",
      "created_at": "2004-07-18T03:03:06.000Z"
    },
    {
      "author": "bjork24",
      "body": "On the verge of bankruptcy?",
      "created_at": "2004-07-18T03:29:26.000Z"
    },
    {
      "author": "Janet",
      "body": "Hey Dan,\r\n\r\nJust started reading through the site and it seems I have a lot of catching up to do. I also saw you made it as a blog of note awhile back. A belated congrats! Reading about this endeavor is giving me the Project Greenlight fix I didn't know I was missing.\r\n\r\nI can only imagine how hard it would be to open a theater, especially nowadays where corporate greed usually wins out (i.e. Blockbuster vs. mom-n-pop video stores).\r\n\r\nAdmittedly, I didn't read every post, but I was intrigued by your \"wish list\" of sorts of who you would want to drop by the theater. I have an imaginary dinner party list in my head that I really should get down on paper, or in the blog at least. \r\n\r\nHaving a way to actually get them there would probably help though.",
      "created_at": "2004-07-18T17:56:34.000Z"
    },
    {
      "author": "mo",
      "body": "hi dear:\r\nplease absolve me :((.yes its nice template but who made it?!? [mr.miss urlblue].thank you very much.\r\nCopyright for Urlblue.com\r\nFrom your persian friend mo.",
      "created_at": "2004-07-18T20:50:29.000Z"
    },
    {
      "author": "cooldesechable",
      "body": "saludos, pase a visitar su blog",
      "created_at": "2004-07-20T03:23:06.000Z"
    },
    {
      "author": "Eden Project",
      "body": "wow, i feel like i'm watching an mtv reality show reading your blog. i'm getting enthralled in all the plot points and characters. I'm growing attached to all of this, and I want to see you succeed, I kinda wish I knew where Midwestburg is so I could come check it out, maybe i haven't gotten to the post that tells me yet, i plan to keep reading, as this is way better than most of the crap on t.v. anyways, good luck from Southwesternburg, TX! -=D",
      "created_at": "2004-07-20T06:30:54.000Z"
    },
    {
      "author": "sara",
      "body": "proud to say i voted for the Moxie: congrats on the decision!\r\n\r\nthought of you as i passed this store front called Moxie for Men in So.Cal.--lo and behold, they had a website so i could share the amusement: http://www.moxieformen.com",
      "created_at": "2004-07-20T07:37:33.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "Watching \"The Majestic\" again reminded me of your theater-to-be. The items that they sold at the concession stand, such as moon pies and boxes of popcorn, were similar to the items that you plan to sell.",
      "created_at": "2004-07-20T07:52:30.000Z"
    },
    {
      "author": "writer",
      "body": "A bunch of folks resurrected this from an abandoned shell in my home town.\r\n\r\nhttp://www.suntheatre.com.au/suntheatre/front.asp",
      "created_at": "2004-07-20T08:34:06.000Z"
    },
    {
      "author": "Mathias Delusa",
      "body": "I would be careful about the whole FBI thing. Why would someone who just embezzeled 100k not take off. Sounds alot like a social engineering trick I know. Make sure you check those ID's real good the next time those guys show up. If they hesitate or make excuses or b-line out of there you need to call the police. Just a thought.",
      "created_at": "2004-07-20T22:51:06.000Z"
    },
    {
      "author": "bjork24",
      "body": "Mathias, thanks for the heads up. The guys who came to our door weren't FBI agents, they were people she had scammed. They relayed the information about the FBI to us.",
      "created_at": "2004-07-20T23:03:51.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
