{
  "id": 380,
  "title": "Two new features to the blog",
  "body": "Being the foremost blog about running a single screen movie theater in Springfield, Missouri isn't as easy as it seems. There's a lot of competition out there trying, desparately at times, to chip away at our near-monopolized share of the market. In order to keep those forces at bay, we have to push ourselves to be as innovative as possible; continually staying one step ahead of those who would love nothing more than to see us fail. Keeping with that mission, we're going to be unveiling two radically different features to the blog in the next few days.<br/><br/>The first is the hotly anticipated MoxieTV. In an effort to keep our readers as enlightened as they are entertained, MoxieTV will combine upcoming Moxie events (new movies, trailers, special events, etc.) with the whimsical, relaxed attitude that many have come to expect from the blog... even though  the majority of them will leave feeling sorely dissappointed after actually reading their first post. The first episode wrapped today and should be available sometime tomorrow. Ideally, we'd like to make MoxieTV a weekly feature... and we'd also like to make it funny, but I guess we'll all just have to wait and see on that one. Funny or not, episode numero uno will be popping up in less than 24 hours.<br/><br/>The second feature is a cohesive set of article-like posts that focus on a central theme. This is something that is COMPLETELY new for me. My posts typically have about as much forethought as a public fart - I get the urge and let it fly - but this upcoming set is going to be different. I've been mentally writing these posts for the last four months and finally feel ready to express my thoughts in a structured, five piece column entitled, \"Why My Hand Always Smell Like Burritos.\"<br/><br/>In all seriousness, the topic of my next five or six posts is going to be on the future of cinema. There's been a lot of talk lately about day-and-date releasing, digital cinema, and the general decline in theater attendance, but most of the articles and conversations I've read have focused on the general affect for filmmakers and consumers. Beyond the oft quoted \"is this the end for the modern multiplex?\" angle, very few of these articles go into great detail about how these advances are really, truly affecting the exhibition industry. So, that's exactly what I'm going to try to do over my next five or six posts. Don't expect them to pop up in a rapid sequence, as I'm really wanting to take my time with these. They'll appear with due diligence... I hope.<br/><br/>With that being I said, I have no idea what I'm going to title the pieces. I need a good title that can be applied to all the articles. The only thing I could come up with was the incredibly cheesy \"Cinema Paradigm-o Shift.\" How stupid is that? Can someone help me think of a better title?<br/><br/>Ok. Intermission time. I better go....",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-03-14T07:13:52.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "--Jeff",
      "body": "<i>With that being I said, I have no idea what I'm going to title the pieces. I need a good title that can be applied to all the articles. The only thing I could come up with was the incredibly cheesy \"Cinema Paradigm-o Shift.\" How stupid is that? Can someone help me think of a better title?</i><br/><br/>How about <i>Deus ex Moxie</i>?  <i>Dea ex Moxie</i>, if you want the genders to match (since Moxie is in the feminine?).  Or at least I think it is.   Sorry, Dr. Hughes.  I thought I remembered my Latin...<br/>",
      "created_at": "2006-03-14T09:04:51.000Z"
    },
    {
      "author": "tim",
      "body": "What about \"MOXIMUM OVERDRIVE\" or, \"MMMM: movies minus the middle man.\" or howabout \"theaters will never die because people still need certain social bonds that cheap dvd's big tv's and piracy can never fill, its only the rise of ticket prices and crappy movies which speak for the current drop in movie going-o shift\" it pretty much rolls right off the tongue. ",
      "created_at": "2006-03-14T09:16:45.000Z"
    },
    {
      "author": "Caleb",
      "body": "I assume you're going to be taking an anti-paradigm shift stance on the topic of cinema, so howabout:<br/><br/>\"Thomas Kuhn Never Went to the Moxie\" or \"Thomas Kuhn Didn't Have Moxie\"",
      "created_at": "2006-03-14T11:10:46.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'd prefer that the title not include the word \"Moxie,\" as I'm planning to sell the articles to the New Yorker.",
      "created_at": "2006-03-14T11:27:11.000Z"
    },
    {
      "author": "Nate",
      "body": "In that case, title it \"Something by David Sedaris.\"<br/><br/>And then include a cartoon with a caption that makes no sense.",
      "created_at": "2006-03-14T18:34:25.000Z"
    },
    {
      "author": "Amanda",
      "body": "How about something unecessarily dire...like \"THE SLOW AND PAINFUL DESTRUCTION OF CINEMA AND THE UNTIMELY DEMISE OF YOUNG ATTRACTIVE THEATER OWNERS\" I have a book in my bookstore called \"The Complete Story of the Italian Earthquake Horror - The World's Greatest Disaster - Death and Ruin by Earthquake, Tidal Wave and Fire\" The more optimistic your perspective the funnier your title.",
      "created_at": "2006-03-15T03:27:28.000Z"
    },
    {
      "author": "Gotta Remain Anonymous on This One...",
      "body": "Re: your series of articles on the future of cinema, I think they should be named Shannon.  Not Del \"Runaway\" Shannon. Shannon, as in:<br/><br/>SHANNON IS GONE I HOPE SHE'S DRIFTING OUT TO SEA <br/>SHE ALWAYS LOVED TO SWIM AWAY <br/>MAYBE SHE'LL FIND AN ISLAND WITH A SHADY TREE <br/>JUST LIKE THE ONE IN OUR BACKYARD   <br/><br/>MAMA TRIES HARD TO PRETEND THINGS WILL GET <br/>BETTER AGAIN <br/>SOMEHOW SHE'S KEEPING IT ALL INSIDE HER   <br/><br/>BUT FINALLY THE TEARS FILL OUR EYES <br/>AND I KNOW THAT SOMEWHERE TONIGHT <br/>SHE KNOWS HOW MUCH WE REALLY MISS HER   <br/><br/>SHANNON IS GONE I HOPE SHE'S DRIFTING OUT TO SEA <br/>SHE ALWAYS LOVED TO SWIM AWAY <br/>MAYBE SHE'LL FIND AN ISLAND WITH A SHADY TREE <br/>JUST LIKE THE ONE IN OUR BACKYARD   <br/><br/>JUST LIKE THE ONE IN OUR BACKYARD <br/><br/>Props to Henry Gross.  No one could say it any better.<br/>",
      "created_at": "2006-03-16T10:44:21.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
