{
  "id": 381,
  "title": "MoxieTV Episode #1",
  "body": "Ok, so here it is - MoxieTV Episode One. I think it looks pretty good, but Justin wanted me to note a few things:\r\n\r\n<ol><li>The special microphone we used to film this episode is capable of picking up the sound of cells dividing inside a pregnant woman from over four miles away, so please excuse the awesome sounds that my clothes and hand rubbing makes.</li>\r\n<li>We shot this episode from the hip, without the aid of a script (thus my many \"uh's\" and \"so's\"), so it's not the most polished piece of professional pronounciation in the world.</li>\r\n<li>The shot that most accurately portrays my <i>true</i> skin tone is the one where I'm standing in front of the \"Mule Face Woman\" banner. It's true, I'm really blue.</li></ol>\r\nThat's about it. I'm sure Justin (MoxieTV editor and director) will be have more to say in the comments, so... let's watch the freakin' thing!\r\n\r\n+ <a href=\"http://moxiecinema.com/moxietv/01\" class=\"broken\">Standard Resolution</a>\r\n+ <a href=\"/episodes/1\">High Resolution</a>\r\n\r\nNOTE: Once the video starts playing, hit pause and let it stream for awhile. It seems to stream 10x faster when the video is paused. Why? I don't know... but it works. Trust me.\r\n\r\nAlso, we'll have standard downloads a little later (.wmv and .mov), as I'm sure not everyone's connection supports streaming.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-03-14T22:57:11.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "I'd reccomend watching the High-Res version, if your computer/connection can support it.  It's not much more demanding than the Standard version, and it's MUCH easier to read the text during the Cache trailer. ",
      "created_at": "2006-03-14T23:12:50.000Z"
    },
    {
      "author": "Nate",
      "body": "The awesomeness that this is knows no earthly bounds.",
      "created_at": "2006-03-14T23:29:09.000Z"
    },
    {
      "author": "Fyse",
      "body": "Oh no, it's not working! I hear voices, but see not movement. It's stuck on your giant leg! Don't worry though, as I'm inclined to blame my computer (she has issues).",
      "created_at": "2006-03-15T00:53:36.000Z"
    },
    {
      "author": "Fyse",
      "body": "Good grief. It works in IE but not in Firefox. Has the whole world gone topsy-turvy?",
      "created_at": "2006-03-15T00:55:30.000Z"
    },
    {
      "author": "justin",
      "body": "What version of Firefox?  Working on 1.5 here (and elsewhere).",
      "created_at": "2006-03-15T00:57:19.000Z"
    },
    {
      "author": "Fyse",
      "body": "Don't worry about it Justin. Like I said, I'm having computer issues at the moment anyway, so I'm sure it's my problem.\r\n\r\nThat was awesome, guys. Impressively high production values too. And good call with 'Le Placard', it's a great film (though called 'The Closet' in the UK). ",
      "created_at": "2006-03-15T01:09:17.000Z"
    },
    {
      "author": "matt",
      "body": "this was cool.  i hope that you can keep up with them closer to weekly than semi-annually.  the cache spoof was a funny idea, too.  that movie is stark, man.  pretty tough to watch in parts, and it's the kind of thing that people will leave talking about.  unfortunately, like primer, most of the discussion is about the audience's disconnect with the plot and not about the themes that the movie is about.  oh well.  i appreciated that flick, but i wouldn't say i liked it.",
      "created_at": "2006-03-15T01:21:34.000Z"
    },
    {
      "author": "Amanda",
      "body": "Nice show...Dan you are much more sophisticated on screen than on blog. Is that a compliment? Anywho...you look very young...like a little kid playing in with his dad's camcorder. WooHoo for young entrepeneurs!",
      "created_at": "2006-03-15T03:22:24.000Z"
    },
    {
      "author": "nicole",
      "body": "Amanda - he appears sophisticated because all the burping & farting was edited out!",
      "created_at": "2006-03-15T04:16:36.000Z"
    },
    {
      "author": "bjork24",
      "body": "That's true. Justin a very good editor.",
      "created_at": "2006-03-15T04:17:07.000Z"
    },
    {
      "author": "justin",
      "body": "just wait for the blooper reel...",
      "created_at": "2006-03-15T04:26:31.000Z"
    },
    {
      "author": "brian of moore",
      "body": "that was supremely excellent\r\n\r\nps: nice shirt",
      "created_at": "2006-03-15T04:31:32.000Z"
    },
    {
      "author": "erin",
      "body": "wonderful!",
      "created_at": "2006-03-15T04:43:54.000Z"
    },
    {
      "author": "Caleb",
      "body": "That was awesome. Great job Justin. Why aren't you majoring in production?? Can't wait for the next one.",
      "created_at": "2006-03-15T08:55:02.000Z"
    },
    {
      "author": "erin",
      "body": "im wondering why dan doesnt go to hollywood!",
      "created_at": "2006-03-15T09:17:36.000Z"
    },
    {
      "author": "Steve Croxton",
      "body": "Bravo! VERY professionally done. Wouldn't be surprised if this leads to something bigger down the line for all of you. I can't wait for Nicole's debut...",
      "created_at": "2006-03-15T09:44:14.000Z"
    },
    {
      "author": "Steve Croxton",
      "body": "Oh, I forgot a couple suggestions: if you haven't already planned on it, you should have a MoxieTV archive on the site. And have you considered playing this before each show?",
      "created_at": "2006-03-15T09:47:25.000Z"
    },
    {
      "author": "Caleb",
      "body": "Or put it on a loop on a TV on top of the brochure area near the front door. You'd probably want to chain the TV to something though. Either way this whole idea is awesome. ",
      "created_at": "2006-03-15T09:54:05.000Z"
    },
    {
      "author": "bjork24",
      "body": "Steve and Caleb: it's funny you guys should mention your ideas (MoxieTV before the movie, or on a loop on an old TV in the corner), because we've been considering both. I like the old TV idea, but only because it's easier to do than the MoxieTV before each film.\r\n\r\nSteve: Yes, there will be a full-fledged MoxieTV section in the very near future.",
      "created_at": "2006-03-15T10:12:05.000Z"
    },
    {
      "author": "Ole",
      "body": "Wow.  I'm impressed.  I second the suggestion that Justin should consider changing majors.  It also makes me appreciate why he & Kelley would pack up and move to be closer to Dan & Nicole, there's some kind of force developing at the 408.  Good thing there's a vault.",
      "created_at": "2006-03-15T11:07:37.000Z"
    },
    {
      "author": "Scott G.",
      "body": "Awesome!  ",
      "created_at": "2006-03-15T17:24:38.000Z"
    },
    {
      "author": "Nate",
      "body": "They keep ME chained in the vault, beneath a trapdoor, only to be brought out during manpower shortfalls.\r\n\r\n\"Get Nate.\"\r\n\r\n\"Nate's asleep.\"\r\n\r\n\"Well wake 'im up, then!\"\r\n",
      "created_at": "2006-03-15T19:43:35.000Z"
    },
    {
      "author": "Barak",
      "body": "I've got sound but no video as well. I'm on a Mac, tried Firefox, Camino and IE. So now I'm just waiting for the .mov version.\r\n\r\nSeriously, I've got nothing else to do. I'm just waiting. Hurry up.",
      "created_at": "2006-03-15T20:41:27.000Z"
    },
    {
      "author": "Caleb",
      "body": "Nate's lying. Well, sort of. He IS locked beneath a trapdoor in the vault but his sole purpose is to type in some numbers on a computer every 108 minutes or else something at the Moxie fails. So in other words, every problem the Moxie has had so far can be blamed on Nate forgetting to type in the numbers. Good going Nate.",
      "created_at": "2006-03-16T01:20:08.000Z"
    },
    {
      "author": "Nate",
      "body": "It's hard enough having to type in those numbers on an outdated, 1970's era keyboard while trapped in a full body/head leather suit with zippers over my eyes and mouth and a chained collar on my neck.\r\nBut to make matters worse, Dan always makes me watch over one of the \"flies\" that he has caught in his \"web\", ball-gagged and duct-taped to a chair, while he has his way with the other one in the dry storage room.\r\n\r\nInevitably, predictably, the one I'm watching always escapes, chokes me with my own collar-chain, and kills Dan with the Moxie's own Samurai sword that Nicole keeps mounted over the cinebar.\r\nEvery.  Freaking.  Time.\r\n\r\nAnd then with the damn numbers!",
      "created_at": "2006-03-16T01:29:19.000Z"
    },
    {
      "author": "brian of moore",
      "body": "btw.. justin... you speak subtitles amazingly well",
      "created_at": "2006-03-16T02:49:41.000Z"
    },
    {
      "author": "Liz",
      "body": "AWESOME! And weird. Moxie TV gave me the same sensation as the audio post did: \"Dan has a voice?  He's a real person? ...Who eats Milk Duds out of the dumpster?\"  (I blame my living a thousand miles away and never getting to visit the Moxie or meet you.)",
      "created_at": "2006-03-16T03:22:54.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<i>'ve got sound but no video as well. I'm on a Mac, tried Firefox, Camino and IE. So now I'm just waiting for the .mov version.</i>\r\n\r\nFrom what I can tell, it appears to work only if you have Flash 8.  If you're using Linux, Flash 7 is the highest version available.  Geez, I hate booting into Windoze for stuff like this...:( \r\n",
      "created_at": "2006-03-16T05:20:09.000Z"
    },
    {
      "author": "justin",
      "body": "I'll encode next weeks in Flash 7 instead of 8.",
      "created_at": "2006-03-16T05:26:52.000Z"
    },
    {
      "author": "--Jeff",
      "body": "For the 3.5 people using Linux (That's me and three other people for those of you counting), it's probably not worth losing the benefits of Flash 8...",
      "created_at": "2006-03-16T08:51:28.000Z"
    },
    {
      "author": "justin",
      "body": "I don't think there's really any benefits.  When encoding, I assumed that something encoded in the Flash 8 format was backwards compatible with 7, and visa versa.  I was wrong, apparently.  As long as there is no negative difference in quality and/or file size, I'll do 7 next week.",
      "created_at": "2006-03-16T09:09:05.000Z"
    },
    {
      "author": "Caleb",
      "body": "Yeah Nicole and her Samurai sword. And her never-ending obsessing with a guy named Bill...\r\n\r\nThe Moxie needs to have a screening of <i>Pulp Fiction</i> this summer. No question about it. Glad we got that settled.\r\n\r\nOh, and I don't know if this movie is going to be wide release or limited, but it's the Weinstein Company and aren't those mostly limited? It looks great and could have the success of <i>Kiss Kiss, Bang Bang</i> if you brought it in. Check it out...\r\n\r\n<a href=\"http://www.apple.com/trailers/weinstein/luckynumberslevin/trailer/\">Lucky Number Slevin</a>",
      "created_at": "2006-03-16T12:15:18.000Z"
    },
    {
      "author": "Caleb",
      "body": "Oh, and this one too, although I have no freaking clue what it's about. And it might not be too appealing to most audiences. But it stars Bjork and her music. Need I say more?\r\n\r\n<a href=\"http://www.apple.com/trailers/independent/drawingrestraint9/trailer/\">Drawing Restraint 9</a>\r\n\r\nOne thing though, didn't she swear she would never act again after making <i>Dancer in the Dark</i>? Although I'm not quite sure this is a \"movie\" but rather extreme video art.",
      "created_at": "2006-03-16T12:24:25.000Z"
    },
    {
      "author": "erin",
      "body": "its about bjork. using vaseline rather than butter, cheese or jelly on her toast.",
      "created_at": "2006-03-16T18:58:57.000Z"
    },
    {
      "author": "Bjork",
      "body": "Imagine if clouds were made of licorice! \r\n",
      "created_at": "2006-03-16T19:41:38.000Z"
    },
    {
      "author": "Bjork",
      "body": "<A href=\"www.mcsweeneys.net/2006/1/10mccoy.html\">Icelanders complete the echo with feel!</A>. ",
      "created_at": "2006-03-16T19:46:00.000Z"
    },
    {
      "author": "Bjork",
      "body": "<A href=\"http://www.mcsweeneys.net/2006/1/10mccoy.html\">Pandas are sexy!</A>\r\n",
      "created_at": "2006-03-16T19:48:56.000Z"
    },
    {
      "author": "Caleb",
      "body": "Someone needs to put a muzzle on Bjork...",
      "created_at": "2006-03-16T21:21:58.000Z"
    },
    {
      "author": "bjork24",
      "body": "There will be NO Bjork-bashing on this blog... that also includes NO Nate-pretending-to-be-Bjork-bashing! Also, NATE, there will be NO more Bjork impersonating!",
      "created_at": "2006-03-16T21:24:58.000Z"
    },
    {
      "author": "Nate",
      "body": "Who was bashing Bjork?  I love Bjork.  I love Bjork and her crazy ways.",
      "created_at": "2006-03-16T22:19:47.000Z"
    },
    {
      "author": "M Scott Phifer",
      "body": "Thank you very much for the first episode of MoxieTV.  Looking forward to future episodes. \r\n\r\nAlso thank you for having TRANSAMERICA here in Springfield.  It was a great film.",
      "created_at": "2006-03-17T11:21:17.000Z"
    },
    {
      "author": "Lynn",
      "body": "Moxie TV is the best!  It is so great, you are so creative and I love it.  Finally an exciting venue in Springfield. Look forward to it all in the future, thank you for all your hard work and dedication. ",
      "created_at": "2006-03-20T12:23:30.000Z"
    },
    {
      "author": "jxstone@sbcglobal.net",
      "body": "Amazing ... the cinamamographer- ist guy doing a commentary in four languages, simultaneously -- including Pig Latin.",
      "created_at": "2006-03-24T17:29:34.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 17,
      "name": "MoxieTV"
    }
  ]
}
