{
  "id": 382,
  "title": "Annie Proulx's serpent tongue",
  "body": "I'm still working on the \"yet-to-be-titled\" articles about the death of cinema, but in the meantime I thought some of you might find <a href=\"http://books.guardian.co.uk/comment/story/0,,1727309,00.html\" target=\"_blank\">Annie Proulx's vitriolic description of the Oscar ceremonies</a> an interesting read. For those of you who don't know, Annie Proulx is the author responsible for the SUPER short story that BROKEBACK MOUNTAIN was adapted from. She also wrote THE SHIPPING NEWS, of which I read 78 pages and promptly fell asleep. I just can't get into fiction.<br/><br/>And speaking of serpent tongues, check out <a href=\"http://news.bbc.co.uk/cbbcnews/hi/world/newsid_1646000/1646912.stm\" target=\"_blank\">this story</a> about a young German girl who has the world's largest tongue (Freakishly Safe For Work). I can't believe some of the quotes they used!<br/><br/>PS - I still need help titling my articles. Surely someone has a good tip... and no, I won't stop calling you Shirley.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-03-16T22:07:10.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "bjork24",
      "body": "Jennifer: I don't know where to find the short story online... although I saw a version of it for sale at Target. It was printed with a 24 point font, which brought it to just shy of 50 pages. I guess people would have a hard time shelling out $7.99 for a 19 page short story.",
      "created_at": "2006-03-17T00:48:34.000Z"
    },
    {
      "author": "Jennifer",
      "body": "I loved Shipping News - it is one of my favorite Pulitzer winners, but I haven't read the short story.  I saw the movie and really enjoyed it and would love to read the story it was based on.  Aside from tracking down the New Yorker that it appeared in, do you know of another way to read it?  Is it available online somewhere?",
      "created_at": "2006-03-16T23:35:19.000Z"
    },
    {
      "author": "Caleb",
      "body": "<i>Hollywood loves mimicry, the conversion of a film actor into the spittin' image of a once-living celeb. But which takes more skill, acting a person who strolled the boulevard a few decades ago and who left behind tapes, film, photographs, voice recordings and friends with strong memories, or the construction of characters from imagination and a few cold words on the page?</i><br/><br/>I totally agree with this point that Proulx makes in her article. Sadly the Academy just doesn't get it. She does come off as a sore loser though, even if <i>Crash</i> was trash.",
      "created_at": "2006-03-17T00:17:52.000Z"
    },
    {
      "author": "brian",
      "body": "drawing restrain 9..?  dan.... make it happen<br/>no seriously<br/><br/>im in class right now.. and just watched that trailer<br/>i had to watch it with no sound... <br/>hmm.. at first i thought it might be weirder without sound<br/>but im sure theres some excellently weird selma songs-ish music going on<br/>",
      "created_at": "2006-03-17T02:43:55.000Z"
    },
    {
      "author": "Caleb",
      "body": "Brian - yes there is some amazing music in the trailer.",
      "created_at": "2006-03-17T03:29:18.000Z"
    },
    {
      "author": "Ole",
      "body": "Re a working title, I think the first thing to do is step back from the Moxie TV title.  Your a multimedia film house, maybe you need Moxie Media or Moxie Projection(istas).  Brand Moxie, brand movies or films, quit helping out TV.",
      "created_at": "2006-03-17T07:24:27.000Z"
    },
    {
      "author": "nicole",
      "body": "Ooh, ooh: Moxie Shorts!",
      "created_at": "2006-03-17T08:38:34.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<i>PS - I still need help titling my articles. </i><br/><br/>Cinema Veritalk? <br/><br/>/got nothin'",
      "created_at": "2006-03-17T09:06:03.000Z"
    },
    {
      "author": "Caleb",
      "body": "I like Moxie TV...",
      "created_at": "2006-03-17T14:15:06.000Z"
    },
    {
      "author": "Nate",
      "body": "Moxie Talksy.",
      "created_at": "2006-03-17T19:28:50.000Z"
    },
    {
      "author": "Laurali",
      "body": "I've read the short story by Proulx and I wasn't very impressed. To be honest I'm surprised they made a movie out of such a crap short story. I haven't seen the movie (cause they-who-shall-not-be-named stole it from the Moxie) but I'm not sure I'd really care to after reading the pathetic piece of writing it was based on.<br/><br/>",
      "created_at": "2006-03-17T19:39:51.000Z"
    },
    {
      "author": "Nate",
      "body": "Voldemort is stealing movies from the Moxie?",
      "created_at": "2006-03-17T20:16:48.000Z"
    },
    {
      "author": "Laurali",
      "body": "Yes. He among others.",
      "created_at": "2006-03-17T20:18:38.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "Dan, you sent me The Shipping News. I too fell asleep while reading it, except I think I was on the toilet at the time...",
      "created_at": "2006-03-17T21:27:46.000Z"
    },
    {
      "author": "evilvet",
      "body": "If you were reading that book whilst on the pot, are you sure you weren't reading her other novel, The Sh*tting News?",
      "created_at": "2006-03-20T19:29:28.000Z"
    },
    {
      "author": "matt",
      "body": "wow, that author seemed really bent out of shape and vitriolic in a very unprofessional way.  what a crybaby.",
      "created_at": "2006-03-22T23:04:08.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
