{
  "id": 383,
  "title": "More MoxieTV goodness",
  "body": "<b>UPDATED</b>\r\n\r\nI'm not going to lie to you, I haven't even started on my 5 piece article regarding the rise and fall of the cinema industry. There's several reasons for this: 1) we're right in the middle of moving, 2) we've been fairly busy at the theater, 3) Justin is running me ragged with MoxieTV shoots, and 4) I can't think of a good title for the articles. Don't you worry your sweet little head though - I'll write them... eventually.\r\n\r\nAs for MoxieTV, episode 2 will be available either late tonight or early tomorrow. We just wrapped primary shooting this morning and it looks like it's going to be an interesting one, to say the very least. If you haven't checked out the MoxieTV page lately, you might notice a few changes... go see for yourself - <a href=\"http://www.moxiecinema.com/moxietv\" class=\"broken\">http://www.moxiecinema.com/moxietv</a>.\r\n\r\nWe'd like to include some audience reaction shots for THE MATADOR in episode 3, so I'm thinking we'll film those after the 7:00 show on Saturday. If you'd like to be included, feel free to show up for that showing and have your face seen by tens of twenties of people. Trust me, it'll be a good time.\r\n\r\nOk, I have a buttload of things to finish before we open doors in a couple hours. Hopefully we'll see everyone here for DARWIN'S NIGHTMARE!\r\n\r\n<b>UPDATE:</b> MoxieTV Episode TWO is now available. Go check it out if you haven't already. ALSO: Don't forget about DARWIN'S NIGHTMARE! Two night's only. We had to beg and plead to get this film... in fact, our print is ONE of only SIX in existence. Don't make us mean and spiteful - come see this movie... it was nominated for an Oscar, for pete's sake!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-03-21T00:54:30.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Ben Dillon",
      "body": "I smell an Emmy nomination.\r\n\r\nAnd it's quite an odd smell.\r\n\r\nNice choice of music, by the way.",
      "created_at": "2006-03-21T22:58:01.000Z"
    },
    {
      "author": "Nate",
      "body": "Nobody has ever made quite clear to me the distinction between buttload and assload.\r\n\r\nThey are both heavy loads, obviously, of abstract concepts (such as stress) or physical objects (such as Fitz's Diet Rootbeer, as in: once again, we are overstocked and have an assload of Fitz's Diet Rootbeer).  However, I feel some cultural consensus should be reached over which is greater than the other.  I go with assload.\r\n\r\nThen, of course, there is crapload, which is merely made up and not a real word.",
      "created_at": "2006-03-21T02:27:12.000Z"
    },
    {
      "author": "Jonna",
      "body": "I'd say that a buttload is more, simply because there are more letters.  Also, if each letter were assigned a numerical value, where A = 1, B = 2, et cetera, then a buttload is definitely more than an assload.",
      "created_at": "2006-03-21T03:17:43.000Z"
    },
    {
      "author": "Nate",
      "body": "But(t) you could just as(s) easily make the argument that assload is more, since A begins the alphabet, and thus has primacy over B.\r\n\r\nSee:\r\n\r\nAcademic grades.\r\n\r\nAlpha males vs. Beta males\r\n\r\n\"A list\" stars\r\n\r\nB movies\r\n\r\nThe A-Team\r\n",
      "created_at": "2006-03-21T03:25:06.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "I'd say a buttload and assload are relative to the person.",
      "created_at": "2006-03-21T07:53:09.000Z"
    },
    {
      "author": "bjork24",
      "body": "Quit talking about \"loads\"... the new MoxieTV is up!",
      "created_at": "2006-03-21T10:24:44.000Z"
    },
    {
      "author": "justin",
      "body": "...and when Dan says \"running me ragged with MoxieTV shoots\" he means \"running me ragged with MoxieTV shoots which equal under 3 hours a <b>week</b>!",
      "created_at": "2006-03-21T10:39:39.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yes, three hours of shooting, but how many endless hours of script revising?! Huh?! Huh?!",
      "created_at": "2006-03-21T10:45:20.000Z"
    },
    {
      "author": "Laurali",
      "body": "May I humbly suggest that the second episode of MoxieTv have a QuickTime version? ",
      "created_at": "2006-03-21T19:52:34.000Z"
    },
    {
      "author": "justin",
      "body": "Quicktime version is on it's way right now - should be up in 20 minutes or so.",
      "created_at": "2006-03-21T20:05:03.000Z"
    },
    {
      "author": "justin",
      "body": "Okay, well the Quicktime version will have to wait.  The audio was desynched, so I'll have to re-encode it.  Sorry!",
      "created_at": "2006-03-21T20:18:34.000Z"
    },
    {
      "author": "Barak",
      "body": "Anyone else not getting audio?",
      "created_at": "2006-03-21T21:07:06.000Z"
    },
    {
      "author": "justin",
      "body": "you'll need to have Flash 8 installed to view the streaming flash version.  Otherwise, you might want to try the downloadable .wmv",
      "created_at": "2006-03-21T21:52:43.000Z"
    },
    {
      "author": "justin",
      "body": "...and by Flash 8, I mean Flash 8 Player, which can be installed <a href=\"http://www.macromedia.com/shockwave/download/index.cgi?P1_Prod_Version=ShockwaveFlash\">here</a>",
      "created_at": "2006-03-21T22:09:40.000Z"
    },
    {
      "author": "Melinda",
      "body": "You guys are waaaaaaaaay cool. \r\n\r\nSeriously.  Moxie TV is brilliant!\r\n\r\nBy the way, were you at Doling or Sequiota Park?\r\n\r\n",
      "created_at": "2006-03-22T00:02:20.000Z"
    },
    {
      "author": "Melinda",
      "body": "Oops, forgot to say.... love the dance, Nicole.  You've got the moves, baby.",
      "created_at": "2006-03-22T00:03:09.000Z"
    },
    {
      "author": "justin",
      "body": "thanks for the kind words! we were at Sequiota Park.",
      "created_at": "2006-03-22T00:14:31.000Z"
    },
    {
      "author": "tedd",
      "body": "My thoughts on Moxie TV dos:\r\n\r\n1.  It was great to see you outside in daylight and not witness huge chunks of your flesh blister and fall off.\r\n\r\n2.  If that was Nicole and your new house you were exiting, you paid to much.  You could at least spruce it up with some curtains.",
      "created_at": "2006-03-22T01:49:17.000Z"
    },
    {
      "author": "Ole",
      "body": "So don't TV shows have theme songs?  Isn't it time to resurrect the Moxie jingle?",
      "created_at": "2006-03-22T13:06:52.000Z"
    },
    {
      "author": "Nate",
      "body": "The brilliantly executed Amazing Race spoof was easily the hardest I'd laughed since...\r\n\r\nwell, since Nicole's \"We Need More People\" Dance five seconds before.\r\n\r\nBut before THAT...it was a long time.",
      "created_at": "2006-03-22T21:27:59.000Z"
    },
    {
      "author": "Caleb",
      "body": "Damn you guys, awesome job. Hysterical and so informative! My favorite parts were Nicole's dance and Dan chasing the ducks. Oh yeah and the kickass editing. ",
      "created_at": "2006-03-23T00:30:36.000Z"
    },
    {
      "author": "Nate",
      "body": "I believe they are swans, Caleb.  Swans.",
      "created_at": "2006-03-23T00:43:30.000Z"
    },
    {
      "author": "Caleb",
      "body": "For some reason it won't post what I'm typing. Let's try this again...\r\n\r\n<a href=\"http://www.apple.com/trailers/fox_searchlight/littlemisssunshine/trailer/\">HA!</a>",
      "created_at": "2006-03-23T00:45:27.000Z"
    },
    {
      "author": "nicole",
      "body": "I think they were geese, actually.",
      "created_at": "2006-03-23T01:18:38.000Z"
    },
    {
      "author": "bjork24",
      "body": "You're both wrong... they were deer.",
      "created_at": "2006-03-23T01:39:32.000Z"
    },
    {
      "author": "Melissa",
      "body": "The music was really cool.  Watching Moxie TV makes me want to quit grad school and be an entrepreneur.  Could I make a living selling homemade soap?",
      "created_at": "2006-03-23T02:38:55.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 17,
      "name": "MoxieTV"
    }
  ]
}
