{
  "id": 384,
  "title": "Fast on the heels of MoxieTV...",
  "body": "... comes MoxieFM! Now instead of listening to the same CD over and over for weeks on end, we're going to mix things up with various songs from ALL of our local artists. Of course, it wouldn't be MoxieFM if it were just a random smattering of songs, so we'll be interjecting little segments here and there to give the pre-show music a life of its own. Now that we have Moxie Cinema, The Moxie Blog, Moxie A Go-Go, MoxieTV, and MoxieFM, I think it's safe to say that THE MOXIE has become \"the king of all media!\" Next on the list: Moxie-style Cashew Chicken!<br/><br/>Keep your ears open for MoxieFM's debut early next week.<br/><br/>Oh yeah, one more thing - yesterday was our 6 month anniversary. Time flies when you're having fun, but not when you're running your own business... that's for DAMN sure!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-03-23T04:21:12.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Nate",
      "body": "...this is getting a little out of hand.",
      "created_at": "2006-03-23T04:37:53.000Z"
    },
    {
      "author": "bjork24",
      "body": "Total. Moxie. Immersion.",
      "created_at": "2006-03-23T04:48:59.000Z"
    },
    {
      "author": "Steve Croxton",
      "body": "Look out Rupert Murdoch, here comes Dan Chilton!!! Though from what I can tell, your politics are a little...better, shall we say?",
      "created_at": "2006-03-23T04:49:07.000Z"
    },
    {
      "author": "Caleb",
      "body": "You should record people calling in requesting songs or asking them what their number one hit music station is. <br/><br/>I'm glad the local artists are down with this too, so if any of you are reading this...KUDOS!",
      "created_at": "2006-03-23T12:43:50.000Z"
    },
    {
      "author": "tedd",
      "body": "Next in the works, Dan and Nicole action figures?",
      "created_at": "2006-03-23T20:34:27.000Z"
    },
    {
      "author": "erin",
      "body": "oh my lord! yes. action figures! they have to come with little accessories. dans with a film roll thing (whatever its called). or maybe a broom? nicole with a cash register. oooh oooh! and they will need little buttons that make them do things. dans button will make him say something really cheesey. and nicoles button will make her dance.<br/><br/>tedd is a super genius. action figures!!",
      "created_at": "2006-03-23T21:02:38.000Z"
    },
    {
      "author": "Amanda",
      "body": "Woohoo! World domination for the Moxie! I will give thee my allegiance when thou rulest the world!",
      "created_at": "2006-03-23T22:47:18.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<i>oooh oooh! and they will need little buttons that make them do things.</i> <br/><br/>Dan with kung-fu grip?",
      "created_at": "2006-03-24T04:46:37.000Z"
    },
    {
      "author": "Nate",
      "body": "Nicole with We Need More People PowerKick Action*<br/><br/><br/><br/><br/><br/>*AAA batteries sold separately.",
      "created_at": "2006-03-24T04:59:31.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
