{
  "id": 385,
  "title": "The Moxie Loves...",
  "body": "Hope Davis!\r\n\r\nI was sitting here tonight realizing that out of the 50 or so movies we've shown so far, Hope Davis has been in three: PROOF, DUMA, and now THE MATADOR.\r\n\r\nThat's 6%! The closest contender behind our new friend Hope is Sarah Silverman for THE ARISTOCRATS and SARAH SILVERMAN: JESUS IS MAGIC. Or am I forgetting someone? But with Sarah, that's only 4% - a huge difference!\r\n\r\nOf Hope's films, PROOF did surprisingly well, while DUMA had one of the lowest turnouts, but we're expecting some nice crowds in for THE MATADOR. Based on how we do with THE MATADOR, Hope Davis may be our new Moxie-film-success indicator. We'll see, I guess.",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2006-03-24T09:33:18.000Z",
  "author": "Nicole",
  "comments": [
    {
      "author": "Aristocrat",
      "body": "I know it doesn't follow this thread, but I just saw this and had to share.  It is one of the filmmakers from the Columbia, MO film festival that aired on TV...  Enjoy.  http://www.youtube.com/watch?v=tczU13W-dbY",
      "created_at": "2006-03-24T11:58:16.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Well, Daniel Auteuil now has been in two Moxie movies within a week (Le Placard and Cache).",
      "created_at": "2006-03-24T21:19:20.000Z"
    },
    {
      "author": "nicole",
      "body": "We also realized Tilda Swinton was in two: Thumbsucker and Broken Flowers, and that Steve Coogan will be in two (Happy Endings and Tristram Shandy, which comes out in April).",
      "created_at": "2006-03-24T21:29:39.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Yes, I was just about to mention that. Along with Brendan Gleeson, if you count the short film, he was in Six Shooter and Breakfast On Pluto.",
      "created_at": "2006-03-24T21:40:48.000Z"
    },
    {
      "author": "Nate",
      "body": "It's like there are only eight actors in the entire world.",
      "created_at": "2006-03-24T21:58:13.000Z"
    },
    {
      "author": "nicole",
      "body": "But still nobody beats Hope Davis's record!",
      "created_at": "2006-03-24T23:07:28.000Z"
    },
    {
      "author": "Caleb",
      "body": "Hope Davis has Moxie. I bet you'll get her new movie, Infamous, too. Basically it's Capote 2, with bigger names. I doubt it will be nearly as good though. And it might go wide release. She's also in another movie with Truman Capote as a character - The Hoax, which is a biopic about Clifford Irving's biography about Howard Hughes. \r\n\r\nWhat's the deal with biopics lately? And more importantly, what's the deal with biopic remakes lately?! Where's the originality people?!",
      "created_at": "2006-03-24T23:43:04.000Z"
    },
    {
      "author": "Nate",
      "body": "As long as people keep becoming famous and subsequently dying from a drug overdose/long descent into alcoholism, they will keep making biopics.",
      "created_at": "2006-03-25T00:20:22.000Z"
    },
    {
      "author": "Maddy",
      "body": "So, Dan, we're dying to know--how did Moxie-a-Go-Go go?\r\n\r\n(wow, read that out loud--I am quite the poet)",
      "created_at": "2006-03-25T21:01:42.000Z"
    },
    {
      "author": "erin",
      "body": "steve busecemi has yet to be in a movie you have shown..\r\n\r\nim not pleased with this.",
      "created_at": "2006-03-26T11:51:22.000Z"
    },
    {
      "author": "erin",
      "body": "buscemi.\r\n\r\ni cant even spell my own husbands last name. whoops.",
      "created_at": "2006-03-26T11:51:46.000Z"
    },
    {
      "author": "Caleb",
      "body": "Yes Erin and Steve's wedding was the party of the century. \r\n\r\nHey I know you guys didn't get <i>March</i> of the Penguins, but perhaps you can get your mittens on <a href=\"http://movies.yahoo.com/mv/news/va/20060324/114325967800.html\">this film</a>? It sounds like it will be hysterical.",
      "created_at": "2006-03-26T13:37:51.000Z"
    },
    {
      "author": "Derek",
      "body": "Well, Hope Davis <i>is</i> pretty fantastic. You should start an official Hope Davis film count. I see this as being in no way creepy or weird.",
      "created_at": "2006-03-27T10:38:37.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 12,
      "name": "Thoughts"
    }
  ]
}
