{
  "id": 386,
  "title": "Moxie A Go-Go Was a No-Show...",
  "body": "NOT! Our first Moxie A Go-Go event was a tremendous success! We had over 50 people show up, which was more than myself or Mille's had anticipated. Prior to the event, my stomach was in knots worrying about several factors: 1) our screen would be too small, 2) there wouldn't be enough food to justify the $20 per ticket price, and 3) something would break during the showing. All of those fears proved to be unfounded, as the screen fit the space perfectly, each guest was served a heaping plate of food, and all the technical stuff performed without a hitch! After the event, the manager proclaimed the event a success and suggested we host another one in April. I agreed, so now it looks like we'll be having TWO Moxie A Go-Go events in April! But more on that in a moment....\r\n\r\nOur April line-up has been finalized, and I'm working like a opossum-possessed to get our calendar finished. Here's what's coming up:\r\n\r\n<ul><li>MRS. HENDERSON PRESENTS (Starts April 5th) - there's a reason why it took us so long to get this one, but I can't go into further detail... it's a long story. Either way, we've got it now!</li>\r\n<li>DAVE CHAPELLE'S BLOCK PARTY (Starts April 6th) - this is actually a five show revival, as the Suxteen already showed BLOCK PARTY for a two week run. GO! Magazine is collaborating with us to throw a <i>real</i> \"block party\" outside the theater on opening night - complete with Budweiser sponsorship, hot dogs, and a couple live hip hop performances. That's Moxie style, baby!</li>\r\n<li>NIGHTWATCH (Starts April 12th) - the movie that took Russia by storm finally arrives in America! It's about vampires too!</li>\r\n<li>TRISTRAM SHANDY: A COCK AND BULL STORY (Starts April 19th) - very, very funny British film about the adaptation of the world's most unadaptable book, \"Tristram Shandy.\" Starring the hilarious Steve Coogan.</li>\r\n<li>THE THREE BURIALS OF MELQUIADES ESTRADA (Starts April 19th) - Tommy Lee Jones' latest vehicle, for which he won best actor at the Cannes film festival. We showed the trailer in front of CACHE, and judging solely from everyone's reaction, this should be a good one.</li>\r\n<li>NEIL YOUNG: HEART OF GOLD (Starts April 26th) - every time this trailer plays, people get up and start dancing around. Neil Young's appeal bridges generations, so I'm expecting hefty turnouts for this one.</li>\r\n<li>TWO Moxie A Go-Go events - the first will be on April 20th at The Skinny Improv's theater for a Mystery Science Theater style event. We'll be showing one of the worst movies of all time - the aptly named MONSTER A GO-GO - and the Skinny Improvperformers will be providing the witty banter. The show will start at 7:00 and tickets will be $8.00 per head. The second M.a.G.G. event at Mille's is TBD, so keep your ears open.</li></ul>\r\nLooks like another stellar month at The Moxie, and as far as full-blown events go, our busiest too. Hopefully you'll be able to make it to ALL of them.\r\n\r\nFinally, I'd like to let everyone know that <a href=\"http://www.myspace.com/moxiecinema\" target=\"_blank\">The Moxie has a MySpace account</a>. It might seem vain, but we base our business success on the number of friends we have on that account. No request denied!!! Please be our friend... woot woot!!!!11",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-03-27T22:05:25.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Paradox",
      "body": "Oooh, that's such a feel-good post, Dan. I'm giddy all over now! Good for you guys! \r\n\r\nSuccess for the Moxie!",
      "created_at": "2006-03-27T23:09:41.000Z"
    },
    {
      "author": "Derek",
      "body": "That is definitely going in my Top 8. I have \"Live MST3K - 7:00 on April 20 at the Skinny Improv Theater\" on a homemade poster that I'm handing out to my nerd friends. You guys are awesome.",
      "created_at": "2006-03-27T23:15:51.000Z"
    },
    {
      "author": "Nate",
      "body": "I will check daily from now to forever that I am never pushed off your Top 8.  I don't care if God himself sends you a MySpace friend request and you have no room left.  \r\nYou got that?",
      "created_at": "2006-03-27T23:19:58.000Z"
    },
    {
      "author": "bjork24",
      "body": "Employees always get top 8... unless we have more than 8 employees... and in that case, I'll put the 8 hottest girls up front.",
      "created_at": "2006-03-27T23:21:56.000Z"
    },
    {
      "author": "Derek",
      "body": "I just edited it to include a mention of the Moxie and the film being shown and to remove copyright infringement.....yeah......And maybe I'll just put it on my door instead of handing them out.....that might be a good idea. I tend to get overzealous. I got pretty excited when Dan told us about it during his opening monologue for The Matador, too. Anyway, I'm done talking.",
      "created_at": "2006-03-27T23:27:56.000Z"
    },
    {
      "author": "Pleased, but thirsty",
      "body": "Glad the Go-Go event went so well!  I thought the film size and the sound were perfect for the room.  Pretty funny flick, too.\r\n\r\nThe food was ample and tasty (my hummus burps lasted all night long).  The only suggestion I would make is to either have occasional beverage service during the movie, or to give folks a \"last call\" before the film begins if there isn't going to be an intermission.  I ended up sucking on ice cubes and then licking the glass.\r\n\r\nThanks for a fun event!",
      "created_at": "2006-03-28T00:03:35.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i would to be an employee... ...sadly you cant afford me\r\nyes.. thats right.. im a high roller....\r\n\r\nbut as it stands im on your top 8... so woohoo!!\r\nill live it up while i can\r\nat least i hold the honor of leaving your first comment",
      "created_at": "2006-03-28T00:37:27.000Z"
    },
    {
      "author": "Al",
      "body": "Dan, I live a ways off, so i have not visited your fine business, but if I did live nearby, I'm sure I'd attend the big 16 screen theater more often, as only a movie or two a month would appeal to me at your place.\r\n\r\nNeedless to say, calling that place the Suxteen seems very petty to me, and borderline skitzo. Needless to say, they could care less about you, and you shouldn't care about them.",
      "created_at": "2006-03-28T10:27:58.000Z"
    },
    {
      "author": "evilvet",
      "body": "Hey, Al:\r\n\r\nAny Brewers fan would love the Moxie.  Their movies showcase the highs and lows of the human condition in all its beauty and horror.  Kind of like this...\r\n\r\n http://mlb.mlb.com/NASApp/mlb/mlb/baseballs_best/mlb_bb_gamepage.jsp?story_page=bb_82ws_gm7_milstl\r\n\r\nPS:  The Badgers look unstoppable in the Frozen Four.",
      "created_at": "2006-03-28T20:49:07.000Z"
    },
    {
      "author": "bjork24",
      "body": "Al: the \"i\" and \"u\" are just so close together on the keyboard... my finger must have slipped!\r\n\r\nI wish I could go into further detail about Campbell 16 and their stance against The Moxie, but I've been advised against it by several people who know a lot more about such issues. If I weren't under this gag order, I would gladly write a gigantic post explaining why Campbell cares about us <i>very much</i> and how they've gone out of their way to make sure we know they care about us. However, I can't do that... so I can see where it might sound childish to someone outside of our immediate circle.\r\n\r\nYou've always been the voice of unflinching pessimism on my blog, Al, and most times I appreciate your frankness (with the exception of one comment where you told me that we should fold and give up on opening the business, since our lack of start-up funds was an insurmountable obstacle). Your call of \"petty\" was spot-on from an outsider's perspective, but \"<i>skitzo</i>\" [sic]? I think you're being a bit reactionary.",
      "created_at": "2006-03-28T21:39:32.000Z"
    },
    {
      "author": "I agree with Al",
      "body": "Although probably not on much. \r\n\r\nI have been turned off in the past by your references to the Campbell \"Suxteen.\"  I think that it's immature to call it that regardless of what is going on.  How many other respectable businesses can you name that come up with derogatory nicknames for competitors and use them on their official websites? \r\n\r\nWith regard to whatver is going on with them...however mean they may be, whatever they do to try to take you out, etc....isn't it better to take the high road and compete on merit without having to bad-mouth them on your website? My point is, you say that thinking it's petty to call them that is \"spot-on from an outsider's perspective.\"  From my outside perspective, there is NOTHING they can do to you that would make me feel like calling them the \"Suxteen\" on this website was warranted.  \r\n\r\nAlso, I think Al has an excellent point about seeing movies at the 16.  I like independent films.  I like going to the Moxie.  Much of the time, you don't show stuff I want to see.  Obviously, someone wants to see it and I'm glad it's on.  I don't fault you for showing movies that appeal to other people.  But I'd hate to see you imply on here that we are traitors who aren't supporting the Moxie when we go to Campbell and see a film.  \r\n\r\nI know that you've made this your livelihood and I'm grateful to you for going out on a limb to make these movies available for us to see.  But even if Campbell steals the movies or whatever...isn't the point that people in Springfield get to see movies that are important, entertaining, etc. even though they aren't big budget?  Perhaps it's because your financial well-being is wrapped up in all this and the Ragtag is non-profit now, or maybe it's because they don't have a blog where it's all thrown out there...but I never get the sense that the Ragtag is being negative about other businesses in the community up in Columbia.  \r\n\r\nCall them the Suxteen behind closed doors if you like.  Hell, keep calling them that on the website if you want.  But just realize that to \"outsiders\" like me, it seems petty.  And bitter.  And immature. And judgemental and threatened.  You are a niche business and you cannot compete with Campbell.  You just can't.  You should have anticipated that they would try to fill the niche opening the Moxie exposed.  \r\n\r\nIf you believe in the Moxie, you believe in independent film, you believe in the people of this community...keep working your ass off to make the Moxie the best it can be and stop wasting energy being negative about your competitors.  And if you don't want to do that, at least realize that doing it on the blog is unnattractive to some of your readers.  ",
      "created_at": "2006-03-28T22:57:07.000Z"
    },
    {
      "author": "bjork24",
      "body": "Well that settles it, I'll no longer refer to Campbell as the Suxteen. However, I do want to note that I've never implied that someone is traitorous to The Moxie if they choose to see a movie there, or at the Springfield 8. In fact, I've promoted them on numerous occasions when they got a movie that we were not able to... as I'll do with THANK YOU FOR SMOKING.",
      "created_at": "2006-03-28T23:06:03.000Z"
    },
    {
      "author": "Nate",
      "body": "I don't have an official anything.  Can I still call them the Suxteen?\r\n\r\n",
      "created_at": "2006-03-28T23:34:15.000Z"
    },
    {
      "author": "Brad",
      "body": "When they don't properly adjust the sound, or when they don't close the theatre doors so I have to get up and do it myself so I don't hear movies from adjacent theatres that also have their doors open, which is every time, can I call them the Suxteen then?\r\n\r\nOr if, god forbid, The Moxie closed their doors and Campbell 16 reverts to its original selection of movies, which I daresay would be almost guaranteed, quickly abandoning the \"exposed niche\" that they only discovered after all the Moxie hoopla, no longer going out of their way to swipe movies from the Moxie that they would have shown ZERO interest in beforehand (even when it would have put even more butts in their seats since there would have been no competition), how about then?  Suxteen then?\r\n\r\nMere customers can be petty, right?",
      "created_at": "2006-03-28T23:41:15.000Z"
    },
    {
      "author": "matt",
      "body": "I've seen almost everything you've got lined up for April and I can tell loyal, local Moxie patrons that they shouldn't skip out on much of that at all.  Tristram Shandy, Night Watch, & Three Buirals were all very different, but all excellent movie experiences for me this year.",
      "created_at": "2006-03-29T00:17:48.000Z"
    },
    {
      "author": "nicole",
      "body": "I think it's a good lineup - I just hope the spring weather won't interfere!",
      "created_at": "2006-03-29T00:32:36.000Z"
    },
    {
      "author": "Al",
      "body": "Dan, I always root for the underdog, and hope you do well. I'd love to visit your establishment if you're in the area.",
      "created_at": "2006-03-29T08:15:07.000Z"
    },
    {
      "author": "Al",
      "body": "Dan, I always root for the underdog, and hope you do well. I'd love to visit your establishment if you're in the area.",
      "created_at": "2006-03-29T08:15:17.000Z"
    },
    {
      "author": "Al",
      "body": "I mean if I'm in the area.:)",
      "created_at": "2006-03-29T08:15:43.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
