{
  "id": 387,
  "title": "And in other news...",
  "body": "The <a href=\"http://www.moxiecinema.com/calendar\" class=\"broken\">April calendar</a> is online, as is <a href=\"/episodes/3\">MoxieTV episode 3</a>. Enjoy! I'm still pounding out the print version of the calendar, and hope to send it off to the printer later today. It's going to be another great month!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-03-28T23:14:11.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Fyse",
      "body": "Moxie TV just keeps getting better. AWESOME stuff guys.",
      "created_at": "2006-03-28T23:48:27.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Fyse!",
      "created_at": "2006-03-28T23:56:13.000Z"
    },
    {
      "author": "Caleb",
      "body": "GENIUS! That was great guys.",
      "created_at": "2006-03-29T00:42:14.000Z"
    },
    {
      "author": "Nate",
      "body": "Am I picking up on a Lost-ish black/white theme in clothing?",
      "created_at": "2006-03-29T01:33:21.000Z"
    },
    {
      "author": "Nate",
      "body": "I'm going to watch that again and look for hidden clues.  Maybe if we zoon in on Nicole's laptop we will see the numbers.",
      "created_at": "2006-03-29T01:33:53.000Z"
    },
    {
      "author": "bjork24",
      "body": "Please don't zoon on Nicole's laptop... I just had it cleaned!",
      "created_at": "2006-03-29T01:38:17.000Z"
    },
    {
      "author": "cassandra",
      "body": "yeah for another great month.....",
      "created_at": "2006-03-29T01:40:15.000Z"
    },
    {
      "author": "Greg Kinnear",
      "body": "What do you mean I am just \"uh...Greg Kinnear?!\" I owned that movie and all your customers would say so if Pierce Brosnan wasn't paying them all a hundred dollars for their flamboyant assertations of his muted, melodramatic performance. You know it Dan, you know it.",
      "created_at": "2006-03-29T02:50:24.000Z"
    },
    {
      "author": "Whimsy Chick",
      "body": "LOVE MoxieTV and can't wait for the Podcast version. :)",
      "created_at": "2006-03-29T03:12:23.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Hey, I don't know if this was some kind of \"find the error\" game that you guys put in or something, but when you were typing in the numbers (which are: 4 8 15 16 23 42), you typed 4 8 16 16...\r\nSo, I either just ruined Dan's day by pointing out a mistake and showed what a huge nerd I am, or I just made a lot of people angry and showed what a huge nerd I am.",
      "created_at": "2006-03-29T04:02:21.000Z"
    },
    {
      "author": "bjork24",
      "body": "The LOST numbers aren't the same as The Moxie numbers. I entered the LOST numbers once.... the coupler busted as a result.",
      "created_at": "2006-03-29T04:04:52.000Z"
    },
    {
      "author": "brian of moore",
      "body": "woah.. somehow i missed episode two\r\nso far that ranks at the best episode\r\n... i replayed the 'more people dance' 4 times\r\nhilarious....  and the kicker was the ding of the frong door at the end\r\n\r\nand of course any episode with bjork in it.. gets extra points\r\n\r\ndid everyone else already say this last week?\r\nsorry... ill try harder next time",
      "created_at": "2006-03-29T04:05:31.000Z"
    },
    {
      "author": "justin",
      "body": "those shots of the numbers were ripped directly out of a real episode of Lost. Specifically, episode 14 of season 2. \r\n\r\nThanks for the nice comments everyone!",
      "created_at": "2006-03-29T04:06:33.000Z"
    },
    {
      "author": "bjork24",
      "body": "And by \"<i>those shots of the numbers were ripped directly out of a real episode of Lost. Specifically, episode 14 of season 2.</i>\" Justin really means: \"Don't ever question my artistic integrity!!!!11\"",
      "created_at": "2006-03-29T04:08:25.000Z"
    },
    {
      "author": "Nate",
      "body": "Kenny really made True/False sound like a fun time, what with everyone rushing to get something to eat all at once and talking about what they just saw.\r\n\r\nDan, did I see ass-crack near the end there?  I believe frame by frame might reveal some ass-crack, but I've no desire to check.\r\n\r\nJustin, awesome job.  Again.\r\n\r\nHonestly though I think you could do Lost spoofs from here till forever and I'd be happy.",
      "created_at": "2006-03-29T04:21:11.000Z"
    },
    {
      "author": "Nate",
      "body": "It would have been nice had you let the Lost music continue on into (what I think of as) the \"piano theme\", giving the image of Dan scrubbing the bathroom floors a nice melancholy feel.",
      "created_at": "2006-03-29T04:23:18.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Ha, sorry Justin. Then it must have been the episode where a frantic John Locke hurriedly types in the numbers as the clock is counting down into the single didgits.  See, he messes up and has to backspace, then retype them, which, of course, generates extra suspense.",
      "created_at": "2006-03-29T04:24:30.000Z"
    },
    {
      "author": "Nate",
      "body": "It cuts out right at 1:53, if you're curious.\r\n\r\nWhat?  I'm a big nerd?",
      "created_at": "2006-03-29T04:24:43.000Z"
    },
    {
      "author": "Caleb",
      "body": "So can we expect a Moxie \"lockdown\" anytime soon, similar to the one in the previews for tomorrow night's episode? If there was one place that I could pick to get trapped in by huge steel doors slamming down at every exit, it would be the Moxie.",
      "created_at": "2006-03-29T06:11:23.000Z"
    },
    {
      "author": "Caleb",
      "body": "I'm sorry Nicole and Kelley but you two own episode 3. I keep watching the part where Nicole is explaining what's going on. Kelley sounds like a ditz who could care less and Nicole sounds like a robot being forced to be there against her will. It's hysterical. And also provides interesting insight into their character's role on the island...I mean in the theater.",
      "created_at": "2006-03-29T06:18:58.000Z"
    },
    {
      "author": "Matthew Martin (Master RJ)",
      "body": "Are you really closed on April 18th (Eric Roberts' birthday) or is this a joke? And while you're at it, observe December 12th as well.",
      "created_at": "2006-03-29T07:03:55.000Z"
    },
    {
      "author": "bjork24",
      "body": "RJ: let me get this straight... are you admitting to NOT observing Eric Roberts Day? I thought it was a national holiday. It's no joke. We'll be closed on that day.",
      "created_at": "2006-03-29T07:06:56.000Z"
    },
    {
      "author": "evilvet",
      "body": "Didn't you already try the Dave Chappelle block party thing?  If memory serves me...\r\n\r\n/post/315",
      "created_at": "2006-03-29T07:23:53.000Z"
    },
    {
      "author": "Chris L.",
      "body": "MoxieTV is kicks unholy @$$. Started reading the blog late last week, and you guys are my new heroes. Bet you didn't know you had Moxie fans in New Mexico, did you? (OK, so I lived my entire life in KC until two years ago...)\r\n\r\nFound the blog because I've wanted to do exactly what you guys have done for a few years now.  I shouldn't admit that the first time I thought about (re)opening a theater, it was in Rolla. Did I not mention I lived there for a year and a half, too? I must've blocked it. I'm seeing a therapist.\r\n\r\n...the image of Dan scrubbing the bathroom floors a nice melancholy feel\r\n\r\nWhich reminds me. You should call your series of articles Cinemelancholy: The Rise and Fall of the Movie Industry\r\n",
      "created_at": "2006-03-29T07:37:08.000Z"
    },
    {
      "author": "Chris L.",
      "body": "Oh, I thought we could use HTML tags... Part of that was bolded and part was in italics. The third paragraph is a quote from an earlier comment.\r\n\r\nShould I use \"i\" and \"b\" instead of \"em\" and \"strong\"?\r\n\r\n",
      "created_at": "2006-03-29T07:39:19.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "I can't get it to work. After Dan, in the bathroom, says \"the food was wonderful\" (whoa, that sounds really weird) it cuts out. This is like the tenth time I've tried it. I've tried each kind of video, I've waited for streaming. I even downloaded it, and every time at the 1:01 mark it stops. At that point on the downloaded version, it stops and says \"this file is corrupted\". Nothing seems to work.",
      "created_at": "2006-03-29T08:55:30.000Z"
    },
    {
      "author": "justin",
      "body": "weird.  what OS/browser are you using?",
      "created_at": "2006-03-29T09:50:00.000Z"
    },
    {
      "author": "Derek",
      "body": "Hey, that's me!\r\n\r\n:-)",
      "created_at": "2006-03-30T05:26:04.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "I might be the last living person using AOL. Last living person? Hmm, not quite sure if dead people browse the internet... oh wait, of course they do, PULSE.",
      "created_at": "2006-03-30T06:47:43.000Z"
    },
    {
      "author": "Chris L.",
      "body": "When there is no more room in AOL, the dead will browse the internet.",
      "created_at": "2006-03-30T11:11:14.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
