{
  "id": 388,
  "title": "The Moxie vs. Beautiful Weather",
  "body": "According to Paul, our booking agent and co-founder of the illustrious Ragtag Cinemacafe, there are two months over the calendar year that almost always do poorly: December and April. I remember one of Paul's first pieces of advice was to \"save up everything you make from January to March, because you'll need it in April.\" His reasoning was simple: beautiful weather. And it makes perfect sense.\r\n\r\nOver the winter months, everyone's yard, garden, and landscaping slowly turns to crap, and it's not until the first sign of nice weather (typically in late March and April) that people start to emerge from their winter coats and undertake massive outdoor clean-up projects. I don't have any hard facts to base these assumptions, just several years of observation and the benefit of having been raised in a family that doesn't quit working outside... EVER! So as these \"outdoor projects\" get underway in the beautiful month of April, I imagine our numbers will dwindle.\r\n\r\nHowever, being the <a href=\"/post/375\">eternal optimist that I am</a>, I don't think our numbers will drop anywhere near as low as December or, dare I say it... February. We have an incredibly strong line-up, and we've already pruned off the majority of our matinees, which would be the hardest hit by an attendance drop due to \"outdoor projects.\" I also think our prime movie slot will move from the 7:00 show to the 9-ish, since that will be the only show that is 100% \"outdoor project\" immune... unless, of course, you grew up in my childhood home, where sunset means it's time to clean all the exterior lights... and mow... again.\r\n\r\nI also think that once the big projects have been completed - garden's planted, bushes' trimmed, yard's reseeded - that our attendance will gradually rise back up with the temperature. Once the dog days of summer hit Springfield, which can begin anytime between January 19th and August 30th, it will be time to sneak back into the air conditioned darkness of The Moxie, have a nice, cold, refreshing beverage, and watch a good movie... or go to a Springfield Cardinal's game, which is exactly what I'll be wanting to do... every single night of the week... home game or no.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-03-31T22:40:17.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "matt",
      "body": "Three extraneous apostrophes in one sentence, awesome!  Good luck through April.  People should see more movies and let grass do its thing.",
      "created_at": "2006-04-01T03:06:24.000Z"
    },
    {
      "author": "Sarah",
      "body": "I just had a thought about The Moxie's publicity.  Why not trade ad space?  You could let businesses advertise on the screen before shows.  In exchange, you could post flyers and movie schedules in their business.  I'm not sure how practical that is, but perhaps it might help.",
      "created_at": "2006-04-01T03:19:59.000Z"
    },
    {
      "author": "Caleb",
      "body": "I think everyone should come see all the movies you've got lined up for April cause they sound awesome. But I ESPECIALLY think everyone should check out Why We Fight before it leaves on Tuesday. Seriously folks, you won't regret it, whatever your political side or lack there of is. Probably the best military/political documentary I've ever seen, with The Fog of War pulling a close second. DO NOT MISS IT!",
      "created_at": "2006-04-01T13:13:36.000Z"
    },
    {
      "author": "Liz",
      "body": "As to extraneous apostrophes, if Dan meant, \"[the] garden [is] planted\" and \"[the] yard [is] reseeded\" then he'd be okay, except that to keep the parallelism, \"[the] bushes [are] trimmed\" would have to be written like \"bushes're\", and that looks funky.  Or probably incorrect.\r\n\r\n*shudder* Did I just comment on someone else's comment?  On <i>grammar</i>?  You'd think that at this hour I'd have something better to do, like sleep.  It must be the peril that April subjects our beloved Moxie to that is keeping me up. Good luck to you.",
      "created_at": "2006-04-01T13:26:10.000Z"
    },
    {
      "author": "evilvet",
      "body": "Dan, your longing to attend every Cardinals game is exactly why The Moxie should embrace KC Royals fans.  Our season will be over in a few weeks, and we should be looking for other evening entertainment options by mid-May.",
      "created_at": "2006-04-01T20:01:34.000Z"
    },
    {
      "author": "bjork24",
      "body": "Liz: that's what I was going for - [the] yard [is] reseeded, [the] garden [is] planted, [the] bushes [is] trimmed. Hmm, that last one doesn't seem to make much sense, do it?",
      "created_at": "2006-04-01T22:28:34.000Z"
    },
    {
      "author": "Matthew Martin (Master RJ)",
      "body": "You should cut a deal with Vintage Stock for late-night films and put calendars there. Moxie + Vintage Stock = $$$$ (or as Invader ZIM says \"Moneys!\")",
      "created_at": "2006-04-02T20:46:51.000Z"
    },
    {
      "author": "Vic Mathis",
      "body": "What does it take to get KY3 and others to review the Moxie films?",
      "created_at": "2006-04-04T05:57:21.000Z"
    },
    {
      "author": "Derek",
      "body": "What does it take to register your theater with Yahoo! Movies?",
      "created_at": "2006-04-04T06:42:42.000Z"
    },
    {
      "author": "bjork24",
      "body": "Vic: I need to send them an e-mail... which I keep forgetting to do.\r\n\r\nDerek: Not much... look <a href=\"http://movies.yahoo.com/showtimes/theater?id=8852&date=20060403\" target=\"_blank\">here</a>",
      "created_at": "2006-04-04T06:44:31.000Z"
    },
    {
      "author": "Brandon",
      "body": "Dan... Have you looked into carrying the <a href=\"http://en.wikipedia.org/wiki/Moxie\" target=\"_blank\">\"Moxie\" soft drink</a>?  I'm sure it'd be a huge hit at your Cinebar.",
      "created_at": "2006-04-04T07:23:59.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
