{
  "id": 389,
  "title": "What's going on at The Moxie these days?",
  "body": "Sorry I haven't written much lately... it's been really busy around these parts. We've been running around trying to get everything ready for the block party on Thursday. We have two hip-hop bands booked (Acumen and Les Izmore), a stage \"tentatively\" rented, a beer kiosk coming from Budweiser, and a hot dog vendor who may or may not show up. Booking movies is one thing, but throwing together an event of this magnitude in a week's time... it's darn hard work, I tells ya. And to top everything off, it looks like we're going to have a gaggle of thunderstorms roll through on Thursday evening, which means I'm going to have to wait to the very last minute to finalize things like beer orders, sound equipment set-up, etc.. Stay tuned for an update on how everything turns out later in the week.\r\n\r\nAs far as other Moxie news goes, we're winding down our runs of THE MATADOR and WHY WE FIGHT tonight. Both movies did extremely well for us, and I really hate to see them go, but I think MRS. HENDERSON PRESENTS is going to help us debunk the \"April sucks\" theory. In fact, I think nearly every movie we have in April is going to do decent business. The more I watch that NIGHT WATCH preview, the more excited I get to see it... and I've seen the preview no less than 12 times at this point.\r\n\r\nOther items:\r\n\r\n+ Red Bull is our newest Cinebar item... not because I think it will be a huge seller for us, but mainly because I'm highly, HIGHLY addicted to them. I love Red Bull <i>almost</i> as much as I love Dr. Pepper and Taco Bell.\r\n\r\n+ Now that baseball season is officially underway, I will be spending even MORE time glued to the computer. If you're a baseball fan, do yourself a favor and check out the \"Game Day\" feature on MLB.com when your favorite team is playing... it's almost as good as watching the game on TV!\r\n\r\n+ Yes, we're really going to be closed on April 18th. Why? Because we want to... and it's the day after Nicole's birthday. As of today, Nicole and I have worked 196 days and only had 3 days off (one for Thanksgiving, one for Christmas, and one on the day the rectifier broke). Holidays don't really count as \"days off\" since we have to spend the majority of the day driving everywhere for family gatherings, and the day the rectifier broke was about as far from a stress-free day off as you can get. I think we deserve one day off that we don't have to worry about the theater. Could we afford to have someone run it for us on that day? Yes, we could, but I'd be worried about things going wrong... and I really don't want to think about the theater at all on our first REAL day off.\r\n\r\n+ Tomorrow at 01:02:03 AM and again at 01:02:03 PM, it will be 01:02:03 04/05/06. Pretty cool, eh? That only happens once every 100 years, so unless the average age of death increases exponentially due to some incredible break-through in medicine, I doubt many of us will live to see it again. I learned that from an e-mail.\r\n\r\n+ Due to salary disputes, MoxieTV episode 4 is going to be delayed.\r\n\r\nAnd that does it for today. It's time to go buy some 70% dark chocolate from the local organic grocery store, and then start the day. Woo hoo!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-04-05T02:11:11.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "i agree",
      "created_at": "2006-04-05T03:37:38.000Z"
    },
    {
      "author": "Caleb",
      "body": "I ate half a bar of Ghirardelli 72% dark chocolate today. It was good, but not nearly as good as the kind you guys buy.\r\n\r\nYay for Red Bull, although I like Full Throttle better myself.\r\n\r\nI don't think <i>anyone</i> has any right to complain about you guys taking a day off. You both work more than anyone I know. So enjoy your first \"real\" day off!",
      "created_at": "2006-04-05T06:46:53.000Z"
    },
    {
      "author": "Jonna",
      "body": "Do I not understand the 72% dark chocolate?  Because I bought some and after eating one piece of it, I think I'm going to use it to make hot chocolate because.. it's just so.. earthy tasting.",
      "created_at": "2006-04-05T08:45:12.000Z"
    },
    {
      "author": "Nate",
      "body": "The Nightwatch preview rocks.  Its one of those that makes you wonder how all these wildly different little snippets are going to fit into a single movie.  I remember thinking that about The Matrix.\r\n\r\nI second the Gameday recommendation.  Office drones take note.  I've been addicted to it since last season.\r\n\r\nA 2 homer Pujols day on opening day, and I am up to 2 whole hits on MLB's fantasy Beat the Streak.  Just 55 more to go before I win $100,000.\r\n\r\nYou cannot make chocolate too dark for me.",
      "created_at": "2006-04-05T18:15:13.000Z"
    },
    {
      "author": "nicole",
      "body": "The darker the chocolate, the better. Has anyone tried those chocolate peppermint cupcakes we started selling? They're dense and chocolaty with a bite of mint. Mmmmm. I want ten.",
      "created_at": "2006-04-05T20:17:33.000Z"
    },
    {
      "author": "Matthew Martin (Master RJ)",
      "body": "I hate dark chocolate. The stuff is just so bland and horrible tasting. And thanks for the April 18th explanation (April 18th wasn't so good because Night Watch will only screen for six days instead of seven).",
      "created_at": "2006-04-05T22:39:56.000Z"
    },
    {
      "author": "Jamie",
      "body": "I am so happy to hear you guys are taking a day off, and because it is the day after the most important day of the entire year.  Nicole's birthday?  or was it Stephanie's, or was it mine?  I'm not sure.  OH WAIT, now I remember, its all of ours!  ",
      "created_at": "2006-04-06T05:50:38.000Z"
    },
    {
      "author": "Matthew Martin (Master RJ)",
      "body": "It's a good thing the Eric Roberts bit wasn't true. It's sucking up to the Julia Roberts empire (grrrr)!",
      "created_at": "2006-04-07T00:23:45.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 17,
      "name": "MoxieTV"
    }
  ]
}
