{
  "id": 39,
  "title": "Call for logos",
  "body": "07.20.04 - S.T.N. (Single Theater Name) seeks attractive, non-smoking logo that likes to hang out on marquees, spruce up drab newsletters, and get caught in the rain. If you think you can complement my uniquely independent and fun-loving nature, please drop me a line. I'd like to start out as friends, but I'm not afraid of committment if the right logo comes along. Are you that special logo? If so, please e-mail me at <a href=\"mailto:the.moxie@gmail.com?subject=I'm the logo for you, Moxie\">The.Moxie@gmail.com</a>...<br/>\t<br/><b>How to repond to a personal</b> - If you'd like to respond or submit a logo to one of the personals above, please use the contact address supplied in the relevant ad. All logos should be submitted in either a .jpeg or .gif format and should not be larger than 150 Kb. We apologize, but due to mailbox limitations we will no longer be accepting wood etchings, copper reliefs, or paper mache submissions. If you submit a logo, the author reserves the right to print it out, fold it up, place it under his or her pillow, and sleep on it. Any and all logos that are submitted may, and most likely will, be displayed online. The author reserves the right to choose a logo that was not submitted through his or her personal, but in the case that a logo is chosen through these means, the winner will receive the following:<br/>\t<br/>1. A large and hardy \"Thank You.\"<br/><br/>2. A GMail invite, assuming that you're one of the last 5 people on Earth who do not already have one.<br/><br/>3. A post devoted to his or her great logo design, including contact information (if winner so chooses).<br/><br/>4. The knowledge that your work will be seen by thousands, if not millions, of sober AND not-so-sober film-goers.<br/><br/>5. Other nifty treats, which may or may not include free movie tickets, a laundry basket, good advice, bad advice, or <a href=\"http://www.thinkgeek.com/caffeine/accessories/5a65/\" target=\"_blank\">caffinated soap</a>.<br/>\t<br/>If you have any questions, please feel free to contact the personal author through the supplied method of contact. Thank you and good luck.<br/>\t<br/><i>This personal is only good through the month of July.</i>",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-07-20T23:00:26.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "James",
      "body": "You and Nicole should have shirts that say, \"Mr. Moxie,\" and, \"Mrs. Moxie\".  Well, you probably shouldn't, but I thought it was a cute idea.<br/><br/>Well, hope everything works out so I can come down there and check it out.",
      "created_at": "2004-07-20T23:24:42.000Z"
    },
    {
      "author": "bjork24",
      "body": "James, I'll wear a shirt that says \"Mr. Moxie\" if you wear one that says \"Mr. Fleur\"... that would be cool!",
      "created_at": "2004-07-20T23:32:13.000Z"
    },
    {
      "author": "Tim",
      "body": "Must ... resist urge ... to submit ... substandard design that will cause ... much laughter and scorn ... in the Dan household ... GAH!  Good luck though, man.  Hopefully someone with design talent will drop one in your lap.  Did you end up drawing one yourself?  I'd be interested to see it.",
      "created_at": "2004-07-20T23:45:54.000Z"
    },
    {
      "author": "bjork24",
      "body": "Tim, I haven't designed one yet. I wanted to see what other people came up with first. You should design a logo, we won't laugh... much. Mwha ha ha. Seriously... ha ha ha!",
      "created_at": "2004-07-20T23:50:53.000Z"
    },
    {
      "author": "whitty",
      "body": "I did a google image search for \"Moxie\"  for logo inspiration and it seems there are a shocking amount of kittens named Moxie.  Also, dogs, show horses, a christian rock band, anime and a champion bull.",
      "created_at": "2004-07-21T00:50:51.000Z"
    },
    {
      "author": "bjork24",
      "body": "All good mascots... each and every one.",
      "created_at": "2004-07-21T01:05:47.000Z"
    },
    {
      "author": "Lor",
      "body": "Just thought I'd write and say that I adore your blog, it's really interesting and makes me wish I could open up my own cinema... <br/><br/>Just wondering, how are you going to choose the logo? Are you and Mrs. Moxie (I love the t-shirt idea, by the way) going to talk it over, or will you make one of those cool flash animations again?",
      "created_at": "2004-07-21T02:45:15.000Z"
    },
    {
      "author": "bjork24",
      "body": "To tell you the truth, Lor, I haven't even thought that far ahead yet. I'm sure I'll figure it out after I get buried in submissions. Thanks for the adoration, by the way! Every little bit helps.",
      "created_at": "2004-07-21T02:58:49.000Z"
    },
    {
      "author": "Ben",
      "body": "Out of curiosity, did you want the logo to include \"theater,\" \"cinema,\" or simply \"the moxie?\"",
      "created_at": "2004-07-21T23:35:41.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ben, preferrably \"The Moxie.\"",
      "created_at": "2004-07-21T23:42:54.000Z"
    },
    {
      "author": "mo",
      "body": "who do the best logo for here [ urlblue] i will invite him/her for gmail towice!!.<br/>thanks from Dan.",
      "created_at": "2004-07-22T18:29:36.000Z"
    },
    {
      "author": "Ben",
      "body": "Dan, in response to your e-mail, I am looking at the school of journalism at MU.",
      "created_at": "2004-07-22T20:25:17.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ben, Nicole knows all about the journalism school at MU (that was her major). Columbia's a great town. Make sure to visit Ragtag, b/c that's the theater we're loosely basing our model off of.",
      "created_at": "2004-07-22T20:33:53.000Z"
    },
    {
      "author": "a",
      "body": "&lt;script&gt;alert()&lt;/script&gt;",
      "created_at": "2004-07-23T03:53:09.000Z"
    },
    {
      "author": "bjork24",
      "body": "Hey everyone, LOOK! It's an unsuccessful hacker! Wah! Run for your lives!",
      "created_at": "2004-07-23T04:34:20.000Z"
    },
    {
      "author": "ARON",
      "body": "HEY.  some of those logos look great.  i especially like the last few.",
      "created_at": "2004-07-23T08:44:13.000Z"
    },
    {
      "author": "whitty",
      "body": "okay, will I be the lamest mutha every if I submit more logos?... I really need a hobby.",
      "created_at": "2004-07-23T21:09:59.000Z"
    },
    {
      "author": "whitty",
      "body": "damn you, no editing!",
      "created_at": "2004-07-23T21:15:13.000Z"
    },
    {
      "author": "bjork24",
      "body": "The more the merrier, I suppose.",
      "created_at": "2004-07-23T21:49:28.000Z"
    },
    {
      "author": "elspeth",
      "body": "Matthew:3<br/>Very biblical, and my choice so far. <br/>e",
      "created_at": "2004-07-24T10:55:27.000Z"
    },
    {
      "author": "Chuck",
      "body": "Note about the logo sample I submitted...you cannot really tell from the pic, but the true colors are:<br/>Moxie body color:  Ruby Red<br/>Moxie outline color:  Navy Blue<br/>The body color: Forest Green<br/><br/>Best on your Logo search!  :)<br/><br/>Chuck",
      "created_at": "2004-07-27T17:42:51.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
