{
  "id": 390,
  "title": "Non-customers say the darnedest things",
  "body": "<b>Dan</b> - Thank you for calling The Moxie, this is Dan.<br/><b>Non-customer</b> - Hi. I have a stupid question.<br/><b>Dan</b> - Okay.<br/><b>Non-customer</b> - I was given a gift certificate for your theater at Christmas, but I looked at your calendar and you're not showing anything that I want to see.<br/><b>Dan</b> - Well, our gift certificates don't expire, so maybe you'll see something you like next month.<br/><b>Non-customer</b> - Well, that's the thing. I've looked at your calendar for the last several months and I didn't see anything that I wanted to watch.<br/><b>Dan</b> - Um hmm. (<i>uncomfortable silence</i>) Well, that's unfortunate.<br/><b>Non-customer</b> - Can I exchange the gift certificate for cash?<br/><b>Dan</b> - Unfortunatley, no. Our gift certificate values are stored in our computer system, so the only way you can redeem them is to buy something.<br/><b>Non-customer</b> - (<i>sounding defeated</i>) Oh. Well, if I come in and watch a movie, and don't like it, can I get the rest back in cash?<br/><b>Dan</b> - No. Our gift certificates store value until they've been used up completely.<br/><b>Non-customer</b> - So what should I do with it then?<br/><b>Dan</b> - Maybe you should give it back to the person who gave it to you.<br/><b>Non-customer</b> - Or maybe I'll throw it away.<br/><b>Dan</b> - You could do that too.<br/><b>Non-customer</b> - Okay. Thanks for your help!<br/><b>Dan</b> - You're welcome.<br/><b>Non-customer</b> - Goodbye.<br/><b>Dan</b> - Bye bye.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-04-05T23:46:58.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "erin",
      "body": "if i were him i would come in and stock up on popcorn. umm. yummie moxie popcorn.",
      "created_at": "2006-04-06T00:23:12.000Z"
    },
    {
      "author": "evilvet",
      "body": "Briilliant! A cash strapped movie theatre sells gift certificates which are presented to people who don't like to see movies.  I'd say today is your lucky day.  ",
      "created_at": "2006-04-06T00:40:58.000Z"
    },
    {
      "author": "Nate",
      "body": "Too bad you can't redeem them for taste!",
      "created_at": "2006-04-06T03:30:14.000Z"
    },
    {
      "author": "Nate",
      "body": "Too many people have this simple equation:<br/><br/>Lack of multi-million dollar marketing campaign building my awareness during prime time commercial slots = BAD MOVIE.<br/><br/>I haven't heard of it.  How could it not be bad?",
      "created_at": "2006-04-06T03:31:45.000Z"
    },
    {
      "author": "Brandon",
      "body": "That's sad.  Oh well.<br/><br/>On another note, have you looked into carrying the <a href=\"http://en.wikipedia.org/wiki/Moxie\" target=\"_blank\">\"Moxie\" soft drink</a>?  I'm sure it'd be a huge hit at your Cinebar.",
      "created_at": "2006-04-06T04:23:39.000Z"
    },
    {
      "author": "Caleb",
      "body": "Dan...that was me. I know I work there and everything but I just do it for the free popcorn. I really don't have any desire to see any of those movies you show in your theater.<br/><br/>Now if you'll excuse me I have to go buy my pork rinds and 24-pack of Budweiser before Nascar starts...",
      "created_at": "2006-04-06T07:18:35.000Z"
    },
    {
      "author": "matt",
      "body": "for people like this, you should just suggest craft projects like coasters or birdfeeders that can use the gift card.  honestly, what a tool.  although if you have so little taste that you can't see a single movie in several months of moxie programming that you'd like to see, how would you fool a friend who DOES like the moxie into thinking you deserved a gift of any kind?",
      "created_at": "2006-04-06T08:32:43.000Z"
    },
    {
      "author": "steph v. horn",
      "body": "We just had a situation like that at the cookie shop. She got a bouquet as a gift from someone and didn't like the cookies and wanted money back...but, since she wasn't the one who bought the cookies, we couldn't give her money. When we asked to refund the person who actually paid for the gift, she said we shouldn't do that because she didn't want them to know she didn't like the cookies.<br/><br/>I think they're are just some really difficult people in the world.",
      "created_at": "2006-04-06T19:45:35.000Z"
    },
    {
      "author": "duanekeys",
      "body": "What's even more sad is someone though this person actually *did* have taste...  enough to go buy them a moxie gift certificate anyway.",
      "created_at": "2006-04-06T16:00:59.000Z"
    },
    {
      "author": "nicole",
      "body": "They probably decided to come in since that phone call, LOVED the movie they saw, and are now devoted Moxie-teers. And read the blog every single day. Am I right? Who knows.",
      "created_at": "2006-04-06T19:54:35.000Z"
    },
    {
      "author": "Matthew Martin (Master RJ)",
      "body": "People who make crap like the \"When A Stranger Calls\" and \"The Shaggy Dog\" remakes hits should not be getting Moxie certificates. If I were you, I would have seduced him or her into \"The Matador\" as an introduction to the wonderful world of art film.",
      "created_at": "2006-04-07T00:21:38.000Z"
    },
    {
      "author": "lincoln",
      "body": "Dan - In the future, please gather all the vital information you can so they can be tagged and herded to the local alien abduction site. If we must be probbed let the mindless ones go first.  thanks",
      "created_at": "2006-04-15T04:11:49.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 14,
      "name": "Dialogue"
    },
    {
      "id": 16,
      "name": "Customers"
    }
  ]
}
