{
  "id": 391,
  "title": "Block Party... is it still on?",
  "body": "<b>10:45 AM -</b> 9 hours and 15 minutes away\r\n\r\nThe sky is a nice grayish green with tendrils of lightning along the horizon. The National Weather Service upgraded their warning from \"severe weather watch\" to \"EXPLOSIVE severe weather watch.\" If there's two things you don't want upgraded to explosive, it's extreme weather and diarrhea.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/040606/blob1.jpg\" width=\"425\" />\r\n\r\nAs you can see, a giant blog of mighty percipitation is headed our way (see Springfield up in the top right corner). Storm systems move NE out of Texas and Oklahoma, which puts us right in line to get hit by this one later in the evening. I'll make the final call at 4:00 pm, but it doesn't look like this storm is getting any smaller.\r\n\r\nStay tuned for more updates throughout the day.\r\n\r\n<b>11:55 AM -</b> 8 hours and 5 minutes away\r\n\r\nStill crappy outside. I think the first storm, of what looks like many, is about to hit. Maybe if they all go through this afternoon, they'll be done by the evening... \r\n\r\n<b>2:15 PM -</b> 5 hours and 45 minutes away\r\n\r\nWell, we're being blanketed with a slow, steady layer of rain. According to the radar, the current system is on it's way out, but the big stuff hasn't happened yet. See here:\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/040606/blob2.jpg\" width=\"425\" />\r\n\r\nLooks promising, doesn't it! Then I read this bulletin from the News-Leader: <i>Stronger thunderstorms are expected to develop quickly late this afternoon over eastern Kansas and Oklahoma. The weather service predicts this line of storms will move across the Kansas-Missouri state line between 5 and 9 p.m., crossing the U.S. 65 corridor </i>[ That's Springfield ]<i> between 7 and midnight and reaching Rolla and West Plains around 9 to midnight. The thunderstorms will move quickly across the Ozarks tonight and leave the area by around midnight, although strong to severe thunderstorms also are possible Friday afternoon, the weather service said.</i>\"\r\n\r\nSo, what should I do? The rain is starting to let up, which gives me a false hope. I know as soon as I call everything off, the clouds will part, the wind will die down, a beach will instantly appear in our parking lot, and it will be amazingly beautiful. If I cancel this thing, I want to see some really crappy weather to validate the decision.\r\n\r\nDamn Missouri weather. I'm going to give it one more hour before we make the final call.\r\n\r\n<b>4:00 PM -</b> 4 hours away\r\n\r\nSure enough... as soon as it clears up and starts to look promising, another crop of storms EXPLODES in Eastern OK and KS. Damn Missouri weather in April! So, we're going to go ahead and call it off. We can't run the risk of having all kinds of electrical equipment sitting outside, along with a large group of people standing around outside when a storm decides to blow in. With as fast as these storms move, we'd barely have time to get everyone inside... if we could even FIT everyone inside. I'm mad! Budweiser was going to have a promotional girl drop by to give away free t-shirts and everything.\r\n\r\nI guess we can try again in May... have a delayed block party. Tornado or not, the show is still running at 10:00 pm for $5.00 per person, and it will continue to run once a day for the next five days. Sorry we had to cancel, guys... we'd rather be safe than sorry, right?\r\n\r\nI'll give another update later in the evening and let you know if anything actually happens.\r\n\r\n<b>6:30 PM -</b> 1 hour and 30 minutes away\r\n\r\nIf we were still having the event, we would be building the stage right now. Currently the sky is filled with gray clouds, and the temperature is dropping quickly as the wind picks up. Oklahoma is quickly filling up a full brew of storms that I imagine will hit here sometime between 8:00 and 9:00 tonight. I think the crappy weather is going to kill our attendance today, but that'll be okay as long as we're vindicated for canceling the block party. More later.\r\n\r\n<b>12:00 AM -</b> well past the time\r\n\r\nIt looks like the killer storm passed us by. I've said it once, and I'll say it again: damn Missouri weather!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-04-06T19:47:52.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "springer brother of the justin variety",
      "body": "explosive weather and explosvie diarrhea...sounds painful.  i hope that storm passes through. def been looking forward to the ole block party, plus its my bro's brithday so i keep telling him that the moxie is actually throwing him a birthday party. dang crazy weather!\r\n\r\n-justin",
      "created_at": "2006-04-06T21:52:50.000Z"
    },
    {
      "author": "Liz",
      "body": "We're having ill-timed and frustrating weather in SLC, too.  Non-stop snow since 5 AM. Hope eveything works out for you!",
      "created_at": "2006-04-06T23:13:12.000Z"
    },
    {
      "author": "Melinda",
      "body": "Oh Dan and Nicole, I don't envy your decision.  It's a real nail-biter.  Right now the sun is shining over my office in southern Springburg after a steady rainfall, but the clouds beyond the sun are very dark.  \r\n\r\nI hope the stress from this doesn't give you anything explosive.",
      "created_at": "2006-04-07T00:06:37.000Z"
    },
    {
      "author": "Matthew Martin (Master RJ)",
      "body": "It stopped raining in Nixa, so it will probably stop in Springfield too.",
      "created_at": "2006-04-07T00:18:40.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yes. It's stopped here, but that doesn't mean anything. From the NWS: <i>Substantial clearing is occurring ahead of the dry line, which will increase the instability available for the storms as they form in Kansas and Oklahoma .  As the storms move into southern Missouri and northern Arkansas  this evening, they will have a relatively high potential to produce tornadoes, some of which could be strong and long-track.</i>",
      "created_at": "2006-04-07T00:31:13.000Z"
    },
    {
      "author": "nicole",
      "body": "Hey - at least I have a noise permit until 11pm. Thanks City of Springfield for the quick turnaround (it normally takes about 30 days, and they helped us obtain one in under 7).",
      "created_at": "2006-04-07T01:24:07.000Z"
    },
    {
      "author": "springer brother of the justin variety",
      "body": "i'm just going to go be loud in the parking lot then. like get one of those loud speaker thingys and just talking...about nothing. i'm just going to talk loudly in non-sensical ramblings. def need to reschedule it though. may would be great! although with missouri weather it will probably like snow or something stupid.\r\n\r\n-justin",
      "created_at": "2006-04-07T02:20:26.000Z"
    },
    {
      "author": "Matthew Martin (Master RJ)",
      "body": "Rather safe than sorry? I thought it was fun to hurt and kill people due to bad weather.",
      "created_at": "2006-04-07T02:45:07.000Z"
    },
    {
      "author": "Melinda",
      "body": "Well, hellz bellz.  It's about 9:30 now, and my whole system is thrown off whack.  My \"buddy with a basement\" invited me over for some dinner and to ride out the storm with her.  I think we're all just a wee bit gun-shy in these parts right now.  Heck, don't blame us with all the shocking destruction that's happened in the last month so close.  So close... so close, but yet so far.\r\n\r\nAnywhoooo.... I packed a quickie tornado emergency kit (my Daddy's Gibson guitar, two bottles of wine, a battery-powered radio and flashlight, a sarong, and Yahtzee.  And I'll be danged.... nothing.  Just a few sprinkles and a wee bit of lightning.  I think the big stuff is going to come after we're supposed to be sleeping.  \r\n\r\nGnarls to Mother Nature.  \r\n\r\nIf you read this in time, do as Lord Springer says and go make some noise outside.  Yelp and howl.  Fart and giggle.  Blow a harmonica badly.  Milk that noise permit, baby.",
      "created_at": "2006-04-07T06:43:06.000Z"
    },
    {
      "author": "nicole",
      "body": "I don't even want to talk about last night. But we did have a nice turn out for the film. Gotta look on the bright side, I guess. ",
      "created_at": "2006-04-08T01:09:56.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
