{
  "id": 392,
  "title": "I really, really hate taxes",
  "body": "I've <a href=\"/posts/198\">said it once</a>, and I'll say it again: I hate taxes. My total income for this year was well below poverty level, but I don't think that matters... for whatever reason. I know little to nothing about taxes, but my sister does (she's a CPA). So another year, another HUGE tax payment. With the money we spent on taxes this year, I could've... bought... something... pretty big.\r\n\r\nAND to make my day even worse, I just received this e-mail from the good people at ConAgra:\r\n\r\n<i>Dear Mr. Chilton,\r\n\r\nThank you for contacting us.  We are always pleased to hear from our consumers but are sorry to inform you that we no longer produce Rosarita Enchilada Meals.\r\n\r\nAs consumers' preferences for products change, so do the varieties of our products.  Only the products with the greatest consumer appeal remain on the store shelves over time.  Unfortunately, the product you inquired about did not have enough consumer interest for us to continue manufacturing it.  The products we currently offer are those that have the greatest consumer demand.\r\n\r\nWe appreciate the time you have taken to contact us and your interest in our products.\r\n\r\nSincerely,\r\nConAgra Foods Consumer Affairs</i>\r\n\r\nI can't put into words how good Rosarita's enchiladas were. I'm tearing up just thinking about it. Nicole makes a pretty good version of the Rosarita-brand enchiladas, but it's just not the same. Why is the world against me?\r\n\r\nMoxieTV episode four just finished filming, so it should be ready in the very near future (i.e. later tonight). Now, I'm off to eat at Chic-fil-a!!!!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-04-10T21:33:12.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Luke",
      "body": "Ugh.  Tell me about it.\r\n\r\nNot only do I hate taxes for the same reasons you do (i.e. paying them), I hate them for the same reason your sister probably does...I'm a CPA.  This time of year sucks.\r\n\r\nI always make time for new Moxie posts, and Moxie TV episodes.  Go Moxie!",
      "created_at": "2006-04-10T23:40:28.000Z"
    },
    {
      "author": "brian of moore",
      "body": "is it jsut me.. or are the comments being weird for everyone lately?\r\nthis post says it has seven comments.. but im only seeing one from luke\r\n\r\non the last post.. i tried to leave a comment\r\ni tried twice... but i never saw it show up\r\nfor a little while it said there were 11 comments.. but i never saw mine... now it says 10 comments\r\n\r\n... i think im losing it",
      "created_at": "2006-04-11T00:07:37.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks for pointing that out Brian. My blog gets hit by an unusually high amount of comment spam, so I have to keep updating my spam-blocking functions. If you leave a comment and find that it doesn't show up, just try writing again... without the word Vi@gr@.",
      "created_at": "2006-04-11T00:18:25.000Z"
    },
    {
      "author": "nicole",
      "body": "If you all haven't tried the Rosarita enchilada kit, you missed something great. I am getting pretty sick of my favorite items being discontinued.",
      "created_at": "2006-04-11T01:35:54.000Z"
    },
    {
      "author": "nicole",
      "body": "Dan just made fun of me for saying \"you all.\"",
      "created_at": "2006-04-11T01:40:13.000Z"
    },
    {
      "author": "Fyse",
      "body": "Y'all should've become career students. No taxes for me! That said, I'm gonna be in the real world from July (for one year at least) so taxes both council and income await...\r\n\r\nDan, I presume you've considered adding one of the swirly letters things, and decided against it? I for one don't mind the additional hassle, since it's a pretty full proof system. Would take the pressure off you constantly changing filter settings, after all.",
      "created_at": "2006-04-11T02:09:04.000Z"
    },
    {
      "author": "bjork24",
      "body": "Indeed Fyse, I have considered the random image thing... but some of the spam is done by hand... by a person... or a half-robot / half-person. I hate comment spammers. Maybe I'll use this: <a href=\"http://www.thepcspy.com/kittenauthtest\" target=\"_blank\">KittenAuth</a>",
      "created_at": "2006-04-11T02:11:42.000Z"
    },
    {
      "author": "Fyse",
      "body": "Some comment spam is done by hand? Good grief, I had no idea. What a depraved and soul destroying job...\r\n\r\nThe kitten thing is genius. Go with it. Or even better, use some of your copious free time to build your own moxie-fied version! Shouldn't be too tricky, and having a unique anti-spam system can only be a good thing.",
      "created_at": "2006-04-11T02:58:19.000Z"
    },
    {
      "author": "justin",
      "body": "you should use that <a href=\"http://www.thepcspy.com/kittenauthtest\">kitten authentication</a> for the comments!",
      "created_at": "2006-04-11T04:56:34.000Z"
    },
    {
      "author": "Caleb",
      "body": "Once I tried posting a link without any text. It was like \"Click Here\" or \"Watch This\" and it was linked. And the Moxie Blog put up its armor and kicked my comment to outer space. Needless to say, I learned my lesson, and I never messed with the Moxie Blog again.\r\n\r\nUntil today...",
      "created_at": "2006-04-11T06:42:01.000Z"
    },
    {
      "author": "Caleb",
      "body": "Be convenient and get <a href=\"http://www.apple.com/trailers/paramount_classics/aninconvenienttruth/trailer/\">this </a> unconvenient movie. Please.",
      "created_at": "2006-04-11T09:08:27.000Z"
    },
    {
      "author": "Caleb",
      "body": "Oh geez, I meant <i>inconvenient</i>. Douche bag strikes again.",
      "created_at": "2006-04-11T09:09:35.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<a href=\"http://kittenwar.com/\">Kitten War?</a>\r\n\r\nOh, AUTHENTICATION.  Close.  :) ",
      "created_at": "2006-04-11T17:00:54.000Z"
    },
    {
      "author": "Laurali",
      "body": "Well Dan if it makes you feel better the Cards did win their first game in the new Busch Stadium....",
      "created_at": "2006-04-11T17:48:28.000Z"
    },
    {
      "author": "Caleb",
      "body": "Great episode of MoxieTV. The music fit perfectly too. So for the Three Burials episode I think Dan should be BURIED ALIVE after saying \"You stay classy Springfield.\" What do you think?",
      "created_at": "2006-04-12T00:47:18.000Z"
    },
    {
      "author": "Amy",
      "body": "Yes, taxes suck.  I wouldn't mind paying mine and my husbands so much, except my accountant is always saying, \"just get me that dependent's social security  number and it'll be okay,\" and then laughs at me when I suggest that the beagle and the corgi and the two cats, are ipso facto, dependents.\r\n\r\nWhy did Bush need a raise again?",
      "created_at": "2006-04-19T08:10:13.000Z"
    },
    {
      "author": "Jess",
      "body": "Enough about taxes.  To replace these obsolete enchiladas you should try a quesa-diller from The Acoustic Cafe.  They're delicious and well worth your dollar!",
      "created_at": "2006-04-20T19:48:40.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
