{
  "id": 394,
  "title": "Your moment of Zen",
  "body": "Well, there's not much going on at the ol' teatro today. NIGHT WATCH starts tonight at 9:15 pm, which I'm hoping will bring in the same size crowds that PULSE did. MRS. HENDERSON PRESENTS had a solid first week... although it was one of our worst weeks for concession sales. It seems there's a reverse correlation between age and concession spending... or maybe it's just the weather. All I know is that this is one of the worst \"concession movies\" we've had since LADIES IN LAVENDER. Wait a minute! It's Dame Judi Dench! She's a concession killer!!!\r\n\r\nAnd in our personal lives:\r\n\r\n+ Nicole and I are SUPER excited for our day off next week. We're planning on taking a little day trip up to St. Louis for some much needed R&R&R (rest, relaxation, and Rr. Pepper). On the itinerary: eating at some of our favorite restaurants (Stir Crazy, California Pizza Company, Lion's Choice), shopping at some of our favorite stores (Trader Joe's), and visiting some of our favorite old haunts (the zoo, downtown, the new stadium, etc.). I can't wait!\r\n\r\n+ I've had a bit of trouble getting motivated lately, and I've decided that the best way to pull myself out of this unproductive stupor is to jump headlong into several intensive side projects. I'll finally be fulfilling a long-held agreement to help Aaron (our graphic designer dude) redesign and update his website. Also on my list of side projects: writing a book, building something out of wood, listening to more of the Beach Boys' post-80s albums, deciphering the secret of LOST, turning lead into gold, and, finally, learning to eat spicier foods.\r\n\r\n+ We've been \"moving\" out of our house for well over a month now. I think my parents are starting to get annoyed at the pace of our progress, but my GAWD... it's just so frustrating! We're literally getting rid of over 50% of our belongings. We trimmed our personal library from over 1,000 books down to less than 200; we're getting rid of several bookcases, our futon, our piano, our TVs (both of them), one of our two beds, etc.. I just don't understand how we managed to accumulate so much crap over the course of one year. I'm not even sure where all the stuff came from!\r\n\r\nYou know when you lose something and there's absolutely ZERO explanation as to where it could've gone? You say, \"I know I left those scissors on top of the microwave. They were just there a second ago! Where in the hell are they!\" Well, now you know... they're in our house. No matter where you are, or what you've lost, it all ended up somewhere in our house. Seriously. It's insane.\r\n\r\n+ Occasionally, when a film ends before midnight on a weekday, Nicole and I are able to slip away and enjoy ourselves. Of course, nine times out of ten, we slip away to bed and enjoy ourselves by watching either LOST, Amazing Race, or The Office on the laptop... but sometimes we actually go OUT and do something youthful - like throwing back a couple beers and belting out some classic Elvis.\r\n\r\n[ VIDEO NO LONGER EXISTS ]\r\n\r\nLet's face it - I've got more moves than U-Haul. Did you see the swivel in my hips? Amazing. Simply amazing. Ok, it's time for intermission... I better go. I'm typically not prone to delving into our private lives on the blog (with a <a href=\"/posts/95\">few</a> <a href=\"/phlogs/1\">notable</a> <a href=\"/posts/241\">exceptions</a>), but I was feeling generous today... and now you're probably feeling bored.\r\n",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-04-13T05:21:59.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "Hahaha...pistachios. \r\n\r\nSpeaking of decoding Lost, hope you guys watch tonight's episode by Friday or Saturday so we can discuss it like the Lost junkies we are. It didn't offer much but what it did offer was at least intriguing. And we have to wait until MAY for another new episode.",
      "created_at": "2006-04-13T06:59:14.000Z"
    },
    {
      "author": "Maddy",
      "body": "Mr. Eko, I like you just the way you are...",
      "created_at": "2006-04-13T07:11:58.000Z"
    },
    {
      "author": "Caleb",
      "body": "Who would have thunk it...<i>Charlie</i> (or <i>Chaaahhlee</i> in Claire dialect) in love with Mr. Eko?!",
      "created_at": "2006-04-13T07:26:16.000Z"
    },
    {
      "author": "Brandon",
      "body": "\"All Shook Up\" was a song the middle school all-boys' after-school choir sang, and I was subjected to it three years in a row:  '98, '99, '00.",
      "created_at": "2006-04-13T07:58:43.000Z"
    },
    {
      "author": "Ole",
      "body": "You had to bring up the pistachio incident again.  How about some drunk dialing stories?  or do you promise to offer stories about Nicole's birthday celebration on your day off next week?",
      "created_at": "2006-04-13T11:26:25.000Z"
    },
    {
      "author": "Fyse",
      "body": "Bored? Not in the least. Perhaps a little disturbed by the hips though.",
      "created_at": "2006-04-13T13:09:03.000Z"
    },
    {
      "author": "Fyse",
      "body": "Whoops. Sorry about that.",
      "created_at": "2006-04-13T13:09:50.000Z"
    },
    {
      "author": "Nate",
      "body": "How come I get scolded for not providing a SPOILER warning but Caleb doesn't?  Huh?\r\nSpoiler alert, Caleb!  I haven't seen it yet!\r\nNow, I'm off to check insidethehatch.com for clues!",
      "created_at": "2006-04-13T16:30:43.000Z"
    },
    {
      "author": "Nate",
      "body": "I like how Dan attempts to lower his voice to something approaching an Elvis-like register from his normally girlish squeal.\r\n\r\nAnd you really need to get those hips into it!  That was rather lackluster hipsterism.",
      "created_at": "2006-04-13T16:33:20.000Z"
    },
    {
      "author": "Fyse",
      "body": "Don't worry Nate, Caleb's only joking. Actually it's Locke and Jack that get it on.",
      "created_at": "2006-04-13T17:40:15.000Z"
    },
    {
      "author": "nicole",
      "body": "I just now got to reading the blog, so yeah. No spoilers! I'm a day behind! Geesh.",
      "created_at": "2006-04-13T21:15:57.000Z"
    },
    {
      "author": "Caleb",
      "body": "Hahaha, I wouldn't dare spoil such a daring, romantic love affair like the one between Charlie and Mr. Eko, but it's just too good not to spoil! \r\n\r\nAnd Fyse, this theory about Locke and Jack is intriguing. You should develop this theory. Maybe Bernard even has something to do with it too, eh? ",
      "created_at": "2006-04-14T03:11:58.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
