{
  "id": 395,
  "title": "Lysol Sanitizing Wipes: How I Love Thee",
  "body": "<img src=\"http://moxie.danchilton.com/pix/grum/041306/lysol.jpg\" width=\"425\" /><br/><br/>Let me start this post by stating, unequivocally, that I am NOT a corporate shill... though I am willing to listen to any and all offers.<br/><br/>I love Lysol's Disposable Sanitizing Wipes. As a business owner, I'm faced with two distinct challenges every single day: 1) getting customers through our doors, and 2) cleaning up poorly-aimed urine from around the toilets. These faintly scented wipes protect my delicate hands from the vile ickiness of the toliet bowl... AND they're flushable!<br/><br/>And if that weren't enough, they also make for great facial cleansing wipes*!<br/><br/>*NOTE: This statement is not true, and Moxie Cinema will not be held liable for injuries stemming from the use of Lysol-brand Sanitizing Wipes on one's face.<br/><br/>Uh oh! Customers are here... I gotta run. Viva La Lysol!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-04-14T03:31:40.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nicole",
      "body": "Uh...Dan...those things aren't flushable. ",
      "created_at": "2006-04-14T06:26:58.000Z"
    },
    {
      "author": "brian of moore",
      "body": "but you wont find that out until the plummer finds the huge backup of wipes in the pipes<br/><br/>until then... keep flushing!... <br/>at least get your moneys worth when he has to come fix it",
      "created_at": "2006-04-14T09:03:05.000Z"
    },
    {
      "author": "Caleb",
      "body": "Dan and Nicole, you two crack me up.",
      "created_at": "2006-04-14T09:29:33.000Z"
    },
    {
      "author": "brian of moore",
      "body": "moneys....... gah.. ... i obviously meant to type \"monkeys worth\"",
      "created_at": "2006-04-14T11:20:00.000Z"
    },
    {
      "author": "nicole",
      "body": "Biran - there is a plumber out there with a monkey for his logo. So that works just as well!",
      "created_at": "2006-04-15T02:10:26.000Z"
    },
    {
      "author": "erin",
      "body": "when i was in 5th grade i wrote a company that made off brand mac and cheese. i got lots of coupons for free mac!<br/><br/><br/>.... the thing about those sort of wipes is you (or at least i) tend to use more than is probably nessisary. its difficult to scrunch them to get the most usage. once there is little grim and grit you have to turn it around.. and then again. but there isnt that much cloth to work with.<br/><br/>yep.",
      "created_at": "2006-04-15T07:59:01.000Z"
    },
    {
      "author": "Caleb",
      "body": "Do you guys know if that new movie <i>American Dreamz</i> is going wide release? If not, you should try to pick it up for May. It looks hilarious. I'm a satire junkie though.",
      "created_at": "2006-04-15T08:16:27.000Z"
    },
    {
      "author": "Caleb",
      "body": "You guys should try to get <a href=\"http://www.youtube.com/watch?v=kfwnEVCwqsM\">this movie</a> this summer!",
      "created_at": "2006-04-15T21:30:50.000Z"
    },
    {
      "author": "kyle",
      "body": "it should be noted that the plumber to which nicole refers not only has a chimp logo he also frequently has a real, live ape in the truck with him.  the ape's name is jo jo.  this is not b.s.  it's true.  ",
      "created_at": "2006-05-10T01:29:50.000Z"
    },
    {
      "author": "Lysandra",
      "body": "silly dan. but my nickname is Lysol and that makes me smile :)<br/>",
      "created_at": "2006-07-11T18:43:27.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
