{
  "id": 396,
  "title": "MoxieTV Episode #5",
  "body": "MoxieTV Episode #5 has been posted... so go <a href=\"/episodes/5\">check it out!</a>",
  "author_id": 3,
  "allow_comments": 1,
  "created_at": "2006-04-18T21:13:44.000Z",
  "author": "Justin",
  "comments": [
    {
      "author": "Nate",
      "body": "Another great one!\r\n\r\nYou guys are starting to accumulate Pixar-like reputation.\r\n\r\nOne of you is going to have to make a dud before too long...it just hasn't happened yet.",
      "created_at": "2006-04-19T00:57:25.000Z"
    },
    {
      "author": "erin",
      "body": "bravo.",
      "created_at": "2006-04-19T02:52:00.000Z"
    },
    {
      "author": "J.D. from the N.S.",
      "body": "i love watching these.  keep up the good work.\r\n\r\nand i can't believe that you some how split in two while falling out the window but magically rejoined when you hit the ground",
      "created_at": "2006-04-19T08:08:41.000Z"
    },
    {
      "author": "brian of moore",
      "body": "davinci remake = flippin hilarious",
      "created_at": "2006-04-19T08:22:16.000Z"
    },
    {
      "author": "Caleb",
      "body": "Funniest...episode...ever.\r\n\r\nGranted there are only 5 to pick from, but still...\r\n\r\nThe Da Vinci Code bit woke up my neighbors though. Technically you could say it was my LAUGHTER that woke them up, but I still blame you guys. ",
      "created_at": "2006-04-19T09:20:43.000Z"
    },
    {
      "author": "justin",
      "body": "thanks for the comments!\r\n\r\nas crappy as we (purposely) made the dummy who fell out of the window, we still scared the bajesus out of some woman who happened to be walking by as we threw it out.  She thought it was a real person until it hit the ground and its head made out of a balloon exploaded.",
      "created_at": "2006-04-19T16:23:37.000Z"
    },
    {
      "author": "Caleb",
      "body": "April 27 is Secretary's Day. Wouldn't it have been cool to have a special screening of Secretary that night? Something to keep in mind for next year though...",
      "created_at": "2006-04-19T19:43:12.000Z"
    },
    {
      "author": "Bitter Pencil Pusher Says:",
      "body": "That's Administrative Assistant to you, pal.  Besides, I'll be getting hammered at TGIFridays with the rest of my fellow administrative assistants.  Think I want to see a movie?  I barely have time to watch the back issues of Desperate Housewives I've TiVO'd!",
      "created_at": "2006-04-19T20:37:33.000Z"
    },
    {
      "author": "Caleb",
      "body": "Excuse me Mr./Mrs. Politically Correct, I guess I just figured not all Administrative Assistants choose to get \"hammered\" on Secretary's Day. And why would you even be celebrating it if you're too high and mighty to call yourself a secretary anyhow?",
      "created_at": "2006-04-19T21:20:23.000Z"
    },
    {
      "author": "Nate",
      "body": "Uh, Caleb, I think, I THINK, Bitter Pencil Pusher is poking fun at the whole lifestyle of the administrative assistant:  the Desperate Housewives watercooler talk and the drunken tables of thirtysomething women drinking Strawberry Margaritas out of glasses the size of goldfish bowls, secretly hating their 22 year old waitress.  In other words, I think it was meant to be self deprecating.  I could be wrong though.\r\n\r\nAnd no that wasn't me...though I'm more familiar with the lifestyle than I'd like.  Switch Desperate Housewives out with Lost and I ain't got far to go.",
      "created_at": "2006-04-19T23:34:42.000Z"
    },
    {
      "author": "Derek",
      "body": "Any chance that the MAGG MST3K will be recorded? I have to play with the University Band during the event :-(",
      "created_at": "2006-04-19T23:41:47.000Z"
    },
    {
      "author": "Derek",
      "body": ".....By which I mean I'll be playing timpani as a part of the band, not, um, playing with the band members.....or whatever other double entendres you might like to use there.",
      "created_at": "2006-04-19T23:43:39.000Z"
    },
    {
      "author": "Melinda",
      "body": "Wow, you're lifting the creativity and hilarity bar pretty high for yourselves.  Thanks for once again bringing chuckles to my work-a-day state of mind.\r\n\r\nNice skivvies.\r\n\r\nDid you guys enjoy your St. Louis day trip?  I didn't realize there are Trader Joe stores in St. Louis!!!  I'm soooooo hoping they'll extend their reach this way.  I bleepin' love that store!",
      "created_at": "2006-04-20T00:10:02.000Z"
    },
    {
      "author": "Bitter Pencil Pusher",
      "body": "Now I would come to downtown to see that 9 to 5 movie.   I just love that Dolly Parton.  Now there was a movie, not like the crap they're showing nowadays.",
      "created_at": "2006-04-20T01:12:35.000Z"
    },
    {
      "author": "Caleb",
      "body": "9 to 5 is a feminist liberal piece of CRAP that only served as a voice for women in the workplace - and we all know how THAT has turned out. And Dolly Parton has enough talent for Branson maybe, but I wouldn't go past that.\r\n\r\n(I kid people, I <i>kid</i>...Branson is too good for Dolly).",
      "created_at": "2006-04-20T07:45:19.000Z"
    },
    {
      "author": "Caleb",
      "body": "Possible <a href=\"http://www.apple.com/trailers/magnolia/thelostcity/trailer/\">movie option</a> for May?",
      "created_at": "2006-04-20T08:36:00.000Z"
    },
    {
      "author": "Caleb",
      "body": "Ooh, and <a href=\"http://www.apple.com/trailers/lions_gate/leonardcohenimyourman/large.html\">this one</a> too, though probably not for May. Of course it <i>is</i> another music documentary, but it looks so good! And any movie with Rufus Wainwright singing in the trailer has got to be good.",
      "created_at": "2006-04-20T08:42:10.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<i>And any movie with Rufus Wainwright singing in the trailer has got to be good.</i>\r\n\r\nRW <b>and</b> Nick Cave.  I'd probably go see this one. ",
      "created_at": "2006-04-20T17:08:29.000Z"
    },
    {
      "author": "Rachel",
      "body": "Dear god...I loved that movie.",
      "created_at": "2006-04-21T03:42:24.000Z"
    },
    {
      "author": "JL",
      "body": "This is so totally off-topic, but what's with the Dolly-bashing, Caleb?  Granted, her films have not been Cannes-worthy, but as a musician, she's sheer genius.  Be careful, or you may find yourself being chased through the streets of Springfield with blazing torches!  I'd be leading that chase, but I'd probably be too busy joining \"bitter pencil pusher\" downing margaritas and doing karaoke to \"Jolene.\"",
      "created_at": "2006-04-22T01:20:48.000Z"
    },
    {
      "author": "Caleb",
      "body": "Ever hear of satire JL? I think Dolly is great, and sheer genius as a musician indeed. ",
      "created_at": "2006-04-22T11:02:40.000Z"
    },
    {
      "author": "Scott",
      "body": "hey, the moxie tv thing is awesome.\r\nyou guys really do a great job.\r\nwe practice across the street and its become a practice to just walk over after practice and enjoy a movie.\r\n\r\nthank you for the moxie!",
      "created_at": "2006-04-23T21:19:45.000Z"
    }
  ],
  "categories": [
    {
      "id": 17,
      "name": "MoxieTV"
    }
  ]
}
