{
  "id": 397,
  "title": "48 Hour Film Challenge",
  "body": "I'm not dead... just buried in Team Moxie's 48 Hour Film Challenge. We have until 8:02 pm on Sunday to complete a 5 minute film. Wish us luck! I'll have more to report on Monday.<br/><br/>Also, there's a new spam detection tool on the comment form. Let me know if you have any problems with it. I don't want it to be intrusive, but I had to do something... I was getting well over 2,000 spam comments a day.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-04-22T08:03:05.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Fyse",
      "body": "Nice work Dan. Thanks to a previous post of yours, I even know what 'flipping someone off' means. Is there a random selection of questions?",
      "created_at": "2006-04-22T12:07:52.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Leave it to you to make even the Spam Filter entertaining.  <br/><br/>Apple. Apple. Apple. Lump of used coal. Apple. <br/><br/>Nice, on so<b>many</b> levels. ",
      "created_at": "2006-04-22T16:53:08.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Ummm.  I use spaces before I <b>bold</b>.  Really. ",
      "created_at": "2006-04-22T16:54:09.000Z"
    },
    {
      "author": "bjork24",
      "body": "Fyse: yes, the questions are randomized.",
      "created_at": "2006-04-22T18:57:41.000Z"
    },
    {
      "author": "Amanda",
      "body": "I love it! So much better than word verification on blogger.",
      "created_at": "2006-04-22T20:35:54.000Z"
    },
    {
      "author": "Caleb",
      "body": "Dan, I could have sworn your favorite drink was stagnant pond water...<br/><br/>Oh wait, now I remember - you like FALLING into stagnant pond water, not DRINKING it.",
      "created_at": "2006-04-24T06:04:48.000Z"
    },
    {
      "author": "bjork24",
      "body": "No, Caleb. I like falling into stagnant <i>trash can</i> water, not stagnant <i>pond</i> water. The distinction is slight, but it's there.",
      "created_at": "2006-04-24T06:06:43.000Z"
    },
    {
      "author": "Derek",
      "body": "You might want to change the \"Indiana Jones movie\" one. Rumor has it, \"The Moxie Intermission\" is on the short list of possible titles for number 4.",
      "created_at": "2006-04-24T08:54:04.000Z"
    },
    {
      "author": "Maddy",
      "body": "I had a dream last night that there was a new Moxie Blog post up, and when I came to check it out again this morning, it was gone!  How sad...",
      "created_at": "2006-04-24T17:02:58.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
