{
  "id": 398,
  "title": "Hory cow",
  "body": "Several things to mention in this post, so let's get moving:<br/><br/><b>48 Hour Film Challenge</b><br/><br/>As I alluded to in my last post, the majority of this last weekend was spent working on a 5 minute short film for the SATO 48 Hour Film Challenge. Nicole and I sponsored a team - aptly named TEAM MOXIE - which was made up of Moxie employees and friends. The goal was to create a 5 minute short film using a predetermined prop and central theme. We had a blast... and by \"blast,\" I mean multiple fights over who got more film time. In all, 41 teams participated. There will be several public showings of the films, so make sure you swing by and see what Springfield's budding filmmakers are capable of doing with 48 hours of their time.<br/><br/>The first combined showing will be at The Moxie on the morning of April 29th (10:00 AM). It is NOT listed on the calendar since it was booked after the beginning of the month. Due to the large amount of teams, there's a chance that half of the films will be shown on Saturday morning, and the other half on Sunday morning. If all 41 teams are successful in creating a 5 minute short... that's nearly three and a half hours worth of film. I'll keep everyone updated as we learn more. There will also be additional showings, along with awards, during Artsfest in early May.<br/><br/>I'm not sure if we're allowed to show our film outside of the confines of the competition, or else I'd gladly post it here. I'll find out later...<br/><br/><b>I love the Cardinals, so why must they hurt me so?</b><br/><br/>I've noticed a disturbing trend since the Springfield Cardinal's season started on April 6th: whenever there's a home game, our numbers our soft... especially if it's on the weekend. Here's a quick rundown of how we preformed during Cardinal's home games. The percentages represent how we did against our average for that day, and theasterisks denote weekends.<br/><br/>April 6 = +24%<br/>April 7 = -39%*<br/>April 8 = -11%*<br/>April 9 = +5%*<br/>April 16 = -45%*<br/>April 17 = +19%<br/>April 19 = +6%<br/>April 20 = -74%<br/>April 21 = -42%*<br/>April 22 = -44%*<br/>April 23 = -47%*<br/><br/>Also worth noting, April 20th was the night of our Moxie A Go-Go at the Skinny Improv, so that's a double whammy on that particular night! Of course, the Cardinals aren't the only factor here. I can also hurl blame towards nice weather, Shakespeare plays in the park, 48 hour film challenges, and Bob Dylan concerts. Don't worry though, we've got a few special events up our sleeves. Even still, it hurts to have something you love (Cardinals' baseball) affect something else you love (attendance). It's like when Bogart bites Nicole, or vice versa. I don't want to be mad at Bogey for biting Nicole, but I'm kind of upset that her arm is bleeding.<br/><br/><b>Moxie A Go-Go is AWESOME!</b><br/><br/>Last Thursday's Moxie A Go-Go at the Skinny Improv was a smashing success. We had nearly 90 people turn out for a hilarious night of Mystery Science Theater fun. We'll definitely be doing more Moxie Skinny Theater 3000 events, but judging by the crowd demographic, I think we'll wait until college is back in session in September. I also announced the third Moxie A Go-Go event during the intro... which is...<br/><br/><u>Moxie A Go-Go #3</u><br/><i>What:</i> Arrested Development marathon<br/><i>Where:</i> The Belmonte<br/><i>When:</i> May 20th<br/><i>Cost:</i> FREE!<br/><br/>We'll also be serving frozen bananas dipped in chocolate, but unlike the event, they won't be free.<br/><br/><b>May? Maybe?</b><br/><br/>May's calendar is starting to take shape. We're waiting to hear about two big movies before we can release the calendar. I'm not going to jinx myself by announcing what we have, but I'll give you a hint for the movie I'm most excited about seeing in May:<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/042406/bettie.jpg\" width=\"425\" /><br/><br/>I <i>LOVE</i> Bettie Page!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-04-24T22:03:06.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "whit",
      "body": "No, I love Bettie Page!",
      "created_at": "2006-04-24T22:20:08.000Z"
    },
    {
      "author": "elliott",
      "body": "i am soo freaking excited about the moxie a go go 3... i love arrested development... and i will eat lots of frozen bananas...<br/>-el <br/><br/>p.s. you should also do a \"the office\" marathon... british of couse...<br/><br/>",
      "created_at": "2006-04-24T23:56:27.000Z"
    },
    {
      "author": "Laurali",
      "body": "I know, I know...we are part of your missing moxie-goers. I can't help it dude! I've got to get my baseball fix so I can make it through the winter. If it's any comfort we are trying very hard to make every movie we want to see...we just schedule them around the games. I'm really hoping to fit in Tristram Shandy...that may be the only one we will miss due to baseball.<br/><br/>(Oh, and don't you think that Bowie *might* be found in the ocean? I'm also willing to bet there is a bowling ball in there somewhere.)",
      "created_at": "2006-04-25T00:06:29.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Will Hard Candy be coming too?",
      "created_at": "2006-04-25T01:50:51.000Z"
    },
    {
      "author": "Derek",
      "body": "Gah! Why does Evangel's music department keep me from every single Moxie-A-Go-Go?! I'll be on choir tour. Boo hiss. I'm planning on coming to the Moxie all the time over the summer, so.....uh.....yeah.",
      "created_at": "2006-04-25T02:27:46.000Z"
    },
    {
      "author": "Laura",
      "body": "I cannot tell you how excited I am about the Arrested Development Moxie-A-Go-Go.   I am especially pumped that you are having it on a Saturday.  Way to go!!  Annyong!!",
      "created_at": "2006-04-25T02:37:44.000Z"
    },
    {
      "author": "Andy",
      "body": "Oh my god.  A marathon of my favorite show at my favorite hang-out in town.  Oh hell yes.  What season are we watching?",
      "created_at": "2006-04-25T05:25:54.000Z"
    },
    {
      "author": "bjork24",
      "body": "<b>Andy says:</b> <i>What season are we watching?</i><br/><br/>I think we'll choose the best from all three seasons. Maybe put it to a vote and pick the best 8 or 10 episodes.",
      "created_at": "2006-04-25T05:27:47.000Z"
    },
    {
      "author": "Scott G.",
      "body": "You should have opened your theater in Kansas City, business would be booming as the Royals suck.",
      "created_at": "2006-04-25T07:02:43.000Z"
    },
    {
      "author": "brad",
      "body": "oh snap! i'll be in town that weekend in may... i think i just might have to come and say every single line from every single show out loud. ",
      "created_at": "2006-04-25T07:04:30.000Z"
    },
    {
      "author": "drtedd",
      "body": "Please, don't let this movie pass without...a Bettie Page look-alike contest!!!",
      "created_at": "2006-04-25T17:54:02.000Z"
    },
    {
      "author": "Caleb",
      "body": "Haha, this post almost got me in trouble with my boss. He came out of his office and saw Bettie Page and was like, what on earth are you looking at?!",
      "created_at": "2006-04-25T18:54:54.000Z"
    },
    {
      "author": "Nate",
      "body": "Ahh, you have Amelie up today.  With her widdle coffee spoon.<br/><br/>You know, it's random f**king shit like that that makes me feel all warm inside.",
      "created_at": "2006-04-25T19:51:48.000Z"
    },
    {
      "author": "Nate",
      "body": "Either that or the rash.",
      "created_at": "2006-04-25T19:53:08.000Z"
    },
    {
      "author": "nicole",
      "body": "Ooh, I LOVE the Bettie Page look-alike contest idea. I'll see what we can do about that.<br/><br/>Andy why is Amelie up?",
      "created_at": "2006-04-25T20:39:18.000Z"
    },
    {
      "author": "nicole",
      "body": "I meant AND, not ANDY.",
      "created_at": "2006-04-25T20:39:34.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Love the new spam catching device, though the questions should be a little harder.",
      "created_at": "2006-04-25T20:42:20.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<i>Love the new spam catching device, though the questions should be a little harder.</i><br/><br/>There are AutoSpammers making it around the questions already???<br/>",
      "created_at": "2006-04-26T18:03:36.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
