{
  "id": 4,
  "title": "Introduction, Part 4",
  "body": "Today's post is going to focus on what Nicole and I have been doing over the last 3 months to get our project up and running. The first and most beneficial activity has been research... lots and lots of research. It's truly amazing the amount of information we've absorbed since we started nearly 3 months ago.\r\n\r\nNow, as I briefly stated back in my very <a href=\"/posts/1\">first post</a>, Nicole and I have both worked in a movie theater before. We've done everything from box (selling tickets), floor (cleaning auditoriums after the films let out), projection (self-explanatory), and all the other little jobs that the general theater employee is expected to do.\r\n\r\nEven with our five years of combined theater experience, we knew very little about how a theater was run... so we started to dig. I went to Google Answers and posted a <a href=\"http://answers.google.com/answers/threadview?id=314872\" target=\"_blank\">question</a> about film distribution, which, up to that point, had always been a mystery to me.  Who do we contact to get the films?  How much do they cost?  Where is my hat?\r\n\r\nThe gentleman (or gentlewoman) who answered my question was very helpful. The most beneficial piece of advice I came away with was a link to <a href=\"http://www.bigscreenbiz.com\" target=\"_blank\">BigScreenBiz</a>, which is an online community for independent theater owners. The site has an incredible forum that, in some way or another, answered nearly all of my questions. I literally spent weeks reading through the archives, seeing what other \"newbies\" had asked and what advice the old pros had given them.\r\n\r\nPosting on the BigScreenBiz forum eventually led me to another great site, <a href=\"http://www.film-tech.com\" target=\"_blank\">Film-Tech</a>, which is definitely not for the casual posting newbie. This forum was designed by and for multiplex theater owners and projectionists... in fact, one of the site's founders is the inventor of FilmGuard, a film cleaner/lubricant that helps keep prints in pristine condition. Film-Tech's forum is insanely informative, but a lot more technical and less independent-minded than BigScreenBiz.\r\n\r\nBeyond those two sites, I've also e-mailed lots and lots of theater owners who run cinemas like the one Nicole and I hope to start.  Many of the owners have been very gracious and generous with their hard-earned knowledge, while others chose to remain a bit more tight-lipped.  Either way, this method of research turned up many useful resources for equipment vendors, concession supplies, booking agents (those are the people responsible for booking films in your theater), and a whole slew of other informative stuff.\r\n\r\nNicole and I also made a special trip at the beginning of May to visit the theater that Cinema 24 is loosely based on, <a href=\"http://www.ragtagfilm.com\" target=\"_blank\">Ragtag Cinemacafe</a> in Columbia, MO. Speaking with the owners and the original founding members of Ragtag was an immense help. We toured the theater, talked about per-caps, capacity percentages, distribution fees, visited the projection booth, and had a grand ole time. I'll count ourselves lucky if we end up being half as successful as they are.\r\n\r\nWe've also spent a lot of time contacting vendors, getting quotes for insurance, liquor licenses, working with architects, and trying to spread the word about our project as quickly, and covertly, as possible. We even went so far as to build an online survey that we e-mailed to college professors, students, and various members of the community asking them about various issues related to our theater. We received over 200 results in the 4 weeks the survey was available, which was a lot more than I had originally hoped for.  In the end, 9 out of the 10 people surveyed agreed that Midwestburg needed an art-house cinema that exhibited smaller independent and foreign films.\r\n\r\nAnd then there's the business plan. If you haven't heard it before, writing a business plan is very, very hard work. I'm not going to delve into the minutiae today, but you can bet your bottom dollar that there will be at least one large post dedicated to the ordeal of writing ours. Suffice it to say, we're now in the final stages of completing our second draft and I still don't think it's quite up to par. Whatever we end up with, it will have to be solid enough to satisfy the banks... and I'm getting ahead of myself here. I'll continue on this at a later time.\r\n\r\nOf course, working at our regular day jobs has made researching for the theater a real challenge, to say the least. If we ever need to call a vendor for a price quote, by the time we get home they're most likely already gone for the day. We've had to use time where we can find it, and I'm sure that's no different for the countless others who have undertaken just such a project. I feel tired just having written about all this work... but it was fun (the research), and I still have a lot to do.\r\n\r\nAs time goes by, I'll start devoting posts to specific portions of the industry that I've learned quite a bit about over the last few months. Until then, I better get back to my real job.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-05-27T23:35:04.000Z",
  "author": "Dan",
  "comments": [],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
