{
  "id": 40,
  "title": "La, la, la, layout",
  "body": "Every good theater has walls, and every good wall has studs, and every good stud wishes he were me, which brings us to the topic of today's post: floorplans, and the space between. Before I begin, I want you to forget everything you know about theaters - forget the enormous ceilings, forget the gargantuan screens, forget the ornate masking drapes, forget the sloped floors, forget the plush carpeting, forget the stadium seating, forget the wide aisles, and, most importantly, forget the stud comment I made at the beginning of the post.<br/><br/>Our theater, if you haven't figured it out yet, is going to be different. Unique. Cozy. Cramped. We're not restricting ourselves to the corporate multiplex schema. We're breaking all the rules - theatrical design included. As it turns out, the building where the theater will be housed poses an interesting set of design challenges, like low ceilings, flat, wooden floors, and load bearing beams that trisect the building into three long, skinny sections. I'm sure a lot of people could look at the building and never imagine a theater in it, but not us.<br/><br/>Are there design challenges? Sure, but nothing we can't handle... and when I say \"we\", I'm not just referring to Nicole and I, I'm also referring to Andrew and Doug, the building's owners. Had they not recognized the potential of this building in the first place, none of this would even be happening. There would be no building, no theater, no blog, no nothing. I'd be chained to my desk, pretending to work at my life-draining, soul-sucking, spirit-crushing job, and you, dear reader, would still be waiting for Kevin's new post on <a href=\"http://tjsplace.blogspot.com\" target=\"_blank\">Life at TJ's Place</a>. Thankfully, that's not the case.<br/><br/>Admittedly, our theater will have some quirky obstacles that you don't get at other theaters. If someone in the first few rows stands up, his or her head will most likely cast a funny looking shadow onto the screen, to which someone will undoubtedly shout, \"hey, down in front!\" Our rows will only be 5 or 6 seats deep, depending on how far back you sit, and the seats will be squeezed together fairly tight. Not so much that you won't be able to breathe, but tight enough that you have to ask yourself in passing, \"crotch or ass?\" But you know what? That's just part of the charm.<br/><br/>Whether good or bad, these little peccadillos give our theater a personality, and as long as we can provide first rate presentation along with a fun and enjoyable atmosphere, lots of great concessionary goods, and a continually refreshing selection of quality film, then I don't think anyone will say, \"The Moxie? Isn't that the place where they introduce films in person and have a camera that shows the audience up on the screen and sell beer and wine and retro candy and have all the art on the walls and all the cool people hang out there? No, I won't go there. The ceilings are too low.\" If I haven't said it enough already, \"We're not your mother's theater! Although your mom is always welcome, of course.\"<br/><br/>Now, with that being said, let me introduce you to our floorplan designs. We had originally planned on using <a href=\"http://moxie.danchilton.com/pix/grum/152_layout_old.gif\" target=\"_blank\">design one</a> for the floorplan, but having the exit door on the front wall (screen wall) of the auditorium severely restricted the width of the screen, so the architect altered the layout and arrived at <a href=\"http://moxie.danchilton.com/pix/grum/153_layout_new.gif\" target=\"_blank\">design two</a>, which is what we're going with now. We've made a few little changes to the current floorplan, but for the most part it looks just like the layout in design two.<br/><br/>As you can see, the auditoriums are longer than they are wide, but not so much that the people on the last row will feel like they're watching the film from the next state. Presentation is very important to me, so I wanted to be sure that the screen was as large as it could be for t<br/>he space available. As it stands, the screen will be just the right size - it won't look distorted to the people in the front row, nor will it be too small for the folks in the back. I'm currently working with the architect and our equipment dealer to iron out all the electrical and construction details for the final draft. Once that's done, the floorplans and electrical schematics will be filed with the city to obtain the appropriate building permits before renovation begins.<br/><br/>We're picking up speed again, and it feels great! I have to blow the dust off the ole business plan, refigure some of the numbers, and get it ready for bank consumption while Nicole busies herself with the wholesale grocery representatives and interior decorators. Woo Hoo!<br/><br/><b>LOGO UPDATES:</b><br/><br/>As you can see from the submissions I've posted, the response to the logo design challenge has been overwhelming. The designs look great and I hope to see a lot more before the end of July. A couple people have written me and asked for specifics, but I've been hesitant to give any out. I was intentionally vague in <a href=\"39\">Tuesday's post</a> because I wanted to see how other people envisioned our theater. Some designs are trendy, some are retro, some are made in PhotoShop, some are hand-drawn... however you'd like to make a logo, we'd love to see it, so get off your lazy butt and send one (or five) in! Geez!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-07-24T00:29:57.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "James",
      "body": "Now, you may have already changed this, but I think that the storage closet connected to the office should have a door to the south, because it wouldn't be very fun to carry a hundred pound box of popcorn through the office and all the way around to get it to concession.",
      "created_at": "2004-07-24T01:14:26.000Z"
    },
    {
      "author": "Francis Lim",
      "body": "Hi there! i saw the few logos that others have posted at your forum. currently im looking for that special logo that can represent my company. Hence i wold appreciate if you would add links to my blog. Thanks",
      "created_at": "2004-07-24T10:30:10.000Z"
    },
    {
      "author": "writer",
      "body": "Remember, a logo will not save your brand. <br/><br/>At best, a logo will attract ordinary people - Joe Sixpack from Kmart - to your product. People who would otherwise know nothing about it.<br/><br/>At worst, a logo will suck up your money for no discernible return.It wilol signal all the right things to 'designer' fellow travellers and nothing to the mass market.<br/><br/>Also, clients (if any of you are listening) expect your logo 'designers' to go ballistic over what I have just said.<br/><br/>They are as predictable as your expensive 'logo' is a waste of money.",
      "created_at": "2004-07-26T15:15:59.000Z"
    },
    {
      "author": "Silver",
      "body": "Not to offend anyone, but it seems to me like Rex's designs are a tad...negative. It seems like they would give the Moxie a bad vibe. Not to say that I could do better, I just think a more cheery logo would be best. <br/><br/>Now that I've given my two cents, I'm going to go feed my dog. Good-bye!",
      "created_at": "2004-07-26T20:49:29.000Z"
    },
    {
      "author": "bjork24",
      "body": "Just so everyone knows, Rex's logos are meant to be satirical... just like his version of this blog over at URLgreen. His logos aren't meant to be mean-spirited, just funny, which they most certainly are.",
      "created_at": "2004-07-26T20:59:24.000Z"
    },
    {
      "author": "Fyse",
      "body": "Rex's logos are indeed funny, but does it strike anyone else that some of them are actually rather good? You should get your friend to submit some serious designs, cos you might just get what you're looking for.<br/><br/>In fact, I think you should use the 'Sit down, shut up and watch the movie' logo as it is. Something to put at the end of the advert slides perhaps?",
      "created_at": "2004-07-26T22:19:06.000Z"
    },
    {
      "author": "Raphaela",
      "body": "Hello.. I'm Brazilian... :) Your blog is very good! I cant speak English a lot... but I understand many things.. ;) See ya! kisses",
      "created_at": "2004-07-26T23:48:03.000Z"
    },
    {
      "author": "mo",
      "body": "Nice blog Design.yes but ... .<br/>Copyright © for mr.Dan<br/>;)",
      "created_at": "2004-07-27T12:02:10.000Z"
    },
    {
      "author": "Oz",
      "body": "Am I right in seeing that you have three bathrooms, and by three bathrooms, I mean three toilets?  Is that going to be enough?  I understand that you are crammed for space, but it's quite possible that people will be very annoyed by that.  I know that in the local art house theaters here in Philadelphia (the Ritz theaters) they have bathrooms with about 8 toilets (for the women anyway, not sure what the boys have), and those things fill up after a showing of any size.  I know that a lot of art house films won't attract a huge crowd, but you've got to be hoping/counting on having a good sized audience with some regularity....",
      "created_at": "2004-07-28T16:34:00.000Z"
    },
    {
      "author": "bjork24",
      "body": "Oz, you're correct. We only have three, tiny, single occupancy restrooms. There's really no way to fit more in, and I'm sure it will tick off a fair amount of patrons, but it's not without precedent. I've been to an arthouse theater with only ONE tiny, single occupancy restroom... so it could always be worse.",
      "created_at": "2004-07-28T17:08:40.000Z"
    },
    {
      "author": "whit",
      "body": "I've waited in line for bathrooms at much larger venues. Three toilets will be survivable if they are clean.  Clean bathrooms at a theater would be a first.",
      "created_at": "2004-07-28T17:34:44.000Z"
    },
    {
      "author": "david",
      "body": "logo submission<br/><br/>[IMG]http://img52.exs.cx/img52/309/moxie.jpg[/IMG]",
      "created_at": "2004-07-30T11:32:36.000Z"
    },
    {
      "author": "david",
      "body": "sorry click this ling thought it would display...",
      "created_at": "2004-07-30T11:33:31.000Z"
    },
    {
      "author": "Michele",
      "body": "I grew up in a small, Southern town with only one grand old theater... whatever was playing at the moment was what you were going to see. It had three long sets of seats with two big aisles, and if someone stood in the front, they did indeed cast an odd shadow on the screen. We yelled at them to duck down. It was a beautiful place full of fun and charm and romance. Good luck with your theater.",
      "created_at": "2004-08-03T23:33:57.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
