{
  "id": 400,
  "title": "SATO 48 - Important news",
  "body": "For those of you who participated in the SATO 48 Hour Film Challenge, and want to buy tickets to the first public screening this Saturday... hurry up! We sold well over 30% of the tickets last night, and I'm sure the rest will be snatched up tonight and tomorrow. If you haven't already, check the <a href=\"http://www.moxiecinema.com/films/77\" class=\"broken\">updated film listing</a>, where you can see all the films and find out which block yours will be playing in. If you only want to buy tickets to one or two blocks, do it online, but if you want to buy a pass for all three showings ($12), you'll need to buy that at the box office. And these showings aren't just for the filmmakers. ANYONE can come see them.<br/><br/>If you're not able to make it to Saturday's shows, don't worry. We'll be showing them again during ArtsFest. Stay tuned for more updates.<br/><br/>Since the showings are so early in the morning, we're going to buy some delicious breakfast snacks to sell at the Cinebar. That had nothing to do with anything we were talking about... so...",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-04-27T21:05:54.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Honkey Hero",
      "body": "Cool, did your film also get banned from showing?  Ours did.. I heard over 1/3 of them will not be shown at Artsfest due to content, making the Moxie the exclusive venue for seeing these films.  ",
      "created_at": "2006-04-28T00:51:32.000Z"
    },
    {
      "author": "Honkey Hero",
      "body": "Actually, after reviewing the titles I am betting the following ones will be shown exclusively at the Moxie... just a guess<br/><br/>Addicted<br/>Deaf'n Greasy<br/>Shot in the Head<br/>The Making of the Sunridge Massacre<br/>Your Turn To Die Sam McFly<br/>Pearls and Canvas (ours)<br/>The Killer's Torment<br/>Numbnuts<br/>To Kill For<br/>",
      "created_at": "2006-04-28T00:55:23.000Z"
    },
    {
      "author": "Caleb",
      "body": "I REALLY hope you guys get <a href=\"http://www.youtube.com/watch?v=V9rzMaAucI4&eurl=http%3A%2F%2Fmonkeysforhelping%2Eblogspot%2Ecom%2F\">this </a>movie.",
      "created_at": "2006-04-28T23:31:03.000Z"
    },
    {
      "author": "Squibbowitz",
      "body": "Can anyone substantiate that, 1/3 won't be shown at Artsfest due to content, rumor? If that's true, I can comfortably say, even without having seen any of the other movies, that they need to change the name of Artsfest. Maybe -Craftsfest or Dreamcatcher Extravaganza or Midwestern Morals Celebration?  ",
      "created_at": "2006-04-29T01:29:58.000Z"
    },
    {
      "author": "Nate",
      "body": "Ha!  That is absolutely true.  Dreamcatcher Extravaganza.  <br/>Well put.<br/><br/>What's wrong with lumping all the age inappropriate ones together and warning people beforehand?<br/><br/>I guess I'm getting ahead of myself.  Rumor is unconfirmed as yet.",
      "created_at": "2006-04-29T01:44:09.000Z"
    },
    {
      "author": "bjork24",
      "body": "I can confirm that 10 movies have been barred from being shown at ArtsFest, although they will still be shown at The Moxie and will still be eligible for awards (I'm not 100% sure about the awards part though). The judges were the ones responsible for choosing which films were and were not shown at ArtsFest.",
      "created_at": "2006-04-29T01:50:21.000Z"
    },
    {
      "author": "erin",
      "body": "squibbowitz said it all.",
      "created_at": "2006-04-29T03:39:12.000Z"
    },
    {
      "author": "Nathan Pope",
      "body": "squibbowitz did say it all.  nate's idea wasn't bad at all.  this is like something i would expect from springfield though.   kind of hard to win an audience award if the people voting don't see it.",
      "created_at": "2006-04-29T04:06:03.000Z"
    },
    {
      "author": "Nate",
      "body": "Ours should be okay but that doesn't make me any less annoyed on behalf of the ten teams that won't have their work shown.<br/><br/>I'm trying to restrain myself, since not all the facts are out but...<br/><br/>...a few, probably premature, points:<br/><br/>I don't recall anything in the materials beforehand mentioning anything about standards that should be adhered to.  I could be wrong.  But I don't remember.  Can anybody correct me on this?<br/><br/>If not, ten teams went out and devoted a significant amount of time on a project that was subject to judging criteria of which they were not aware.<br/><br/>And what is \"appropriate for Artsfest\"?  That's a real head-scratcher.  Sure, it's a family affair.  I have some common sense.  But again, disclaimers and viewer discretion should do the trick.  Are any of the visual arts like paintings and sculptures screened for First Friday Art Walk?  I've sure seen some left field stuff there!<br/><br/>And, again, I would prefer the term Craftsfest if this is how things work.  In all seriousness.  Why pose as something more sophisticated than the reality?",
      "created_at": "2006-04-29T07:05:49.000Z"
    },
    {
      "author": "Caleb",
      "body": "I can totally understand why they might not want to show graphic violence, excessive language, or sexual content in front of a group of twelve year olds with their parents. HOWEVER, they did not have any stipulations on content for the filmmakers to follow that I am aware of and if they're worried about offending someone, heaven forbid, all they have to do is stick a warning sign up at the screening cautioning people that some of the films contain R-rated elements that might be inappropriate for little kids. ",
      "created_at": "2006-04-29T10:39:49.000Z"
    },
    {
      "author": "Honkey Hero",
      "body": "I was the first to ask for a copy of the community standards, about 3 weeks before the competition and was told that they would be given later... When later came, I was told the community standard guidelines are not written, so just use your best judgement.  <br/><br/>Really I'm not too disappointed for myself that our flick isn't playing during artsfest, but I am for everyone else that worked on it.   If I was to rate our movie I would say it would be a PG-13.. for adult situations and some violence... There is no sex, language and the rest... But when they called and said our film was banned, I asked why, and was told that a family with young children must be able to come and watch it without feeling uncomfortable.  I can live with that.  I really wouldn't want a four year old watching it either.  <br/><br/>But in defense of the organizers, they had a lot more teams than expected (41) and with being the first year this was put on I'm sure they were a bit overwhelmed....  I still think they did a great job with it.  The films banned were viewed by the artsfest council who had the say of the films were inappropriate or not.  <br/>",
      "created_at": "2006-04-29T15:14:28.000Z"
    },
    {
      "author": "Nate",
      "body": "Craftsfest council.  \"Viewed by the craftsfest council.\"",
      "created_at": "2006-05-01T16:43:51.000Z"
    },
    {
      "author": "Rodeo",
      "body": "hey, i am a 12 year old, i competed in Sato48. and my movie was accepted, and you shouldn't take the titles for granted, or maybe you should...some of them don't have a THING to do for what the film is about. Obviously, my team was the youngest...",
      "created_at": "2006-05-04T00:52:30.000Z"
    },
    {
      "author": "Rondel",
      "body": "Has anyone found out who needs to be at the awards ceremony yet?  I've checked several sights and have found nothing......",
      "created_at": "2006-05-05T20:17:20.000Z"
    },
    {
      "author": "Horse Johnson",
      "body": "Yeah they sent an email out saying the judges didn't get their stuff done because they were too busy... so no nominations ",
      "created_at": "2006-05-05T21:14:15.000Z"
    },
    {
      "author": "Horse Johnson",
      "body": "There will still be awards, but they didn't put out any nominations so you would have a hint if you should go or not and pay the $5... Seems like a good way to get some more money I guess... ",
      "created_at": "2006-05-05T21:15:47.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    }
  ]
}
