{
  "id": 402,
  "title": "Just in the nick of time: a new MoxieTV Episode",
  "body": "Here's a <a href=\"/episodes/6\">new episode of MoxieTV</a> for you to lambast. It's the shortest one to date, but there's only so much you can do with a bunch of rubber snakes.<br/><br/>And now for something completely different: an animated gif of Chuck Norris popping some blonde in the nose. It's only funny because it's Chuck. *sigh* If only we could get him to do a MoxieTV episode with us... if only.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/050206/chuck.gif\" width=\"170\" />",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-05-03T01:47:24.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Honkey Hero",
      "body": "Ah good old Chuck, nothing better than seeing him beating a defenseless woman... ",
      "created_at": "2006-05-03T01:58:03.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i hope thats as close as i ever come to your crotch<br/><br/>(or do i??)<br/><br/>((yes.. actually.. i do..))<br/><br/>no offense to your crotch mind you...<br/>i mean... i dunno.. the way i see it.. there are 3 types of people in this world.... <br/>the... people that like to be near dan's crotch... <br/>the people that would rather not be any closer to it than 3 feet...<br/>and neil diamond fans...<br/><br/>im not a neil diamond fan...",
      "created_at": "2006-05-03T03:15:57.000Z"
    },
    {
      "author": "Caleb",
      "body": "That was hilarious. Those special effects are amazing - they look very similar to the ones used in Snakes on a Plane!! And nice song too, Dan. ",
      "created_at": "2006-05-03T04:23:06.000Z"
    },
    {
      "author": "erin",
      "body": "why snakes? does it go with some film your showing? no? hum..<br/><br/>they are sexy snakes none the less.",
      "created_at": "2006-05-03T05:46:34.000Z"
    },
    {
      "author": "Caleb",
      "body": "Erin is apparently <i>completely</i> out of the loop. :-)",
      "created_at": "2006-05-03T07:26:44.000Z"
    },
    {
      "author": "Derek",
      "body": "Hahahahaha. Don't f*** with Chuck.",
      "created_at": "2006-05-03T23:23:20.000Z"
    },
    {
      "author": "brian of moore",
      "body": "nor has she flown in a plane lately",
      "created_at": "2006-05-03T08:56:20.000Z"
    },
    {
      "author": "erin",
      "body": "hey! leave me alone. im cool!",
      "created_at": "2006-05-03T16:27:10.000Z"
    },
    {
      "author": "Nate",
      "body": "Absolut MoxieTV.<br/>Absolut goodness.",
      "created_at": "2006-05-03T17:46:06.000Z"
    },
    {
      "author": "Jordan",
      "body": "The snakes are a start...<br/><br/>Insert Samuel L. Jackson and some aircraft... and then you'll have yourself a REAL movie. ",
      "created_at": "2006-05-04T01:42:09.000Z"
    },
    {
      "author": "Caleb",
      "body": "OH...MY...GOD...<br/><br/>Dan and Nicole, you HAVE to watch tonight's episode of Lost ASAP. <br/><br/>Biggest shock of the season, by far. ",
      "created_at": "2006-05-04T06:03:52.000Z"
    },
    {
      "author": "Fyse",
      "body": "I have to confess, I'm as confused as erin about all the snakes. Anyone care to explain?!<br/><br/>Oh, and Caleb is right. A seriously AWESOME episode of Lost.",
      "created_at": "2006-05-04T15:54:55.000Z"
    },
    {
      "author": "Caleb",
      "body": "The snakes have to do with <a href=\"http://www.imdb.com/title/tt0417148/\">this</a>, the instant cult classic movie that hasn't even hit theaters yet (it will in August). It has the biggest hype surrounding it of any movie since...well, nothing really. The Blair Witch Project had close to the same hype I guess. Anyway, it looks like the crappiest movie of the year, but that's why it looks so good. Oh yeah, and Samuel L. Jackson is in it. ",
      "created_at": "2006-05-04T17:37:23.000Z"
    },
    {
      "author": "Nate",
      "body": "It started as a few internet jokes that snowballed into a big, self-aware, self-referencing thing, where its cool if people make obscure references to it that other people pick up on.  Similar to All Your Base Belong To Us or Chuck Norris jokes.<br/>You know it's reached critical mass when it found its way into MoxieTV.  Next it will be on the cover of Time.",
      "created_at": "2006-05-04T18:16:27.000Z"
    },
    {
      "author": "bjork24",
      "body": "<i>Originally</i> this episode was supposed to include a picture of Samuel L. Jackson holding a snake with The Moxie behind him... and you'd hear him say, \"I'm sick of all these snakes!\" That portion was lost in the editing, however.",
      "created_at": "2006-05-04T18:46:58.000Z"
    },
    {
      "author": "brian of moore",
      "body": "that lost episode freaked me out<br/>i actually havent ever watched a real episode of lost until now<br/>but i did watch the thing on abc.com  that basically caught you up on everything thats happened so far... <br/>a few seasons of lost .. compressed into about 40 minutes...<br/>sure.. id like to watch all of the episodes (one of my friends has them)... but i dont have the time.. so a summary was good enough<br/><br/>anyway.. yeah.. double you tee eff<br/>",
      "created_at": "2006-05-04T21:50:13.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 17,
      "name": "MoxieTV"
    }
  ]
}
