{
  "id": 403,
  "title": "A long one about digital cinema",
  "body": "We get lots of comments here at The Moxie, ranging from \"<i>this popcorn is great!</i>\" to \"<i>the restrooms are completely out of toilet paper... again!</i>\", and my personal favorite: \"<i>something over here smells like a rotting corpse!</i>\" Most of these comments are met with a nod and a smile, but there's ONE particular comment that really gripes our souls - so much so that whenever Nicole hears it she instantly tosses her customer service face aside and matches the remark with a fiery retort and a sound slap. What could this vile remark be, you ask?\r\n\r\nTwo words: <i>real theater</i>.\r\n\r\nYou'd be surprised how many times we hear it... \"<i>How did you get this film and the real theaters didn't?</i>\" , \"<i>These movies don't play in the real theaters, do they?</i>\" , \"<i>Is this a real theater?</i>\" , \"<i>That movie was so good! I wonder why the real theaters didn't pick it up?</i>\" I know that the majority of people who use the term don't mean it in a derogatory sense, but why can't they say \"other theaters,\" or even \"the big theaters?\" When people phrase it with those terms, it doesn't seem nearly as offensive. Even still, it makes us wonder: do these people think we're just showing whatever movie we happen to rent on DVD? Additional comments seem to corroborate this assumption. For instance, when people watch me rewind a giant reel of film, you'd be surprised how often I hear, \"you mean movies aren't all digital these days?\" or something to that effect. It's astonishing how many people think this way. When I tell them that the other theaters use film too, but with a larger machine that doesn't require them to have intermissions, they look at me with an expression of complete and utter disbelief. I assume they either think I'm lying through my teeth to make The Moxie seem more like a \"real theater,\" or they simply can't believe that 99% of all theaters are still using 35mm film in much the same way as they were 50 years ago. \"So why isn't everything digital?\" they ask. Well, that's what I'm going to try to shed a little light on today.\r\n\r\n<b>Why aren't all theaters digital?</b>\r\n\r\nThere have been countless articles written on the impending digital revolution and the effect it's going to have on modern cinema, but I've yet to see any that were written from the perspective of a theater owner. Most of the pieces I've read were penned by consumer electronics advocates, members of the elusive 18-32 male demographic, technologists, and people who have already given up on the cinematic experience as a whole. Interestingly enough, out of those four categories, I fit into three. Unlike most theater owners, I am not fearful for the coming age of digital cinema, nor do I think we have anything to worry about for the next five years. Digital cinema will not spell the end for theaters. Day-and-date releases will not spell the end for theaters. A pandemic outbreak of the much-feared avian flu within the US <i>will</i> spell the end for theaters... at least for several months... but I'm getting off track here. Obviously I have plenty to say about all these issues, but I need to take it one post at a time. Today: digital cinema. Tomorrow: the strange black spots growing on my hand.\r\n\r\nAs most of you know, we have the ability to show both 35mm and digital films here at The Moxie. The majority of our films are shown in 35mm, while the smaller independent and local films are shown in digital. When given the choice, I'll always choose 35mm film over digital... but we're rarely given a choice. I can only think of one film in the last seven months that was available through both mediums, and that was BUBBLE. In my opinion, 35mm simply looks better than digital. Crisp, crystal clear clarity is appealing in my computer's monitor, but not on the big screen. When pro-digital pundits compare digital projection to 35mm, they usually speak in terms of resolution, which, if you ask me, is digital's biggest pitfall. With every step made in picture clarity, the line between mere mortals and movie stars becomes all the more blurred, as pimples, pores, and pustules begin to invade the silver screen. If anyone should be behind the push for digital cinema, it's make-up artists. Their jobs are probably the most secure in Hollywood.\r\n\r\nNow I'm getting off track. Where was I? Oh yeah, resolution. As I said earlier, resolution, along with brightness, is one of the key components in the pro-digital advocate's arsenal. While it's easy to visual a digital presentation in terms of resolution and pixels, it gets a bit more fuzzy (literally) when relating to film. Think about it this way: when you open a digital photo in PhotoShop and zoom in to 1600%, what do you see? A bunch of colored pixels, right. Now, imagine if you took an old baby picture of yourself and looked at it under a <i>real</i> magnifying glass... what would you see? If the picture was taken with high quality 35mm film, you'd probably see a fuzzy gradient of colors blending into each other. When you digitalize something, it's converted into pixels, which makes the idea of resolution much more clear. Does that make sense? No? If not, you might want to stop reading here, because the next section is really going to confuse you.\r\n\r\n<b>DIGITAL</b>\r\n\r\nFor the sake of arguement, let's assume that each pixel of resolution requires only 1 byte of data.\r\n\r\n<ul><li>Standard digital resolution on a DVD is 720 x 480 = 345,600 bytes of data per frame</li>\r\n<li>345,600 * 24 frames per second = 8,294,400 bytes per second</li>\r\n<li>8,294.400 * 60 seconds per minute = 497,664,000 bytes per minute</li>\r\n<li>497,664,000 * 120 minutes (average movie length) = 59,719,680,000 bytes total</li></ul>\r\nSo an uncompressed digital movie in DVD format is approximately 60 GIGABYTES in size. After it's compressed into an MPEG-2 file, the size shrinks to to between 4 to 9 GIGABYTES, which ensures the film will fit snuggly on a DVD disc.\r\n\r\n<b>35MM</b>\r\n\r\nAs mentioned earlier, it's difficult to slap a single accepted resolution on to one frame of 35mm film, but from what I've heard it's somewhere in the 4096 x 4096 arena. Of course, print quality can differ depending on the generation of the film transfer, but let's assume that this is a first generation print. So, utilizing the same basic formula as above:\r\n\r\n<ul><li>4096 x 4096 = 16,777,216 bytes per frame</li>\r\n<li>16,777,216 * 24 frames per second = 402,653,184 bytes per second</li>\r\n<li>402,653,184 * 60 = 24,159,191,040 bytes per minute</li>\r\n<li>24,159,191,040 * 120 minutes = 2,899,102,924,800 bytes per movie</li></ul>\r\nNow we're looking at nearly 2.9 TERABYTES of uncompressed data to match the resolution of 35mm film. For the non-technical, that's roughly 316 DVDs worth of information. If we can achieve the same sort of compression as MPEG-2 (despite its host of problems like digital artifacting, etc.), that brings the total down to around 300 GIGABYES or so. Don't forget, we're assuming that each pixel is only worth one byte of data, which is rarely the case. But that's not all - storage is only half the battle. What good is a 300 GIGABYTE movie going to do you if you can't show it at that resolution? A 4096 x 4096 movie isn't going to look that good on our 1024 x 1024 projector. You're going to need a brand new, state-of-the-art 4K projector... the stuff dreams are made of. Sony just released one and demonstrated it at CES 2006. They have two models: a 5,000 lumen projector for screens with a 20 foot width or smaller, and 10,000 lumen projectors for screens with a 40 foot width or smaller. I've yet to see a substantiated figure, but these projectors are rumored to cost well over $250,000 each. A new 35mm projector will only set you back about $40,000.\r\n\r\nSo, pretend you're a theater owner. You have a lovely 16 screen cineplex nestled in suburbs, and you want to jump on the digital cinema bandwagon. Are you ready to pony up four million dollars to digitally match the picture quality you're already achieving with 35mm film, and surpassing in most cases? Any theater owner would balk at that price... but fear not, Mr. Pretend Theater Owner, because Hollywood feels your pain. Why release digital films for 4K projectors when you can release them for 2K projectors at half the price (and half the quality). The typical theater audience won't be able to tell the difference anyways! And 2K projectors cost about the same as a good 35mm film projector! Genius! Of course, I'm overstating the situation here, but it's not far from the truth. There are several obvious advantages to digital cinema:\r\n\r\n<ol><li>Less shipping - it costs about $60 to ship two cans of 35mm film</li>\r\n<li>Ease of operation - projecting a digital film requires a lot less expertise than successfully threading and projecting a 35mm film</li>\r\n<li>Nondegradable - unlike film, digital prints don't get scratched</li>\r\n<li>Easier to pirate - oh wait, that's not an advantage, is it</li></ol>\r\nAnd as with everything else, there are considerable disadvantages:\r\n\r\n<ol><li>Increased cost of maintenance - digital parts tend to cost more than their mechanical projector counterparts</li>\r\n<li>Increase in IT skill - suddenly the theater industry will be in serious need of ultra-expensive network administrators and digital technicians. Good for IT, bad for theater owners.</li>\r\n<li>Expensive equipment - a 35mm projector, if maintained properly, will last well over 30 years. I'm not sure how long a digital projector can be expected to last, but I doubt it can hold a candle to the reliability of a Simplex XL (ours is from 1949)</li>\r\n<li>Although digital is coming close to matching the <i>resolution</i> of 35mm film, it still has a long way to go before it can mimick the color depth and contrast.</li></ol>\r\nOf course, none of this is what's really at issue here... it's the disappearing theater audiences. What Hollywood doesn't understand is that the problem isn't in the distribution, it's in the presentation. The cinematic experience has degraded so drastically over the years (cell phones, pre-show commercials, untrained projectionists, dirty auditoriums, expensive concessions) that it comes as no surprise that the majority of people would rather wait for the DVD so they can watch it at home. To be successful as a theater, you have to offer an experience that's worth more than the movie itself. If every multiplex in the nation invested the cost of one 4K digital projector into hiring and training a crew of projectionists and an army of customer service oriented ushers, you might just see people start going to the theater again.\r\n\r\nI think I've blabbed on long enough. It's time to go watch last night's episode of LOST.\r\n",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-05-04T23:27:56.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Nate",
      "body": "This was very interesting, Dan.  Thanks.\r\nBut as a non-technologist, or at least only a passive consumer of consumer electronics, I still need a little help.\r\n\r\nYou describe in great detail why 35mm film holds more visual information than a digital file, but you just said digital projection will destroy the illusion by showing us pores and actor's blemishes and what not.  Which is it?  I'm obviously missing something here, but you didn't make it clear to me yet.  Don't worry.  You're not the only one: advocates of film always go down this road, but leave me unsatisfied on this question.  I've always wondered about it but have yet to hear a clear answer.\r\n\r\nPerhaps if I was an experienced photographer I would understand better.  You talk about resolution vs. color depth and contrast, and I am having trouble wrapping my brain around those concepts and understanding why they are different.  \r\n\r\nFor the sake of argument, if you had all the resolution you want, which, clearly we will at some point, don't you get all the color depth and contrast you want?  \r\n\r\nDoesn't the infinite resolution allow you to paint with whatever palette you choose to put into the digital file?\r\nAgain, perhaps if I was a film-using photographer I would understand this better.",
      "created_at": "2006-05-05T00:04:02.000Z"
    },
    {
      "author": "Steve Kirks",
      "body": "\"The cinematic experience has degraded so drastically over the years (cell phones, pre-show commercials, untrained projectionists, dirty auditoriums, expensive concessions) that it comes as no surprise that the majority of people would rather wait for the DVD so they can watch it movie at home. To be successful as a theater, you have to offer an experience that's worth more than the movie itself. \"\r\n\r\nYou nailed it, Dan.  I go to the Moxie instead of the \"big\" theaters for the quality of the experience and the demonstration of the craft.",
      "created_at": "2006-05-05T00:15:43.000Z"
    },
    {
      "author": "Snarky Reader",
      "body": "Wow that was boring...",
      "created_at": "2006-05-05T01:12:08.000Z"
    },
    {
      "author": "Oz",
      "body": "Cool post.  Personally, I like when you explain things.  Reminds me of the old Cinema24 days.",
      "created_at": "2006-05-05T01:49:42.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Oz.",
      "created_at": "2006-05-05T01:57:41.000Z"
    },
    {
      "author": "Derek",
      "body": "I greatly enjoyed this post. Thanks for the informativeocityishness. The guy who lives in the room next to mine is a photography guy, as was my old roommate, and they both talk about how much better 35 mm is than digital, but now I understand why. Oh, and I call the other theaters, \"the crappy theaters\" as a general rule.",
      "created_at": "2006-05-05T02:27:34.000Z"
    },
    {
      "author": "Nicole",
      "body": "I was trying to think of a way to describe the visual differences between film and digital in non-technical terms (because I'm pretty far from being able to speak of things technically). I think what I can come up with is that film seems to capture a moment of something that happened in real life. It is softer and has more of an artistic quality to it. Digital seems to be more of an exact representation of what you would see in real life. You see the blades of grass clearer, or as Dan said, people's pores. This is more with photography in mind, but I guess it's more or less the same. There's even a slight difference between films shot digitally but transfered to film (like Bubble or Me & You & Everyone We Know). \r\n\r\nI'm not sure if I accomplished my mission. But that wins the award for my longest comment!",
      "created_at": "2006-05-05T02:36:57.000Z"
    },
    {
      "author": "-Jeff",
      "body": "I'm gonna have to disagree with you there <b>Snarky Reader,</b> that was one of the finest posts in a long time, especially for this TechHead...\r\n\r\nThere's just entirely too much information here to properly discuss it in the Leave A Comment Section (Forums, perhaps?) but this principle is the <i>exact</i> same thing I've been bitching about in terms of 35mm still photography for years.  \r\n\r\nI'd take my trusty Nikon F series and Fuji Provia/Velvia film over any digital camera in a cocaine heartbeat.  \r\n\r\nSame goes for theatrical films.  While you can do some amazing things with digital films, nothing beats the \"look\" of properly exposed film in a theatre.\r\n\r\nI'd continue this in the Forums with anyone interested, it's a hell of a topic...\r\n",
      "created_at": "2006-05-05T05:07:50.000Z"
    },
    {
      "author": "Fyse",
      "body": "Oz took the words right out of my mouth. How long is it since Cinema24? I feel like I've been reading this blog half my life. In a good way, that is.",
      "created_at": "2006-05-05T06:01:57.000Z"
    },
    {
      "author": "Al",
      "body": "Thanks for the info, Dan.",
      "created_at": "2006-05-05T06:26:08.000Z"
    },
    {
      "author": "matt",
      "body": "It sounds like some of the argument against digital here is actual against digital cinematography, not projecting digital.  After all, every single movie made is edited digitally and then spit back out to film, so there's 35 mm film involved at some point unless you shoot edit and distribute digitally.  Projecting digital won't take a beautifully filmed movie shot on 35mm and sterilize it.  \r\n\r\nAnd the shipping cost isn't the only expense here--making 3000+ prints of a big movie is no small potatoes, and the economy of scale works against small, indie films too.  Digital projection might offer the means to more cheaply and quickly distribute films, but it sounds like the obstacle is an industry that wants the theaters to pay for the swap out.\r\n\r\nAbove all else, the films that are getting released need to be better if people are going to stay involved--and they need to be something that seeing in a theater with an audience will enhance. ",
      "created_at": "2006-05-05T07:24:25.000Z"
    },
    {
      "author": "nicole",
      "body": "We had something interesting happen today that kind of falls into the whole \"digital vs print\" category. For one of the films that was released on Day and Date (DVD the same day as film), the theaters that actually exhibit those films get a small percentage of the DVD sales. So that was pretty exciting, receiving a check from a film studio as opposed to mailing a check to them.",
      "created_at": "2006-05-05T07:36:58.000Z"
    },
    {
      "author": "Caleb",
      "body": "Um...your mom uses digital projection in a real theater. \r\n\r\nVery informative, well-written article there Dan. I can always immediately tell when I'm watching something projected digitally. It's just not as pretty. In fact I think your projector should have a slogan: \"Because film is just sexier.\" \r\n\r\nOn another note, as far as independent films go, I think it's really important to support digital <i>filmmaking</i> because it has given a \"paintbrush\" so to speak to many people who otherwise might never have had a chance to make movies, for better or for worse. The Moxie has done Springfield a great service by realizing this and showing movies by local filmmakers, even though it means projecting them digitally.",
      "created_at": "2006-05-05T23:35:55.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Watching a film digitally in a theatre looks like you're watching a DVD (ugh, Flying Tiger). Film looks so much better, even if there are blotches everywhere.",
      "created_at": "2006-05-06T06:49:45.000Z"
    },
    {
      "author": "I {heart} Dan's mom.",
      "body": "Dan, hey I know everyone else has said \"thanks\" but really, \"thanks\" for a well written and informative article.\r\n\r\nFor a geek, this type of info is just good pr0n, but hopefully the average gives at least a little attention to the first couple of paragraphs.\r\n\r\nBut heck, if anyone is looking for a \"real\" theatre experience that is ... too cold or too hot + low volume level + extra butter for your popcorn ON the seats + sharing an armrest with a typical missourian + the best possible customer service a pimpley 15-year-old can give ... I suggest they give the (non)friendly local Campbell 16 a visit.\r\n\r\n(said in a whisper ... Wehhhrenberg)\r\n\r\nDan and all...I bid you, good day.",
      "created_at": "2006-05-10T06:46:05.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 16,
      "name": "Customers"
    }
  ]
}
