{
  "id": 404,
  "title": "A perfect storm",
  "body": "I have a feeling that tonight is going... to... be... incredibly... ssssslllllooooowwwwww. Why? Well, do you remember how I said it's pretty slow on nights when there's a pub crawl? And do you remember when I wrote that First Friday Artwalks tend to cannibalize our older demographic? And do you recall how I told you that our attendance decreases across the board on nights (especially weekend nights) when there's a Springfield Cardinal's home game? And how beautiful weather tends to put a dent in ticket sales? Well, guess what's going on tonight... on this beautiful, 68 degree evening there is a HUGE Cinco de Mayo pub crawl, a First Friday Artwalk, AND a Springfield Cardinals home game. Hopefully THE BIG LEBOWSKI can draw in a few revelers this evening. Wish us luck!\r\n\r\nThis weekend doesn't look too promising either, as the Springfield ArtsFest is taking place on both Saturday and Sunday.\r\n\r\nSo, I guess I'll have plenty of time to write a follow-up to yesterday's post. Yay!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-05-06T01:07:39.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Jordan",
      "body": "Don't worry, Dan.  I'll show up in support of The Moxie (and to a slightly lesser degree the Coen Bros.) any day.  Except for tonight, because I have to go clean at the Campbell Suxteen - I'm not too proud to call it that - and then sleep.\r\n\r\nSaturday, though?  Saturday's a shoe-in.",
      "created_at": "2006-05-06T01:59:17.000Z"
    },
    {
      "author": "Derek",
      "body": "Were it not for the whole moving out and leaving town simultaneously tomorrow morning and therefore needing desperately to pack tonight, I would most certainly be there right now and for all of the shows of the evening. Now it's back to work. Good luck.",
      "created_at": "2006-05-06T03:20:34.000Z"
    },
    {
      "author": "matt",
      "body": "just out of curiosity, are you showing a print of the big lebowski, or a dvd copy?  i know there are prints that still float around since there's a theater here that shows it once a year or so.  what a great movie to see with an audience, and one that most people who love it seemed to have missed the first go-around.",
      "created_at": "2006-05-06T03:42:05.000Z"
    },
    {
      "author": "bjork24",
      "body": "We have the real deal, Matt. An original 35mm theatrical print. If I were to wager a bet, I'd say it's been played at least 500 times. It's great!",
      "created_at": "2006-05-06T03:54:15.000Z"
    },
    {
      "author": "Scott G.",
      "body": "Dan, is there any chance you could show art at your place on First Friday?  The Moxie Gallery?  maybe have a movie showing in the background.  No? ",
      "created_at": "2006-05-06T05:55:59.000Z"
    },
    {
      "author": "bjork24",
      "body": "Actually, we already have a Moxie gallery. We switch out artists on a monthly basis to conincide with the Artwalk. Don't get me wrong, we get plenty of people on First Friday, but they're only here to see the art, not the movie. Don't they know that the movie IS THE ART?!",
      "created_at": "2006-05-06T06:00:39.000Z"
    },
    {
      "author": "matt",
      "body": "i took my girlfriend to see the big lebowski about 2 years ago at one of these revival cult screenings.  the print was obviously old and worn but it was still great to see it again with an audience.  people dressed up, there was trivia!  the only unfortunate thing was that some nimrods thought it would be funny to recite every line from the movie a la rocky horror or like when you watch a movie like spinal tap at home.  just DON'T let people do that!  i'm glad you guys are showing that.",
      "created_at": "2006-05-06T07:30:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "AND we're giving away free bowling game certificates. I need to think up some good trivia!",
      "created_at": "2006-05-06T07:33:20.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i bet the slowness wouldnt be so bad.. if morons werent running around throwing orange soda everywhere...\r\n.. ahem...\r\n\r\nanyway.. do more people (besides me and my friends) at least buy some concessions while they are looking at the new art of the month?\r\n\r\nif you were giving away free white russians.. you'd be sold out\r\nmaybe if i stand outside and give away white russians\r\ndont worry.. if i get arrested i promise not to mention *both* of your names",
      "created_at": "2006-05-06T12:32:57.000Z"
    },
    {
      "author": "Caleb",
      "body": "You want a white russian? I can get you a white russian, believe me. There are ways, Dude. You don't wanna know about it, believe me. Hell, I can get you a white russian by 3 o'clock this afternoon... with nail polish. These fucking amateurs...",
      "created_at": "2006-05-06T18:46:38.000Z"
    },
    {
      "author": "Nicole",
      "body": "The BIG L turnout was decent last night. I think tonight's will be bigger.",
      "created_at": "2006-05-06T19:07:41.000Z"
    },
    {
      "author": "brian of moore",
      "body": "well played caleb.. well played",
      "created_at": "2006-05-06T20:56:13.000Z"
    },
    {
      "author": "Caleb",
      "body": "Saturday late night screening of The Big Lebowski = the bestest time I've had at the Moxie since opening night. If you missed it well that sucks for you now doesn't it?",
      "created_at": "2006-05-07T11:09:27.000Z"
    },
    {
      "author": "erin",
      "body": "the screening was indeed awsome! was that steve buscemi's first visit to the moxie?\r\nthe only non-awsome part about the evening was the constant getting up of people going out and in. in and out. but i guess thats should be expected with a large group of boozed young people (i know, im a total square). its great there was such a good crowd though.\r\n\r\ncant wait for next years! caleb and i have plans for awsome 'long live donny' t-shirts.\r\n\r\ni ",
      "created_at": "2006-05-08T01:58:56.000Z"
    },
    {
      "author": "Jordan",
      "body": "Sorry for text messaging during the free game/poster giveaway.\r\n\r\nNext time I'll be more aware.  I promise.",
      "created_at": "2006-05-08T02:44:22.000Z"
    },
    {
      "author": "Caleb",
      "body": "Question: when can we expect another great episode of Moxie TV? Surely Justin doesn't have anything better to do in his last week of classes! My real question was whether the episode will be Arrested Development-centric or not. And if so, well, that would just be hilarious. I got dibs on playing Gob though, just as long as Dan and Nicole buy me a Segway so I can fully get into character.",
      "created_at": "2006-05-09T08:39:00.000Z"
    },
    {
      "author": "brian of moore",
      "body": "<a href=\"http://www.apple.com/trailers/sony/artschoolconfidential/large.html\">art school confidential</a>\r\n\r\ni want to see it because it has the word art in it\r\nwell.. that an john malkovich",
      "created_at": "2006-05-09T11:21:21.000Z"
    },
    {
      "author": "justin",
      "body": "we're taking this week off.... but we'll be back next week",
      "created_at": "2006-05-09T19:05:40.000Z"
    },
    {
      "author": "Rachel",
      "body": "Dan & Nicole -- How do you go about getting noise permit for an outdoor event? Any info would be useful!",
      "created_at": "2006-05-09T20:48:45.000Z"
    },
    {
      "author": "bjork24",
      "body": "Rachel: If your event is downtown, start with the Urban Districts Alliance (www.udaonline.org)",
      "created_at": "2006-05-09T21:07:17.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
