{
  "id": 405,
  "title": "Stone Reynolds strikes again",
  "body": "As many of you already know, The Moxie sponsored a team of employees and friends to compete in the <a href=\"http://www.sato48.com\" target=\"_blank\">SATO 48 Hour Film Challenge</a> a couple weekends ago. We had a blast making this little 5 minute film, and were nominated for SIX awards (Best Picture, Best Editing, Best Direction, Best Screenplay, Best Sound, and Best Actor for DUG)... unfortunately, we won NOTHING! As is the case with all good awards ceremonies, another movie swept the event.\r\n\r\nNow that the awards gala has past (it was Sunday night), we're free to show our film to the public. So in lieu of a new episode of MoxieTV, I give you <a href=\"/episodes/7\">STONE REYNOLDS</a>. Sharp eyes might notice two Moxie employees, excluding myself. If you count Justin's voice, that would make three Moxie employees.\r\n\r\nThe objective, by the way, was to create a 5 minute film that used the provided prop (the ArtsFest bag) in 3 shots - a close up, a shot where it's altered, and a shot of our choosing - and also followed this central theme: \"To solve a conflict in a creative way.\" Let me tell you, five minutes is NOT very long.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-05-10T02:58:07.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Nate",
      "body": "Sharp eyes might also catch a wigged-out Dan falling off a fence onto his ass.  That man sacrificed his body, like, EIGHT times for that shot.\r\n\r\n\r\n\r\nI am getting the word 'KNOWLEDGE-A-FUL' printed on a T-shirt.\r\nAny takers?",
      "created_at": "2006-05-10T17:18:22.000Z"
    },
    {
      "author": "Nate",
      "body": "I heard the director on this, the real one, was a real a-hole to work for.  \r\nThe first day?  He fired someone just to show everyone on the crew who was boss.  Then he put a cigarette out on his own neck.\r\n\r\nAnd Dug was a diva.",
      "created_at": "2006-05-10T17:20:28.000Z"
    },
    {
      "author": "Melinda",
      "body": "Nothing less than inspiring.  A true artistic masterpiece, and on a deeper level... reeking of philosophical brilliance.  \r\n\r\nAwesomeness conflict solving.  I totally got the golf club metaphor, like it was the hand of conscienceness itself.\r\n\r\nBravo, Team Moxie.  Bravo.\r\n\r\n(And I thought I was the only person to ever wipe a booger on the car seat... dang, is nothing I do original?)",
      "created_at": "2006-05-10T22:26:18.000Z"
    },
    {
      "author": "Honkey Hero",
      "body": "Hey, I liked that a lot! Great job! That is one was one of my favs... ",
      "created_at": "2006-05-12T23:37:56.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 17,
      "name": "MoxieTV"
    }
  ]
}
