{
  "id": 406,
  "title": "Hello Springfield!",
  "body": "Springfield's very own Federal Prison Hospital - home to such notable criminals as Al Capone, Robert Stroud, and John Gotti - has a shout out in FIND ME GUILTY, Sidney Lumet's new film that just started showing tonight. I was startled by it, but not nearly as much as when I found out Jason Bourne was from Nixa (a suburb of Springfield). Hooray for local references in big Hollywood movies! Good thing I don't live in NYC, or else this post would be much, much longer.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-05-11T08:17:37.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "erin",
      "body": "isnt there some famous actor or something from around here too? B something. Bart? Bruce?\r\n",
      "created_at": "2006-05-11T16:18:29.000Z"
    },
    {
      "author": "Caleb",
      "body": "I assume the \"B---\" actor Erin is speaking of is Bob Barker, honorable host of the best damn show on television. That is, if you're a 60-year old woman.",
      "created_at": "2006-05-11T18:13:59.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Yeah, Bob went to Drury. About the Bourne thing, I'm from Nixa, and that had us talking for months. We even hoped the third movie would be shot here (of course, the plot would to have been changed quite a bit). Don't forget Southwest Missouri getting a mention in the Best Picture-winning Million Dollar Baby.",
      "created_at": "2006-05-11T19:52:15.000Z"
    },
    {
      "author": "Amanda",
      "body": "We had fun with The Bourne Supremacy because Jason's 'real' name is exactly the same as one of our good friends. David Webb.",
      "created_at": "2006-05-11T20:57:11.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Remember the X-Files episode that ended in a call center in Camdenton, Mo.? That's where I'm from!",
      "created_at": "2006-05-11T21:04:05.000Z"
    },
    {
      "author": "Caleb",
      "body": "Nice write-up in Go Magazine's 20 Under 30 about you guys, among other noble Springfieldians. But I did notice Bob Barker was missing from the issue even though he's looking young as ever.\r\n\r\nAnd as far as Hollywood recognizing Missouri goes, I think <i>Deep Impact</i> beats all the rest when President Morgan Freeman thinks of a way to save humanity from an unfortunately-guided comet by putting a bunch of people in Missouri caves. ",
      "created_at": "2006-05-11T21:04:11.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "My hometown, Wichita, Kansas, has a fair share of movie shout outs. Such as in <i>Planes, Trains, and Automobiles</i>: \"Are you saying I could be <i>stuck</i> in Wichita?\" Or <i>All the President's Men</i>: \"That's a bullshit question, that's a question straight out of Wichita, Kansas.\" \r\n\r\nAh... Hollywood loves Wichita.",
      "created_at": "2006-05-11T23:37:45.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Don't forget The Ice Harvest.",
      "created_at": "2006-05-11T23:58:34.000Z"
    },
    {
      "author": "Melinda",
      "body": "Earlier this week on Good Eats (yep, I watch the Food Network), the show started with a guy in a kitchen looking perplexed.  The host asked him what was wrong, and he said, \"Tonight's pot roast night, and Mom's gone.\" \r\n\r\n\"Where did she go?\"\r\n\r\n\"Branson, Missouri.\"\r\n\r\nSo the host helped the poor fella learn how to cook pot roast, and all was well.  \r\n\r\nMom never returned.",
      "created_at": "2006-05-12T18:37:26.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
