{
  "id": 407,
  "title": "Arrested Development fans UNITE!",
  "body": "As many of you already know, we're hosting an ARRESTED DEVELOPMENT MARATHON at the Belmonte on Saturday, May 20th. I'd like to show at least 10 episodes, but I need your help deciding which ones. If you jump over to tv.com you can view <a href=\"http://www.tv.com/arrested-development/show/17005/episode_listings.html?season=0\" target=\"_blank\">a listing of all the episodes from all the seasons</a>. Let me know which ones are you favorites, or which ones you'd like to see, and I'll tally up the votes to find out which ones get played. I think the pilot episode is a given...<br/><br/>Season 3, by the way, isn't <i>completely</i> out of the question, but for the sake of this post, let's pretend it is. Thanks for your help guys!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-05-12T06:08:25.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Laura",
      "body": "It's hard to whittle down my list of favorite episodes because I love them all.  Here's the short list of what I came up with:<br/><br/>From Season 1:<br/>Expanded Pilot<br/>Pier Pressure (\"And that's why you always leave a note\")<br/><br/>From Season 2:<br/>Immaculate Election (\"Steve Holt is a bastard\")<br/>Afternoon Delight<br/>Motherboy XXX<br/><br/>From Season 3:<br/>Fakin' It (\"My name is Judge\" and the Hung Jury!)<br/><br/>Good luck narrowing your list down to 10.  Sheesh!",
      "created_at": "2006-05-12T10:34:40.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<br/>Yeah, I tried to come up with just ten.  Impossible. <br/><br/>Was <i>S.O.B.S</i> in Season 3 where they held the \"TBA Fundraiser\" event at the beginning?  It seemed like it was much earlier, maybe S2.   <br/><br/>I know S3 is possibly off limits, but I remember that episode SLAYING me...<br/><br/>Agreeing with Laura, <i>Pier Pressure</i> should be in for sure as well as the full pilot.  <br/><br/><i>Bringing up Buster</i><br/><i>Key Decisions</i><br/><i>Shock and Aww</i><br/>and <i>Missing Kitty</i> round out my S1. <br/><br/>Season 2: <br/><br/><i>The One Where They Build a House</i><br/><i>Afternoon Delight</i><br/><i>Motherboy XXX</i><br/><i>The Immaculate Election</i><br/><i>The Sword of Destiny</i> (\"May I have the trick sword please?\")<br/><br/>That's tough, I want to see them all.  Somebody else? <br/>",
      "created_at": "2006-05-12T17:36:57.000Z"
    },
    {
      "author": "Nate",
      "body": "As an AD virgin, I should just tell you guys to not screw this up.",
      "created_at": "2006-05-12T17:50:13.000Z"
    },
    {
      "author": "btchplz",
      "body": "wow, this is a great idea!<br/>  top ten:<br/>season one- my mother the car<br/>                  pier pressure<br/>                  public relations<br/>                  shock and aww<br/>                  let em eat cake<br/><br/>season two- the one where they build a house<br/>                  amigos<br/>                  afternoon delight<br/>                  sword of destiny<br/>                  meet the veals<br/>                  <br/>                   <br/>                   ",
      "created_at": "2006-05-13T01:45:33.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Well, it seems everyone wants Afternoon Delight, and I will add to that. I also really love \"Righteous Brothers\". But I think for the sake of AD virgins like Nate, and for the overall cohesiveness and hilarity of the marathon, if possible, you should show ten episodes in a row. For example ep.'s 1-10 or 15-25. Because the show has a lot of main jokes that run through several episodes, and seeing them together would prob. be funnier than seeing 10 random (although hilarious) episodes. So, I suggest to see which ones people request and then play the ten ep. block that contains the most requested ep.'s possible. But it will be the best marathon ever either way, just a suggestion.",
      "created_at": "2006-05-13T11:00:05.000Z"
    },
    {
      "author": "Katie",
      "body": "I'm sure this event will be hilariously awesome no matter what you show, but the Ocean Walker episode makes laugh hysterically every time I see it. Ha. Bumpaddle.",
      "created_at": "2006-05-15T21:52:28.000Z"
    },
    {
      "author": "doorbell",
      "body": "i think showing them in a row would add definite benefits to people who are not familiar. episodes with lucille 2 come to mind.  ",
      "created_at": "2006-05-17T03:53:36.000Z"
    },
    {
      "author": "Tammy Kirks",
      "body": "Wow. This is a tough decision. My all-time favorite episode is \"Meet the Veals,\" but there are so many other great ones, especially with Liza Minnelli. So here's my suggestions:<br/><br/>Pilot - extended version<br/>Visiting Ours<br/>Pier Pressure<br/>Missing Kitty<br/>Good Grief!<br/>Afternoon Delight<br/>Burning Love<br/>Motherboy XXX<br/>Meet The Veals<br/><br/>Also, the episode where George Sr. installs a hot tub in the attic just kills me. I can't remember the name. I'm all for skipping the first episodes in  Season 3 (I blame Charlize Theron for AD's demise), but the ending ones where Tobias is working at the \"restaurant\" are hilarious.",
      "created_at": "2006-05-17T18:38:47.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
