{
  "id": 408,
  "title": "Da Vinci Code protests",
  "body": "This handwritten letter was delivered to a theater owner in Cleveland, Ohio:<br/><br/><i>Dear Superintendant of the theater,<br/><br/>Please do not consent to have the \"Da Vinci Code,\" movie presented at your theatre.<br/><br/>It's a major attack against Christianity, based on a novel by Dan Brown who says that Jesus and Mary Magdalene had sexual relations and a child together - and that the figure of St. John in the Da Vinci picture of \"the Last supper\", is really Mary Magdalene. How preposterous when there are 12 figures, representing the 12 apostles.<br/><br/>If you do present this movie, we will rally the theatre and protest for the good of all society.<br/><br/>The organization that we belong to is, \"America Needs Fatima.\" It is a catholic organization - yet in listening to the Protestant T.V. stations, they also are protesting the novel; and are determined to organize and protest the movie theatre that will present it.<br/><br/>Hopefully none will accept this movie in their theatre.<br/><br/>Thank you.</i><br/><br/>I wonder if THE DA VINCI CODE will get the same reaction here in Springfield? Either way, it just leads to more buzz and free publicity... as if the movie needed it in the first place.<br/><br/>via <a href=\"http://www.film-tech.com/cgi-bin/ubb/ultimatebb.cgi?ubb=get_topic;f=5;t=001650\" target=\"_blank\">Film-Tech</a><br/><br/><b>UPDATE:</b> You can add this to the list as well:<br/><br/><i>Worldwide protests over THE DA VINCI CODE continued to be mounted Wednesday in advance of the film's official premiere at the Cannes Film Festival next week. In Mumbai (formerly Bombay), India about 2,000 members of the Catholic Secular Forum and their supporters marched through the streets, many displaying placards reading, \"Stop Hurting Our Faith,\" while others vowed to stage a hunger strike \"until death.\" In the predominantly Catholic Philippines, it appeared that the government was about to ban the film after Eduardo Ermita, executive secretary to President Gloria Macapagal Arroyo, remarked that \"we should do everything not to allow it to be shown.\" Even in Muslim Jordan, the country's Council of Churches called for the film to be banned as blasphemous.</i><br/><br/>via <a href=\"http://imdb.com/news/sb/2006-05-11/#4\" target=\"_blank\">IMDB</a>",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-05-13T07:09:22.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "Geez, if you do not want to see a movie, don't see it! The book itself doesn't bash Christianity at all (besides, since when was it a sin to get married and have kids?), but instead has probably acted to revive interest in religion, if anything. Just because it offers an idea contrary to the details of the Bible doesn't mean it's the Antichrist. If they're worried about <i>that</i> then I think they need to be protesting The Omen next month. ",
      "created_at": "2006-05-13T07:25:30.000Z"
    },
    {
      "author": "Master RJ",
      "body": "All this uproar sometimes makes me a self-hating Baptist (Yes, I'm liberal and Baptist, does anyone have a problem with it?).",
      "created_at": "2006-05-13T07:33:14.000Z"
    },
    {
      "author": "brian of moore",
      "body": "how proposterous! a woman apostle! <br/>everyone knows thats impossible<br/>as well as everyone knows that evolution is impossible<br/>and that jesus could turn desert sand into snowcones",
      "created_at": "2006-05-13T09:20:33.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Apparently lacking a dictionary containing the word \"<b>fiction</b>,\" all these fundies and associated groups blasting the Da Vinci are cracking me up.   They're actually making documentaries and shows refuting this WORK OF FICTION.  <br/><br/>Eye on the ball, people.<br/>",
      "created_at": "2006-05-13T21:44:11.000Z"
    },
    {
      "author": "Amanda",
      "body": "What's preposterous is the clunky syntax in that letter.",
      "created_at": "2006-05-13T21:44:40.000Z"
    },
    {
      "author": "Caleb",
      "body": "Jeff, apparently the groups read the version, \"The Da Vinci Code: A Memoir\" with the foreward by James Frey before the publisher pulled it from the shelves with new editions under the \"fiction\" category.",
      "created_at": "2006-05-13T22:56:24.000Z"
    },
    {
      "author": "--Jeff",
      "body": "<i>Jeff, apparently the groups read the version, \"The Da Vinci Code: A Memoir\" with the foreward by James Frey before the publisher pulled it from the shelves with new editions under the \"fiction\" category.</i><br/><br/>NICE.   So, doesn't that make Frey 0-2 in writing autobiographies?  Seems like he should just stick with writing fiction, since that seems to be what he's good at... <br/><br/>",
      "created_at": "2006-05-14T17:26:56.000Z"
    },
    {
      "author": "springer brother of the justin variety",
      "body": "silly christians. uneducated people protesting films and such make me cringe. this whole belief is nothing new to the history of the church. have they ever heard of gnosticism? and even if jesus was married, does that change anything really?",
      "created_at": "2006-05-15T01:45:36.000Z"
    },
    {
      "author": "Maddy",
      "body": "The problem is that people like this give an entire group of people (Catholics, Christians, whatever...) a bad name.  Don't they realize how silly they look?",
      "created_at": "2006-05-15T03:34:37.000Z"
    },
    {
      "author": "Nate",
      "body": "1)  Theatres have \"Superintendents\"?<br/><br/>2)  How does one \"rally\" a theatre?  Does one turn one's ballcap around backwards?<br/><br/>3)  Does anyone here think religious zealots embarking on hunger strikes until death is a bad thing?  'Cause I sure don't.",
      "created_at": "2006-05-15T20:22:47.000Z"
    },
    {
      "author": "Robotech_Master",
      "body": "Will the religions of the world never learn that all their protests are completely counterproductive to the goals they want to attain? I personally don't plan to watch DVC because Dan Brown writes crap books, and I have no interest in seeing a crap movie based on a crap book. And if left to its own devices, the crap movie would probably tank at the box office.<br/><br/>But every time a religiously-controversial film comes out&mdash;<i>Last Temptation of Christ</i>, the Mel Gibson jesus movie (forget the name), and now <i>Da Vinci Code</i>&mdash;some religious faction(s) hurries out to protest it&mdash;and everyone not in those factions immediately buys tickets to find out what the fuss is about.<br/><br/>Too bad they can't just do what the Good Book says and turn the other cheek.",
      "created_at": "2006-05-17T07:45:14.000Z"
    },
    {
      "author": "kurt meadows",
      "body": "Doesn't anyone have more important things to do than \"pa-tooing\" a movie staring tom hanks? geez. (no offense to mr. hanks) Those on one side of the argument won't change and those on the other side won't change either. Nobody wants to be proven the fool. ",
      "created_at": "2006-05-18T00:56:09.000Z"
    },
    {
      "author": "Tony Sherwood",
      "body": "As someone who's a Christian, I can honestly say that if Jesus was married, that wouldn't affect me in the least (although I don't think that he would put someone through the pain of being his wife and then watching him be beaten and crucified... I know I wouldn't do that to anybody).  However, I think a lot of what was put in the Da Vinci Code was put there because it would be \"shocking\" and that puts Dan Brown in the same camp as Jerry Springer... not worth reading, not worth seeing the movie, and not worth standing outside to protest.<br/>",
      "created_at": "2006-05-20T01:39:42.000Z"
    },
    {
      "author": "Sara",
      "body": "Ummm... Movie?  Not real.  And, Tom Hanks sucks in it.<br/><br/>Watch it for Paul Bettany.  Not the story.<br/><br/>And wait for the $2 show.  (I saw it by force, not choice.)",
      "created_at": "2006-06-02T17:44:56.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
