{
  "id": 409,
  "title": "Market trends at The Moxie",
  "body": "The movie exhibition business is often described as \"feast or famine\" by those working on the inside. In the early days (read: pre-last week), my mental outlook was based on the highs and lows we experienced here at the theater. If it was a good week, I was happy; if it was a bad week, I was grumpy; and if it was a piss poor month altogether, I was <a href=\"/posts/375\">an intolerable, whiny, little pantywaste</a>. Now, as a veteran theater-owner of nigh on eight months, I've finally begun to harden myself against sudden attendance downturns. Two thirds of a year is a long time in the exhibition business, you know. I've seen lesser men buckle after only 2/3 of an 8 hour shift! Of course, I'd be lying if I didn't blame Paul - our cinementor - for at least some, if not all, of our shift in perspective. That man's been experiencing the ebb and flow of the indie arthouse scene for well over five years. If anyone knows the feeling of having a stellar month turn to crap, or vice versa, it's Paul. Thanks again for your help, ol' buddy!\r\n\r\nHmm...\r\n\r\nWhat was the original reason for this post? Oh yeah, I remember: market trends at The Moxie. It's amazing how similar running a movie theater is to investing in the stock market - with us being brokers, and our audience being investors. We <a href=\"http://www.boxofficemojo.com/daily/\" target=\"_blank\">track daily transactions</a>, <a href=\"http://www.indiewire.com/\" target=\"_blank\">read news hot off the wire</a>, <a href=\"http://www.metacritic.com/film/\" target=\"_blank\">listen to analysts</a>, <a href=\"http://www.imdb.com/\" target=\"_blank\">research good investments</a>, and <a href=\"http://www.moxiecinema.com/calendar\">publish our entire portfolio</a> for all the world to see. Sometimes it's a bull market here at the theater, while other times attendance can be a bit bearish. There are literally hundreds of factors that can affect how our \"stocks\" perform: from the ones we can control (lack of exposure across the city, niche advertising, forgetting to turn on the outside lights, etc.), to the ones we can't (finals week, beautiful weather, tornadoes, baseball home stretches, pub crawls, snow storms, First Friday Art Walks, etc.).\r\n\r\nDo all theaters see as much fluctuation in their attendance as we do? Probably not. Running a single screen theater is like having only one company's stock in your entire portfolio. So, in keeping with that analogy, with every additional screen you add to your theater, your portfolio diversifies exponentially. That's the biggest thing I envy multiplexes... diversification (am I really saying this?). Having eight or more screens allows theaters to hedge their bets and lessen the ups and downs of the market to a certain extent. Multiplexes, like the smart investors they are, can fill their largest auditoriums with high yield stocks like MI:3, POSEIDON, and RV, and make a killing from ticket sales!\r\n\r\nOh. Wait.\r\n\r\n<b>This just in:</b> MI:3 and POSEIDON tanked at the box office this weekend.\r\n\r\nHmm. Perhaps it's a bear market all over this crazy industry! Who would'a thunk it? My hope is that this \"finals week\" slump doesn't downgrade into a summer long depression. I think as long as we continue to invest wisely, and further build the integrity of The Moxie portfolio, then we should bounce back in no time. With that said, September can't get here soon enough. Hurry back students. Hurry back!\r\n\r\nHere's to a bullish summer, folks!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-05-15T06:03:05.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "if you are suggesting... putting another screen in the bathrooms..\r\n..... im not completely opposed to the idea\r\n\r\njust make sure they are short films.. and its only one bathroom\r\nive been finding myself buying at least two sodas everytime i come\r\nso youll need at least one bathroom that wont be occupied for 30 minutes at a time\r\n",
      "created_at": "2006-05-15T09:21:38.000Z"
    },
    {
      "author": "chris (tall dude)",
      "body": "Finals week will be over soon enough.  As for tornadoes, I'm working on it.  ",
      "created_at": "2006-05-15T16:35:26.000Z"
    },
    {
      "author": "Caleb",
      "body": "I knew <i>Poseidon</i> would sink, and I'm not talking about the ship. It looked like it would be the <i>Stealth</i> of this year. ",
      "created_at": "2006-05-15T23:06:29.000Z"
    },
    {
      "author": "Nate",
      "body": "And yet, I am bizarrely drawn to the concept of escape through the labyrinthine bowels of a capsized ship.  Don't know why.",
      "created_at": "2006-05-16T00:37:19.000Z"
    },
    {
      "author": "drtedd",
      "body": "Then do what I did Nate.  Rent \"Titanic\" and watch it standing on your head (or turn your TV upside down).",
      "created_at": "2006-05-16T01:43:43.000Z"
    },
    {
      "author": "Caleb",
      "body": "Dan, how much do you predict <i>The Da Vinci Code</i> will open with this weekend? I think it will break $80 million.",
      "created_at": "2006-05-16T01:57:58.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'd say somewhere between mid-60s to high-70s. Tom Hanks hair will keep it from reaching 80 million on opening weekend.",
      "created_at": "2006-05-16T02:07:16.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Hmm, Stealth and Poseidon were huge failures... has Hollywood found its next Ben Affleck, Josh Lucas? Probably not, he's not famous enough to be a big failure. Anyway, Dan, what happened to the State of the Moxie posts? I LOVE STATS!",
      "created_at": "2006-05-16T02:12:55.000Z"
    },
    {
      "author": "bjork24",
      "body": "<i>Anyway, Dan, what happened to the State of the Moxie posts?</i>\r\n\r\nThey were used against us. I won't say by who, or for what purpose, but we decided it would be better to play our hands a little closer to the chest.\r\n\r\nI HAVE POCKET JACKS! I HAVE POCKET JACKS!",
      "created_at": "2006-05-16T02:27:33.000Z"
    },
    {
      "author": "matt",
      "body": "if making a collective 40+ million is tanking, i'll take it!  there's certainly a scale to these things and people who expect every big movie to open to a 70-100 million dollar weekend see anything less as a failure, but if mi3 and poseidon were just on fewer screens, their per screen average and total raked in would make sense and no one would be calling them the mess that they are for the box office.  whether or not they are even movies worth talking about is another thing altogether!  \r\n\r\ni just went to a single screen arthouse theater here yesterday to see the Notorious Bettie Page (not a great flick, but not a bad way to spend 90 minutes) and what struck me there was the apathy that the theater owner seemed to display towards the product.  this is a beautiful old theater with curtains and stuff and yet there's no effort to ever do anything special there that i'm aware of.  no premiere events, no screenings with directors, no silent movies with bands playing, no animation festivals, no godzilla movies at midnight... nothing.  it's basically 'here's our one screen and here's the movie we have on and if we don't feel like cutting trailers onto the one print we are showing, tough!' and that just doesn't really work.  \r\n\r\ni guess my point is... don't ever lose that excitement for what you do and why you started this.  a one screen arthouse theater is only ever going to be as cool and energetic as its owners.",
      "created_at": "2006-05-16T05:15:17.000Z"
    },
    {
      "author": "bjork24",
      "body": "Then I guess we only have a few years left... you know, until the coolness wears off... for Nicole. I'm never going to be lame! Woo hoo!",
      "created_at": "2006-05-16T05:20:09.000Z"
    },
    {
      "author": "Nicole",
      "body": "The coolness wore off from me the day I turned 13.",
      "created_at": "2006-05-16T06:33:13.000Z"
    },
    {
      "author": "Caleb",
      "body": "What? Dan and Nicole? <i>Cool???</i> HAHAHAHA! ",
      "created_at": "2006-05-16T07:26:42.000Z"
    },
    {
      "author": "Andy",
      "body": "Fairly unrelate, but, I would like to see statistics on this:\r\n\r\nHow many newspapers in this nation ran a header reading \"Poseidon Sinks,\" and pretended that it was the wittiest barb in box office report history?",
      "created_at": "2006-05-16T10:16:12.000Z"
    },
    {
      "author": "Nate",
      "body": "I have seen about four reviews already that used the term \"waterlogged.\"",
      "created_at": "2006-05-16T16:46:32.000Z"
    },
    {
      "author": "Gregory Holman",
      "body": "Dan—Love this post. V. clever.\r\n\r\nGreg",
      "created_at": "2006-05-19T17:38:22.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
