{
  "id": 41,
  "title": "Post Forty-One",
  "body": "Well, I don't have much to report today. We're still making progress, slowly but surely. Nicole is working with an interior decorator who was kind enough to volunteer her services in exchange for free advertising and a few movie tickets. I'm still waiting to hear back from our equipment dealer, but it may be a couple more days since I'm guessing he's onsite at an out-of-state project. In the meantime, I'm busying myself with business plan revisions and website tinkering.\r\n\r\n<b>SPEAKING OF WEBSITES:</b> I'm currently trying to wean myself off of table-driven layout and embrace CSS-P wholeheartedly, but I'll be damned if it isn't the hardest thing I've ever done in my life! I can typically pick up a new web language (or in the case of CSS, new web syntax) in a week or so, but this is like relearning the English language without using our standard 26-letter alphabet. It's hard!\r\n\r\n<b>RIDDLE:</b> How many letters are in the alphabet?\r\n\r\n<b>THE LURE OF BLOGGING:</b> What is it about blogging that's so appealing? Before starting this one, I'd never read a blog in my life, but now I read all kinds. If a visitor leaves a comment with a URL on one of my posts, I always take the time to go and read through their blog. They're addicting, I tells ya. A very unusual, and research-worthy, social/cyber construct, to be sure.\r\n\r\n<b>VIRTUAL ANONYMITY:</b> I also find it strange, yet intriguing, that beyond this blog, no one has any idea who I am, what I look like, or where my hat is. Of course, that intrigue goes both ways. When I read other people's blogs (those that don't provide pictures, that is), I often find myself envisioning what the author looks like based on their posts. I do that a lot - when I talk to people on the phone, when I hear a new band on the radio, when I read an article in the newspaper or in a magazine - I'm always trying to envision what the person looks like.\r\n\r\n<b>WHERE AM I GOING WITH THIS?:</b> I'm not sure. I know I promised to keep my posts \"theater-oriented,\" but I couldn't help myself. Although, since this blog is a construct and/or result of starting the theater, I suppose talking about it could be considered \"theater-oriented\" chatter.\r\n\r\n<b>EXAMPLE OF NON-THEATER-ORIENTED CHATTER:</b> Does anyone else think Colin, from the Colin and Christie team of <i>Amazing Race</i>, looks like Luke Skywalker? Seriously. Check <a href=\"http://moxie.danchilton.com/pix/grum/151_luke_colin.jpg\" target=\"_blank\">this</a> out if you don't believe me.\r\n\r\n<b>LO, LO, LO, LOGOS:</b> I'd like to extend a hardy thank you to everyone who took the time submit a logo for <b>The Moxie</b>. For those of you who haven't submitted one yet, there's still time. The polls are open until 12:00 am on July 31st, after which time all entries will be either burned or eaten.\r\n\r\n<b>RIDDLE ANSWER:</b> There are 11 letters in the alphabet.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-07-28T19:51:34.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Necrite98",
      "body": "I totally agree with what you said about blogger fixation.  I've only been blogging for a few weeks now, but it has become something of an electronic heroin addiction.  I check your blog constantly for updates, and have since been turned on to several others that I must check daily.\r\n\r\nThank you for all of the wonderful posts!",
      "created_at": "2004-07-28T22:53:31.000Z"
    },
    {
      "author": "bjork24",
      "body": "Necrite98, thanks!",
      "created_at": "2004-07-28T23:09:22.000Z"
    },
    {
      "author": "whit",
      "body": "that guy totally looks like Luke Skywalker.",
      "created_at": "2004-07-29T01:19:17.000Z"
    },
    {
      "author": "Jay",
      "body": "whoah, holyshit!  what's really creepy is i didn't realize you'd superimposed colin's face on luke's for several seconds.",
      "created_at": "2004-07-29T02:11:50.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'm telling ya! It's uncanny.",
      "created_at": "2004-07-29T02:16:25.000Z"
    },
    {
      "author": "Kev Malo",
      "body": "Totally Luke. The whiny bitch.",
      "created_at": "2004-07-29T04:13:27.000Z"
    },
    {
      "author": "Newell",
      "body": "I'm with you on the blogging thing. I started mine due to peer pressure from a group of online friends who were all starting them around the same time. It's funny because I thought it was a fad and none of us would be keeping up with it for as long as we have. I've been doing mine for around seven months now. It's still mostly only read by the friends that conned... er... coaxed me into it in the first place. Of the group I started with, I think I update my blog much more frequently than the rest of them (even though I haven't done so in about a week, for shame!). I keep doing it 'cause I kind of enjoy it. It's therapeutic in a weird sort of way to put your personal affairs out in public site without anyone REALLY knowing who you are.",
      "created_at": "2004-07-29T10:10:26.000Z"
    },
    {
      "author": "whit",
      "body": "whoa!  that's alot of logo entries!  How are you going to choose (pick me! pick me!)?",
      "created_at": "2004-07-29T20:08:38.000Z"
    },
    {
      "author": "bjork24",
      "body": "Newell, even the people who I come in contact with 7 days a week don't REALLY know me.\r\n\r\nWhit, we'll most likely print them all out and let Bogey eat them. The one that's the least chewed up will win.",
      "created_at": "2004-07-29T20:25:28.000Z"
    },
    {
      "author": "Anti",
      "body": "ditto on the blog fixation, I started mine because I was banned on a forum and thought I'd entertain myself.\r\n\r\nBlogs are like television to me now.",
      "created_at": "2004-07-29T21:26:43.000Z"
    },
    {
      "author": "Sar",
      "body": "Very interested in your theater...I have toyed with the idea of opening a bar but haven't researched the logistics of such a project...\r\nAs for blogging...I have blogged for quite some time but just recently started reading other blogs.  It is VERY addicting!",
      "created_at": "2004-07-29T22:47:02.000Z"
    },
    {
      "author": "Americanmuse",
      "body": "Hey, I was wondering who provides you with this comment script, I like that you customized it to your site and was hoping I could do the same on mine. Let me know, won't you please?",
      "created_at": "2004-07-29T23:07:40.000Z"
    },
    {
      "author": "bjork24",
      "body": "Anti, you gotta be careful on those forums... they'll get you everytime.\r\n\r\nSar, good luck with your bar.\r\n\r\nAmericanmuse, I built this ultra-fancy comment script in PHP.",
      "created_at": "2004-07-29T23:27:34.000Z"
    },
    {
      "author": "Americanmuse",
      "body": "Well, its really nice. I wish I knew how to do that.",
      "created_at": "2004-07-30T00:02:26.000Z"
    },
    {
      "author": "oddlyoddvincent",
      "body": "I found your hat. The cats next door were playing with it. I'll have it properly laundered and mail it back to you.",
      "created_at": "2004-07-30T17:50:20.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks.",
      "created_at": "2004-07-30T18:07:07.000Z"
    },
    {
      "author": "José Roberto",
      "body": "Hi. I`m from Brazil and recently found your blog by accident... Really great to read about The Moxie, especially because it`s so rare to see something like this in the region I live in... Really, really far from São Paulo, Rio de Janeiro... Far from heaven... =) VHS, DVD and eMule are what save me from complete madness. \r\n\r\nIf you find a way to translate some portuguese words, please take a look at my blog. Are you familiar with brazilian cinema?",
      "created_at": "2004-07-30T21:38:27.000Z"
    },
    {
      "author": "bjork24",
      "body": "Jose, I can't say I know much about Brazilian cinema, but I'm always willing to learn.",
      "created_at": "2004-07-30T22:10:53.000Z"
    },
    {
      "author": "whit",
      "body": "Oh, but what about Gilliam's Brazil?  That's what I like to imagine Brazil to be like.",
      "created_at": "2004-07-30T23:45:49.000Z"
    },
    {
      "author": "Aj Riley",
      "body": "I understand exactly what you mean about blogging being addictive. I've only just started, and my friend thought I was crazy yesterday when something bad happened and I said, \"At least I'll have something to write about.\" By the way, I answered the riddle correctly.",
      "created_at": "2004-07-31T01:55:50.000Z"
    },
    {
      "author": "Guy",
      "body": "I counted only 7 letters in 'the Alphabet\" t,h,e,a,l,p, and b",
      "created_at": "2004-08-01T00:31:38.000Z"
    },
    {
      "author": "squeak",
      "body": "guy: each letter counts as one even if it repeats itself ;) \r\n\r\nto have the logo's final fate be subjected to the warm, wet slobber of a canine eroticus? Brings new meaning to the phrase: \"the dog ate my 'homework' ...\" \r\n\r\nblogging? just got started. I have toyed with the idea for a very long time. I like reading about other people and what they like. Give's the \"net\" some life.",
      "created_at": "2004-08-01T04:40:58.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "It's been great checking out those logo submissions. I also have to agree with everyone who says blogging is addictive. I used to be one of those who laughed at people who blogged. Having found a group of blogs that I can relate to has made me an addict. You know what they say, different blogs for different... frogs. Um, yeah.",
      "created_at": "2004-08-01T07:21:39.000Z"
    },
    {
      "author": "Red",
      "body": "If there are 11 in the alphabet you're referencing, are there 11010 in the English alphabet?",
      "created_at": "2004-08-01T11:06:39.000Z"
    },
    {
      "author": "Sarcasmotron",
      "body": "Glad to read about your CSS frustration. Me, too. Too many years of simple table layouts but as the saying goes, if it ain't broke, don't fix it.\r\n\r\nShould it take so long when it's supposed to make it easier? If I were taking care of the Amazon site then I could understand but sheesh, a blog's only one page.",
      "created_at": "2004-08-01T18:35:26.000Z"
    },
    {
      "author": "Pril",
      "body": "Hey i seen your haveing a logo thing i would like to help you out with a logo... that is if your still doing it! well i'm going to check your blog out somemore...",
      "created_at": "2004-08-02T00:40:28.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks everyone, but the logo competition is now over. I'll be posting about it in a couple minutes.",
      "created_at": "2004-08-02T01:22:51.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
