{
  "id": 411,
  "title": "The Magician's Alliance hates The Moxie",
  "body": "Tonight is our ARRESTED DEVELOPMENT MARATHON at The Belmonte! Woo hoo!!! I just picked up 49 chocolate-dipped bananas covered with various goodies: toasted coconut, chocolate sprinkles, crushed peanuts, and toasted almonds. I'm also taking over a giant cooler filled with tasty Fitz sodas (root beer, cream soda, and orange). The Belmonte will be providing a peanut butter and jelly bar, along with some nice warm tea. Unfortunately, I was unable to procure an illusionist. It's like I've been banned from the Magician's Alliance! I was hoping to get Tony Wonder. We're still going to have a blast - illusionist or not!<br/><br/>And for those of you who were curious, we're playing the episodes in sequential order - starting from the extended pilot to... whenever we're done. As a longtime AD fan, I would've loved to bounce around from episode to episode, but what about the people who aren't as familiar with the show? Fans and non-fans alike can appreciate the show in sequential order. I'm bringing season 2 with me though... just in case. Hope to see some of you there!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-05-21T00:35:13.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Andy",
      "body": "It's really a shame that this had to come on the same night as an Underoath show.",
      "created_at": "2006-05-21T19:48:28.000Z"
    },
    {
      "author": "Aaron J Scott",
      "body": "Did you hear that there was a Bluth Family estate sale yesterday? NPR had a little bit about it. Perfect timing ... What would have been even more perfect is if you had the marathon last week when David Copperfield was here. He was a lot of fun, even if a bit self-glorifying. I'm reading \"... Kavalier and Clay\" again because of it all.",
      "created_at": "2006-05-21T21:45:49.000Z"
    },
    {
      "author": "Caleb",
      "body": "If David Copperfield is so powerful that he can teleport someone from Springfield to Hawaii, he should have been able to magically appear at the show to perform a few tricks last night. What a phony.<br/><br/>Speaking of illusions, there are TWO films about magicians coming out this year. Christopher Nolan's <i>The Prestige</i> (starring Christian Bale & David Bowie - together at last!) and Neil Burger's <i>The Illusionist</i> (starring Edward Norton & Paul Giamatti). Yes, my friends, it is truly a magical year.",
      "created_at": "2006-05-21T22:56:38.000Z"
    },
    {
      "author": "Nate",
      "body": "You would think David Copperfield could make David Blaine disappear.",
      "created_at": "2006-05-22T18:25:28.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "David Blaine's next feat: riding in a car for 12 hours with David Copperfield.",
      "created_at": "2006-05-22T20:30:41.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
