{
  "id": 413,
  "title": "The Moxie Blog: Two years old and still not listed as an A-list blog on blogebrity.com",
  "body": "Well, here we are again. Another year of The Moxie Blog is through and done. When I started this blog 730 days ago, I had no idea it would be dragging on this long. It still seems strange to me that the entire theater, and the rest of The Moxie website, has materialized around <i>the blog</i>. I bet that's pretty rare in the business world. Can you imagine what this blog would be like if we were still in the process of opening? Pathetic. That's what it would be - absolutely pathetic.\r\n\r\nBut here we are, two years in! The number of articles I posted in year two was down 10% from the first year, but I attribute that to me being quite a bit more busy in this last year than I was in year one. I only managed to squeeze out 73,000 words this year, which is down quite a bit from the 100,000 I banged out in year one. At this rate, The Moxie Blog will only consist of two 1,000 word posts per year by 2017. But fear not, gentle reader. I guarantee you those will be two damn good posts.\r\n\r\nCheck out the special masthead today (avert your eyes to the top of the screen). It's a throwback to the olden days, before I had announced the location or name of our theater. How many of you were around back then? I can think of a few (Oz, Fyse, a few people who have, or had, \"Whitt\" as part of their name, etc.). Those were the days, huh. Back when men drank whiskey and women wore clothes. BUT ENOUGH WITH THE REMINISCING!\r\n\r\nInstead of going on about the past, let's look ahead to the <i>future</i>! As most of you know, we're a little more than 2/3 of the way through our first year of business. Assuming we make it to the big ONE YEAR mark (a huge milestone for any small business), we're going to be hosting a week long set of festivities that will knock your freakin' socks off! The fun will begin on Thursday, September 14th and end on our one year mark, September 21st. Here's a small taste of what you can expect:\r\n\r\n<ul><li><b>Movie trivia night</b> - teams will join together to answer difficult movie trivia (including questions about The Moxie), eat food, drink, and be merry.</li>\r\n<li><b>MST3K</b> - another round of our popular Moxie Skinny Theater 3000.</li>\r\n<li><b>Unplugged concert</b> - an acoustic concert with some of favorite local bands, along with cake and champagne.</li>\r\n<li><b>Special scavenger hunt</b> - I can't say anymore about this one.</li>\r\n<li><b>Cinebar sponsor</b> - another auction for the naming rights of our Cinebar.</li>\r\n<li>And possibly much, much more!</li></ul>\r\nThe biggest event of the week, however, will be a showcase of short films from local filmmakers. The films will be shown on the weekend of September 16-18, and an award ceremony will be held on September 20th. The only eligibility rules are that the film must be 20 minutes or less, and the filmmaker must reside within 100 miles of Springfield. Films will be judged by aneclectic panel of judges from Springfield, as well as by the audiences that view the films over the weekend. We want this to be a celebration of local film, first and foremost. We're not trying to create another film festival, we're just combining our favorite type of film (shorts) with our favorite kind of filmmaker (local). I'll post more information in the next couple days, but I wanted toannounce this as soon as possible so anyone who wanted to participate would have plenty of time to get their film done.\r\n\r\nAnd that about does it for now. Happy Birthday to the old Moxie Blog, and a big thanks to all you loyal readers!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-05-24T21:28:31.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Nate",
      "body": "Happy Birthday Moxie Blog!  Are we now in store for the Terrible Two's?  Will the Moxie Blog throw tantrums and break things?",
      "created_at": "2006-05-24T22:21:09.000Z"
    },
    {
      "author": "Yoda",
      "body": "Posted comment in a while, I have not.  Important occasion, this is.  Young padawan blog, you no longer are.\r\n\r\n\r\nRemains, one test does, before true master blog you become.\r\n\r\n\r\nGawker.  You must face Gawker.",
      "created_at": "2006-05-24T22:24:54.000Z"
    },
    {
      "author": "Sawyer",
      "body": "Happy birthday freckles.",
      "created_at": "2006-05-24T22:25:26.000Z"
    },
    {
      "author": "Invisible Smoke Monster",
      "body": "**whirrrr!!!**chachung! chachung! **whirrrrrr!!!!*** clank! clank! ** mrrrroooo!! *** chachung!",
      "created_at": "2006-05-24T22:26:36.000Z"
    },
    {
      "author": "Desmond",
      "body": "Are you him?",
      "created_at": "2006-05-24T22:26:53.000Z"
    },
    {
      "author": "erin",
      "body": "in a perfect world. i would have lots money. and would therefor win the naming rights of the cinebar.\r\n\r\n.... \"The Why Hasnt Steve Buscemi been in a Wes Anderson Film Cinebar\"\r\n\r\nbut then again... if it WAS a perfect world. steve would have already been in one of andersons films.",
      "created_at": "2006-05-25T00:36:15.000Z"
    },
    {
      "author": "Matthew Martin (Master RJ)",
      "body": "If I had money, it's would be either:\r\n\r\nThe Free Katie Holmes From Tom Cruise And Scientology Cinebar\r\n\r\nor\r\n\r\nThe No Matter What You Say, Jennifer Connelly Is Still The Best Actress In Hollywood Today Cinebar",
      "created_at": "2006-05-25T01:15:05.000Z"
    },
    {
      "author": "Caleb",
      "body": "In the spring of 2004,\r\nI was sick of the Hollywood gore.\r\nBut then I heard of a new place\r\nWhere I could expand my taste,\r\nAnd visit Campbell 16 no more.\r\n\r\nThey built this theater with Apoxie,\r\nAnd then glued it shut with epoxy.\r\nThey had a secret plan,\r\nAnd with a blog they began,\r\nNow they're open, this place called The Moxie!",
      "created_at": "2006-05-25T04:07:40.000Z"
    },
    {
      "author": "Fyse",
      "body": "Happy Blogday! I must've read nearly all of those 173,000 words, and enjoyed (almost) every last one. Here's to the next year in Moxieland!\r\n\r\nBTW How's the new spam catcher working out? Doing the job?",
      "created_at": "2006-05-25T04:10:08.000Z"
    },
    {
      "author": "erin",
      "body": "dear god caleb. that was awful.",
      "created_at": "2006-05-25T05:25:23.000Z"
    },
    {
      "author": "Matthew Martin (Master RJ)",
      "body": "What can I say, he thinks Ellen Page is 42 (About that, Ellen Page is perfect for that role. In fact, she looks too young for the character.)",
      "created_at": "2006-05-25T06:54:56.000Z"
    },
    {
      "author": "Caleb",
      "body": "At least I rhymed the word \"Moxie!\" - with the help of a rhyming dictionary that is.\r\n\r\nI can also define the word \"sarcasm\" - <i>without</i> a dictionary.",
      "created_at": "2006-05-25T07:19:17.000Z"
    },
    {
      "author": "Nate",
      "body": "And I can define \"irony.\"\r\n\r\nIt means when something is made of a hard and metallic  substance that is like iron, but not quite iron.  \r\nIt is iron-y.",
      "created_at": "2006-05-25T17:36:28.000Z"
    },
    {
      "author": "Oz",
      "body": "Congrats! (a day late).  I have to tell you that I often think of how amazing it is that you actually went out there and did this--got a little, independent theater.  When I was reading this blog back in the day, I never thought you'd actually do it.  What were the odds?  Well, I'm glad you did, and one of these days, I hope to come to the Moxie myself.  I wish it were closer to Kansas City, as I end up there at least once a year to visit the in-laws.  Do you think you could work on moving Springfield closer to Kansas City?  Then you could be come a Royals fan.  What fun!\r\n\r\nAnyway, I'm proud of you, Danny boy.  Keep up the good work!  Long live the Moxie!  And long live the Moxie Blog!!!",
      "created_at": "2006-05-26T00:36:51.000Z"
    },
    {
      "author": "Ben Dillon",
      "body": "Happy (Belated) Blogday.\r\n\r\nAnd thanks to Blogger's \"Blogs of Note\" for leading me to The Moxie (\"Cinema 24\") oh-so long ago.",
      "created_at": "2006-05-26T13:13:38.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
