{
  "id": 414,
  "title": "The Inconvenient Truth about booking limited release films",
  "body": "Every 15 minutes I get an e-mail via our <a href=\"http://www.moxiecinema.com/suggest\" class=\"broken\">suggestion form</a> asking me if we'll be playing Al Gore's AN INCONVENIENT TRUTH before the June 6th vote for a new coal-burning power plant in Springfield. Sometimes people leave their e-mail addresses, other times they don't. So, in the hopes of killing 896 birds with 1 stone, I'm going to reprint the e-mail I've been sending:<br/><br/><i>Dear loyal Moxie supporter,<br/><br/>We will be shownig Al Gore's AN INCONVENIENT TRUTH, starting on July 5th. The movie just opened last weekend in <u>four</u> theaters (two in NYC, and two in LA). It will slowly expand on June 9th to larger cities. Then, on July 5th, it will be available to mid-market cities (i.e. Springfield). We booked it for The Moxie as soon as we possibly could. I wish we could play it before the vote, but unfortunately that's not how the theatrical exhibition industry works. I hope you get a chance to see it in July (we will be showing it for 2 weeks). In the meantime, perhaps you'd like to come see all the other great films we show that don't necessarily influence the outcome of upcoming votes.<br/><br/>Thank you for your inquiry,<br/>Dan Chilton</i><br/><br/>I hope that helps stem the tide of requests. I wonder if all the people who are sending me e-mails will still come see the movie in July, long after the power plant vote has passed? I guess we'll just have to wait and see. In the meantime, please enjoy this funny picture I found while googling for an image of a \"laser gun.\"<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/052706/laser.jpg\" width=\"425\" />",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-05-28T00:22:10.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Matthew Martin (Master RJ)",
      "body": "That kind of looks like footage from a Claire Danes movie.",
      "created_at": "2006-05-28T01:59:24.000Z"
    },
    {
      "author": "Caleb",
      "body": "<i>\"In the meantime, perhaps you'd like to come see all the other great films we show that don't necessarily influence the outcome of upcoming votes.\"</i><br/><br/>Here here! <br/><br/>And I've never seen a romance/romantic comedy with laser guns, seeing as how that's about the only kind of movie dearest Claire stars in. I think we can all agree that was NOT her in T3, but rather a brainless, immoral clone of Claire.",
      "created_at": "2006-05-28T09:18:25.000Z"
    },
    {
      "author": "brian of moore",
      "body": "and thats when jimmy the mechanic learned never to ask uptight rich white businesswomen for directions<br/><br/>....  sorry i got nuthin...<br/><br/>anywho... you should show my movie when im done with it<br/>and by movie... i mean commercial...<br/>and by commercial.. i mean short art film for nike that really doesnt have much to do with nike besides having a bug in it.. made of shoe parts....   but as long as nike thinks it has to do with nike... ... then thats all that matters....<br/><br/>maybe this could be my 'ad'... since i never got around to doing that other idea i had....  hmmm.....<br/>just pretend its not for some multimillion dollar company that uses slave labor... <br/><br/>did i mention that ive been stuck in the art annex on campus for 9 days straight.. all day every day with the two same people every day.....  animating...<br/>no seriously... ALL day.... we keep staying up later and later ... im not even sure what day it is... i think i missed a day.... today should be my sunday... but its almost 11am on monday.... confusing.... ...eh<br/>i need some social interaction that doesnt include anyone in the room im in...... dont get me wrong... their nice people....<br/>at least... for the first five days......<br/><br/>...... help me....",
      "created_at": "2006-05-28T19:37:24.000Z"
    },
    {
      "author": "erin",
      "body": "brian, have you been bathing in the sculpture lab sinks? with murphy's oil soap?<br/><br/>hope you join civilization again soon.<br/><br/>and brian... it was sunday when you typed that. not monday dude.<br/><br/>: )",
      "created_at": "2006-05-29T07:36:21.000Z"
    },
    {
      "author": "brian of moore",
      "body": "hmm.... no... that was monday.........<br/><br/>wasnt it?  ... i mean.. wait.... holy crap youre right<br/>everythings jumbled..... my head hurts",
      "created_at": "2006-05-29T10:29:55.000Z"
    },
    {
      "author": "Caleb",
      "body": "<i>In another surprising debut, Al Gore's global-warming documentary, An Inconvenient Truth, amassed $365,787 at only four New York and Los Angeles theaters -- or $91,447 per theater, the highest-ever average for a documentary. (By contrast, X3 averaged $32,554 per screen.)</i><br/><br/>Saw this on IMDB today and thought you might find those numbers interesting. That's crazy! Hope it does that well for you guys in July!",
      "created_at": "2006-05-31T19:46:56.000Z"
    },
    {
      "author": "Nicole",
      "body": "I think it could possibly be our biggest film yet.",
      "created_at": "2006-05-31T21:25:10.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Makes me think of Fahrenheit 9/11, everyone who wasn't Republican (me and Mom included) saw it in theatres and enjoyed it.",
      "created_at": "2006-05-31T23:09:19.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
