{
  "id": 416,
  "title": "Ebert hypes AN INCONVENIENT TRUTH",
  "body": "I know most of you don't put much stock into what Roger Ebert says, but he's still one of my favorites, and probably the single most digested film critic of all-time, so you can imagine my surprise, and delight, when reading his new review on AN INCONVENIENT TRUTH (opening at The Moxie on July 5th). Here's a quick quote:\r\n\r\n<quote>When I said I was going to a press screening of \"An Inconvenient Truth,\" a friend said, \"Al Gore talking about the environment! Bor...ing!\" This is not a boring film. The director, Davis Guggenheim, uses words, images and Gore's concise litany of facts to build a film that is fascinating and relentless. In 39 years, I have never written these words in a movie review, but here they are: You owe it to yourself to see this film. If you do not, and you have grandchildren, you should explain to them why you decided not to.</quote>\r\n\r\nYou can read more <a href=\"http://rogerebert.suntimes.com/apps/pbcs.dll/article?AID=/20060601/REVIEWS/60517002\" target=\"_blank\">here</a>, and you can voice your Ebert love/hatred in the comments below.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-06-03T06:28:59.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Steve Croxton",
      "body": "First of all, my thoughts on Al Gore: I bought a copy of \"Earth In The Balance\" 14 years ago, and voted for Clinton as much for his courage to choose Gore as his running mate as for Bill himself. You can say what you want about Al, but he has never been afraid to stand up for what he believes in despite the political fallout, and his concern for the envronment has never waivered. He has continued to speak out on the subject, right on through his Vice Presidency, but unless you were a C-Span watcher, it went pretty much unreported. Then there is Mr. Ebert...\r\n\r\nFrom the moment I heard that Roger Ebert had called The Beatles' \"A Hard Days Night\" \"...one of the great life-affirming landmarks of the movies\", I knew that, agree or disagree with his views, I respected the man. He seems to speak from the heart as much as the head when he reviews a film. He's kinda like Leonard Maltin with balls. And from what I can tell, he watches films across the board, not just the big studio releases but a lion's share of the foreign and indie releases as well. Ebert loves film and loves what he does; I'm not so sure about many of his contemporaries...\r\n\r\nOr maybe I have a screw loose and am up too late...but that's my 2 cents...",
      "created_at": "2006-06-03T12:18:05.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Al Gore rules. On Ebert, he can be hit-or-miss (He gave Love Don't Cost A Thing three stars, while giving A Dirty Shame one star), but entertaining. But a good (hell, great) review on an important film always makes me smile.",
      "created_at": "2006-06-03T13:31:54.000Z"
    },
    {
      "author": "Caleb",
      "body": "Gore is the man. And the majority of Americans agreed with that in 2000. Ebert is the man too. And I agree with him 95% of the time. \r\n\r\nThe people who refuse to see this film are most likely the ones that think every element of global warming is one big myth. People used to think the earth was flat too, so I guess the rest of us should forgive their ignorance.",
      "created_at": "2006-06-03T21:34:04.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Global warning should not be compared to Casper the Friendly Ghost and flying pigs. It is 113% real.",
      "created_at": "2006-06-04T21:48:52.000Z"
    },
    {
      "author": "brad",
      "body": "saw it this weekend..really really good",
      "created_at": "2006-06-06T05:17:16.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 10,
      "name": "Reviews"
    }
  ]
}
