{
  "id": 417,
  "title": "I'm not the only one who thinks...",
  "body": "BILL AND TED'S EXCELLENT ADVENTURE is one of greatest movies of all time. <a href=\"http://www.kottke.org\" target=\"_blank\">Jason Kottke</a>, world reknowned blogger, also happens to <a href=\"http://www.kottke.org/06/06/bill-and-teds-excellent-adventure\" target=\"_blank\">agree with me</a>.<br/><br/><quote>I know I'm going to get mail about my five-star rating for this movie, but it cannot be helped. One summer when I was a kid, a friend and I watched Bill and Ted's Excellent Adventure -- no joke -- every single day for a span of 2 months. I still know every line by heart, the timing, inflection, everything. If there were a Broadway production of this movie, I could slide effortlessly into the role of either Bill S. Preston, Esq. or Ted Theodore Logan, no rehearsal needed.</quote><br/><br/>I'm not sure why I'm telling everyone this... I guess I just needed some vindication. I'm going to shoot Kottke an e-mail and inform him about \"<a href=\"http://www.billandted.org/musicalhome.htm\" target=\"_blank\">Bill and Ted's Excellent Musical Adventure</a>,\" an amateur musical about my favorite time travelling duo (complete with <a href=\"http://www.billandted.org/musical02.html\" target=\"_blank\">soundtrack</a> and <a href=\"http://www.glenncarter.com/mate/b&t.doc\" target=\"_blank\">script</a>)!<br/><br/>WYLD STALLYNS!!!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-06-05T07:45:54.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "You're not alone. This happens to be a favorite comedy of mine (my favorite comedy is Some Like It Hot). At one point, when was eleven, it was my favorite movie and also the first DVD I ever bought (haven't got the boxed set though). But then I started watching R-rated movies and Turner Classic Movies.",
      "created_at": "2006-06-05T08:23:08.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Whoa whoa whoa there Dan, now I'm not sure, but isn't it... Wyld Stallyns?",
      "created_at": "2006-06-05T10:42:04.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Yep, Dan spelt it wrong. He also spelt musical wrong. I'd watch it, at least it beats \"High School Musical\" and almost anything by Andrew Lloyd Webber (what a hack, that Webber).",
      "created_at": "2006-06-05T11:33:24.000Z"
    },
    {
      "author": "Nate",
      "body": "It goes, \"Wyld Stallions!\"  *air guitar riff*<br/><br/>You may think you can separate these things, but they are of a piece, they are parts of a whole.  They are one.",
      "created_at": "2006-06-05T16:29:40.000Z"
    },
    {
      "author": "Nicole",
      "body": "My history teacher in high school thought this movie was perfect, and we watched it in every class I took with him.",
      "created_at": "2006-06-05T20:46:52.000Z"
    },
    {
      "author": "bjork24",
      "body": "Jeezy Creezy, you guys are rough! Typos have been corrected.",
      "created_at": "2006-06-05T21:12:45.000Z"
    },
    {
      "author": "Sukotto",
      "body": "I loved B&T so much that I once watched it on the movie pay-channel (even though we didn't pay for it).<br/><br/>So I sat there and listened to the movie and watched the srcolling lines, flashes of colour, and negative (and sometimes inverted) shadow images of the actors.<br/><br/>",
      "created_at": "2006-06-05T21:40:37.000Z"
    },
    {
      "author": "brian of moore",
      "body": "fully agreed.... a most triumphant movie<br/><br/>'i fell out of my suit when i hit the door'<br/><br/>hehe....<br/><br/>my favorite line was probably from bogus journey<br/>when they are falling down that pit....<br/><br/>-wanna play 20 questions?<br/>~okay!....  i got one<br/>-is it a mineral?<br/>~yeah!<br/>-are you a tank?<br/>~yeah!!!<br/><br/>anywho... be excellent to each other <br/>... and party on dudes!<br/><br/>",
      "created_at": "2006-06-05T23:20:39.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Seriously, one of the best films.  <br/><br/>Matt and I quote it all the time.<br/><br/>And yet, we still don't own it.  Go figure.",
      "created_at": "2006-06-08T08:57:16.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
