{
  "id": 418,
  "title": "Rock and Roll!!!!!!!11",
  "body": "Another great night for ROCK AND ROLL SPACE PATROL. It wasn't a sellout, but it was pretty close. For those of you who didn't get a chance to see it, you still have one more chance tomorrow night. The DVDs went on sale today at <a href=\"https://buy.tromamovies.com/product_info.php?products_id=600\" target=\"_blank\">Troma</a> and on <a href=\"http://www.amazon.com/gp/product/B000EWBOHC/qid=1149654692/sr=8-2/ref=sr_1_2/102-9860508-8183340?%5Fencoding=UTF8&v=glance&n=130\" target=\"_blank\">Amazon</a>, but if you come to the showing tomorrow night, you can get an AUTOGRAPHED copy! DVDtalk has <a href=\"http://www.dvdtalk.com/reviews/read.php?ID=22012\" target=\"_blank\">a nice little review</a> about RNRSP:\r\n\r\n<quote>When you think about it, it's amazing how inspiration can overwhelm presentation. For all its digital bells and whistles, the Star Wars prequels are a horrendous waste of computing time, as underdeveloped and self-serving as a supposed entertainment entity can get. Frankly, there is more fun in the first fifteen minutes of Rock and Roll Space Patrol: Action is Go! than in the entirety of Anakin Skywalker's transformation into Darth Douche Bag. Not only that, but Troma tricks out the DVD in such a way as to guarantee hours of replay value. Therefore, this release easily earns a Highly Recommended rating, and proves that money and F/X mean nothing when you don't have a solid foundation of imagination behind them. Jim Bultas and his fellow fantasy geeks can stand up and be proud. This is, without a doubt, one of the funniest, freshest and most freaked out releases of 2006. If you ignore its lo-fi sci-fi fun, it will be you whose [sic] considered the dork.</quote>\r\n\r\nHopefully we'll see you tomorrow night for the final showing! And yes, I realize this is the third post in a row where I used my new &lt;quote&gt; feature. I just can't help it!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-06-07T08:34:07.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "monkey",
      "body": "I'm there dude! ;)",
      "created_at": "2006-06-08T02:33:13.000Z"
    },
    {
      "author": "monkey",
      "body": "btw...nice spam catcher",
      "created_at": "2006-06-08T02:34:20.000Z"
    },
    {
      "author": "brian of moore",
      "body": "<a href=\"http://www.aprairiehomecompanionmovie.com/\">a praire home companion movie!???</a>\r\n\r\nexcellent....\r\n\r\n\r\n",
      "created_at": "2006-06-09T18:54:20.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
