{
  "id": 419,
  "title": "An inconvenient truth about that movie with the same name",
  "body": "Well, it's happened again. A movie starts out on a limited release schedule, receives insane amounts of press, opens in four theaters to box-office-busting amounts of money, and just like that... the movie is verboten to smaller theaters. Such was the case with BROKEBACK MOUNTAIN and THANK YOU FOR SMOKING, and now once more for AN INCONVENIENT TRUTH and A SCANNER DARKLY.<br/><br/>When Paramount booked the film with us nearly a month ago (we were even listed on <a href=\"http://moxie.danchilton.com/pix/misc/truth.pdf\">their PDF of theaters showing the film</a>), TRUTH was still fairly unknown, but once the buzz and hype and stellar reviews started  to roll in, we began to worry. Are we upset? Sure we are, but that doesn't mean we don't understand why the decision was made. If I was at the zoo and watched some guy jump into the bear pit and get mauled to death, would I be upset? Yes. Would I blame the bear? No. It's simply the nature of the beast. The same metaphor can be extended to robots and the elderly.<br/><br/>The job of the movie studio is to make as much money as possible from their films. In today's climate of hyper-vigilant mini-critics and rants on IMDB, a movie has ONE week to make the lion's share of its money. Think about it: the latest X-MEN movie made $104M in the first weekend, and $34M the second. THE DA VINCI CODE made $77M the first weekend, $34M the second, and $18M the third. Films don't have the same staying power they used to, so it makes sense that studios would want to get the biggest bang for the dollar right from the start. Why play a guaranteed hit in a 75 seat theater when you can play it in an auditorium 10x that size, fifteen times a day?! It makes perfect sense, and leaves no one to blame.<br/><br/>I know a lot of you don't care much for Campbell, but I think you should make an exception and go see AN INCONVENIENT TRUTH. It's an important film that as many people as possible need to see. And don't worry about us, we still have plenty of good movies to take the place of AN INCONVENIENT TRUTH and A SCANNER DARKLY. Of course, once the Gillioz opens, this sort of thing won't be happen nearly as much.... mark my words.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-06-09T21:31:51.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "In the words of Dr. Sam Loomis:<br/><br/>\"I knew this would happen.\"<br/><br/>So, what will be the replacement feature?",
      "created_at": "2006-06-09T21:37:08.000Z"
    },
    {
      "author": "Nate",
      "body": "\"I know a lot of you don't care much for Campbell, but I think you should make an exception and go see AN INCONVENIENT TRUTH.\"<br/><br/>That right there.  That's as good a proof as any that the principles of Campbell and The Moxie are in fundamentally different places.<br/><br/>I will rent it.  The polar ice caps won't have completely melted within four months.",
      "created_at": "2006-06-09T22:57:12.000Z"
    },
    {
      "author": "polar ice caps",
      "body": "or will we? ",
      "created_at": "2006-06-09T23:41:00.000Z"
    },
    {
      "author": "Nate",
      "body": "Don't give up polar ice caps!  Fight!  Fiiiiiiight!!",
      "created_at": "2006-06-09T23:43:35.000Z"
    },
    {
      "author": "polar ice caps",
      "body": "if captin planet was still around he would be able to save me...  ... ",
      "created_at": "2006-06-10T00:36:10.000Z"
    },
    {
      "author": "Caleb",
      "body": "Al Gore just lost my vote...<br/><br/>Wait a minute, it's too late for that. I think you should e-mail the man and explain the situation and ask Mr. Gore if he would come speak at The Moxie on July 5 to make up for your misfortune. <br/><br/>And while I highly doubt the bigwigs at Campbell 16 care about the environment enough to be proud to show this movie, I guarentee they would not have publicly encouraged people to see the movie if it were playing at The Moxie. ",
      "created_at": "2006-06-10T02:28:52.000Z"
    },
    {
      "author": "Aristocrat",
      "body": "This makes me mad.  It makes me want to blow up little two-headed frogs with firecrackers!  Why can't we have anyting nice?  I'll tell you why:  The Man.  He's always keeping us down, taking away all things that are rightfully ours in a thinly veiled attempt to lower our IQ and make us fat.  Maybe we should rise up, protest, take them down.<br/><br/>Oh nevermind, there's a Buffy marathon and I'm fresh out of Doritos!!!  Gotta go.",
      "created_at": "2006-06-10T04:07:06.000Z"
    },
    {
      "author": "bjork24",
      "body": "<strike>Are you a mefite, Aristocrat? Do you have cameras?</strike> Nevermind.",
      "created_at": "2006-06-10T04:16:08.000Z"
    },
    {
      "author": "The Man",
      "body": "Dear Aristocrat, <br/><br/>Please return my two-headed frogs. <br/><br/>And the firecrackers. <br/><br/>Sincerely, <br/><br/>The Man. ",
      "created_at": "2006-06-10T05:17:12.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Forget Buffy. Bring some chips for a \"My So-Called Life\" marathon I will have. When I have it.",
      "created_at": "2006-06-10T08:15:49.000Z"
    },
    {
      "author": "Caleb",
      "body": "When is the silent film event again? I couldn't find it.",
      "created_at": "2006-06-10T09:00:23.000Z"
    },
    {
      "author": "brian of moore",
      "body": "we must prepare for the coming war with the elderly<br/>we cant let them win!... i dont want the highest speed limit to be 15 mph<br/><br/>.... but before i prepare... i must go to this my so-called life marathon",
      "created_at": "2006-06-10T12:15:26.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "But the problem is, it hasn't been scheduled yet. Maybe if I sold shares for my upcoming picture \"Mormon Sunday Of Death\" and get the $100,000 for the project, I could shell the money for chips, sodas, rental of Remington's (I go to youth church at Ridgecrest) for a Thursday or Friday, then I could do it. By the way, who's you're favorite character? Mine's Rayanne.",
      "created_at": "2006-06-10T14:07:51.000Z"
    },
    {
      "author": "brian of moore",
      "body": "of course it would be rayanne.... shes sultry<br/>brian krakow.. is pretty amusing ... definately not as good looking..<br/><br/>i remember seeing AJ Langer in 'the people under the stairs'...<br/>which i guess was made before she ever became rayanne...<br/>but i didnt see it till a few years after MSCL was cancelled...<br/>i think i saw her on some sort of doctor show recelently...<br/>i forget what it was.... hmm...",
      "created_at": "2006-06-10T23:58:30.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "It was called \"Eyes\". Never saw it, but with A.J., it had to be good. And it's pretty cool to see her younger in \"The People Under The Stairs\". Her and the fact Wes Craven directed it (and when it watching it, also finding out Everett McGill and Ving Rhames appearing) where the main reasons I watched it.",
      "created_at": "2006-06-11T04:58:48.000Z"
    },
    {
      "author": "Nate",
      "body": "Claire Danes with her baby fat.....awwwwww.....<br/><br/>\"And cheerleaders....can't people just cheer, like, by themselves?\"",
      "created_at": "2006-06-12T17:44:23.000Z"
    },
    {
      "author": "Nate",
      "body": "Hey, interesting fact!  Cameron Crowe was such a fan of MSCL that the shot of Jerry McGuire and Dorothy Boyd looking at each other across a residential street at night was a direct homage to the exact same shot in the pilot of MSCL with Angela Chase and Brian Krakow.  I always loved both shots but somehow never put it together.  Saw it on Wikipedia recently.",
      "created_at": "2006-06-12T17:47:15.000Z"
    },
    {
      "author": "eric",
      "body": "Definitely agree that as many people as possible need to see this movie.  Although it must be noted it's going to be hard to get the people who need to see it the most, to actually get over their misconceptions about it (or Al Gore).<br/><br/>Yet it is perhaps the single most important issue of our lifetime.  And lots of people aren't noticing!<br/><br/>There's a new site dedicated to spreading An Inconvenient Truth and to get people out to the theaters.  I don't think it's too late; tomorrow it opens in 400 more theaters as it expands across the country.<br/><br/>Anyway, I'd really appreciate if you took a look.  I welcome your thoughts.  The site is at http://sharethetruth.us and it *just* launched.  It is NOT for profit whatsoever.<br/><br/>Thank you!<br/><br/>eric",
      "created_at": "2006-06-17T07:59:06.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
