{
  "id": 420,
  "title": "How to ensure low attendance to a really good movie in the bible belt",
  "body": "Print the synopsis for KINKY BOOTS in the movie section as: \"Based on a true story of an English footwear factory that made kinky boots for transvestites to save the business.\" Hmmm. I wonder if the local paper will let us write the synopsis from here on in?\r\n\r\nIn other news: check out <a href=\"http://www.youtube.com/watch?v=V-bOPH-zEd0\" target=\"_blank\">this cool Moxie commercial</a> that <a href=\"http://www.nathandspringer.com/\" target=\"_blank\" class=\"broken\">Nathan Springer</a> made for a class project. Thanks Nathan! It looks grrrreeeeeaaaaaattttttt!\r\n\r\nThat's it, kiddos! Come see KINKY BOOTS!!!!!!!!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-06-11T05:56:54.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nathan springer",
      "body": "so i went and checked my website info and had seen that there was like a 100% jump in the last 12 hours, i now know why. thanks.",
      "created_at": "2006-06-11T06:24:21.000Z"
    },
    {
      "author": "bjork24",
      "body": "Really? I just posted this 30 minutes ago... such is the power of THE MOXIE BLOG!",
      "created_at": "2006-06-11T06:26:34.000Z"
    },
    {
      "author": "justin springer",
      "body": "yeah! you put the commercial up. i'm the moxie boxie guy! you should see all the sweet moxie shirt pics nathan and i took while in d.c. and nyc.",
      "created_at": "2006-06-11T08:10:23.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "No one should really pay attention to the new movie sypnosis page in The News-Leader. They gave Fantastic Four a B while Capote got a C+. They even liked The Shaggy Dog remake.",
      "created_at": "2006-06-11T23:01:43.000Z"
    },
    {
      "author": "nicole",
      "body": "Unfortunately, RJ, people do pay attention to that page.",
      "created_at": "2006-06-11T23:04:15.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Drat. I only pay attention to it to make fun of it. Bring back the old grading system and the ghost of Dave Daly!",
      "created_at": "2006-06-11T23:10:33.000Z"
    },
    {
      "author": "erin",
      "body": "very nice commercial. very nice.",
      "created_at": "2006-06-11T23:52:49.000Z"
    },
    {
      "author": "nicole",
      "body": "I saw KINKY BOOTS today. I thoroughly enjoyed it, but I am also in the mood for cabaret singing drag queens and British romantic comedies. It's just a warm fuzzy film!",
      "created_at": "2006-06-12T02:41:36.000Z"
    },
    {
      "author": "a moxie tv fan",
      "body": "where art thou moxie tv? to guide us, to inform us, to make us laugh. your fans cry out wanting more episodes, more dan, and yes more justin. please grant us this so after a long day of work we can come home, and watch the new episode thus making the whole day worthwhile... \r\n\r\n",
      "created_at": "2006-06-12T20:24:06.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Another beef with the current grading system:almost none of the Moxie movies are reviewed and graded, so they make them all seem like they're bad horror movies (cough, the When A Stranger Calls remake).",
      "created_at": "2006-06-12T23:57:01.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 16,
      "name": "Customers"
    }
  ]
}
