{
  "id": 423,
  "title": "Answered prayers...and classified ads",
  "body": "Hello there.  This is just a quick note saying that (short of a hole in the sky opening up and sucking every major league baseball player into the heavens) the coolest Springfield-related thing since the opening of the Moxie has risen:\r\n\r\n<a href=\"http://springfield.craigslist.org/\">SPRINGFIELD CRAIGSLIST!</a>\r\n\r\nNow head out there and post some ads!",
  "author_id": 3,
  "allow_comments": 1,
  "created_at": "2006-06-19T20:09:10.000Z",
  "author": "Justin",
  "comments": [
    {
      "author": "whit",
      "body": "whoa!  I was just perusing the StL craigslist lamenting Springfield's lack of one.  Looks pretty barren at the moment.  Can't wait to list all my random ugly furniture!",
      "created_at": "2006-06-19T20:24:15.000Z"
    },
    {
      "author": "Caleb",
      "body": "I must be completely out of the loop. What the heck is \"craigslist\"?",
      "created_at": "2006-06-19T20:48:47.000Z"
    },
    {
      "author": "bjork24",
      "body": "It's like a giant online garage sale, with funny posts and job listings -> <a href=\"http://en.wikipedia.org/wiki/Craigslist\" target=\"_blank\">Wikipedia</a>",
      "created_at": "2006-06-19T21:02:12.000Z"
    },
    {
      "author": "Nate",
      "body": "Caleb doesn't know what Craigslist is??  I know something \"techie\" that Caleb doesn't?  Even when I'm the one putting \"techie\" in quotations?  Unbelievable!\r\n\r\nIt is pretty cool, though.  Wonder if people will post invites to casual sex, like the ones Wonkette is always highlighting from D.C. interns?",
      "created_at": "2006-06-19T22:17:41.000Z"
    },
    {
      "author": "Nate",
      "body": "You think the News Leader will report this (it IS news), or hope it will go away (it is BAD news for them).  Maybe they already have, I dunno.  But I could see them not printing a word about it.\r\n\r\nSo much of their revenue comes from classifieds.  I hate to see any newspaper get choked off more than they already are, especially my own town's paper (I worked there, and have friends there, and I just like newspapers in general), but cl is just so damn handy.  And so damn free.",
      "created_at": "2006-06-19T22:34:15.000Z"
    },
    {
      "author": "bjork24",
      "body": "CL has sorta become the Wal-Mart of cyberspace, or so it's been called. Whatever town it moves into, the local paper takes a hit. Still, I've yet to hear of a print newspaper being put out of business by CL. Maybe one of the TV news shows will cover it... ?",
      "created_at": "2006-06-19T22:37:56.000Z"
    },
    {
      "author": "Nate",
      "body": "Jasmine Huda!  KSPR 33 Action Team!  Activate!",
      "created_at": "2006-06-19T22:44:46.000Z"
    },
    {
      "author": "Caleb",
      "body": "Nate, you would be surprised at my lack of knowledge about popular \"techie\" sites. I just discovered digg this year thanks to Dan. And in fact, I didn't even know what Wonkette was until you mentioned it, but let's pretend I always knew about it, just for a good laugh. \r\n\r\nSo Dan, when will you guys be getting the shocking documentary, <i>Craigslist: The High Cost of Free Classifieds</i>?",
      "created_at": "2006-06-19T23:14:43.000Z"
    },
    {
      "author": "nicole",
      "body": "There is actually a documentary called 24 HOURS ON CRAIGSLIST, but I saw it on DVD the other day.",
      "created_at": "2006-06-19T23:38:47.000Z"
    },
    {
      "author": "Gregory Holman",
      "body": "Craigslist is generally harmful to local media, yes, and its effects can be very similar to a Wal-Mart Supercenter's effects on small town-center businesses.\r\n\r\nGO Magazine, which, like the Moxie, is locally owned and operated, has offered free online and print classified and personal ads since its launch last August. Anyone can submit ads <a href=\"http://www.springfieldgo.com/classifieds/\">here</a>. \r\n\r\nIn doing so, you're supporting a local media outlet (owned by Whitaker Publishing, of 417 Magazine fame) whose owners, writers and other staff live here and patronize local things covered in the magazine, plus the businesses that advertise. Not something you can say about many of our competitors.\r\n\r\nGregory Holman\r\neditorial director\r\nGO Magazine",
      "created_at": "2006-06-20T00:23:23.000Z"
    },
    {
      "author": "bjork24",
      "body": "We heart GO Magazine and 417!",
      "created_at": "2006-06-20T00:26:21.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Where can I post a funding ad for my motion picture \"Mormon Sunday Of Death\". I just posted in GO Magazine's classifieds (waiting for approval) that I am trying to raise $100,000 to make it. It's an action/comedy shot in Nixa and Springfield and I will show it at the Moxie and give you 55% of the cut in Springfield, because you are so awesome.",
      "created_at": "2006-06-20T00:52:29.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Why do I always put things to a screeching halt? Why?! (Nancy Kerrigan screaming starts)",
      "created_at": "2006-06-20T07:00:16.000Z"
    },
    {
      "author": "Caleb",
      "body": "Because RJ, you dumbfound us with your incredible words of wisdom.  Or something like that.\r\n\r\nYou guys didn't get An Inconvenient Truth, but maybe you could get <a href=\"http://www.apple.com/trailers/independent/americafreedomtofacism/trailer/\">this one</a> in August or September? It looks intriguing, a wake up call even. Plus, it's proposing to be non-partisan.",
      "created_at": "2006-06-20T07:25:56.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Incredible words of wisdom? I'm making a feature-length film, I've got a script and you don't believe it? Why do you take Uwe Boll and Michael Bay seriously, but not me? You'll be sorry.",
      "created_at": "2006-06-20T09:14:49.000Z"
    },
    {
      "author": "Heather",
      "body": "CraigsList is going to be the best thing that has come to this town in years!! I moved here from San Francisco two years ago and life in SF revolved around Craigslist. Every job, apartment, pet, car, etc. I ever bought/found was on Craigslist... and it is free!!!\r\n\r\nI love Go, but Craigslist is entirely different than your classifieds... there is space for the both of you in this town... and if I were you I would get on Craigslist ASAP and starting promoting your new website and events. \r\n\r\nAs far as it replacing independent media, just won't happen. Craigslist does not generate content... in SF there is still the SF Bay Guardian and the SF Weekly and they partnered with Craigslist and worked together.\r\n\r\nFolks... its free... and you will see if you start using it that it is nothing like the news-leader... do you really want to pay $15 to sell that $16 toaster? And CareerBuilder... no thanks.  Craigslist is the the essence of a FREE INTERNET and the best there is in  online community... second only to MySpace, of course.",
      "created_at": "2006-06-21T01:06:27.000Z"
    },
    {
      "author": "DTGumby",
      "body": "Post in both Go and Craiglslist. Support your community.",
      "created_at": "2006-06-21T02:46:38.000Z"
    },
    {
      "author": "Caleb",
      "body": "Craigslist, while I'm sure it's useful, will never be as cool as Go. But then again, I read Go for the content, not the ads. ",
      "created_at": "2006-06-21T03:24:19.000Z"
    },
    {
      "author": "Nate",
      "body": "Unless you are reading this and are an advertiser in Go!  I always look at your ad!  I look at it and then immediately visit/patronize/buy your business/event/product!  Keep advertising in Go, please!",
      "created_at": "2006-06-21T03:53:36.000Z"
    },
    {
      "author": "Albert",
      "body": "About craiglist choking off the local newspaper...Good for craiglist. The newsleader sucks. I sell cars. Try putting a Jeep in the paper...the allow Jeep in about 5 different sections. In the Post Dispatch in STL, I am guaranteed to sell if its in the paper or craiglist...the Newsleader on the other hand is a waste of time and money... I hope Craigslist becomes the Walmart of advertising",
      "created_at": "2006-07-06T08:45:21.000Z"
    },
    {
      "author": "Albert",
      "body": "Pss..... Im the guy that sent the email to get Craiglist Springfield......i think ill give myself a cookie",
      "created_at": "2006-07-06T08:46:19.000Z"
    },
    {
      "author": "mobile world data communication ltd",
      "body": "we are auk company oour main business is selling of phones iopods and notebooks.for more information contact the general manager mr ben sammy(mwdclimited@yahoo.com) or call+447024079956",
      "created_at": "2006-08-22T15:09:18.000Z"
    }
  ],
  "categories": [
    {
      "id": 11,
      "name": "Techish talk"
    }
  ]
}
