{
  "id": 424,
  "title": "A Day at the Moxie without Dan and Nicole",
  "body": "Wow... two posts in a row by me (Justin, not Dan)! I'm sitting in the vault waiting for <a href=\"http://www.moxiecinema.com/films/91\" class=\"broken\">THE DEVIL AND DANIEL JOHNSTON'S</a> first showing to end.  Dan and Nicole <i>both</i> have tonight off!  This is the first time they've shared a night off since the theater opened in September.  Kelley and I are running the ship, which means that everyone who comes in tonight looks at us, realizes we're not Dan and Nicole, and walks out the door thinking they've gone to the wrong theater.  <br/><br/>So what's the special occasion?  Today is Dan and Nicole's 3rd wedding anniversary.  To celebrate the occasion, I'm going to post a cute kissing photo from the wedding day.  It's quite the <i>Kodak Moment</i>.  The only catch is, it isn't Dan and Nicole kissing.  It's Dan and his best friend (and best man) Doug.  Dan's surely going to fire me for posting this photo, but hey, it's worth it:<br/><br/><center><img src=\"http://img95.imageshack.us/img95/5516/kiss4vk.jpg\"></center><br/><br/>Cute, eh?  Happy Anniversary, Danicole!<br/>",
  "author_id": 3,
  "allow_comments": 1,
  "created_at": "2006-06-22T05:23:46.000Z",
  "author": "Justin",
  "comments": [
    {
      "author": "brian of moore",
      "body": "aww... love is a beautiful thing....<br/><br/>and so is that awkward smile...",
      "created_at": "2006-06-22T05:39:52.000Z"
    },
    {
      "author": "Al",
      "body": "You can almost hear the foreplay a starting.",
      "created_at": "2006-06-22T07:18:38.000Z"
    },
    {
      "author": "Jonna",
      "body": "Hehehe... Dan looks like he's wearing lipstick!  And it reminds me of that scene in Clifford (the movie with Martin Short, not that big red dog.. geez) where Clifford trades out his uncle's chapstick for that old woman's lipstick...",
      "created_at": "2006-06-22T07:43:52.000Z"
    },
    {
      "author": "Caleb",
      "body": "It's been nice working with you Justin! <br/><br/>And Happy Anniversary Dan and Nicole!",
      "created_at": "2006-06-22T08:41:22.000Z"
    },
    {
      "author": "Nate",
      "body": "What, no tongue?",
      "created_at": "2006-06-22T17:29:57.000Z"
    },
    {
      "author": "bjork24",
      "body": "Oh... there was tongue... in my ear!",
      "created_at": "2006-06-22T18:47:02.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Dan's got the Edward Norton in \"American History X\" thing goin' on.",
      "created_at": "2006-06-22T20:23:28.000Z"
    },
    {
      "author": "nicole",
      "body": "Dan can look like Edward Norton, Chris O'Donnell or Morgan Spurlock, depending on his mood.<br/><br/>I can look like my sister Stephanie.<br/><br/>Thanks for the post and filling in last night, Justin and Kelley!",
      "created_at": "2006-06-22T21:10:56.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "Why is Dan wearing lipstick?",
      "created_at": "2006-06-24T02:08:56.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
