{
  "id": 425,
  "title": "Moxie Shorts 2006",
  "body": "For those of you who didn't notice the new ad on the sidebar, or the <a href=\"http://www.moxiecinema.com/forum/index.php?action=vtopic&forum=4\" class=\"broken\">new section in the forum</a>, Moxie Shorts 2006 has been officially announced. Everything you need to know can be found at <a href=\"http://www.moxieshorts.com\" class=\"broken\">www.MoxieShorts.com</a>, so what are you waiting for?! Get busy making a movie, dude!\r\n\r\nBut before you go... I have a few suggestions for people who might be considering making a short film, but don't quite know what to make it about. Instead of taking the easy road and making a short film about the rise and fall of Greco-inspired architecture in pre-war Miami, why don't you think about making a short in one of these fun, yet under-used genres:\r\n\r\n<ul><li><b>Silent short film:</b> It doesn't have to be black and white, but it also shouldn't be a music video. A good silent film mixes minimal verbal cues with expressive acting. It's an art that may well be forgotten, but I think it might be right up the alley of a few intrepid filmmakers.</li>\r\n<li><b>Documentary short:</b> Why waste your time writing a fictional story when there are so many interesting ones floating around Springfield?! Dig up a good story, do a little research, and film a light-hearted documentary that will help us learn something new about our surroundings.</li>\r\n<li><b>Animated shorts:</b> Granted, making an animated short is a lot of hard work, but at all the short film festivals and showcases we've been to, they're always the hit of the party. Remember, not all animated shorts have to be classic pen to paper, or computer to screen, animation - stop motion is still a viable way to make an entertaining flick. One of the most enjoyable short films I've seen was a 3 minute stop motion music video for a Benny Benassi song... the entire film was made up of dancing orange juice and milk cartons. AWESOME!</li></ul>\r\nSo there you have it - a few recommendations to hopefully help you spark your inner filmmaker. Good luck!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-06-23T21:45:57.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Oz",
      "body": "I have to admit, I feel sort of left out of this whole film making contest.  Not that I'm a film maker nor likely to make a film for this contest at any rate, but I feel excluded nonetheless.  And I also feel like you must have a readership that exists outside of Springfield (especially us old time readers from before the Moxie even existed in Springfield), and some of those readers might actually be interested in making a film for this festival.  For those people, I have a suggestion.  I understand that your ticket buyers will most likely be from Springfield, and Springfield themed filmed will interest them.  So is it possible to open the submissions up to films which are set in Springfield (and the filmmaker may or may not live in nor be from Springfield)?  You could make it so that the \"setting\" was central to the film, i.e. more than just a passing reference.  Then the festival would be open to all the readers of the Moxie blog--if they want to take the step of learning enough about Springfield to set their film there.\r\n\r\nSo just to be clear on what I'm suggesting, the film festival would now be open to films made by Springfield filmmakers (any content) AND also open to films which are set in Springfield (which may or may not be made by Springfield filmmakers).\r\n\r\nAnd that's my two cents. :)",
      "created_at": "2006-06-24T15:54:58.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
