{
  "id": 426,
  "title": "A depressing Monday post",
  "body": "In case you thought we were the only theater in the US to have AN INCONVENIENT TRUTH ripped away from us, think again. Arthouse theaters seem to be an endangered species these days, and no other article has more accurately described our current state of peril than <a href=\"http://www.boxofficeprophets.com/column/index.cfm?columnID=9615\" target=\"_blank\">this one</a>. If you've ever considered opening an arthouse theater, or care about the existance of little microcinemas like The Moxie... READ THIS ARTICLE.<br/><br/><quote>Now, along comes Al Gore and his hip PowerPoint presentation. Do the little indie arthouse guys reap the benefits of playing this Paramount Classics \"blockbuster\"? The answer has generally been, \"No.\" The Regals and AMCs and Centurys of the world have jumped into the arthouse pool and have snapped up An Inconvenient Truth for their so-called art programs. The independent arthouse exhibitors – who support Paramount Classics when the grosses aren't so frothy – have been, in many cases, deprived of one of the summer's major arthouse hits.</quote><br/><br/>With the big chains bearing down on us on one side, and the day-and-date release chipping away from the other, it'll be a wonder if little cinemas like ours make it through the next five years. Reactionary on my part? Probably. If anyone can go against the grain, it's The Moxie. LONG LIVE THE MOXIE!<br/><br/>Seriously though. Read this article and discuss. It raises a TON of good points, and I'm eager to hear what you have to say about it.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-06-26T09:20:33.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Scott G.",
      "body": "Could you go without booking Paramount Classics?  I can believe that it might not make much sense to do that if they are one of your main bookies or whatever they're called :)  ",
      "created_at": "2006-06-27T20:14:41.000Z"
    },
    {
      "author": "bjork24",
      "body": "We could do that, but then we'd have to quit booking all the other distributors who went to Campbell over us: Warner Independent (SCANNER DARKLY), Focus Features (BROKEBACK MOUNTAIN), Sony Picture Classics (CAPOTE), Fox Searchlight (THANK YOU FOR SMOKING)... and pretty soon all we're left with is Magnolia Pictures, and I'll be <i>damned</i> if I become Mark Cuban's bitch... again.",
      "created_at": "2006-06-27T20:19:18.000Z"
    },
    {
      "author": "brian of moore",
      "body": "i think if you kids keep up with your innovative and interesting ideas.... like moxie a go go... moxie shorts.....  the moxie art wall<br/>etc etc..... then i think you will only grow with popularity...<br/>getting the good popular movies is definately a big part of staying in business... but the moxie has alot more going for it.. than just good movies<br/><br/>or at least thats what my biased mind... tells me",
      "created_at": "2006-06-26T09:37:05.000Z"
    },
    {
      "author": "Nate",
      "body": "I second that!<br/>If I just went for the movies, it wouldn't bother me at all to wait a few months for the DVD's to come out.  <br/>But for the blockbuster movies, though, nine times out of ten that is exactly what I do.  I wait four months for the DVD.  And I'm a movie lover!  One who used to insist on seeing the \"big\" movies on big screens.  Now I see those on my small-ish screen at home, and all the art-house movies on a big screen.<br/>It's not even that the C16 and SPR8 are all that bad an experience, it's just an empty experience for $8 a pop, vs. taking it home for $2-$3.  Whereas, at the Moxie, I'm getting more than that:  I get to hang out a little bit.  Take it easy.  See people I know.  Talk to the owners.  Sprinkle some seasonings.  Stroll over to Well Fed Head, etc.  And usually the movie's better.  I don't care if every art-house movie goes day and date.  I would still be paying to see many of them at the Moxie.  So it's people like me you need to find - and are finding - the habitual theatre audience.  We're the ones who won't stop coming.",
      "created_at": "2006-06-26T17:50:05.000Z"
    },
    {
      "author": "Bluto Blutarski",
      "body": "\"Over? Did you say over? Nothing is over until we decide it is! Was it over when the Germans bombed Pearl Harbor? Hell no!\"<br/><br/>",
      "created_at": "2006-06-26T18:18:16.000Z"
    },
    {
      "author": "Steve Richards",
      "body": "I understand the studios desire for a quick money grab on their more mainstream product.  However, I don't get how the speciality divisions do not see it in their best interest to increase traffic at the theaters where 90% of their product will play.  I also do not understand why the smaller film divisions would ignore the long term effect on their own company if independent theaters are forced to close.  Putting smaller films with wider appeal into bigger theaters on paper may seem like a better business decision, but I think that long term it is a mistake.  (I'm not completely sure on this but:  I don't think Campbell 16 has ever played a Paramount Classics film before and have serious doubts that they will be programming the division's next non-Al Gore release)",
      "created_at": "2006-06-26T22:32:57.000Z"
    },
    {
      "author": "bjork24",
      "body": "When Paramount Classics originally booked AN INCONVENIENT TRUTH with us, we thought it was there way of rewarding us for doing so well with NEIL YOUNG... apparently not.",
      "created_at": "2006-06-26T23:26:14.000Z"
    },
    {
      "author": "Dave",
      "body": "i guess the best that could happen is that a few high profile indys like this get ripped from small theaters, and bomb in the big theaters. that way, later on, if a big theater has the choice of showing the indy on 1 screen or adding another screen for a blockbuster they'll go for the sure thing.",
      "created_at": "2006-06-27T18:13:33.000Z"
    },
    {
      "author": "Steve Richards",
      "body": "Economic intimidation obviously is not a viable solution however nabbing children of executives may do some convincing.  ",
      "created_at": "2006-06-27T20:35:24.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "But it's fun to be Mark Cuban's bitch! (I may be a little biased for being a Mavericks fan.) By the way, I'll support ya when I make my indie movies with exclusive two-week runs on opening weekend or when it hits 20-30 screens (55% cut both weeks) with choice for holdovers (additional 40% cut after that at other theatres, because I said so). But one little catch, you might need additional showings each day.<br/><br/>Example:<br/>Fri-Sun:11:30 2:00 4:30 7:00 9:30 12:00 (two-hour film)<br/>Fri-Sun:11:30 3:15 7:00 10:45 (three-hour film, I'll make a few)<br/>Mon-Thurs:2:00 4:30 7:00 9:30 (two-hour film)<br/>Mon-Thurs:4:15 8:00 (three-hour film)<br/><br/>Little Known Fact:Patrick Stewart loves country music.",
      "created_at": "2006-06-28T04:52:55.000Z"
    },
    {
      "author": "Stephanie",
      "body": "I have spent many, many hours in that Palm Desert theatre.  I'm am now even happier that I spent my time there.  Interesting article - I just don't know how you convince the distributors to forgo the cash from the chains on movies that will support larger audiences.  Money talks - there is no loyalty to be had out there. ",
      "created_at": "2006-06-28T05:33:59.000Z"
    },
    {
      "author": "Ron",
      "body": "It's all Wal Mart's fault.",
      "created_at": "2006-07-10T07:12:20.000Z"
    },
    {
      "author": "Gayle",
      "body": "As long as you guys are around, I'll be there.  It's utter crap that you got ripped like that.  You'd think Paramount, who lives off money, would be happy to give the movie to anyone who wants it and can afford to pay for it.  But perhaps I'm being naive in thinking that the  more exposure this movie gets, the more money it could make.<br/><br/>I, for one, will not being seeing it at Campbell 16.  Not only because you guys got hosed but also because Campbell 16 gets more annoying every time I'm there.",
      "created_at": "2006-07-27T01:22:41.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
