{
  "id": 428,
  "title": "O PROPOSITION, O PROPOSTION, wherefore art thou PROPOSITION?",
  "body": "<b>Monday</b><br/><br/>As is the case on every Monday, we called the film couriers to make sure this week's films (WATER and THE PROPOSITION) were on their way. With the holiday falling on our regular delivery day, it was very important that we receive both films on Monday. WATER arrived at 2:00 pm... yay! But where was THE PROPOSITION? We called all the couriers, but none of them had THE PROPOSITION scheduled for delivery. In a panic, we called the distribution company. They're the ones responsible for releasing prints to the courier for delivery, so if anyone knew where the mix-up was, it would be them. CLOSED. Closed on Monday. Closed on Tuesday.<br/><br/>Uh oh.<br/><br/><b>Wednesday</b><br/><br/>We made our first call to the distribution company at 8:00 AM PST. <i>Our normal business hours are 9:00 to 5:00.</i> We wait an hour and call again.<br/><br/><b>RECEPTIONIST:</b> Thank you for calling Name Withheld Pictures.<br/><b>ME:</b> Hello. Could I speak with someone in distribution and releasing please? I've been trying to get ahold of Bill McBillerton, but he's not in.<br/><b>RECEPTIONIST:</b> Sure. One moment please.<br/><i>hold music</i><br/><b>RECEPTIONIST:</b> And what was your name sir?<br/><b>ME:</b> Dan Chilton with Moxie Cinema.<br/><b>RECEPTIONIST:</b> Ok. Dan Shelton with Maxi Cinema. One moment please.<br/><i>hold music</i><br/><b>SOME GUY:</b> Yeah.<br/><b>ME:</b> (startled) Uh, hi. My name is Dan Chilton and I was trying to get ahold of someone in distribution.<br/><b>SOME GUY:</b> Yeah.<br/><b>ME:</b> Would that be you?<br/><b>SOME GUY:</b> Yeah!<br/><b>ME:</b> (tempted to quote BRICK) Well, we start THE PROPOSITION tonight and it doesn't seem like anyone in your department released it.<br/><b>SOME GUY:</b> You mean you start it on Friday.<br/><b>ME:</b> No, we start our movies on Wednesdays.<br/><b>SOME GUY:</b> Well, I can't help you. You need to speak with Bill McBillerton.<br/><b>ME:</b> I've already tried Bill. Is he in the office today? Have you seen him?<br/><b>SOME GUY:</b> He'll be in in five minutes. Tell him you talked to Steve. You need to talk to Bill. *click*<br/><br/>Five minutes later<br/><br/><b>ME:</b> Hi, is this Bill?<br/><b>BILL:</b> Yeah.<br/><b>ME:</b> My name is Dan Chilton, and I'm with Moxie Cinema in Springfield, Missouri.<br/><b>BILL:</b> Uh huh.<br/><b>ME:</b> We're booked to start THE PROPOSITION today, but acccording to Technicolor (film courier) it was never released.<br/><b>BILL:</b> That's probably right. I haven't been in the office for four days, and I'm not really in a position to tackle this right now. I've got all kinds of stuff backed up.<br/><b>ME:</b> Well, I really need the film released. We start it TONIGHT!<br/><b>BILL:</b> (sounding put out) Alright, I'll see what I can do.<br/><b>ME:</b> What's the probability of us getting it on time?<br/><b>BILL:</b> I don't know. Do you want me to call you back?<br/><b>ME:</b> Yeah, that would be great.<br/><br/>Long story short - four phone calls later, the film is now somewhere between <a href=\"http://maps.google.com/maps?f=d&hl=en&saddr=Wilmington,+OH&daddr=Springfield,+MO&ie=UTF8&ll=38.470794,-88.571777&spn=6.295109,10.305176&om=1\" target=\"_blank\">Wilmington, OH (Technicolor's homebase) and Springfield</a>. Worst-case scenario, it arrives at 9:15 PM... and starts at 9:30. It's going to be a long, stressful day.<br/><br/><b style=\"font-color: #DC0000;\">UPDATE:</b> The film just arrived (7:45 PM)! It's on like Monkey Congo!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-07-05T21:25:02.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "What horrible business practices! That Name Witheld Pictures is really making a <i>name</i> for themselves, eh? That really sucks for you guys, considering it seems like this one could bring in a fair crowd tonight. I hope your day off went well to make up for this crap! ",
      "created_at": "2006-07-05T23:07:17.000Z"
    },
    {
      "author": "brian of moore",
      "body": "if you dont get the movie in time...<br/>im willing to try out my new standup routine....<br/>ill need a few minutes to write it first...<br/>im a hit .. in norway",
      "created_at": "2006-07-05T23:28:51.000Z"
    },
    {
      "author": "Nate",
      "body": "Man, I am sorry that you have to put up this kind of @$%#*^",
      "created_at": "2006-07-05T23:28:55.000Z"
    },
    {
      "author": "Nate",
      "body": "\"...put up WITH this kind of @$%#*^\"<br/><br/><br/>The other way makes it sound like I'm saying something substantially different.",
      "created_at": "2006-07-05T23:29:51.000Z"
    },
    {
      "author": "bjork24",
      "body": "Just so we're clear: THE PROPOSITION plays tonight... at 9:30... ish. It won't be canceled. I can build reel one in 15 minutes - sans trailers, which sucks. I'm going to have to push my body to limits heretofore unseen!",
      "created_at": "2006-07-05T23:32:44.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Yeah, First Look is a pretty crazy company. It's amazing this even was released into 200 theatres (Little Fish was put onto DVD just a month after its theatrical release). They care more about the DVD releases than the theatrical releases, so he was probably trying to stiff this area and make everyone wait for the DVD.",
      "created_at": "2006-07-06T00:26:13.000Z"
    },
    {
      "author": "Darren",
      "body": "Er, just so you know, it's a pretty good film. Here's what I said about it:<br/><br/>A violent, Australian western that’s half 'Unforgiven' and half 'Heart of Darkness'. The surreal feel of the movie’s outback scenes also reminded me, oddly, of sections of the 'Last Temptation of Christ'. Guy Pierce is excellent as the scraggly anti-hero, and John Hurt steals both of his scenes. The script and music–both by Nick Cave–were clunky in places, but all in all the most enjoyable western I’ve seen in years.",
      "created_at": "2006-07-06T05:16:44.000Z"
    },
    {
      "author": "MaxDugan",
      "body": "Dan, I got this out of office reply from a fellow large conglomerate employee:<br/><br/>\"I am in the office but unable to handle anymore additional duties today. I will deal with the issue you have as soon as I can. <br/><br/>Thank you!\"<br/><br/>NO, THANK YOU!<br/><br/><br/>",
      "created_at": "2006-07-07T19:42:18.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
