{
  "id": 429,
  "title": "Electronic Arts Films Announced!",
  "body": "Here are the selection of films lined up for the MSU Electronic Arts Showcase. Enjoy!\r\n\r\n<b>JULY 18:\r\n\r\nOvercome</b>  -- directed by Ben Bumgarner, animation by Matt Raithel & Nathanial Fuller, sound design by Doug Storm.  A young woman takes on a basketball robot in a game of one on one in this spec commercial for the WNBA. 2.5 minutes.\r\n\r\n<b>Sporky</b> – directed and animated by Ross Story, sound design by Mike Fieldson, original music by Baron Roberts.  In this animated short, Sporky stands up to arch-villian Xacto and his gang of thugs in an abandoned Mall Mart supercenter. 8.5 minutes.\r\n\r\n<b>American Truth (& Fiction)</b> – written and directed by Andrew Twibell, produced by John Probyn.  On the verge of heading west to follow his dreams, a young filmmaker’s plans are suddenly thrown into question.  22 minutes.\r\n\r\n<b>Mannequin</b> -- written, directed and animated by Art Weisen, original music by Reed Roye. A wooden mannequin overcomes a plastic mannequin in this loose retelling of the David and Goliath story. 7 minutes.\r\n\r\n<b>Pandora’s Box</b> – directed by Randall Moore, produced by Chris Nagle and Brandon Kerr.  Owen Quigley is forced to pull one last job before he can put his life of crime behind him. 30 minutes. \r\n\r\n<b>Where I Sleep</b> – directed by Jennifer Jones, produced by James Hafner.  A music video featuring the Christian Rock Band, The Professional Americans.  4:40 minutes.\r\n\r\n<b>Pretend</b> – written and directed by Doug Johnston, with sound design and original music by Daniel Kirkpatrick. When his orphaned nephew comes to live with him, Alexander Hazel's life is changed forever. Witness to a paranormal event, his faith in agnosticism is shaken to the core. Eventually, he embraces the power of love and the necessity of faith without proof.  32 minutes.\r\n\r\nTotal Running time:  107 minutes (plus disc changes)\r\n\r\n<b>JULY 19:</b>\r\n\r\n<b>Mannequin</b> -- written, directed and animated by Art Weisen, original music by Reed Roye. A wooden mannequin overcomes a plastic mannequin in this loose retelling of the David and Goliath story. 7 minutes.\r\n\r\n<b>Held Captive</b> – written and directed by John Hull.  A political prisoner survives by keeping alive  the hope that he will one day return to his wife.  5 minutes.\r\n\r\n<b>I, Octavio</b> – written and directed by Daniel Quintanilla, with original music and sound design by Rodney Eddings.   A young illegal immigrant and an American woman afflicted with ALS discover that they share a similar longing for a time when hope was still alive for them.  36 minutes.\r\n\r\n<b>The Creation Story</b> – Daniel Quintanilla.  An experimental short about the creative process.  2.5 minutes.\r\n\r\n<b>Sporky</b> – directed and animated by Ross Story, sound design by Mike Fieldson, original music by Baron Roberts.  In this animated short, Sporky stands up to arch-villian Xacto and his gang of thugs in an abandoned Mall Mart supercenter. 8.5 minutes.\r\n\r\n<b>Pandora’s Box</b> – directed by Randall Moore, produced by Chris Nagle and Brandon Kerr.  Owen Quigley is forced to pull one last job before he can put his life of crime behind him. 30 minutes. \r\n\r\n<b>Pretend</b> – written and directed by Doug Johnston, with sound design and original music by Daniel Kirkpatrick. When his orphaned nephew comes to live with him, Alexander Hazel's life is changed forever. Witness to a paranormal event, his faith in agnosticism is shaken to the core. Eventually, he embraces the power of love and the necessity of faith without proof.  32 minutes.\r\n\r\nTotal Running time:  2 hours 1 minute (plus disc changing time)\r\n",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2006-07-10T02:53:46.000Z",
  "author": "Nicole",
  "comments": [],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
