{
  "id": 430,
  "title": "The INCONVENIENT truth, the whole INCONVENIENT truth, and nothing but the INCONVENIENT truth",
  "body": "Since we first informed everyone that we wouldn't be getting AN INCONVENIENT TRUTH, a lot of things have changed. First, <a href=\"http://www.springfieldgo.com\" target=\"_blank\" class=\"broken\">GO! Magazine</a> wrote an <a href=\"http://www.springfieldgo.com/columnists/show_column/20\" target=\"_blank\" class=\"broken\">article</a> about what happened and published it in their latest edition. Then, on June 30th, Campbell opened the film to a less than stellar performance, which is important to note since the main reason for them getting it over us was based solely on their ability to earn more money on the draw. I'm not going to spill how much Campbell actually made on opening weekend, but I can assure that it was well within our range. WELL WITHIN! So we got on the horn with the distributor and suddenly they've taken an interest in showing it at our theater again. How very strange indeed.\r\n\r\nSo, beginning on August 9th, AN INCONVENIENT TRUTH will be playing at The Moxie. I have a strong feeling the target audience still has yet to be tapped - no one we spoke to even knew it was playing at Campbell - so we're going to kick it off big time. I'm going to try my hardest to host a symposium or two, as long as I can find a couple willing professors from MSU or Drury. Maybe I could get Tom Trtan to come in and speak... he's a Moxie regular, you know. Anyway, that's the latest on AN INCONVENIENT TRUTH. So, if you haven't seen the film yet, hold your horses and help us host one hell of an opening weekend... one month late.\r\n\r\nOther stuff happened over the weekend as well, but nothing nearly as exciting. On Friday night, during the intermission of our last show, a rapscallion lit off a firecracker in the art hall... but that's another story for another day. I have to go build UP FOR GRABS now. If you're looking for a fun Summer movie, come see UP FOR GRABS. It's hilarious! Nicole and I watched PIRATES OF THE GULF OF MEXICO: DEAD MAN'S LUGGAGE, or whatever it's called, last night. I can easily say it was one of the worst movies I've seen in a very long time. I know you won't believe me until you see it for yourself, but just remember who warned you. If you want REAL Summer fun, come see <a href=\"http://www.apple.com/trailers/independent/up_for_grabs.html\" target=\"_blank\" class=\"broken\">UP FOR GRABS</a>!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-07-11T06:42:21.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Aaron Scott",
      "body": "\"PIRATES OF THE GULF OF MEXICO: DEAD MAN'S LUGGAGE ... \"\r\n\r\nWow. That sounds almost like a porno. You guys are ggggrrrroooooossssss!",
      "created_at": "2006-07-11T16:51:07.000Z"
    },
    {
      "author": "Laurali",
      "body": "I'm so glad you are getting 'The Inconvenient Truth'! We hadn't gone to see it yet because we now find it difficult to stomach any movie theater without beer. Go figure.\r\n\r\nWe also really want to see 'Up for Grabs' but the viewing of live baseball might interfere.",
      "created_at": "2006-07-11T17:40:19.000Z"
    },
    {
      "author": "Tedd",
      "body": "Who needs the All-star game when the Moxie is showing Up for Grabs?\r\n\r\nAn interesting bit of historic homerun trivia is that the man who caught Mark McGwire's record setting (for a day or two, anyway) blast #68 is a Springfield veterinarian, Dr. Heath Wiseman.  He actually had his name mentioned by ESPN's Dan Patrick, for that I am eternally jealous.",
      "created_at": "2006-07-11T18:04:21.000Z"
    },
    {
      "author": "Nate",
      "body": "I too am glad I held off on an Inconvenient Truth.  This is huge!",
      "created_at": "2006-07-11T18:10:34.000Z"
    },
    {
      "author": "Caleb",
      "body": "August is gonna rock!! And by the way, my MSU chemistry professor from a couple semesters ago was big on global warming stuff with the chemistry side of the environment. Plus, I've seen him at the Moxie a time or two and so he might be interested. His name is Eric Bosch.\r\n\r\nI can't believe that kid set off that bottle rocket! I remember seeing him with it and Nicole asking him if he planned on setting it off in the theater. What a little jackass punk. Did you throw him out?",
      "created_at": "2006-07-11T20:37:48.000Z"
    },
    {
      "author": "nicole",
      "body": "No, that was someone else, Caleb. These guys were much younger.",
      "created_at": "2006-07-11T20:39:48.000Z"
    },
    {
      "author": "Laura",
      "body": "I totally agree with you about that Pirates movie.  What a stinker.  I was totally bored.  Yawn!",
      "created_at": "2006-07-11T22:01:36.000Z"
    },
    {
      "author": "Stormy",
      "body": "Dig, brutha, on the Pirates flick.  Lotta yawns in that there theater.  Seriously, though, if you're in for a pirate flick, watch out for Highway Pirates... Coming Soon!",
      "created_at": "2006-07-12T08:22:43.000Z"
    },
    {
      "author": "nicole",
      "body": "I've been hearing good things about Highway Pirates!",
      "created_at": "2006-07-13T02:37:38.000Z"
    },
    {
      "author": "Sharon",
      "body": "When will I be able to order tickets for \"An Inconvenient Truth\" online?",
      "created_at": "2006-07-27T20:39:03.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
