{
  "id": 433,
  "title": "It. Is. So. Ridiculously. Hot.",
  "body": "I'm sorry I haven't posted lately, but this heat has melted my brain into a warm puddle of memories and long-forgotten Nintendo cheat codes. I know we're not alone - isn't half the country griped by a heat wave right now? - but still... IT'S DAMN HOT! I have an extension for Firefox that shows me the weather in my status bar, and for the last week and a half it's been flashing this icon that sort of resembles a red, flaming penis:\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/072006/hot.gif\" width=\"425\" />\r\n\r\nI think it's supposed to be a thermometer, but COME ON! That's some bad icon design, if you ask me... and I know you DIDN'T!\r\n\r\nBoth of our showings of the MSU Student Showcase sold out on Tuesday and Wednesday. I wasn't expecting last night's show to sell out, but was pleasantly surprised when it did. The air conditioner, however, wasn't as excited. You see, our building is entirely exposed on the West side (<a href=\"/pix/misc/photo_tour/west-entrance.jpg\" target=\"_blank\">look</a>), which means the bricks get baked by the sun for 8+ hours every day, and then at night they slowly release the heat back into our auditorium. That's usually not a problem when we have smaller crowds, but once you cram in 75 hot people, it starts to get really hot and really humid really fast. Our air conditioner just can't keep up! So, for those of you who battled through the Southern Louisiana atmosphere of our auditorium last night, thank you! I hope you enjoyed the films.\r\n\r\nAugust's line-up is done, which means it's time for me to start bangin' away at the calendar. Here's a quick look at what's coming up:\r\n\r\n+ August 2 - 8: HEART OF THE GAME\r\n+ August 4 - 5: RAISING ARIZONA (late-night showings)\r\n+ August 9 - 22: STRANGERS WITH CANDY / AN INCONVENIENT TRUTH\r\n+ August 22 - 23: ONLY HUMAN\r\n+ August 23 - Sept 5 - HOMEMADE HILLBILLY JAM\r\n+ August 23 - 29 - WASSUP ROCKERS\r\n+ August 30 - TBD - WORDPLAY\r\n\r\nIt's a very simple, and stellar, line-up... just the way we like it. I'm waiting to hear back from Big Smith (the stars of HOMEMADE HILLBILLY JAM) on when they'll be available for a Q&A or two. I'm sure those shows will sell out pretty quick. Oh man, I suddenly got hit with a tremendous hunger pain... I'm outta here.\r\n\r\nNOTE: Don't forget, the <a href=\"http://www.moxiecinema.com/films/105\">PEARL WHITE SILENT FILM SUMMER SERIES</a> has been moved from this Saturday to the next (July 29th). Still the same place, the old firehouse, and same time, dusk (9-ish). Hopefully we'll see you there.\r\n\r\nONE MORE THING: <a href=\"/post/46\">Remember</a> <a href=\"/post/64\">our</a> <a href=\"http://moxie.danchilton.com/pix/grum/56_evection.jpg\">old</a> <a href=\"/post/38\">neighbor</a> back in St. Louis (long-time readers might)? Yeah, well, she's going to be <a href=\"http://www.stltoday.com/stltoday/news/stories.nsf/stlouiscitycounty/story/62AAC17CBC1C8B82862571AC0018AF6F?OpenDocument&highlight=2%2C%22hartstein%22\" target=\"_blank\" class=\"broken\">spending the next 11 years in federal prison</a>. She stole our mail, my camera, and Nicole's iPod (for a week), so I'm glad she's finally getting what she deserves.\r\n",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-07-20T23:36:02.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "That lady sounds like a monster! \r\nIt's monsterly hot outside!\r\nYou've got a monster of a lineup in August!\r\nHow many times could I possibly use the word monster (4)?",
      "created_at": "2006-07-21T00:17:50.000Z"
    },
    {
      "author": "Steve Richards",
      "body": "I think the oppressive temperatures play into your hand with An Inconvenient Truth.  The hotter the temperature the more relevant the movie will seem.  Probably won't contribute to Wassup Rockers though.  ",
      "created_at": "2006-07-21T00:21:28.000Z"
    },
    {
      "author": "Nate",
      "body": "Man, those are some old posts.  And you sure commented back a lot then.  It's like you were just so happy to have readers.",
      "created_at": "2006-07-21T00:34:40.000Z"
    },
    {
      "author": "brian of moore",
      "body": "acording to weather.com: 101 F  and feels like 105 F\r\nim not going outside until the sun goes down\r\nokay fine.. i went and had lunch earlier.. but im not going out *again*\r\nuntil the sun goes down",
      "created_at": "2006-07-21T00:42:37.000Z"
    },
    {
      "author": "--Jeff",
      "body": "You need to line the west side of the building with Space Shuttle tiles.  Surely that wouldn't cost much.  \r\n\r\nHome Depot, maybe? ",
      "created_at": "2006-07-21T01:49:36.000Z"
    },
    {
      "author": "elliott",
      "body": "do prisons have air conditioners? because if they do, then she still is not getting what she deserves!\r\n\r\nproposition: outdoor prisons! \r\n\r\ni guarenttee that will decrease the crime rate in the state! ",
      "created_at": "2006-07-21T01:52:39.000Z"
    },
    {
      "author": "Nate",
      "body": "I hear NASA is selling those tiles on clearance.",
      "created_at": "2006-07-21T01:56:14.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Wassup Rockers will probably be so steaming hot, the temperatures will increase themselves.",
      "created_at": "2006-07-21T01:59:04.000Z"
    },
    {
      "author": "Fyse",
      "body": "It's too darn hot here too, and we haven't even heard of air-conditioning. (Well, that's not quite true, but neither my flat or my office has it. I'm sitting in an ice-cold computer room right now though! Woot!)\r\n\r\nI covered the outside of my bedroom windows in tin foil the other day, and it's definitely helped. You guys will just need a bit more foil...",
      "created_at": "2006-07-21T02:38:33.000Z"
    },
    {
      "author": "bjork24",
      "body": "I will say this: those giant blocks that I built to cover up the windows... they're completely cool to the touch on the auditorium side. Four inches of soundboard and foam insulate really do make a difference!",
      "created_at": "2006-07-21T02:44:18.000Z"
    },
    {
      "author": "nicole",
      "body": "I actually thought of lining the stairwell on the side of the building with tin foil, but it would probably blind drivers passing by.",
      "created_at": "2006-07-21T02:54:44.000Z"
    },
    {
      "author": "Michael",
      "body": "Did anyone see the thermometer icon on KY3 at 6:00?  Looked like an angry red <i>ejaculating</i> penis.  I swear, it was at a 45 degree angle and the mercury would just... pop out of the top.  I felt so dirty, but in a good way.",
      "created_at": "2006-07-21T03:55:19.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "That's pretty common looking, it's like it hasn't had any water in quite a while.",
      "created_at": "2006-07-21T04:17:57.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Wow...eleven years, huh?  That's awesome!\r\n\r\nThat'll teach her to leave sour milk out on the porch, eh?",
      "created_at": "2006-07-21T17:31:33.000Z"
    },
    {
      "author": "Fyse",
      "body": "I only just noticed about your ex-neighbour. How did you find out about that? Have you been monitoring newspapers? Great news, anyway. Your tales of her antics were extraordinary.",
      "created_at": "2006-07-22T01:38:59.000Z"
    },
    {
      "author": "bjork24",
      "body": "Every once in awhile she pops into my head, so I goolge her (I know, gross!)... that's how I found out.",
      "created_at": "2006-07-22T01:47:00.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
