{
  "id": 434,
  "title": "Chairs, chairs, everywhere, nor any place to sit",
  "body": "The \"real\" Coleridge line doesn't sound nearly as good as the oft misquoted \"water, water, everywhere, but not a drop to drink,\" but since I'm a Inglish Majer I thought I'd use the right one and risk sounding pretentious. I'm AWESOME!<br/><br/>At first, having an auditorium filled with vintage, low-back aluminum chairs sounded awesome - it was cool, it was retro, it was MOXIE - but now as they all slowly start to break, one-by-one, I'm wondering if we shouldn't upgrade to something newer. I should note, when I say \"broken,\" I don't necessarily mean \"impossible to sit in.\" The \"broken\" chairs I'm referring to are the ones that slope too far toward the ground when you're sitting in them (*cough* fourth row *cough*). Once the first batch of chairs broke (about 10 of them), my dad and uncle opened them up and welded new rings to the pivots, which seemed to solve the problem for the time being. However, I've since learned that \"rings\" and \"pivots\" were just terms used to describe the same thing: leprechauns.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/072406/seat01.gif\" width=\"425\" /><br/><br/>As you can see, there are only two basic positions that a chair can be in at any one time. It's either up, or it's down... there is no in-between (despite the light shaded area between the two positions). Over time, the leprechaun that lives inside each chair grows old and dies, creating a broken chair. This is what a good chair looks like:<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/072406/seat02.gif\" width=\"425\" /><br/><br/>And this is what a bad chair looks like:<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/072406/seat03.gif\" width=\"425\" /><br/><br/>As you can clearly see, it all has to do with the health of each chair's particular leprechaun, which begs the question: if leprechauns can't be brought back from the dead, how can we fix our seats? Nicole posited the idea of welding folding legs onto the front of each chair, so as the bottom part extended outward into the sitting position, the legs would drop down and only allow the chair to drop to a comfortable degree. Unfortunately, this solution poses more problems than it solves - what if the legs don't fold back down when the seat pops back up? Would the little legs be strong enough to hold up the weight? And, most importantly, where would we find 150 little folding aluminum legs?<br/><br/>The more I think the problematic chairs, the more my head hurts. What do you guys suggest? If, however, you find yourself sitting in one of our esteemed broken chairs at a sold out Moxie show, just scoot your butt to the back of the seat. It works. Trust me.<br/>",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-07-25T04:27:36.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Derek",
      "body": "I've never had a problem with the chairs. Most of the time when I go, the people (person) I'm with (*coughJonnacough*) mention(s) the chair issue and make(s) me trade since they \"broken\" chairs don't seem any different from any normal chair to me. Maybe it's the height that prevents me from knowing how a normal-sized chair <i>should</i> feel since all chairs feel small. Or maybe I'm just playing the role of martyr so people will think I'm cool. Okay, this comment is too long and I haven't given you any suggestions . . . Um, how about kicking complainers in the face like you always do, Dan? Nicole's idea is feasible, but the metal pieces plus hinges plus labor, etc. could end up being quite an expense. It's worth checking, though, right? Maybe.",
      "created_at": "2006-07-25T04:46:49.000Z"
    },
    {
      "author": "nicole",
      "body": "You know how when old people need to use walkers, they put tennis balls on the legs? That's what I'm invisioning somehow. Tennis balls. But I'm no engineer, so I'm having trouble finding the missing pieces.",
      "created_at": "2006-07-25T05:37:25.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "im surprised that you dont easily notice this problem derek...<br/>seeing that i was about to assume this problem was caused by tall people like us anyhow.....  see most often i find myself sliding down low in my chair.. because being a tall person.. i know that people behind me probably cant see.. so i slide my fat ass towards the end of the seat<br/>this action most likely causes much strain on the poor leprechaun<br/>and thus they die a horribly gruesome death...<br/>maybe you didnt notice because youre republican<br/>(OHH!! snap!!)<br/>seriously though... thats proably why...<br/>(OHH!!! double snap!!! with a cherry on top!!!)",
      "created_at": "2006-07-25T06:39:13.000Z"
    },
    {
      "author": "Caleb",
      "body": "I think you should just stop starving the leprechauns and FEED them once in a while. Even a popcorn kernel every now and then can expand their lives by 10 years or more.<br/><br/>Is there any way you could connect some super strong fabric straps to the back support part and the sides of the seat so that they are taut when the seat is in proper position? Does that make sense? I imagine it would be a lot cheaper than aluminum legs. The little straps might cause comfort issues on their own though.<br/><br/>OR since your 1-year is coming up, you could have a special deal where people can buy a new chair for the theater and get their name on it (which would stay on it for the life of the chair). Of course you would have to give the founding members their own chair still and pay for those new chairs yourself, but I bet you could sell all the rest of the seats easily. I imagine new chairs cost somewhere around $100-200 maybe? There are plenty of people/businesses in Springfield who would jump at a chance like that. Of course if they didn't jump, that would be a big expense to buy the chairs that didn't sell. ",
      "created_at": "2006-07-25T08:14:08.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Me: You saved the leperchauns and kicked the winning field goal for the Chiefs to win Super Bowl XLVII, what will you do now?<br/><br/>Dan:I going home and crack open a beer!",
      "created_at": "2006-07-25T12:08:12.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Ahem, that's cracking open a beer.",
      "created_at": "2006-07-25T12:09:27.000Z"
    },
    {
      "author": "Derek",
      "body": "I'm not a Republican anymore, Brian. What else you got?",
      "created_at": "2006-07-25T15:22:25.000Z"
    },
    {
      "author": "Laurali",
      "body": "Ah the joys of vintage seating...I have the name of a company that can refurbish vintage chairs. (I think they also sell new ones.) Let me know if you want the contact information.",
      "created_at": "2006-07-25T17:35:33.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Macgyver?  <br/><br/>/got nothin' ",
      "created_at": "2006-07-25T19:31:02.000Z"
    },
    {
      "author": "Al",
      "body": "Dan, I'm sorry \"muscular\" guys like me have broken your chairs.",
      "created_at": "2006-07-25T20:02:22.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "i dont think i believe you derek...<br/>you were way too hardcore.. when i worked with you<br/>but on the slim chance that there is truthiness in what you say<br/>YES!!... its because of something i said when we worked together.. isnt it!",
      "created_at": "2006-07-25T20:15:49.000Z"
    },
    {
      "author": "Nate",
      "body": "I am a seat-slider.  Guilty.  It is only because I am conscientious of those behind me.",
      "created_at": "2006-07-25T22:27:35.000Z"
    },
    {
      "author": "Melinda",
      "body": "I'm glad you're going to work on the dead leprechaun situation.  I'm pretty dexterous and can chill out easily in any position for a couple of hours, and I don't even really mind the noisy leprechauns either... BUT, I have been concerned that the wrong person or persons would sit in a bad chair and then that whole word-of-mouth thing could go badly for The Moxie. <br/><br/>Good luck with a cheap and brilliant solution.  Maybe a pre-show screen notice that says, \"Quit yer bitching and watch the movie!\"<br/>",
      "created_at": "2006-07-25T23:32:25.000Z"
    },
    {
      "author": "Caleb",
      "body": "Oooh, it could be in a speech bubble above Captain Jack Sparrow's head!",
      "created_at": "2006-07-26T00:10:12.000Z"
    },
    {
      "author": "Ian",
      "body": "Oh damn, Dan, this is some funny crap!  \"The Rime of the Ancient Leprechaune,\" after all this time!<br/><br/>Seriously, though, those seats can be a real pain in the rump!<br/>Eh?  HAHA!<br/><br/>Maybe you could just fill the room with throw pillows and bean bags!  Wash the covers a couple times a week, and put coffee tables every few feet!",
      "created_at": "2006-07-26T01:00:42.000Z"
    },
    {
      "author": "Derek",
      "body": "I admit, Brian, you had a hand in it. My conversations with you and several other people were an assistance. However, much of the decision was due to seeing how ridiculous my dad was when he called Democrats \"evil\" and tried to get us to refer to \"Uncle Rush.\" I currently call myself a \"moderate,\" but I'd be most accurately described as \"apathetic\" because I read far too many Chuck Palahniuk novels to think politics make much of a difference. Anyway, this is not at all the right place to talk about this, so I'm done. The point is, um, thanks Brian. You were a help in getting me to see the light. Danicole, you're awesome, too. Oh, and I like Melinda's idea.",
      "created_at": "2006-07-26T02:06:23.000Z"
    },
    {
      "author": "Jonna",
      "body": "...OR Derek could SHOVE IT (you know where!) and Dan, you could just take out all the chairs and have everyone provide their own seating.  You could even rent out space for people if they want to, say, bring and keep a couch in the auditorium.  And no one else could sit on it (or, you could secretly rent it out -- think of all the possibilities!).  OR you could rent out the \"better\" seats for a higher price.  You could keep them in a \"box\" (box seating!).  Or call the better seats the balcony.  Or something entirely different, like first class or elite (leet/7334).  Can't you just see it now? \"Would you prefer economy or first class seating tonight?\"",
      "created_at": "2006-07-26T02:19:21.000Z"
    },
    {
      "author": "Ian",
      "body": "What's next, Jonna, everyone who's not a member has to wear a bright yellow star, has to STAY in the \"economy\" section for \"convenience\"?  And wtf is 7334?<br/><br/>But hammocks would be nice, you're right.",
      "created_at": "2006-07-26T03:14:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "El 1337, La 7334. It's the femine conjugation of the same term.<br/><br/>Duh 1@^/ !",
      "created_at": "2006-07-26T03:19:01.000Z"
    },
    {
      "author": "Caleb",
      "body": "I think it's funny how the leprechauns <i>really</i> plump up after dying, and their clothing goes from dark green to neon green. And I'm guessing they just shove the violin up their ass right before they die.<br/><br/>Those little buggers. Such an interesting species. ",
      "created_at": "2006-07-26T03:35:17.000Z"
    },
    {
      "author": "bjork24",
      "body": "The increased weight is due to bloat.",
      "created_at": "2006-07-26T04:12:36.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "derek: uncle rush? haha.. <br/>that would probably turn me.. even if i was a republican..<br/>and yeah.. 2 party system = silly.. but its what we have to deal with<br/>we can continue this conversation the next time we work together<br/>(in purgatory)<br/><br/>7334???  female version?<br/>since when was 1337 $p34k derived from spanish<br/>7334 = leef!",
      "created_at": "2006-07-26T05:08:07.000Z"
    },
    {
      "author": "bjork24",
      "body": "Actually, Brian, 7334 = TEEA. Maybe Jonna was thirsty when she posted that.",
      "created_at": "2006-07-26T05:10:46.000Z"
    },
    {
      "author": "Mom",
      "body": "Sounds like you need to let your dad and uncle Sonny start repairing sets...until you have enough money to replace them. Hopefully they can fix most of the broken chairs, giving you enough time to save enough money to purchase new chairs in the near future?<br/><br/>Hey, they work for FREE...you can't beat that!",
      "created_at": "2006-07-26T06:16:08.000Z"
    },
    {
      "author": "Ian",
      "body": "Say, Mr. Chilton and Mr...Sonny, I've got this table I need stained and put together.  It's for the (eventual) good of the Moxie.  How about it?",
      "created_at": "2006-07-26T07:37:50.000Z"
    },
    {
      "author": "bjork24",
      "body": "Just because you look like me, Ian, doesn't mean you get to benefit from free family labor too. If that were the case, Nate would have his back door fixed!",
      "created_at": "2006-07-26T07:44:41.000Z"
    },
    {
      "author": "Ian",
      "body": "I thought the doctors said Nate's back door could NEVER be fixed, not after that night in Rio.",
      "created_at": "2006-07-26T07:56:39.000Z"
    },
    {
      "author": "Nate",
      "body": "Back door?  Wha...?<br/>There are many things that need fixing around the house, but I don't think the back door is one of them.  I have some water damage I think in the subflooring right by my bathtub though.  Could they do that?",
      "created_at": "2006-07-26T17:36:26.000Z"
    },
    {
      "author": "Gayle",
      "body": "I have no advice to give.  I just want you to know that I'd rather stand up in your theater than sit anywhere else.",
      "created_at": "2006-07-27T01:17:31.000Z"
    },
    {
      "author": "Derek",
      "body": "AMEN, GAYLE!!! Preach it!",
      "created_at": "2006-07-27T01:44:38.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 16,
      "name": "Customers"
    }
  ]
}
