{
  "id": 435,
  "title": "Amazing Audition Tape",
  "body": "A long time ago, in late May, Nicole and I decided it would be fun to audition for The Amazing Race. Being huge fans of the show, and having the theater as our hook, we thought we might stand a chance. Apparently not. The first round of live auditions took place last week and our telephone never rang... not even once. Of course, we don't own a telephone, but I'm sure you're picking up what I'm trying to put down.<br/><br/>So in lieu of a new MoxieTV (which, if the rumors are true, might be coming back soon), here is Team Moxie's audition tape for The Amazing Race.<br/><br/><iframe width=\"425\" height=\"318\" src=\"http://www.youtube.com/embed/A2sw9Y3wjrk?rel=0\" frameborder=\"0\" allowfullscreen></iframe><br/><br/>And please spare me the comments about what you think of reality TV as a whole or The Amazing Race in particular. We enjoy it, and I thought you might enjoy our AWESOME audition tape.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-07-27T02:38:41.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Aaron Scott",
      "body": "Aw, you guys are just tooooooooooooooo cute.",
      "created_at": "2006-07-27T03:18:16.000Z"
    },
    {
      "author": "Luke",
      "body": "Guys, that was awesome.  You are both so natural in front of the camera.  The Amazing Race is missing out.",
      "created_at": "2006-07-27T03:34:05.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "very nice...<br/>i think if dan had been in a speedo<br/>and nicole had worn a donald duck costume<br/>you two would be a shoe-in<br/>im not sure why i think that.. i just do..",
      "created_at": "2006-07-27T03:55:19.000Z"
    },
    {
      "author": "Ian",
      "body": "Sheesh, If I had a million dollars to dangle in front of you, you'd be in MY amazing race.  I've seen some friends' audition tapes for things like this, and y'all blew em all away.<br/><br/>I think you two should record a short film and enter it anonymously in the Moxie Shorts thing.",
      "created_at": "2006-07-27T04:24:25.000Z"
    },
    {
      "author": "Caleb",
      "body": "That was great. Shucks they didn't call you, <i>this year</i>. I guess this means you won't be leaving the theater in the hands of Justin, Kelly, Nate, and I this fall? Damn. That would have been an interesting month. Better luck next year!",
      "created_at": "2006-07-27T04:46:18.000Z"
    },
    {
      "author": "nicole",
      "body": "Justin was the director. He done real good.",
      "created_at": "2006-07-27T05:13:14.000Z"
    },
    {
      "author": "erin",
      "body": "you two are indeed too cute.<br/><br/>you do realize that if you were to leave the moxie in the hands of others... a certain employee of yours will have, by the time you return, alphabetized and then color coded the candy, beer, wine, toliet paper, anything not glued down, etc.<br/><br/>i wont say which employee would do such a thing. but trust me... it would happen.",
      "created_at": "2006-07-27T05:50:50.000Z"
    },
    {
      "author": "Penny",
      "body": "Y'all are cool! That tape was great. The Amazing Race soooo should have picked you. Maybe next year.  Go team Moxie!",
      "created_at": "2006-07-27T07:41:49.000Z"
    },
    {
      "author": "Ian",
      "body": "Too many positive comments!<br/><br/>Here:<br/>Nicole, you look like Darth Vader in the title image.",
      "created_at": "2006-07-27T10:27:44.000Z"
    },
    {
      "author": "FYse",
      "body": "Good work, guys. I'd have chosen you, and you know that's what really matters.<br/><br/>I may be wrong, but is that the first time we've heard Nicole speak on the Moxie Blog? What a treat.",
      "created_at": "2006-07-27T23:10:05.000Z"
    },
    {
      "author": "Derek",
      "body": "Wow, Ian, Nicole <i>does</i> look like Darth Vader in that shot. I mean, the audition tape's awesome, but that one screen shot is . . . man, that's uncanny :-/",
      "created_at": "2006-07-28T01:30:15.000Z"
    },
    {
      "author": "nicole",
      "body": "I don't look like Darth Vader...do I?",
      "created_at": "2006-07-28T03:18:05.000Z"
    },
    {
      "author": "Ian",
      "body": "It also looks like Dan's left arm is leprotic.",
      "created_at": "2006-07-28T05:29:24.000Z"
    },
    {
      "author": "Dave",
      "body": "you guys should've covered your faces in nic patches and just screamed at eachother the whole time. you'd be IN THERE.",
      "created_at": "2006-07-28T18:58:10.000Z"
    },
    {
      "author": "Barak",
      "body": "Now I want to see your audition tape for Who Wants to be a Superhero.",
      "created_at": "2006-07-28T19:52:44.000Z"
    },
    {
      "author": "Nate",
      "body": "Ha!  I am just now getting around to watching this, 'cause I haven't had functioning speakers for a couple days.<br/>This was fantastic.  I don't know HOW they could have passed you over.  The people they DID get better be fantastic, is all I gotta say.  You guys are just so likeable, it's like they should mass produce you and sell you in boxes.<br/>And good job Justin!",
      "created_at": "2006-07-29T03:12:34.000Z"
    },
    {
      "author": "nicole",
      "body": "Ahem, Nate. I AM mass produced, remember? Her name is Stephanie.",
      "created_at": "2006-07-29T06:55:07.000Z"
    },
    {
      "author": "Rachel",
      "body": "Okay so what if they said they wanted Nicole but would pair her with a 300 pound toothless man? Or they wanted Dan, but only with a sassy Latina? I think you two have too much wonderfully adorable chemistry. They want drama and occasional nudity.",
      "created_at": "2006-07-29T07:33:45.000Z"
    },
    {
      "author": "bjork24",
      "body": "Occasional nudity? Hell, I can give them frequent nudity if that's what they're looking for. I'm naked 60% of the time anyway!",
      "created_at": "2006-07-29T08:26:35.000Z"
    },
    {
      "author": "Nate",
      "body": "You are 60% naked 100% of the time, actually.",
      "created_at": "2006-07-31T20:17:56.000Z"
    },
    {
      "author": "Warren",
      "body": "yo.  at least when he's 60% naked he works every time.  but is he made with bits of real panther?",
      "created_at": "2006-08-01T08:20:49.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 17,
      "name": "MoxieTV"
    }
  ]
}
