{
  "id": 437,
  "title": "This Weekend at The Moxie",
  "body": "It was a busy weekend here in Moxieland. We had POINT BREAK on Friday and Saturday night, the PEARL WHITE SILENT FILM SUMMER SERIES (P.W.S.F.S.S) also kicked off on Saturday night, and it marked our final weekend for the July Passport Series. POINT BREAK brought in some pretty good-sized crowds on both nights, but I was really impressed with the turnout we had at the Old Firehouse for the P.W.S.F.S.S. Despite the weather (it was really hot); despite a Springfield Cardinals home game; despite being the first weekend of the Ozark Empire Fair; and even despite going head-to-head with another Moxie event (POINT BREAK), we still managed to attract a crowd of nearly 100 people. And let me tell you, it was a blast.<br/><br/>The image looked even better than when we had originally tested it way back in early June. Stupid me, I forget to bring my camera, or else I'd have plenty of pictures to prove the preposterous proportions of the projected picture. I'll make sure to take plenty of pictures during the third and final installment in August. It was a little toasty when the first film began around 9:10, but a nice breeze had settled in once Charlie Chaplin's THE KID hit the wall. If you managed to miss this one, yet again, we'll be hosting the third and final installment on Friday, August 25th. Trust me, you won't be disappointed. I was even told by several people that our outdoor cinema puts the one in Founder's Park to shame. That's always nice to hear, but this isn't a competition... we always knew we were better. I kid! I kid!<br/><br/>Also worth noting, July was a bang-up month (*shocked face*)! When we decided to throw together the passport series, back in late June, we thought it would be a desperate attempt to lure people into the theater during the traditionally low-attended month. Boy were we wrong. July was one of the strongest months we've had in 2006! One week wonders WATER and MRS. PALFREY AT THE CLAREMONT were huge hits, even out-performing their two week counterparts, THE PROPOSITION and DISTRICT B-13. MOUNTAIN PATROL was the only slow performer we had all month. In the end, it looks like we're going to have between 30 and 40 people who managed to see all SEVEN international films and turn in their passports. We'll draw the winner of the $400 travel gift certificate on First Friday and announce them here (along with contacting them via e-mail, on the phone, and announcing it in the newsletter). Thanks to everyone for making July the surprise hit month of the year. And here's to August (*makes cork popping nose with my mouth and gulps down some orange juice*)!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-08-01T04:18:35.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "David Saldaña",
      "body": "Hi.  How can I submit a film for showing at your theater?<br/>I'm a filmmaker from Puerto Rico.  I just finished my first digital feature, El Reporte (The Report). It's a cross-island adventure comedy.<br/><br/>I'll appreciate your response.<br/>",
      "created_at": "2006-08-01T17:18:53.000Z"
    },
    {
      "author": "Ian",
      "body": "That OJ'll do you good.<br/><br/>And I've heard nothing but positive responses and positive speculation about the PWSthing.",
      "created_at": "2006-08-01T22:40:42.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
