{
  "id": 438,
  "title": "Mmm, mmm Quizno's",
  "body": "Yesterday, only a few blocks from the theater, a brand new Quizno's (one of my all-time favorite sandwich shops) opened its doors to the public, kicking off the beginning phase of a much bemoaned, yet highly anticipated, gentrification of downtown Springfield. I, for one, think it's great, and made it a point to buy a sandwich on opening day - not really so much because I support big chain diversification, but mainly because their sandwiches make my pants tight. <br/><br/>I can't say I'll show the same enthusiasm for every nationwide store that opens its doors downtown, but for the most part I'm pro-gentrification... at least to a certain extent. Like my <a href=\"/posts/317\">chain restaurant wish list</a> before it, I'm sure this post will garner a few barbs and e-mail flames, but it's worth discussing, especially since downtown is teetering on another big break-through in its ongoing revitalization. So, without further ado, here's a list of businesses I'd like to see open downtown:<br/><br/>1. <b>Trader Joe's</b> - I cannot think of any other business I would want to see open in Springfield more than Trader Joe's. I don't care where you put it - hell, you could shove it way out in Nixa or Republic - and we'd still shop there every week! If we had one within a 30 mile radius of downtown, I'd never go to a regular grocery store again. For those of you unfortunate enough to have never visited a Trader Joe's... I'm so very sorry. Next time you're in the Lou, make it a point to swing by one of their four locations, or you could be like us and make your friends bring you stuff whenever they visit. Trader Joe's is the AWESOME!<br/><br/>2. <b>The Gap and Urban Outfitters</b> - Where are we supposed to shop now that the Gap's been booted from the Bowelfield Mall? I don't have the money to shop at the Banana Republic or Macy's! In fact, I can barely afford to buy what little clothes I do from Target! In all reality, I'll just continue wearing my second-hand clothes and be completely happy with it, but for those who do like to shop for cool clothes, both of these stores would be a welcome addition to the hip offerings of Staxx and Shae Belle (among others). A trendy second-hand store would be cool too, but rumor has it that that wish may have already been granted.<br/><br/>3. <b>Starbucks</b> - NOT! Long live The Mudhouse!!!!!!!!!<br/><br/>4. <b>Mac Store</b> - This one is definitely wishful thinking, even though downtown has the perfect demographic blend for a strong Mac user-base: young loft-dwelling urbanites, artsy hipsters, and a swelling college population with dispensable income. And let's not forget the free WiFi that blankets downtown with it's warm hour-long embrace! It's enough to make this PC guy come out of the Mac closet and plant a big juicy one on the nearest 17\" MacBook Pro Intel Core Duo!!! Woo hoo! <small>I can't believe I just said that.</small><br/><br/>5. <b>Lush</b> - I have to admit, this particular wish is more Nicole than me, but a happy Nicole is a happy Dan, so I had to include it. Lush sells fancy soaps and body products. Nicole worships and lusts after Lush products. Once, when she was completely sober, Nicole insisted that if a Lush were to open in Springfield she would work there all day and at The Moxie all night. That's devotion, folks.<br/><br/>6. Nicole also wants an Anthropologie, Pottery Barn, Sephora, and William Sonoma.<br/><br/>I think the more familiar chain businesses that open downtown, the better everyone's exposure will be in center city, which is just another way to say \"downtown\" without using the same word twice in one sentence... which I just did. Seriously though, what better way to make the rest of Springfield stand up and take notice than to mix in a few of their favorite spices into the downtown simmering pot. Sure local businesses are great, but <i>some</i> people <u>need</u> familiarity... just enough to lure them downtown, then us local spices JUMP THEM, drag them into our shops, and a new race of subservient customers is born!<br/><br/>Also of note, we tried The Acoustic Cafe today for the first time. It too is quite amazing. You see, chains and locals really can live together in harmony! That is, until College Station opens... and then the war shall commence.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-08-04T06:34:10.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Winnie",
      "body": "i've never been to trader joes, but i think your list is pretty darn perfect of chains that could grace downtown's presence. <br/>i'd have to say my dream store downtown is H&M, hands down. ",
      "created_at": "2006-08-04T08:58:41.000Z"
    },
    {
      "author": "brian of moore",
      "body": "youre obviously drunk",
      "created_at": "2006-08-04T11:58:21.000Z"
    },
    {
      "author": "--Jeff",
      "body": "I was with you until you started rambling about the Mac store.  Now  I agree with brian of moore:  drunk.  <br/><br/>http://www.bestweekever.tv/2006/07/07/bwe-mac-ads/ <br/><br/>Funniest Mac parody ads.  Ever.  <br/><br/>/Would take a Mac only for an Avid editing suite<br/>//Still a Linux guy",
      "created_at": "2006-08-04T17:10:40.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Oh, yeah:  We definitely need a William-Sonoma.   We lost the one really good \"Kitchen\" store a year or so ago. <br/><br/>Le Creuset in Springfield?  <br/><br/>Not a chance. <br/>",
      "created_at": "2006-08-04T17:16:56.000Z"
    },
    {
      "author": "Nate",
      "body": "Dan, I like the operatic foreshadowing contained within your last sentence.<br/><br/><br/>Or maybe I've been watching too much Buffy.",
      "created_at": "2006-08-04T17:57:53.000Z"
    },
    {
      "author": "Nate",
      "body": "And Brian that was awesome.  I peed myself.  <br/><br/>Not so awesome -the peeing on myself.",
      "created_at": "2006-08-04T18:04:54.000Z"
    },
    {
      "author": "nicole",
      "body": "H&M would be pretty cool, but I have to say that the last couple times I've been to one, the quality seems to have gone from cheap to cheaper. A ZARA would be even better!<br/><br/>Oh Anthropologie. How I covet thee.",
      "created_at": "2006-08-04T19:52:17.000Z"
    },
    {
      "author": "bjork24",
      "body": "Geez, you guys are so anti-Mac! Did I forget to mention that Mac Stores also sell iPod accessories? I bet that will change your tune.",
      "created_at": "2006-08-04T20:46:05.000Z"
    },
    {
      "author": "--Jeff",
      "body": "What is this \"iPod\" you speak of?",
      "created_at": "2006-08-04T22:54:36.000Z"
    },
    {
      "author": "hello I'm a PC",
      "body": "Sorry dan, but when the Macbook Pro doesn't even have the technology to cool down after using it for longer then 20 minutes and ever time you do use it you risk losing your fingerprints due to the mass amounts of heat it produces... <br/><br/>Tell mac to get a fan and then we'll talk. <br/><br/>Oh and, why buy an ipod nowadays when you can have a cell phone with one built in...<br/><br/>",
      "created_at": "2006-08-04T23:00:19.000Z"
    },
    {
      "author": "Derek",
      "body": "What about a Virgin Megastore?<br/><br/>. . . I kid. I kid.",
      "created_at": "2006-08-05T03:07:32.000Z"
    },
    {
      "author": "Couldn't Resist",
      "body": "<i>What about a Virgin Megastore?</i><br/><br/>Springfield already has one, it's called Evangel.",
      "created_at": "2006-08-05T03:13:34.000Z"
    },
    {
      "author": "Nate",
      "body": "You presume quite a lot about the Evangel crowd.  Don't forget:  Preachers' kids and all that.<br/><br/>I dated one once.  Wooooooo-eee!  Mercy.",
      "created_at": "2006-08-05T07:20:31.000Z"
    },
    {
      "author": "Warren",
      "body": "I'm couldn't be happier about Quizno's.  I don't care what anybody says, they've got the sandwich biz on lockdown.  However I do enjoy Planet Sub quite a little bit.  I also think that we need an Ikea.  My friend has a ton of Ikea stuff and it all rules, but we can't get it here unless we order it.  I hate ordering stuff.  (The spam catcher is asking me for Dan's favorite drink.  Please let it be Goat's blood....)",
      "created_at": "2006-08-05T08:30:29.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Ultimate goal: move Missouri 1,500 miles west to get an In-N-Out burger (how sweet, fresh meat) and try that hidden menu.<br/><br/>That and a gourmet popsicle store (mmm, popsicles).",
      "created_at": "2006-08-05T09:11:21.000Z"
    },
    {
      "author": "Jonna",
      "body": "A banana stand!",
      "created_at": "2006-08-05T23:01:18.000Z"
    },
    {
      "author": "Derek",
      "body": "Wow, Jonna. Wow. Wow.<br/><br/>Ikea rules. Let's get one.<br/><br/>Why is Evangel the brunt of that joke? What about one of the ten million Bible Colleges in town?<br/><br/>I have to be careful what I say about Evangel now because they just announced that they will be watching what we say online from now on. Hooray for Big Brother!<br/><br/>I mean, I love Evangel. Yes. Their rules make perfect sense.",
      "created_at": "2006-08-06T08:09:42.000Z"
    },
    {
      "author": "roe",
      "body": "my heart still belongs to Jimmy John's.  Quizno's just doesn't do it for me.",
      "created_at": "2006-08-07T05:51:03.000Z"
    },
    {
      "author": "nicole",
      "body": "Mmm, we do love Jimmy Johns. I think we order it at least once a week (oh that guacamole sauce). And who can beat the 50cent day-old bread deal!!! Amazing! If you haven't had that yet, it's a great late-night snack.",
      "created_at": "2006-08-07T22:00:44.000Z"
    },
    {
      "author": "Cory",
      "body": "are you guys kidding? you just named like 20 super-corporate megastores. This is BAD for our local businesses. Also BAD for the overall character of downtown. How is the Sub Shop supposed to stay open when it's competing with Jimmy Johns and Quiznos? Or maybe I could put it on your terms. How is the Moxie supposed to stay open with the arrival of a huge cineplex on Cambell? If you compare us to KC, we're going for a Westport feel, not a Plaza feel. All those stores just make a place generic. It could be anywhere, USA. Places are interesting because they have their own vibe, not a more of the same. If you were describing Springfield, you wouldn't say, \"Well, we've got the Gap, Quizno's, um..Blockbuster Video, ahh...William Sonoma...Pottery Barn...\" People would be like oh, you mean like EVERY OTHER city in America? Say no to corporate megachains and yes to local flavor. ",
      "created_at": "2006-08-07T23:27:47.000Z"
    },
    {
      "author": "Derek",
      "body": "I dislike Jimmy John's for the sole reason that they squished Roly Poly, which I loved dearly.",
      "created_at": "2006-08-08T01:58:14.000Z"
    },
    {
      "author": "Nate",
      "body": "Everyone knows that roly polys are unsquishable.  <br/><br/>They are impervious to mere squishing.",
      "created_at": "2006-08-08T02:32:45.000Z"
    },
    {
      "author": "nicole",
      "body": "Cory - no, we're not kidding. Dan's not saying that we should have downtown Springfield turn into souless downtown USA. But here's the thing: there are people in the Springfield metro area who are afraid to come downtown, or don't even know what great things it has to offer. We (and I don't think I'm alone in saying this for some of the other shops down here) have a really hard time reaching certain parts of the city. So, if a couple places (such as a Gap or Pottery Barn) arrive, people who wouldn't ordinarily come here will now think twice.<br/><br/>If a multiplex were to arrive here (which, from the sound of it, isn't too far away), then that means hundreds of more people a day will come down specifically to see movies. Then they notice how great it already is down here (restaurants, boutiques, coffee shops), and decide that next time they eat out as a family, why not try that neat Mexican restaurant down the street? Or instead of checking out the new Pirates, that one movie at The Moxie looks pretty neat.<br/><br/>Some of my favorite cities combine chains and local flavor seamlessly. They're mostly college towns (Columbia, MO; Athens GA, Ann Arbor MI, Lawrence KS). I think we can achieve that vibe. ",
      "created_at": "2006-08-08T02:52:16.000Z"
    },
    {
      "author": "Derek",
      "body": "Good call, Nicole! I agree completely. Lawrence and Columbia are cities that make Missouri look awesome, and I'd love to have Springfield be like that.",
      "created_at": "2006-08-08T03:25:06.000Z"
    },
    {
      "author": "Oh wow",
      "body": "First of all, I never thought I would see a Chilton saying the downtown megaplex was a good thing...good for you, though.  See, doesn't it feel nice to stop being negative about every perceived competitor??  Isn't it nice to at least pretend you don't think everyone is out to get you???  <br/><br/>Second, I think it's funny that Derek thinks Lawrence makes MISSOURI look awesome.....",
      "created_at": "2006-08-08T04:02:18.000Z"
    },
    {
      "author": "bjork24",
      "body": "How many Chiltons do you know, Oh wow???????????",
      "created_at": "2006-08-08T04:15:36.000Z"
    },
    {
      "author": "nicole",
      "body": "Do we know each other personally, Oh Wow? That's the only reason I can think of for the anonymity.<br/><br/>We've been talking about this megaplex since it's announcement well over a year ago, and this is the attitude we've always had. Well, we do think 14 screens is a bit much, but other than that, we've never thought someone was out to get us.<br/><br/>",
      "created_at": "2006-08-08T04:38:04.000Z"
    },
    {
      "author": "nicole",
      "body": "Oh yeah, we also eat at the Sub Shop on a weekly basis (with Dan's Dad). We love subs, I guess.",
      "created_at": "2006-08-08T04:40:23.000Z"
    },
    {
      "author": "Tedd",
      "body": "My list of SC's (Significant Chiltons)<br/><br/>1.  Dan and Nicole<br/><br/>2.  Alex",
      "created_at": "2006-08-08T07:24:21.000Z"
    },
    {
      "author": "Nate",
      "body": "Those people that write the auto repair books: <br/><br/>http://www.chiltonsonline.com/",
      "created_at": "2006-08-08T17:33:38.000Z"
    },
    {
      "author": "Nate",
      "body": "And don't forget about the meerkats, Nicole.  The meerkats are out to get you.  They are out to get ALL of us.",
      "created_at": "2006-08-08T17:35:27.000Z"
    },
    {
      "author": "Nate",
      "body": "The more I think about it, the more hilarious a picture \"Oh Wow\" paints of you guys:  glancing over your shoulders, paranoid mutterings under your breath, holding your brownies tight to your chest.  \"Everybody's out to get us, Dan.  They're out to get us!\"<br/><br/>It's hysterical because I've never met two more positive, industrious people in my life.<br/><br/>But still.  You do mutter.",
      "created_at": "2006-08-08T17:40:06.000Z"
    },
    {
      "author": "Rachel",
      "body": "I absolutely love Trader Joe's. We should start a letter writing campaign for that one... mmm... ",
      "created_at": "2006-08-10T19:07:12.000Z"
    },
    {
      "author": "Doug",
      "body": "I worked downtown for 15 years, then our location changed for 5 years, and I really didn't come downtown too often.  Our office was moved back downtown again last fall, and I couldn't be happier.  I'm amazed with all the wonderful things that are springing up, I am THRILLED with the Quizno's, and think it's pretty dog-goned nifty that I can sprint out of my downtown office at 4:30 and catch a matinee of \"Strangers with Candy\" at the Moxie.  <br/><br/>Am I dead?  Is this heaven?  <br/><br/>BTW, I'm from Southeast Missouri originally, and there's enough Chiltons over there to burn a wet mule.  ",
      "created_at": "2006-08-30T03:41:47.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 12,
      "name": "Thoughts"
    }
  ]
}
