{
  "id": 439,
  "title": "An Old Box of Films, Part 1",
  "body": "Back when we first opened the theater, a gentleman dropped by and told us that he had recently inherited several boxes and canisters filled with old 35mm films. He had no idea what the movies were, so he asked if we might be able to put them on our projector and help him figure it out. We agreed, and told him to bring by the films whenever he had a chance. Today, nearly a year after our original meeting, he called to let us know he was in town with the films.<br/><br/>Long story short, we now have a dusty collection of 35mm films sitting in the vault... but that's not the half of it, folks. As I started to dig through everything, I found not one, but TWO complete feature films (one of which looks like it's never been played before), a couple animated short film featurettes from the 1950s, and several film trailers from the late 70s... including an original STAR WARS preview.<br/><br/>Here's a detailed list of what I've uncovered so far:<br/><br/><ul><li><b>THE DREAMER</b> - This is the first of the two feature length films, and it is in pristine conditions. When a film is screened, the heads and tails (excess film on both ends of the reel) are typically cut away, allowing the reels to be spliced together seamlessly. However, the heads and tails are uncut on all five reels. There's no scratches, dirt, or any other visible signs of having been shown before. However, after <a href=\"http://www.imdb.com/find?q=the%20dreamer;s=all\" target=\"_blank\">searching IMDB for the film</a>, I came up empty-handed.<br/><br/>There are three direct title matches: a British film from 2000 (too new), a black and white from 1948 (the film is color, so that's not it), and a third from 1916 (definitely not it). The other results are foreign films where the title translates to \"The Dreamer,\" but from what I can tell, the film isn't foreign. There are no subtitles and the film stock is from the US. From the frames I saw, it looks like the film is set in the 1970s (obvious fashion and hairstyles), in an office setting. Reel number one, the one that should contain the title in the opening credits, is wound backwards, so the outermost part is the end of the reel.</li><br/><li><b><a href=\"http://www.imdb.com/title/tt0075909/\" target=\"_blank\">DAMNATION ALLEY</a></b> (1977) - <a href=\"http://en.wikipedia.org/wiki/Damnation_Alley_%28film%29\" target=\"_blank\">wikipedia</a> - This is the second feature-length film in the collection, and it looks like a hoot. According to the IMDB trivia, \"the movie sat on the shelf at 20th Century Fox for some time after production was completed in 1976. Fox had high hopes for it on its release in 1977, expecting it to do better at the box office in comparison to Fox' other sci-fi release scheduled for that year... Star Wars.\"<br/><br/>Unlike THE DREAMER, this print looks like it's been played... but not much. The print itself is in perfect condition - in fact, I've seen current films that looked worse than this one. When I was reading the forum for DAMNATION ALLEY, a certain <a href=\"http://www.imdb.com/title/tt0075909/board/nest/49820661\" target=\"_blank\">post</a> caught my eye (requires login). It said:<br/><br/><quote>My best memories of this movie are the giant cockroaches and the \"Star Wars\" trailer (before the special effects were done) that preceded the movie.</quote><br/><br/>Hmm, could that mean that the included STAR WARS trailer is an early version of the film, sans sepcial effects?</li><br/><li>Two reels (#1 and #3) of <b>JESUS CHRIST SUPERSTAR</b>, along with two lengthy promo trailers for the film. It's obvious that these reels have been played numerous times, but considering their age, they've held up pretty well. The color has faded a little, and there seems to be some tinting towards the outer part of the reel.</li><br/><li>The <b>STAR WARS</b> trailer is awesome. It's in great shape, despite missing its tail and having some masking tape residue on last few frames. I unwound it far enough to see a couple frames of Chewie and Han, and a tie fighter with the classic semi-transparent squares around it. I can't wait to see this one on the big screen.</li><br/><li>The short featurettes are: <b><a href=\"http://www.imdb.com/title/tt0075229/\" target=\"_blank\">SKY RIDERS</a></b> promo; <b><a href=\"http://www.imdb.com/title/tt0046778/\" target=\"_blank\">BILLY BOY</a></b>, an animated short directed by <a href=\"http://en.wikipedia.org/wiki/Tex_Avery\">Tex Avery</a> from 1954; and <b><a href=\"http://www.imdb.com/title/tt0045095/\" target=\"_blank\">ROCK-A-BYE BEAR</a></b>, another Avery cartoon from 1952. There's a fourth short animated film - looks like another Avery - but it's in terrible condition.</li><br/></ul>There are two things that excite me about this find: 1) What if THE DREAMER is a film that never made it to the public (thus explaining its pristine condition and lack of info in IMDB)? And 2) what if we have one of the only existing copies of DAMNATION ALLEY? I'm going to dig into the films a bit deeper, and keep updating the blog as I find out more. Best case scenario, we throw a \"Found Film Fest\" and show them all during Moxie Week in September. Worst case scenario, I die.<br/><br/>More to come!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-08-08T07:31:14.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Laura",
      "body": "How exciting!  I can't wait to hear what you find out about those movies.  ",
      "created_at": "2006-08-08T08:02:07.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Damnation Alley is coming to DVD through Anchor Bay.",
      "created_at": "2006-08-08T09:16:37.000Z"
    },
    {
      "author": "--Jeff",
      "body": "RJ, you read that blog, right?  The Moxie HAS A PRINT OF IT!  We can watch it in the air-conditioned comfort of the Moxie (September, maybe!) along with you and 74 of your closest friends.  <br/><br/>Who needs this \"DVD\" stuff? <br/><br/>I'm all for a Found Film Festival...",
      "created_at": "2006-08-08T17:03:27.000Z"
    },
    {
      "author": "Nate",
      "body": "Real Tex Avery prints!  That is maybe what I like most of all.",
      "created_at": "2006-08-08T18:19:22.000Z"
    },
    {
      "author": "Caleb",
      "body": "This is AWESOME! I like the Found Film Festival idea too. So do you get to keep the film or is it only on loan from that guy?",
      "created_at": "2006-08-08T19:50:11.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Could \"The Dreamer\" actually be \"Dreamer\": the 1979 Noel Nosseck movie about bowling?   <br/><br/>http://www.imdb.com/title/tt0079080/ <br/><br/>It's around the same time frame as your other movies...<br/>",
      "created_at": "2006-08-08T21:55:34.000Z"
    },
    {
      "author": "--Jeff",
      "body": "More about Dreamer:  <br/><br/>http://en.wikipedia.org/wiki/Dreamer_(1979) <br/><br/>",
      "created_at": "2006-08-08T21:57:26.000Z"
    },
    {
      "author": "shaun",
      "body": "have you ruled out the possiblity that it may be an adult feature?<br/>",
      "created_at": "2006-08-08T23:08:49.000Z"
    },
    {
      "author": "bjork24",
      "body": "That's a good point, Shaun. However, I have a hard time believing that an adult film would be in this condition - NBP (Never Been Played). Still, you never know. I guess we'll find out soon enough!",
      "created_at": "2006-08-08T23:12:00.000Z"
    },
    {
      "author": "Fyse",
      "body": "That is hugely exciting. Wish I could see them too, but I look forward to hearing all about it.",
      "created_at": "2006-08-09T03:13:29.000Z"
    },
    {
      "author": "Al",
      "body": "Damnation Alley got some play after The Day After was on TV, it was pretty good actually.  It has a limited collector base, but I would think the Star Wars promo would be worth serious cash.",
      "created_at": "2006-08-09T04:35:57.000Z"
    },
    {
      "author": "Bud says:",
      "body": "Part of Damnation Alley was filmed in a junkyard owned by a family friend so it holds a special place in my heart. Most of the girls in Bloomington, CA turned out hoping to catch a glimpse of Jan Michael Vincent, but my brother and I had to get an upclose look at the vehicle. That vehicle is definitely the star of the movie in my opinion. I wish your theater was a little closer to Socal, I'd jump at the chance to see the flick on the big screen again.",
      "created_at": "2006-08-09T16:19:17.000Z"
    },
    {
      "author": "Greg Ward",
      "body": "Did you see the website for the car in this movie? It is the same one used for the Paperboy 2000 in \"Get A Life\" w/ Chris Elliot! Can't wait to see this movie",
      "created_at": "2006-08-09T18:08:42.000Z"
    },
    {
      "author": "Greg Ward",
      "body": "Here is the website for the car in the movie. http://www.snowcrest.net/fox/landmaster/",
      "created_at": "2006-08-09T18:11:34.000Z"
    },
    {
      "author": "CousinSteph",
      "body": "Too cool about the SW trailer!  Hope we get to see it one day.",
      "created_at": "2006-08-09T20:55:13.000Z"
    },
    {
      "author": "william",
      "body": "It is cool hearing about the starwars trailer ,any idea what value it has ? just curious",
      "created_at": "2006-10-02T07:14:05.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
