{
  "id": 440,
  "title": "An Unbelievable Truth",
  "body": "We broke all kinds of records today, and I'm dying to tell the world. First off, we completely sold out the 7:00 showing of AN INCONVENIENT TRUTH, grossing (with only one show on a Wednesday night) nearly HALF of what the other theater did over their entire opening weekend. I don't want to gloat, but that's really AWESOME! Hopefully the distributor(s) will think twice when we tell them that our audience is much more atuned to these types of films than those at the multiplexes.\r\n\r\nSecond point of incredibleness: we have a HUGE turnout for STRANGERS WITH CANDY, which, as I type this, are laughing their heads off in the auditorium. Had TRUTH been the only big show tonight, I'd be happy, but having TWO big shows - one right after the other - is almost too much to believe. Think about this: the total for tonight's two shows (on a Wednesday, which is traditionally one of our slowest nights of the week) is 61% of the ENTIRE TOTAL FOR ALL OF LAST WEEK! MY CAPS LOCK IS STUCK!\r\n\r\nIf this continues, we might be able to break our all-time single week attendance record. Woah. I haven't heard an audience laugh that hard for a long time... like, since SARAH SILVERMAN was in town. So, a big THANK YOU (CAPS LOCK STUCK AGAIN) to everyone who braved the big shows tonight, and another big THANK YOU to everyone who will come after them. These are exactly the kind of weeks we live for... literally.\r\n\r\n:)",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-08-10T07:11:11.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "elliott",
      "body": "good. go team moxie. but i only have one question. does al gore make all theatres that show his film raise the temp in the theatre to better get the point across, or is that just the summer and a sell out show? \r\n\r\neven if he didn't, it was worth the wait to see it at the moxie... i'd rather be hot and at the moixe than cold and at campbell any day of the week...\r\n",
      "created_at": "2006-08-10T07:18:20.000Z"
    },
    {
      "author": "bjork24",
      "body": "We had the A/C running full blast, but a sold out crowd who insists on exhaling their hot breath (hold it in, folks) in tight quarters on a super hot day... it tends to raise the temp a bit. Either way, thanks for braving it out.",
      "created_at": "2006-08-10T07:22:51.000Z"
    },
    {
      "author": "elliott",
      "body": "i was kinda hoping it was an al gore thing... \r\n\r\nwe really wanted to see strangers with candy also, but homework awaits... ",
      "created_at": "2006-08-10T07:27:01.000Z"
    },
    {
      "author": "nicole",
      "body": "No, no. You're right, Elliot. It's an Al Gore thing. ",
      "created_at": "2006-08-10T07:30:41.000Z"
    },
    {
      "author": "brian of moore",
      "body": "remind me to remind you guys to save me a ticket for tomorrows 7pm show.. seeing that i dont do to much 'buying' of tickets these days",
      "created_at": "2006-08-10T10:09:17.000Z"
    },
    {
      "author": "evilvet",
      "body": "I'm so glad that your \"I Smell Greenhouse Gas and Candy\" double feature was huge.  Your lineup for the rest of the month looks more stacked than a Betty Page lookalike contest at an International House of Pancakes.  Go crazy.",
      "created_at": "2006-08-10T17:03:43.000Z"
    },
    {
      "author": "Caleb",
      "body": "Sounds like quite the Gore-fest. HA!!!! Get it? GET IT?! God I'm so clever sometimes. ",
      "created_at": "2006-08-10T18:34:35.000Z"
    },
    {
      "author": "Nate",
      "body": "The crowd seemed very into it, like a gospel church for environmentalists.  At least the the lady behind me was.  She did everything but raise her hands to the sky, close her eyes, sway back and forth, and exclaim things like \"Hallelujah. Praise be.  Mmmm-hmmm.\"\r\n\r\nShe did keep up a running commentary, though.  \"That's right!  Oh man!\" That sort of thing.  It annoyed me throughout what was otherwise a fascinating movie.",
      "created_at": "2006-08-10T19:25:21.000Z"
    },
    {
      "author": "justin",
      "body": "and they clapped.  a lot.",
      "created_at": "2006-08-10T19:40:14.000Z"
    },
    {
      "author": "Amanda",
      "body": "Woohoo! Happy days for the Moxie. We're happy for you even though we can't commute there from Boise :(",
      "created_at": "2006-08-10T20:24:22.000Z"
    },
    {
      "author": "Mike B.",
      "body": "Glad to hear it. It was a good film, well-presented. ",
      "created_at": "2006-08-10T21:38:58.000Z"
    },
    {
      "author": "Zach",
      "body": "Good to hear things are going well!",
      "created_at": "2006-08-11T07:40:37.000Z"
    },
    {
      "author": "Mary FK",
      "body": "Yea! I was there and I'm speading the Moxies name all over town. I'm so proud of that theater. A strong attempt to bring culture into Springfield. Congrats!",
      "created_at": "2006-08-19T05:23:15.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 16,
      "name": "Customers"
    }
  ]
}
