{
  "id": 441,
  "title": "An Old Box of Films, Part 2",
  "body": "So, here's what we've learned so far:<br/><br/><ul><li><b>THE DREAMER</b> is none other than <a href=\"http://www.imdb.com/title/tt0079080/\" target=\"\">Dreamer</a>, a Rocky-style bowling movie, as Jeff pointed out on the first post. Strangely enough, DREAMER was never released theatrically... it went straight to video. So then why do we have a pristine 35mm print of the film? And more importantly, would a bowling movie from 1979 play well at The Moxie?</li><br/><li>The STAR WARS trailer is actually a promo for the April 10, 1981 re-release (just before THE EMPIRE STRIKES BACK was released). I was hoping it was an original from 76 or 77, but still... a 25 year old STAR WARS preview is pretty cool.</li><br/><li>I'm still waiting to hear back from 20th Century Fox on DAMNATION ALLEY (regarding whether it's the last remaining print, etc.).</li><br/><li>Springfield 33, our local ABC affiliate, will be running a story about the films tomorrow during the 5:00 news, and <i>possibly</i> again during the 10:00.</li></ul><br/>Very exciting stuff! As usual, I'll keep updating as I learn more.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-08-11T03:11:10.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Leonard Maltin on Dreamer (1979) from Leonard Maltin's 2007 Movie Guide:<br/><br/>Bowling, a sport only slightly more cinematic than isometric exercises, gets the Rocky treatment in this bland rags-to-riches story. Having Tim Matheson's bowling ball made by Flubber might have helped pick up the pace.<br/><br/>In short, Maltin gave it two stars. Fox might be wondering on the print of the film (I read it was a Fox release and the film is only available on VHS). Also, a bowling film will do well, remember The Big Lebowski?",
      "created_at": "2006-08-11T04:14:13.000Z"
    },
    {
      "author": "J.D.",
      "body": "It's great that you got these movies, but I was wondering if there was anything that would prevent you from showing them. <br/>Ya know except for them not doing good, like do you need to get the studio's permission or anything or can you just show them?",
      "created_at": "2006-08-11T07:00:04.000Z"
    },
    {
      "author": "Caleb",
      "body": "The Big Lebowski was anything but a bowling movie. The best summarization would include flying nude female painters and White Russians. But NOT bowling.",
      "created_at": "2006-08-11T08:39:27.000Z"
    },
    {
      "author": "brian of moore",
      "body": "caleb is correct.. rj is not... but you guys knew that<br/><br/>i was born in 79 and im pretty sure i would play well at the moxie",
      "created_at": "2006-08-11T09:25:42.000Z"
    },
    {
      "author": "--Jeff",
      "body": "Agreed:  The Big Lebowski is NOT a bowling movie.  <br/><br/>Kingpin: Best bowling movie ever. <br/>",
      "created_at": "2006-08-11T16:57:39.000Z"
    },
    {
      "author": "Nate",
      "body": "Don't play it on a Saturday.  I don't roll on Saturday.",
      "created_at": "2006-08-11T18:19:40.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "The Big Lebowski IS a bowling movie. That's like saying Vision Quest isn't a wrestling movie.",
      "created_at": "2006-08-12T00:50:32.000Z"
    },
    {
      "author": "Nate",
      "body": "I think what Caleb means is that The Big Lebowski has bowling in it, but that is not why it did well.",
      "created_at": "2006-08-12T00:55:51.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "I was just trying to spread good cheer, tootles.",
      "created_at": "2006-08-12T04:47:56.000Z"
    },
    {
      "author": "tim",
      "body": "Odd, i don't read this site for a couple days and my co-worker tells me about this little theater from my home town he saw on CBS nightly news and how they received a gift of a bunch of old film prints. Imagine if the Moxie was that theater, crazy. ",
      "created_at": "2006-08-17T19:05:20.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
