{
  "id": 443,
  "title": "Is the grass greener",
  "body": "Our big one year anniversary is right around the corner, which means it's time to wax introspective and ask myself, \"has it all been worth it?\" By the time September 21st rolls around, I will have worked 360 out of 365 days, introduced nearly 900 of the 1,000 movies we've shown, manually rewound over 1,800 reels, and spent close to 4,000 hours inside The Moxie (3,800 of which were probably on the computer). It's been a long, tough first year, but I'd be lying if I didn't say I've loved every minute of it. Even still, there's some things I miss about the old 9-to-5 routine. For instance:\r\n\r\n<ul><li><b>A structured workday</b> - 8:00 am to 4:30 pm (with an hour lunch), five days a week. There's something subtly alluring in that kind of structure.</li>\r\n<li><b>Evenings</b> - Coming home from work around 5:00, relaxing, eating dinner, watching TV, going to the movies, etc..</li>\r\n<li><b>Good health insurance</b> - No further explanation needed.</li>\r\n<li><b>Salaries</b> - Looking back, I find it funny how two people in their early 20s, with no kids, no house payments, and no obligations, were making $60,000 a year and STILL complained about how they didn't have any money.</li>\r\n<li><b>Weekends</b> - Two days off... in a ROW! I can't even remember what that was like.</li></ul>\r\nAnd yet it amazes me how many people take these things for granted... just as I did, before we started The Moxie. Of course, with all that being said, I can see where people stuck in the old \"9-to-5\" rut might find running their own business attractive. Just like any other job, there are a lot of pros and cons to running The Moxie, but thankfully the pros far outweigh the cons. Let me brag for a moment.\r\n\r\n<ul><li><b>What's an alarm clock?</b> - Now that we work nights, it's not unusual for us to go to sleep around 1:00 or 2:00 in the morning, which means we get to sleep in until... whenever. We wake up naturally with the sun, which is usually around the time that \"The Price Is Right\" is winding down.</li>\r\n<li><b>Being your own boss</b> - I'm sure this is the #1 reason most people daydream about running their own business, but let me be the first to tell you, it's not that great. Without a boss, I have no one to complain about, no one to secretly feel intellectually superior over, no one to mock during happy hour after work. I need that release, doggoneit!</li>\r\n<li><b>Big responsibilites</b> - Business taxes, payroll taxes, personal taxes, sales taxes, liquor licenses, business licenses, health inspections, insurance, audits, worker's compensation, payroll, health insurance, liability insurance, rent, utilities, etc.. It's enough to give anyone a headache! Good thing Nicole does it all, because I don't think I could handle it. Woo hoo for Nicole!</li>\r\n<li>Wasn't I supposed to be bragging?</li>\r\n<li><b>Wide open days</b> - Our days are usually pretty free to do whatever we like, which 90% of the time means absolutely nothing. You've gotta take a break sometime.</li></ul>\r\nSo, I think that's enough bitching and bragging. Maybe this post will awaken all the commenters out there who had forgotten what it was like to see a new post on The Moxie Blog. Also, here's a little secret between you and me: everyone who comes to the last showing of AN INCONVENIENT TRUTH tonight is going home with more than they came with.\r\n",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-08-23T00:18:15.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nicole",
      "body": "Here's the main thing I miss about my pre-Moxie existence: having my own office (well, ok, cubicle). Seriously. My desk is the Cinebar counter. That gets old quickly. My ergonomic computer station is a laptop on top of a Coke crate. I just need a desk. A simple desk where I can file, pay bills, and work on all the fun administrative stuff that consumes my Wednesdays.\r\n\r\nAnyone have a desk they want to get rid of? \r\n\r\nOther than that, I do love our Moxie life. Well, except for the crappy insurance. Don't take that for granted, people!",
      "created_at": "2006-08-23T01:14:13.000Z"
    },
    {
      "author": "Aaron J Scott",
      "body": "You know, I have good health insurance and I can't manage to get sick.\r\n\r\nAnd you guys were making $60K a year? I need your old jobs.",
      "created_at": "2006-08-23T02:15:37.000Z"
    },
    {
      "author": "nicole",
      "body": "Actually, rumor has it that my old position is currently open...in St. Louis. It was a marketing job at a publishing company. But I made significantly less than Dan, yet did 6 times more work. Go figure.",
      "created_at": "2006-08-23T02:47:24.000Z"
    },
    {
      "author": "--Jeff",
      "body": "You can have my desk, Nicole, but you have to take the stuff cluttered on it.  The cool, new, geeky hardware, stuff cluttered on it. \r\n\r\nAnd install it.  :)  \r\n\r\nhttp://img237.imageshack.us/img237/796/superx1fi1.jpg\r\n\r\nOn second thought, I don't want to give that up.  You guys continue owning the business, I want the hardware and the office...",
      "created_at": "2006-08-23T06:11:00.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Do you know how many people would kill to have your job? Lots and they'd even kill you for it.\r\n\r\nPostscript: on more than they came in with, was it a Miranda July-designed statue of Rachel McAdams frenching Elizabeth Bathory?",
      "created_at": "2006-08-23T17:48:57.000Z"
    },
    {
      "author": "nicole",
      "body": "No, it was compact florescent (sp?) light bulbs.",
      "created_at": "2006-08-23T17:51:33.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Not as entertaining, but still, it works.",
      "created_at": "2006-08-23T18:02:10.000Z"
    },
    {
      "author": "Nate",
      "body": "I enjoyed last night's Inc. Truth discussion at WFH.  It had a few...interesting moments.\r\n\r\nHope I didn't step on anyone's points.  I tried not to!",
      "created_at": "2006-08-23T18:36:58.000Z"
    },
    {
      "author": "Nate",
      "body": "Dan, here is something that can help you with all those film reels:\r\n\r\nhttp://www.youtube.com/watch?v=f5Fg6KFcOsU",
      "created_at": "2006-08-23T19:20:58.000Z"
    },
    {
      "author": "Dave",
      "body": "that structure and free time you miss gives one just enough time to lament the fact that they're a corporate stooge... but the free stationary is nice.",
      "created_at": "2006-08-24T19:14:28.000Z"
    },
    {
      "author": "Al",
      "body": "Dan, I think at one point you considered taking Monday off, at least in the Summer. Any more thought to that?",
      "created_at": "2006-09-01T06:22:02.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
