{
  "id": 445,
  "title": "Moxie Week 2006",
  "body": "September is upon us, and you know what that means... that's right: we have to stop sleeping with months of the year! Woah! That joke was AWESOME! I've still got it! Seriously though, September 2006 means Moxie Week is right around the corner! I just finished adding all the special events to the online calendar, so if you haven't check that out yet, <a href=\"http://www.moxiecinema.com/calendar\" class=\"broken\">you probably should</a>. Now, let's take a look at what's going on during Moxie Week 2006:<br/><br/><b>MST3K</b> - <i>Thursday (September 14th)</i> - We're going to kick off the festivities by revisiting one of our favorite Moxie A Go-Gos: MST3K (Moxie Skinny Theatre 3000). Everyone's invited over to The Skinny's place (on Park Central East, across from Trolley's) at 8:00 pm for an MST3K-style roasting of MANOS: THE HANDS OF FATE! Last time we hosted this event, it sold out... and I bet the same thing will happen this time too. ($8.00 tickets)<br/><br/><b>Moxie Shorts</b> - <i>Friday (15th) through Sunday (17th)</i> - We have three showings scheduled for our short film celebration: Friday at 7:00 pm, Saturday at 2:00 pm, and Sunday at 4:30 pm. Screeners will go out to our esteemed panel of judges later in the week. I believe we have enough student-made films that we'll be able to award prizes for both \"Best Short Film\" and \"Best Student Short Film,\" which is great. Keep your eye on <a href=\"http://www.MoxieShorts.com\" class=\"broken\">MoxieShorts.com</a> for updates. ($5.00 tickets)<br/><br/><b>Found Film Festival</b> - <i>Saturday (16th) and Monday (18th)</i> - Remember the boxes of old films that were brought in a little over a month ago? <a href=\"/posts/439\">Of course</a> <a href=\"/posts/441\">you do</a>! Well, guess what: we're going to show some of them! The feature film with be the ultra-cheesy <a href=\"http://www.imdb.com/title/tt0075909/\">DAMNATION ALLEY</a> (1976), starring Jan-Michael Vincent and an army of KILLER COCKROACHES. Also on the line-up will be at least one of the original Tex Avery animated shorts, and the 1981 STAR WARS trailer. It's going to be a night filled with movies that haven't been screened for at least 30 years... should be exciting! ($5.00 tickets)<br/><br/><b>Movie Trivia Night</b> - <i>Tuesday (19th)</i> - It's time to brush up on your film knowledge and meet us in the banquet room behind Patton Alley Pub for a night of movie and Moxie-related trivia (sample: what's the name of The Moxie Blog's mascot?). This will be team trivia, so all you introverts are going to need to toughen up and ally yourself with at least TWO more people, but no more than FOUR... in layman's terms: teams need to be between 3 to 5 people. A participation fee of $50 per team will cover your entry, food, and my precious, precious time. The winning team will take home a portion of the participation pool, along with other sweet prizes. Registration will begin one week prior to the event on Tuesday the 12th.<br/><br/><b>Poster Liquidation</b> - <i>Wednesday (20th)</i> - Nicole is in charge of this one, and I don't know many of the details beyond the fact that we're getting rid of all our excess movie posters. I'm sure she'll chime in sooner or later with more info.<br/><br/><b>BIRTHDAY BASH!!!</b> - <i>Thursday (21st)</i> - Those of you who attended the Big Smith Q&A / concert after last Tuesday night's show may have noticed a few auditorium upgrades. For instance, we now have two large extensions (thanks Dad!) that tack on an additional 3 feet to the stage, AND directional can lights that can be controlled from the booth (thanks ME!). Big Smith was the impetus for the upgrades, but I had future plans in mind as well. So, on the night of our one year anniversary, we will be hosting the first of what I hope will become a monthly series... tentatively and uncreatively named, Moxie Unplugged. Our first concert will feature the musical stylings of Cindy Woolf, J.R. Top (one-time Moxie employee), and Nathaniel Carroll... AND IT'S FREE! To top things off, we'll also be serving champagne and cake at the Cinebar. Tickets will be available \"day of.\" I'm pumped for this one... PUMPED!<br/><br/><b>The re-auctioning of the Cinebar's naming rights</b> - <i>11th through 21st</i> - Longtime readers may remember when we originally auctioned off the naming rights to our beloved Cinebar way back in April of 2005. It was quite an ordeal, but it helped raise additional funds to get us to opening day. Well, now we're doing it again. On September 21st, The <a href=\"http://www.sgfsoccer.com\">SGFSoccer.com</a> Cinebar will become The (your name here) Cinebar. The money raised through the auction will be divided as follows: part of it will be donated to the film and video departments at MSU and Drury, part of it will be set aside for future Moxie A Go-Go events (which may be going non-profit in the future), and the rest will go towards buying us a decent sign (neon perhaps) for the outside of our building. Unlike the last time we auctioned off the naming rights, the money won't be needed for the sole purpose of keeping us in business, which is something I couldn't be more happy about.<br/><br/><b>UPDATE:</b> It's live - <a href=\"http://cgi.ebay.com/ws/eBayISAPI.dll?ViewItem&item=180027705209\" class=\"broken\">The Cinebar auction</a><br/><br/>That about does it for the Moxie Week 2006 schedule. I hope everyone is able to make it to at least a couple of the events... if not ALL of them. Can you guys believe we've even come this far? It's still a bit surreal to me... like that radioactive donkey dancing in the corner.<br/>",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-09-04T08:24:20.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "i like this month<br/>i also like that it sounds like you guys are doing fairly well.. financially<br/>",
      "created_at": "2006-09-04T09:23:49.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Planet Funktron Cinebar, here we come.",
      "created_at": "2006-09-04T09:38:56.000Z"
    },
    {
      "author": "--Jeff",
      "body": "I'm using all of my life savings to write a check for the \"Oh, RJ CineBar.\"<br/><br/>Nothing you can do about it. ",
      "created_at": "2006-09-04T17:46:43.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
