{
  "id": 446,
  "title": "Beer, Big Smith, and our man Bogart",
  "body": "We're going to be introducing a new beer menu around the beginning of October, and I thought I'd give you guys a sneak peek. For those of you who have forgotten what we serve, here's our current line-up:\r\n\r\n+ Budweiser\r\n+ Bud Light\r\n+ Amberbock\r\n+ Michelob Ultra\r\n+ Boulevard Wheat\r\n+ Boulevard Pale Ale\r\n+ Schlafly Oatmeal Stout\r\n+ Schlafly Seasonal (rotates)\r\n+ Mueller Lager\r\n+ Mueller Pale Ale\r\n\r\nThe whole \"all Missouri beer\" menu was cool for the first year, but I think it's time to widen our horizons a bit. Now don't worry, I'm not overhauling the ENTIRE menu, just our weakest sellers. So here's what I was thinking for the 06-07 roster:\r\n\r\n<b>Veterans</b>\r\n+ Bud Light\r\n+ Budweiser\r\n+ Boulevard Wheat\r\n+ Boulevard Pale Ale\r\n+ Shlafly Seasonal\r\n+ Mueller Lager\r\n\r\n<b>Rookies</b>\r\n+ Guinness Stout\r\n+ Blue Moon Unfiltered Wheat\r\n+ Newcastle Brown Ale\r\n+ Killian Red OR Fat Tire (still undecided)\r\n\r\nSo, what do you guys think? The menu isn't set in stone, so I'm sure my opinion could be swayed one way or the other.\r\n\r\nI meant to post these pictures quite awhile ago, but stuff happened and I forgot. These are a few shots from Big Smith's Q&A / acoustic set from last Tuesday.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/090606/bs_talking.jpg\" width=\"425\" />\r\n\r\nHere's the band talking to the sold out audience about their documentary, HOMEMADE HILLBILLY JAM. Notice the nice stage extension that my dad built, which no one is standing on... and would you just look at how well they're lit! Someone must've spent a lot of time hanging and calibrating the new stage lights... oh yeah, I DID! Good job, Dan. Good job.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/090606/bs_singing.jpg\" width=\"425\" />\r\n\r\nHere's Big Smith doing what they do best: looking blurry in photographs. They're also playing their instruments and singing is this picture as well. Mark (far left) was brave enough to move the fronts of his feet onto the new stage extension, while Jay (far right) is taking his life into his own hands as he plays the washboard while precariously balancing on the stairwell.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/090606/bs_bob_singing.jpg\" width=\"425\" />\r\n\r\nHalfway through their set, the guys asked Bob Bilyeu (father of Mark and Jody) to join them on stage and sing a funny little ditty about a cross-eyed woman. Bob wasn't afraid to stand on the stage extension.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/090606/bogart.jpg\" width=\"425\" />\r\n\r\nAnd finally, here's Bogart. Good night Springfield! You've been great!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-09-07T08:04:27.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brian of moore",
      "body": "im pretty sure the stage extensions most useful aspect\r\nwas that it made the band on the stage feel more secure that they wouldnt fall off\r\n\r\nas for the beers.. im not much for beer.. (as in i kind of loathe it)\r\nbut from being associated with many beer lovers.. id say adding guinness is going to make alot of people happy\r\nas for the last two.. i seem to hear people enjoying fat tire more often than killians... but as stated... its not exaclty my forte\r\n\r\nps- nice pillows\r\n\r\n",
      "created_at": "2006-09-07T08:27:11.000Z"
    },
    {
      "author": "bjork24",
      "body": "<i>nice pillows</i>\r\n\r\nI didn't know you could see Nicole's chest in any of those pictures.\r\n\r\n*rimshot*",
      "created_at": "2006-09-07T08:37:49.000Z"
    },
    {
      "author": "brian of moore",
      "body": "chest of drawers! .. \r\n*slam dunk* ..... okay maybe not...\r\n\r\nspeaking of shots though\r\nnice money shot of bogart",
      "created_at": "2006-09-07T09:05:58.000Z"
    },
    {
      "author": "jOsh",
      "body": "Fat Tire!!! no question there...",
      "created_at": "2006-09-07T10:26:38.000Z"
    },
    {
      "author": "--Jeff",
      "body": "GUINNESS!!! \r\n\r\nBrilliant.   \r\n\r\nSorry to be the dissenting voter, but I'd go for Killian Red as the choice for the other Undecided.  (That's only if the world ran out of Guinness.) ",
      "created_at": "2006-09-07T17:05:57.000Z"
    },
    {
      "author": "Nate",
      "body": "Oh.  My.  God.\r\nGuinness at the Moxie?  \r\nWere you guys trying to figure out a way to entice me to hang around MORE?\r\nAnd I too prefer Killian's over Fat Tire, but I would just drink it once in a Blue Moon.  Aha!  I'm awesome.\r\n\r\n1.  Those Bilyeu's are so awesome.  Jody's the best.  I still have to resist writing it bilyeu, with a lower case \"b\", because Brady used to force us all to write it that way in high school, though I think he's past that now.\r\n\r\n2.  Bogart is flashing all of Springfield, the pervert.\r\n\r\n3.  I like the couch and coffee table.  Very loft-y.",
      "created_at": "2006-09-07T17:52:48.000Z"
    },
    {
      "author": "justin",
      "body": "sierra nevada pale :(",
      "created_at": "2006-09-07T20:01:04.000Z"
    },
    {
      "author": "nicole",
      "body": "Yeah, Bogey has no tact. And I like how because of him, we have to have a slip cover for the slipcover! And Nate, my Grandfather made that coffee table (he was the one that was Olivia deHaviland's personal guard, and also guarded the Hindenburg when it crashed). Yet he died of lung cancer when my Mom was a teenager.",
      "created_at": "2006-09-07T21:35:27.000Z"
    },
    {
      "author": "Rachel",
      "body": "That is quite the beer line-up! Very exciting! I would choose Fat Tire over Killian's, but it's a tough call. It will be hard to choose one anyways -- now with Guiness and Blue Moon, and all the MO beers! I love Mueller and Boulevard. ",
      "created_at": "2006-09-07T23:11:00.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Your grandfather was in the John Wayne crapfest The Conquerer?",
      "created_at": "2006-09-07T23:22:51.000Z"
    },
    {
      "author": "nicole",
      "body": "No RJ, people get cancer from smoking, not being in movies.",
      "created_at": "2006-09-07T23:31:26.000Z"
    },
    {
      "author": "Caleb",
      "body": "I vote for Fat Tire. But I haven't had Killian Red. So I'm biased. \r\n\r\nQuestion: are you keeping Amberbock and Michelob Ultra? Maybe it's just me, but those seem to be some of your best sellers. \r\n\r\nWoot for Guinness!",
      "created_at": "2006-09-08T09:00:27.000Z"
    },
    {
      "author": "Tedd",
      "body": "Looks to me like Bogart has been dipping into the beer inventory.  \r\n\r\nAlthough I'm a Boulevard Pale Ale fan, my date likes Michelob Ultra.  So either keep it on the menu, or I'll have to buy her one of these...\r\n\r\nhttp://www.thebeerbelly.com/",
      "created_at": "2006-09-08T19:08:33.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "I mean people REALLY died from being in The Conquerer. Look it up!",
      "created_at": "2006-09-09T01:29:03.000Z"
    },
    {
      "author": "nicole",
      "body": "Yes, that may be true, RJ, but my Grandfather was not one of them. He died from smoking. As did my other grandfather.",
      "created_at": "2006-09-09T01:50:27.000Z"
    },
    {
      "author": "Ed Moore",
      "body": "Fat tire over Killian's Irish Water.  Guinness is always a must!",
      "created_at": "2006-09-09T03:14:00.000Z"
    },
    {
      "author": "Steve Croxton",
      "body": "First my vote on the Killians/Fat Tire debate: Fat Tire, no contest. Once upon a time, when I first began widening my horizons away from American carbonated vineger water...er...I mean, lagers, Killians was great. But not so much anymore. I'd still take it over say, Bud, but Fat Tire is now much more to my liking. I'd also much prefer Guiness Draught to Stout. \r\n\r\nBut I can't really complain. You added Newcastle, which has been by fave for a few years now. And Blue Moon is great too.\r\n\r\nPerhaps if I ever return to a more normal schedule at work, I may actually show up more regularly like I did in the beginning. I will definitely be there when you get \"The U.S. vs. John Lennon\". ",
      "created_at": "2006-09-09T06:19:48.000Z"
    },
    {
      "author": "Ole \"Cinebar\" Olson",
      "body": "Pilsner Urquell.  It's the best beer on the planet and would give you something of substance next to the Guinness.  All else pales.",
      "created_at": "2006-09-19T23:14:05.000Z"
    },
    {
      "author": "mike",
      "body": "oooh...I second that Sierra Nevada Pale Ale recommendation. A very good, and very accessible micro.\r\n\r\nThen again, I live in PA so it doesn't matter much.\r\n\r\ngah",
      "created_at": "2006-09-21T04:18:02.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
