{
  "id": 447,
  "title": "Monkey Trouble",
  "body": "So, last night I was over at my friend's house playing \"totally legal Monopoly money\" Texas Hold 'em, when I get a call on my wireless, mobile, cellular telephone.\r\n\r\n<b>DAN:</b> Hello.\r\n<b>NICOLE:</b> I'm sorry to interrupt you on \"guy's night,\" but you'll never guess what just happened!\r\n<b>DAN:</b> The projector exploded?\r\n<b>NICOLE:</b> No, I just got a five from a monkey!\r\n<b>DAN:</b> A monkey paid you five dollars?!\r\n<b>NICOLE:</b> No! It slapped my hand.\r\n<b>DAN:</b> Why was there a monkey in the theater?\r\n<b>NICOLE:</b> I don't know, it came in with some lady. She said it was a service animal.\r\n<b>DAN:</b> Did it attack your glasses and jump into the popper?\r\n<b>NICOLE:</b> No, but it was all dressed up with pants and a button shirt. At first I thought it was just a really hairy baby.\r\n<b>DAN:</b> Did you sell a ticket to the monkey?\r\n<b>NICOLE:</b> No, they just wanted to see the theater.\r\n<b>DAN:</b> Awesome. I want to get a high five from a monkey! That's one of the sole reasons we opened The Moxie!\r\n<b>NICOLE:</b> Too bad! And it was a low five, by the way.\r\n\r\nPretty strange, eh? Well that's not the half of it. Had that been the whole story, it would barely warrant a one sentence mention on the blog (e.g. \"A dressed up monkey came into the theater and gave Nicole a low five last night. In other news, I lost at poker again last...\"). However, the story took a bizarre twist today when we received the following letter from the Springfield-Greene County Health Department in the mail:\r\n\r\n<quote>To: ALL FOOD SERVICE ESTABLISHMENT OWNERS AND OPERATORS</quote>\r\n\r\n<quote>Due to numerous complaints and recent discussions of the definition of service animals with the U.S. Department of Justice, Civil Rights Division, this Department has made the decision not to allow Ms. [NAME OMITTED] to enter a Food Establishment with her monkey. According to the U.S. Department of Justice definition of service animals, such an animal must be able to perform a specific task for people with disabilities. It has become apparent that this monkey does not qualify as a service animal.</quote>\r\n\r\n<quote>Please be advised that should Ms. [NAME OMITTED] be allowed to enter your Food Establishment with her monkey, you will be in violation of the 1999 Missouri Food Code Section 6-501.116 which is a critical violation. Should this person or another person accompanying her monkey, refuse to leave the premises with the animal, you are directed to call this Department at [PHONE NUMBER] for assistance or after hours the Police Department at [PHONE NUMBER].</quote>\r\n\r\n<quote>Your cooperation is appreciated.</quote>\r\n\r\nNow, before I continue, I want to make it abundantly clear that I'm not posting this to mock Ms. [NAME OMITTED] or cast ridicule onto the Health Department. I don't know the details behind the monkey, or the letter, but I'd sure as hell like to find out. It's just such a bizarre and unusual story that I had to share it with all 14 of my blog readers! That letter, by the way, was sent to all 4,203,189 food establishments in the Springfield metro area.\r\n\r\nIn fact, one of my poker buddies who works at a pizza place, called me today to tell me I'd be in violation of code section 6-501.116 if I allowed the monkey back into The Moxie. Needless-to-say, we've been planning out various scenarios for when the day comes that we actually have to remove the primate from the premises. Most of them end with the monkey breaking free from Ms. [NAME OMITTED], attacking Nicole's glasses, and diving into the popper... which is how most of my poker nights end too.\r\n\r\nAnd that, my friends, is the weirdest story I've told in a long time. Cherish it.\r\n\r\nCherish it.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-09-09T08:04:03.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Steve Richards",
      "body": "I see that monkey everywhere.  I find him adorable and the health department can cram it.  Campbell 16 managers have been angry at employees in the past for allowing the monkey into theaters, but I argued that (until now apparently) there is no explicity monkey rules and as long as the film being shown is monkey suitable, and provided the monkey does not shit on the floor and then rub it into the ground the monkey should be afforded the same rights as his more evolved brothers.  ",
      "created_at": "2006-09-09T08:17:43.000Z"
    },
    {
      "author": "nicole",
      "body": "The low five. Was. Awesome. Caleb got one too!",
      "created_at": "2006-09-09T08:23:29.000Z"
    },
    {
      "author": "brian of moore",
      "body": "cherishing...\r\n\r\nhow can they be 100% sure that it cannot perform a task that would be helpful to the disabled?\r\nwhat if she teaches it one... like flipping a lightswitch\r\n... would it then be okay?\r\nmaybe if you guys taught it to use the popper!\r\nwhat kind of fantastic treat that would be\r\nit would bring in tons of business\r\n\"we *could* go watch something at (insert name of shitty cineplex) \r\nor! we could go to the moxie and get popcorn made by a monkey!\"\r\n",
      "created_at": "2006-09-09T09:37:25.000Z"
    },
    {
      "author": "bjork24",
      "body": "I don't think we have room for another monkey popcorn slinger... Caleb, Justin, and Nate have pretty much saturated the market.",
      "created_at": "2006-09-09T10:10:09.000Z"
    },
    {
      "author": "erin",
      "body": "could he not perform a high five? or was he just in a low five mood?\r\n\r\neither way. thats totally awsome.",
      "created_at": "2006-09-09T18:05:35.000Z"
    },
    {
      "author": "Derek",
      "body": "Consider it cherished.",
      "created_at": "2006-09-09T20:36:30.000Z"
    },
    {
      "author": "Steve Croxton",
      "body": "Oh Danno. You are going to have to write a book one of these days...seriously ;)",
      "created_at": "2006-09-10T00:13:46.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "The monkey just loves Scarlett Johansson and Jon Stewart, cut him some slack.\r\n\r\nNew rule: free popcorn for the monkey. Monkeys like popcorn, right? (they also like stealing things, like in the Thora Birch/Harvey Keitel film Monkey Trouble).",
      "created_at": "2006-09-10T01:34:15.000Z"
    },
    {
      "author": "Monkey",
      "body": "Hey, does that mean I'm not allowed at the moxie?!",
      "created_at": "2006-09-11T16:50:39.000Z"
    },
    {
      "author": "GO Magazine",
      "body": "That's one of the funniest things I've read in a long time. Thanks for making my morning...ML. \r\n\r\nDoesn't The \"Banned Monkey Cinebar\" have a ring to it? (Providing the monkey pays up, of course)",
      "created_at": "2006-09-15T18:53:07.000Z"
    },
    {
      "author": "Susan",
      "body": "I have met the Lady in question and Richard(the monkey's name).The point here is if her monkey is welcome at the moxie b/c it provides a service then can I bring my Staffordshire Terrier who is actually registered as a service dog? I have seizures and she notifies by tugging at my husbands hand(honest I swear costed us over 1500.00$$ to have her trained)and the answer is most likely no b/c I can't muzzle her, and the law states she has to be muzzled in public.B/c she is listed as dangerous.I feel for her and I think it's nothing more than some crabby old (blank) being hatefull.BTW we love your theater my son wants to know when you are going to show Jaws?",
      "created_at": "2006-09-16T02:35:57.000Z"
    },
    {
      "author": "nicole",
      "body": "There was a newspaper article in the NewsLeader on Friday. It brought up interesting points, such as where do you draw the line between a therapy animal and a service animal, and that the ADA doesn't require paperwork to prove your animal is or isn't a service animal.\r\n",
      "created_at": "2006-09-17T23:45:48.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
