{
  "id": 448,
  "title": "eBay the Cinebar: Year 2",
  "body": "And just like that, Moxie Week 2006 has unofficially kicked off with <a href=\"http://cgi.ebay.com/ws/eBayISAPI.dll?ViewItem&item=180027705209\" class=\"broken\">The Cinebar auction</a> going live just a few moments ago. I'm nervous to see how this year's auction will end up, since we won't have nearly the same media hype and buzz surrounding the bidding, BUT we'll have a successful year of business under our belts. Either way, it ought to be interesting. I know of at least a couple businesses that have expressed interest in winning the auction. We shall see.\r\n\r\nIn other news, LOOSE CHANGE will have a FREE showing tonight. Tickets will be available from 3:30 until the show opens and/or sells out, whichever comes first. I've watched the majority of the film, and while I don't believe any of the theories they propose, and have read numerous studies that contradict ever point made in the film, I still think it's interesting documentary. Come early if you want good seats.\r\n\r\nIn other news, Nicole and I were making cookies last night, and when we cracked open our second egg, a runny gush of black phlegm that smelled like a rotten fish, cat barf casserole poured forth into the cookie dough. Mmmm, old eggs. On that note, it's lunchtime!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-09-11T21:16:09.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "You do know GO Magazine hated Loose Change. Well, I'm coming for Wordplay today, see ya there.",
      "created_at": "2006-09-11T21:43:49.000Z"
    },
    {
      "author": "Honkey Hero",
      "body": "1st Bid!!  I am so cool!",
      "created_at": "2006-09-11T21:48:52.000Z"
    },
    {
      "author": "brian of moore",
      "body": "current high bidder!!  SWEET!\r\ni have this in the bag!.... surely it wont go over $150.... right?",
      "created_at": "2006-09-11T22:27:34.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "It went to $1,000 last year, right?",
      "created_at": "2006-09-11T23:26:19.000Z"
    },
    {
      "author": "Honkey Hero",
      "body": "Darn you Brian of Moore... ",
      "created_at": "2006-09-11T23:55:37.000Z"
    },
    {
      "author": "Dave",
      "body": "your cinematographer and director levels both have the same price ranges",
      "created_at": "2006-09-12T00:00:10.000Z"
    },
    {
      "author": "bjork24",
      "body": "@Dave: those levels (or levers, as in \"Executive Producer Lever\") are strictly hypothetical... and eBay won't let me change the damn listing!",
      "created_at": "2006-09-12T00:18:50.000Z"
    },
    {
      "author": "whit",
      "body": "I am totally saving up for the next year's \"Whitty is Awesome Cinebar\", because, alas, this time 'round the bidding quickly went beyond the $13 I currently have in my checking account.",
      "created_at": "2006-09-12T23:18:59.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
