{
  "id": 449,
  "title": "Movie Trivia Night Reminder",
  "body": "Registration for Movie Trivia Night, which will be held one week from tonight in the banquet room at Patton Alley Pub, starts today. Hmmm, that sentence is confusing. Registration starts today and will run up until the event. There seems to be a rumor spreading that the trivia is all Moxie-related, or all about movies that were played at The Moxie. This, my friends, is not true. Yes, there will be some Moxie-related questions, but the vast majority are general movie themed. I just wanted to clear that up.<br/><br/>ALSO: there seems to be some confusion about how the trivia will be answered. Let me clear that up as well.<br/><br/><ol><li>There are three sections of trivia</li><br/><li>Each team is given an answer sheet at the beginning of each section</li><br/><li>I will announce a trivia question</li><br/><li>Your team will write down the answer</li><br/><li>At the end of the section, teams will turn in their sheets to be scored</li><br/><li>Before the next section begins, the scores and answers from the last section will be announced</li><br/><li>Rinse and repeat</li></ol><br/>If you're still confused, just watch season one / episode three of the British version of The Office. That's how we're going to do it... only we won't be throwing someone's shoes over the pub at the end of the night.<br/><br/>And now I'm off to go buy some lemon-scented soap!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-09-12T22:44:42.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nicole",
      "body": "We're finalizing the menu this week. Just out of curiosity - any interest out there? Do we feed for 50 or for 5?",
      "created_at": "2006-09-15T03:23:48.000Z"
    },
    {
      "author": "Nate",
      "body": "I'm going to show to watch.  But I'll probably eat one of those super yummy patton alley burgers.",
      "created_at": "2006-09-15T03:44:19.000Z"
    },
    {
      "author": "brian of moore",
      "body": "... i might go watch...<br/>if it only cost 20 instead of 50.. i might even play...<br/>but since i dont forsee any team i could put together.. winning....<br/>50 seems like a nice chunk of change to give away...",
      "created_at": "2006-09-17T00:51:40.000Z"
    },
    {
      "author": "bjork24",
      "body": "You, Ian, Phil... that's 3 people, which comes to $16 and some change for each of you. You get food, AND a good time! What more could you ask for?!",
      "created_at": "2006-09-17T00:53:05.000Z"
    },
    {
      "author": "nicole",
      "body": "Yeah, there won't be anything fun to watch if everyone's just there to watch. Come on!",
      "created_at": "2006-09-17T01:58:00.000Z"
    },
    {
      "author": "Ian",
      "body": "I KNOW people have to step up and compete, but my movie knowledge...really, it's piss poor.  And I cry easy.",
      "created_at": "2006-09-17T03:34:46.000Z"
    },
    {
      "author": "bjork24",
      "body": "I <i>hope</i> we get at least 2 or 3 teams, but no one has expressed interest yet.<br/><br/>*sigh*",
      "created_at": "2006-09-17T04:07:55.000Z"
    },
    {
      "author": "Ian",
      "body": "Maybe if you write all the questions in permanent marker on the rinds of watermelons that've been soaking in hard liquor, stack the melons up on a greased table, have the contestants spin around until they're dizzy, and sick your dog on everyone and everything, you can still salvage the event.<br/><br/>Someday _I'll_ be a business owner and my ideas will finally be effected.  (to tragic results)",
      "created_at": "2006-09-17T08:35:03.000Z"
    },
    {
      "author": "Nathan Pope",
      "body": "i've got a team.  doesn't doug have one too?   guess i come by the theatre and register?  word to your mommie.  ",
      "created_at": "2006-09-18T19:14:14.000Z"
    },
    {
      "author": "nicole",
      "body": "You can either register at the theater, or the day of at Patton Alley. Looks like we have a few good teams in the mix!",
      "created_at": "2006-09-18T20:26:19.000Z"
    },
    {
      "author": "Scott",
      "body": "How/Where do we register?<br/><br/>Also-When is the dealine?",
      "created_at": "2006-09-19T07:20:44.000Z"
    },
    {
      "author": "bjork24",
      "body": "You can sign-up at the event. Just come to Patton Alley with money and team in-hand.",
      "created_at": "2006-09-19T07:24:20.000Z"
    },
    {
      "author": "Ian",
      "body": "But where and when can I register, even?  Why won't you guys tell me?",
      "created_at": "2006-09-19T10:59:52.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
