{
  "id": 45,
  "title": "Early August Update",
  "body": "Three posts in three days... just like old times, eh? Ok, here's the down low on what's been droppin' since my last update on the theater's progress, which, <a href=\"38\">according to the title</a>, was sometime in mid-July. Hold on, let me re-read that post... man, this is long. Come on already! Ok, I don't have time to read the whole thing, so let's just assume everything I'm telling you is as fresh as a summer breeze, which, if you live in the Midwest, is about as fresh as a warm washcloth (pronounced WAR•sh•cloth by my mum) to the face.<br/><br/>About a week and a half ago, the architect in charge of our project contacted me to request additional information about the equipment we were going to install (i.e. projectors, platter, screen, speakers, popper, etc). He needed a whole slew of equipment specifications and spatial estimations to finalize the construction plans before they could be submitted to the city for a building permit. After playing e-mail/phone tag with the equipment dealer in Oregon, I was finally able to have a voice to voice meeting with him yesterday and procured some concrete estimates (oxymoronic, I know). For instance, each projector will require a hardwired 220 V (20 amp service) and 120 V connection, along with a 6 inch exhaust pipe that will channel the heated air from the lamphouse to the roof. Pretty cool, huh?<br/><br/>Then came the BIG topic... sound isolation and absorption. Every theater has to have these two elements under control, or else patrons in one theater will be able to hear the dull thumping bass from the other auditorium.<br/><br/>*** I have a difficult time writing in the midst of incessant talking. Right now the intern in the cube to the left of me is talking very loudly AND profanely about how cold it was last winter when he had to walk to class in the morning. \"I had fuckin' icicles in my 'stache, dude. I swear to god!\" Now he's talking about the moral implications of <i>Hellboy</i>. He doesn't even have a 'stache! Moving on... ***<br/><br/>Sound isolation is the long-winded term for keeping each theater's sound within that respective auditorium. Sound absorption is the fine art of making the sound <i>inside</i> the auditorium sound good. The easiest way to isolate sound between two auditoriums is to build two walls, side by side, that have a small air gap between them. Then, on the interior side of each wall, use two layers of sheetrock to increase the mass. As long as you make sure that the separating wall is adequately soundproofed from the floor to the ceiling, then you should, in theory, have very little audible leakage between the two auditoriums. Of course, with a building as old as ours - with rich wood floors and an exposed beam ceiling - some leakage is bound to happen, but as long as we can keep it negligible to nihil, I'll be a happy Twizzler eater, which, if you can recall some of my earliest posts, are always packaged in a misleading way.<br/><br/>Sound absorption, on the other hand, is a horse of an entirely different color... and breed... and smell... ok, it's actually a llama. As you already know, our auditorium walls are going to be used as a pseudo-gallery for regional artists, which causes a problem when installing new pieces. How can we hang pictures and paintings on the wall if we can't puncture or cut the sound drapery? How? HOW? Well, we can't. In this case, we'd have to devise some sort of hanging track system that would suspend the pieces of art from the ceiling with wires, which is something I don't want to do. Well, guess what? We don't have to! Woo hoo! You see, side walls only require 50% coverage with sound absorption material, which means we can have custom sound panels mounted every 5 or 6 feet along the wall and hang the artwork in the space between... just like the Dave Matthews Band song!<br/><br/>The sound absorption panels are made of semi-rigid fiberglass that come in 4 by 8 sheets of two inch thickness, which can then be cut into any shape<br/> we like. After the panels have been cut into giant silhouettes of Elvis and my hat, we'll stretch special fire-proof material over the front and mount them to the wall. The back wall will have to be completely covered with either fiberglass panels or sound drapery to reduce reverberation. Next time you're in a theater, take a moment to see what kind of sound absorption material they have on their walls. I've seen some theaters that use fiberglass panel circles to create hideous green and yellow art deco eye sores, which isn't much better than the floor-to-ceiling, multi-tonal, pop-stained sound drapes. Ugly or not, that material is the difference between hearing the dialogue loud and clear versus having your ears bleed profusely just before your head inevitably explodes from the excessive reverb.<br/><br/>Let's see... what else? We have the choice between buying a stand-alone popper or one that sits on the back counter. I'm leaning towards the stand-alone version, because I doubt we'll have enough room for a back counter. The website is still coming along, as I mentioned in <a href=\"44\">yesterday's</a> supremely boring and sparsely commented post. Next week is going to be a no-nonsense, nose-to-the-grindstone, no-holds-barred, no-smoking, nomad-knowing... I forgot where I was going with this. Oh yeah, we're repolishing the business plan next week. I need to recalculate the numbers, fix all 429 spelling and grammatical errors, and add some flair to a few boring parts. I was thinking I'd print it out on green construction paper and use scrapbook scissors to add a decorative border. NOT!<br/><br/>Nicole and I are leaving on a jet plane tonight for a short vacation in Toledo! Toledo, you ask? Yes, Toledo. No, not Toledo, SPAIN... Toledo, Ohio! OH HI OH HI OH, round on the ends, high in the middle (Brak). We're going to visit Nicole's twin sister, who also happens to be my sister-in-law (what a coincidence), and her fiance (accent over one of the vowels, I forget which one). We're going to go to Cedar Point, which is the roller coaster theme park that can be seen in the opening credits of <i>Step by Step</i> starring Patrick Duffy and Suzanne Somers. Oh, don't act like you didn't watch ABC's TGIF back in the early 90s. \"Did I do that?\" \"You wah•AR in big twouble, mistew.\" Ah, the Olsen twins. So innocent. So skinny. Also worth noting, Cedar Point has the world's fastest and highest roller coaster. I think it goes roughly 5 miles straight up in the air before rocketing you back down to earth at somewhere around 300 or 400 miles per hour. It's going to be a B-L-A-S-T, and will most likely be our last real vacation for a long while. I doubt we'll be rolling in a lot of money or free time for at least the first few years of <b>The Moxie's</b> existence. Oh well. It's not like we won't be having fun 24 freakin' hours a day! Woo Hoo! Mimosas for everyone!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-08-06T01:05:28.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Newell",
      "body": "I have relatives in Ohio. One aunt in particular puts that mysterious R sound into the word wash too. Every time I see her I like to ask who the first president of the United States was. It never fails to crack me up. <br/><br/>I never thought that sound proofing and all that was so complicated. Interesting stuff. But then, that's why I come here in the first place.  <br/><br/>Hope you guys have fun in Cedar Point!",
      "created_at": "2004-08-06T02:34:54.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks, Newell!",
      "created_at": "2004-08-06T03:17:07.000Z"
    },
    {
      "author": "Trinity",
      "body": "I'm from Ohio, and I don't know anyone that does the \"r\" thing.  Of course, I'm from Northern Ohio, and I don't live there anymore :)<br/>Cedar Point is one of the great parks.  One problem: the older I get, the sicker the rides make me.  So sad.<br/><br/>DC recently opened a Signature theater downtown (on E St.), playing more independant, off-beat stuff.  It's great - you might want to check it out.  There's also one in Shirlington, VA (Arlington) that gets rave reviews.",
      "created_at": "2004-08-06T17:13:26.000Z"
    },
    {
      "author": "Aaron",
      "body": "Hey.  I may have somewhat of a solution as far as hanging the art goes.  Being that I am an Art Major in St. Louis, we have had to spend alot of time learning about installations and whatnot....and a situation similar to your has come up before.  A friend of mine was dealing with the the idea of light within her piece.  It was very important for her piece to be hung on the wall while still having back lighting.  The problem was that her piece could not be connected to the wall with screws or other devices that could puncture, so a device was created, or thought up, by the rest of the student body.<br/><br/>For your situation, due to the sound-proofing, you may want to consider attaching a piece of wood to the wall almost as an anchor (a 2 x 4 or something along those lines).  Then create a barrier with cauke or silicon around the plank so that light and/or sound could not seep through.  You could then attach the art to piece of wood so that no more pentration would exist.<br/><br/>Just a thought for you to consider.<br/><br/>WOO HOO for the Midwest YO!  Highway 44! (pronounced furty fur!)  Warsh it in the Zink! (wash it in the sink)",
      "created_at": "2004-08-06T21:24:52.000Z"
    },
    {
      "author": "ARON",
      "body": "OH YEA....and if you are familiar with ST. Louis, and the cinemas of the area, you may want to check out the Chase Park Plaza.  They have art hanging on the walls of each theater.  If you have time to check that out or call them to talk to someone about their own solution, you should.  Maybe someone could help you out.",
      "created_at": "2004-08-06T21:27:23.000Z"
    },
    {
      "author": "whit",
      "body": "what about a picture rail?  They used to be pretty common in house.  Basically a piece of wood near the cieling that a special hook hangs on and then pictures/art are hung from a wire from the hook.",
      "created_at": "2004-08-06T22:39:58.000Z"
    },
    {
      "author": "anonymous",
      "body": "have you talked to any architects that specialize in theatre construction? there is an art and science to creating a sound-proof and equalized auditorium. the placement of sound batting is essential to achieving good quality sound. i can get you some numbers of local people who would know what to do and would give some advice for free. you know how to get in touch w/me.",
      "created_at": "2004-08-07T05:23:41.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
