{
  "id": 450,
  "title": "More Trivia Night notes",
  "body": "A couple more notes for tonight's movie trivia at Patton Alley:\r\n\r\n<ol><li>The event will be held in the banquet room, which is directly behind the pub. You can enter from the parking lot, or through the pub.</li>\r\n<li>$20 from each team's entry fee will be set aside for the award pool. The winning team will take it all, plus a few Moxie treats. Simple math: If 5 teams participate, the winner will take home $100... if 10 teams participate, the winner will take home $541 dollars! It's exponential, folks!</li>\r\n<li>We prefer that you not bring non-competing guests (a.k.a. people who aren't on your team) for a number of reasons. If they sit with you, that could be considered cheating. The food is paid for from the entry fee, which just covers the 3 to 5 people on the team. If more people come and eat the food, we'll have to pay for it with money that doesn't exist. If you MUST bring someone, please make sure they sit away from your team, and tell them that if they eat any of the free food, we will have them arrested.</li>\r\n<li>You can register at the door, but make sure you bring your team's entry fee in cash. We don't accept credit cards outside of the theater.</li>\r\n<li>Non-alcoholic drinks are free. Alcoholinated drinks are not.</li></ol>\r\nAnd that about does it. We'll be starting around 7:00 (no later than 7:15), so make sure you get there beforehand. We'll open doors at 6:30.\r\n\r\nSee you there, suckers!!!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-09-19T10:53:25.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "David",
      "body": "Is there a team count yet? My wife is killer at movie trivia and I know someone else I can call that is pretty good. I pretty much suck but I have nothing better to do so I thought I might come down.\r\n\r\nAlso, is this an elimination type of event or will entry guarantee participation throughout the entire event?  I would hate to be eliminated for bombing the first round.\r\n",
      "created_at": "2006-09-19T19:15:59.000Z"
    },
    {
      "author": "bjork24",
      "body": "There are three sections, non-elimination. Teams will play from beginning to end, then, after all the sections have been played, their scores will be tallied and a winner will be announced.",
      "created_at": "2006-09-19T20:31:17.000Z"
    },
    {
      "author": "Brook",
      "body": "Would it be okay if I came by for a few minutes to get some footage for media?",
      "created_at": "2006-09-21T01:55:36.000Z"
    },
    {
      "author": "Brook",
      "body": "P.S. \r\nI know we talked about it but after hearing that it is at a different location, and of your anger towards those who might come for food, I thought I'd double check.",
      "created_at": "2006-09-21T01:56:38.000Z"
    },
    {
      "author": "Brook",
      "body": "UGH. I completely screwed up and thought it was THURSDAY. But I still want to do the story about the Moxie's 1st Birthday.",
      "created_at": "2006-09-21T02:09:16.000Z"
    },
    {
      "author": "nicole",
      "body": "You can still stop by, and cupcakes are free for all...until they last, at least. I have a limited number of supply, especially since I keep eating them.\r\n\r\nJust got my shipment of 'champagne' in. Sofia Coppola Blanc de Blancs! Mmmm.",
      "created_at": "2006-09-21T02:15:39.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
