{
  "id": 452,
  "title": "Review: Moxie Week 2006",
  "body": "Phew. Moxie Week 2006 finally drew to an end last night with our birthday (FREE cupcakes!) concert. Fortunately, all the week's events went smoothly, but there were several moments when the stress needle went way, way, WAY into the red. I doubt we'll ever try to coordinate so many events in such a short amount of time again... at least not without the help of an army of volunteers and event coordinators. Still, it's all done now, and everyone seemed to enjoy themselves, so let's look back fondly on what was... MOXIE WEEK 2006!<br/><br/><b>The Cinebar Auction</b><br/><br/>This was the first \"unofficial\" event of Moxie Week. The auction kicked off on September 11th and ended yesterday at noon. The naming rights went for significantly less than they did last year, but that's okay. Like I said originally, we're not in the same financial straits as we were back then. For the upcoming year, The Cinebar will be known as The \"<i>Springfield Polo Club</i>\" Cinebar.<br/><br/>Interestingly enough, the first apartment I lived in was called \"<i>The Polo Club</i>,\" so I originally thought that's what the name was referring to... au contraire. Apparently Springfield has a real Polo Club that plays other cities around the region. Pretty cool, huh! So, for the second year in a row, The Cinebar will be sport-themed... and, for the second year in a row, the winning bid will have come from a Founding Member.<br/><br/><b>MST3k</b><br/><br/>The first \"official\" event of Moxie Week was Moxie Skinny Theatre 3000 at The Skinny Improv's theater. The turnout wasn't as big as our first MST3k event, but it was still a good-sized crowd. As always, the Skinny guys did a wonderful job poking fun at MANOS: THE HANDS OF FATE, which was ripe for the poking... believe me. It was the first time I had actually seen the film, and I can't imagine watching it without a running commentary. If awfulness were money, MANOS would be Warren Buffet.<br/><br/><b>Moxie Shorts</b><br/><br/>We ended up screening 12 short films for this year's Moxie Short Film Celebration, and had large crowds for all three showings. It never ceases to amaze me how hungry people are for short films. I mean, when you think about it, short films are not only enjoyable, but they're cost-efficient too. Where else can you see 10 movies for five dollars? That's $0.50 per film! The Palace can't even beat those prices!<br/><br/>As for the winners, well... we were still waiting on a ballot from our final judge, but I don't think it's going to make it in on time, so I'll update the official site later this evening with the winners. What's that you say? You don't want to take the time to click over to <a href=\"http://www.moxieshorts.com\" class=\"broken\">MoxieShorts.com</a> and find out for yourself? You want to know now?! Ok then, here's this year's winners:<br/><br/><b>Best Short Film:</b> The Big Idea<br/><b>Best Student Short Film:</b> People In Motion<br/><b>Audience Award:</b> The Big Idea<br/><br/>Congratulations to the winners, and thank you to everyone who participated in our first annual Moxie Shorts! If you were one of the filmmakers, we'll be in touch with you shortly. As for the rest of you, and for those of you who didn't compete, there's always next year. Any short film made between today and August 1st of 2007 (we're moving the deadline up one month) will be eligible for next year's Moxie Shorts.<br/><br/><b>The Found Film Festival</b><br/><br/>I was honestly surprised with the turnout for this event. I wasn't expecting many more than 10 or 15 people per show--after all, how much of a draw can a 30-year-old box office bomb have?--but we had a nice turnout for the Saturday night show. The Monday show was pretty much what I had expected. Attendance aside, the films were a hoot and a half (half a hoot is sometimes known as a \"ho\"). The Tex Avery animated short was refreshingly violent... almost like watching an \"Itchy and Scratchy\" cartoon, and DAMNATION ALLEY was more than adequately corny. All in all, this was a fun and unique event.<br/><br/><b>Trivia Night</b><br/><br/>This was where the shit hit the fan. We worked for over a month coming up with creative and challenging questions for trivia night, but grossly underestimated the amount of time it would take to turn the stupid things into an Impress (OpenOffice version of PowerPoint) slideshow. Nicole and I worked non-stop (literally) on Tuesday in a race against the clock to finish everything. When we weren't busy making answer keys, we were yelling at each other for not finishing all this stuff weeks ago. But when did we have time? We were up to our eyeballs in preparation for all the other events! As you can see, the stress has yet to subside.<br/><br/>To make matters worse, with little less than an hour before we opened doors, the Moxie A Go-Go power amp exploded. I don't know how it happened, but it did, which meant I had 45 minutes to find a suitable replacement. I went to Radio Shack first, hoping beyond hope that they'd have a small karaoke amp or something that I could use for the mic and audio portion of the trivia... they had nothing. \"Try Wal-Mart,\" the Radio Shack guy told me.<br/><br/>And so, on September 19th, 2006, I went back to Wal-Mart... breaking my streak of 9 months and 13 days since I had last been. I was really hoping to make it an entire year... oh well. I bought a crappy little First Act amplifier and made it back just in time for Nicole and I to yell at each other some more. I also kicked the box that the Wal-Mart amp came in. It was an empty futile attempt to vent some of my stress, but it ended up being good since it helped me break down the box for recycling. I also made a karate sound when I kicked it. HIYAH!<br/><br/>We ended up having six teams participate, which was more than I had thought would show up. Along with $120 in prize money, the winning team also earned bragging rights for winning The Moxie's first trivia competition. We lost quite a bit of money on this event, but everyone enjoyed themselves, so that's all that matters. I drowned my stress in Guiness all night long, and ended up barfing up chocolate milk the next morning. I'm not quite sure how the Guiness turned into chocolate milk, but it did. Moral: don't drink eight pints of Guiness if you haven't eaten all day... and especially don't do it if you've been internalizing stress. Stress and stouts don't mix well... neither does chocolate milk.<br/><br/><b>Birthday Concert</b><br/><br/>Last night's concert was fun. Plain, old-fashioned fun. Cindy, JR, and Nathaniel all sounded great. Aaron of <a href=\"http://www.morawk.com\" class=\"broken\">MOrawk</a> fame loaned me his power amp and mixer, so we were able to fill the auditorium like a water balloon on Senior Skip Day. It was AWESOME! And did I mention the free cupcakes? They were plentiful, and tasty to boot! I originally wrote \"and taste to booty\" in that last sentence. I'm AWESOME! I actually had a chance to sit in the auditorium, drink a beer, and enjoy myself, and that, my friends, is a rarity. Especially when I'm fully-clothed. Ha ha ha! I'm just... <i>kidding</i>... ?<br/><br/>There you have it, Moxie Week 2006 in a nutshell. A big THANK YOU to everyone who came out and helped us celebrate this very special occasion. Here's to another year full of Moxie!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-09-23T04:25:49.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Laura",
      "body": "This has nothing to do with, well, anything but I haven't been to Wal-Mart for 1 year, 1 month and 2 days.  Dan, you need to start a new streak.  You can do it!!!<br/><br/>Congratulations on the Moxie Week success!",
      "created_at": "2006-09-23T08:01:39.000Z"
    },
    {
      "author": "Ian",
      "body": "Yay The Moxie!!<br/>Too bad you were sick :(<br/>Woo!!",
      "created_at": "2006-09-23T09:55:59.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "The Big Idea won? Shenangians!",
      "created_at": "2006-09-24T03:02:47.000Z"
    },
    {
      "author": "drtedd",
      "body": "Congratulatins to Springfield Polo Club.<br/><br/>Do visits to Sam's Club count as violations?",
      "created_at": "2006-09-24T23:42:16.000Z"
    },
    {
      "author": "nicole",
      "body": "No, we go to Sam's Club. Ironic, isn't it? Sam's is in the business for small businesses (where else can you get paper bags that cheap?), but Wal Mart is in the business to shut down small business.",
      "created_at": "2006-09-25T00:43:36.000Z"
    },
    {
      "author": "Matthew Martin aka Master RJ",
      "body": "Sam's Club is awesome. I also remember they serve pretty good pizza at their snack bar.",
      "created_at": "2006-09-25T01:23:32.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
