{
  "id": 453,
  "title": "Moxie Online is all about YOU!",
  "body": "Well, I've gone and done it... I've made yet ANOTHER upgrade to the website. This time, however, it's not purely aesthetic. After a year of tyrannical web rule, I've decided to loosen (ever so slightly) my iron-fisted grip on the site and allow more user interaction. Now, before I go any further, let me tell you a little story about users, the blog, and the state of West Virginia.\r\n\r\nIn the beginning there was only the blog. I'd write posts, and readers would comment... lather, rinse, repeat, ad infinitum. Then, one bright and cheery day, an entire website sprang forth from the deepest bowels of the blog. It had a calendar, a list of available beers, and all kinds of information about Moxie movies. It was, and is, what you know today as MoxieCinema.com. Things were simple in the early days; I wrote posts at least 2 or 3 times a week, people commented, calendars were looked over, trailers were watched... what more was there to do? \r\n\r\nThen, like Athena bursting from Zeus's head, the forum splashed onto the scene. It was slow going at first, but the forum wouldn't give up. Slowly but surely, it started to gain in popularity. Fast forward to today, and you'll see that all three MoxieCinema.com entities are virtually neck-and-neck in page views / visitors / etc..\r\n\r\nThe blog took the biggest hit over the last year, mainly because I haven't had as much time to devote to it as I'd like. I used to tell myself that once year one rolled around, I'd kill off the blog. \"What more is there to write about?\" I'd ask myself as I masterfully used a soldering gun to modify a universal remote so it will work from inside the projection booth. \"No one will care what I have to say by that point.\" And yet here we are, you and I, one year in, and look what I'm still doing. Type type type type typing away at the ol' Moxie Blog. Old habits are hard to kick, I guess. *begins kissing computer*\r\n\r\nWhat?! NOTHING! Uh, where's my keys?! Where am I?!\r\n\r\nSo I decided it was time to make the website more lively; \"<i>stickier</i>,\" to use a real webmaster term. And thus the new Moxie Membership was given life. Basically, it's an extension of the forum membership, so if you're already signed up there, you're good to go. Being a Moxie Member will allow you to rate movies (and eventually write brief reviews [i.e. reviews about underwear]), use a super cool \"movie suggestion tool\" that I've been mentally programming for the last month, chat on the forum, have your own <a href=\"http://www.moxiecinema.com/member/1\" class=\"broken\">member page</a> where you can track what movies you've seen and/or rated, comment on the blog, see top secret \"members only\" content, and many more things that I haven't thought of yet.\r\n\r\nIn fact, if you're logged in right now, you should see a big picture right below this sentence.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/092906/weird.jpg\" />\r\n\r\nIf you can't see the picture, you should really consider signing up. Just click the new tab up top that says \"members.\" Trust me, you won't regret it.\r\n\r\nIt may turn out, however, that *I* will regret allowing customers to rate movies that are currently playing... who knows. We'll take each day as it comes, cross each bridge as we get to it, eat each bag of candy corn that's labeled \"NICOLE'S! DO NOT EAT!\" as we find it... you get the idea. And in case you're wondering why I changed the blog comments to member only, well, it just had to be done. Believe it or not, I was still getting about 20 to 30 spam messages a day (even with the spam catcher), and let's not kid ourselves... very few people even comment on the blog these days. It's kind of like an old barn.\r\n\r\nYeah, an old barn in West Virginia.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-09-30T07:20:48.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "El Brian de Moore",
      "body": "i can only see that pictures because im a member???!\r\nI *AM* member awesome!!!\r\n\r\nps. im spamming your base",
      "created_at": "2006-09-30T09:09:23.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Ah, using an old idea of mine.",
      "created_at": "2006-10-01T03:31:56.000Z"
    },
    {
      "author": "nate",
      "body": "This is me commenting on the blog!",
      "created_at": "2006-10-01T18:03:27.000Z"
    },
    {
      "author": "nicole",
      "body": "mmmm, candy corn.",
      "created_at": "2006-10-01T19:45:10.000Z"
    },
    {
      "author": "justin",
      "body": "Lump of used coal",
      "created_at": "2006-10-02T05:52:46.000Z"
    },
    {
      "author": "Ian",
      "body": "I'm in your base, spamming your blogz!\r\n\r\nEating each bag of candy...that's funny!  One point.",
      "created_at": "2006-10-02T19:29:44.000Z"
    },
    {
      "author": "jhawk",
      "body": "Ian, just for that, I'd post my \"IM IN UR FRIDGE EATIN UR FOODZ\" kitty picture, but Blog Comments still don't allow pics.  \r\n\r\nC'Mon, Dan.  We're all members here.  Lift teh HTML bannanation! \r\n",
      "created_at": "2006-10-02T21:14:29.000Z"
    },
    {
      "author": "jhawk",
      "body": "<b>bannination.</b>\r\n\r\nI meant to spell \"teh\" like that, though. \r\n",
      "created_at": "2006-10-02T21:22:32.000Z"
    },
    {
      "author": "drm00se",
      "body": "I haven't posted on here in a while because I got tired of looking stupid in my comments. Now, though, I feel compelled to say one thing: Amazing. You're amazing. That's all I'm gonna tell you.\r\n\r\n-Derek",
      "created_at": "2006-10-03T16:50:11.000Z"
    },
    {
      "author": "Ian",
      "body": "BananaNation!  w00t",
      "created_at": "2006-10-06T09:31:24.000Z"
    },
    {
      "author": "Greg",
      "body": "That is a significantly funny picture.",
      "created_at": "2006-10-13T20:41:00.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
