{
  "id": 456,
  "title": "Feast, famine, or somewhere in between",
  "body": "The theater business, perhaps unlike any other industry in the whole of the universe, is especially prone to the \"feast or famine\" business cycle. For those of you who don't know what that means, here's a brief tagline: you're either making money, or you're not.<br/><br/>All businesses have high and low points, of course, but they tend to be accentuated by sloping trends. They're either building up for the holiday season, or winding down in preparation for Summer. In other words, they can sense coming trends... for the most part. We're lucky if we're able to guess whether next week will be better than this one. It's a lot tougher than you'd think to figure out customer trends. Unfortunately for us, it's not as easy as simply bringing in a good movie; if that were the case, we'd be busy ALL THE TIME! We have to factor in the time of day, weather, other downtown events, positive buzz, negative buzz, parking, TV schedules, etc., etc., etc.. The more variables you have to deal with, the less likely it is for you to be able to estimate your audience.<br/><br/>Exhibit A - here's what our attendance look liked during the first year:<br/><br/><a href=\"http://moxie.danchilton.com/pix/grum/101406/year_one_big.gif\"><img src=\"http://moxie.danchilton.com/pix/grum/101406/year_one_small.gif\" width=\"425\" alt=\"\" /></a>Click to enlarge, fool!<br/><br/>Notice anything (other than the continual ups and downs)? If a gun was put to your head, and you were told to point out an over-arching trend, could you? I mean, seriously! The theater business is like dating someone with bipolar disorder: one week they're doing great and everyone's happy, the next week you're getting punched in the ribs for moving around too much in bed. It's been a challenge to keep on top of things, but as always we're forging ahead with the gleeful willingness of a Texas beef cow.<br/><br/>Oh, and in case you're wondering about the colored lines on the graph - the green line represents what we consider an average week, the red line represents what ended up being our statistical average week, and the blue line is what we have to cross for us to consider it a good week. Make sense? Good. And now, for some interesting trivia from year uno:<br/><br/><b>Most total tickets sold</b><br/>1. AN INCONVENIENT TRUTH<br/>2. TRANSAMERICA<br/>3. BROKEN FLOWERS<br/>4. HOMEMADE HILLBILLY JAM<br/>5. THE ARISTOCRATS<br/>6. BRICK<br/>7. THE MATADOR<br/>8. THE SQUID AND THE WHALE<br/>9. SARAH SILVERMAN: JESUS IS MAGIC<br/>10. KISS KISS, BANG BANG<br/><br/><b>Most average tickets sold per show</b><br/>1. AN INCONVENIENT TRUTH<br/>2. HOMEMADE HILLBILLY JAM<br/>3. ENRON: THE SMARTEST GUYS IN THE ROOM<br/>4. WHY WE FIGHT<br/>5. NIGHTWATCH<br/>6. TRANSAMERICA<br/>7. STRANGERS WITH CANDY<br/>8. THE ARISTOCRATS<br/>9. SARAH SILVERMAN: JESUS IS MAGIC<br/>10. EVERYTHING IS ILLUMINATED<br/><br/>You might notice that the lists change pretty dramatically. BROKEN FLOWERS is our third highest ticket seller, but it doesn't even land in the top ten for average tickets sold per show, which I feel is the truest indication of a films performance. The reason behind this discrepancy is that some of our films were given an ungodly amount of showings (for instance, BROKEN FLOWERS had 46 screenings), which made it easier for them to amass large amounts of tickets. Yet when you take the attendance total and divide it by the number of shows, the average tickets sold aren't that impressive. Either way, it's going to be a long time before another film knocks AN INCONVENIENT TRUTH off the throne. If our films were baseball players, AN INCONVENIENT TRUTH would be Albert Pujols.<br/><br/>Now, let's look at the other side of the scale. If I'm going to flash the top films, I might as well pull my pants down and show you the losers too. It's only fair.<br/><br/><b>Least total tickets sold (5 showings or more)</b><br/>1. BROTHERS OF THE HEAD<br/>2. HEAVEN ON EARTH<br/>3. BE HERE TO LOVE ME: A FILM ABOUT TOWNES VAN ZANDT<br/>4. L'ENFANT (THE CHILD)<br/>5. WASSUP ROCKERS<br/>6. ROAD TO GUANTANAMO<br/>7. LOGGERHEADS<br/>8. THE BOYS OF BARAKA<br/>9. KEKEXILI: MOUNTAIN PATROL<br/>10. FIND ME GUILTY<br/><br/><b>Least average tickets sold per show</b><br/>1. BROTHERS OF THE HEAD<br/>2. ROAD TO GUANTANAMO<br/>3. THE WILD PARROTS OF TELEGRAPH HILL<br/>4. THE HEART OF THE GAME<br/>5. DUCK SEASON<br/>6. WASSUP ROCKERS<br/>7. FIND ME GUILTY<br/>8. BUBBLE<br/>9. L'ENFANT (THE CHILD)<br/>10. THE BOYS OF BARAKA<br/><br/>What's interesting to note here is that our two worst performing films, BROTHERS OF THE HEAD (#1) and ROAD TO GUANTANAMO (#2), played during the same week (OUCH!). Also, DUCK SEASON (#5) and FIND ME GUILTY (#7) played in the same week, which also happened to be finals week (DOUBLE OUCH!). As you can see, neither the best films nor the worst films share much in common. The best example of a good movie performing poorly is JUNEBUG... hands down. We literally had hundreds of people asking us if we were going to show it, the film was generating tons and tons of good reviews, Amy Adams was already garnering Oscar buzz, yet no one showed up. Thanks a lot DECEMBER! Luckily, we've learned from our mistakes, so this year we're planning on closing the theater from Thanksgiving to Christmas... NOT! We'll see how things shape up this time around.<br/><br/>Ok, that about does it for this post. It's a beautiful early Fall day outside, which means it'll probably be slow today... or maybe not. In this business, you can never tell.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-10-15T01:51:06.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "El Brian de Moore",
      "body": "hey.. 20 good weeks! .. as apposed to 13 below average weeks<br/>good job guys!<br/><br/>... hmm.. i liked duck season alot...<br/>out of the other movies that did badly.. i only saw... <br/>BE HERE TO LOVE ME: A FILM ABOUT TOWNES VAN ZANDT<br/>which i also thought was quite good...<br/>and also wassup rockers.. which was okay.. not great",
      "created_at": "2006-10-15T02:53:51.000Z"
    },
    {
      "author": "Ian",
      "body": "I'm with Brian!<br/><br/>KEKEXILI looked good, but I just never got around to getting around to it.  I'll do better this year, guys.<br/><br/>I was afraid that one of those lines above was the \"break even\" line.  Fortunately, that line was too low to include in the chart, right?",
      "created_at": "2006-10-15T03:40:13.000Z"
    },
    {
      "author": "Master RJ",
      "body": "I'm not surprised Brothers Of The Head did poorly. It's a movie that only showed in five theatres, made little money and made people go \"Huh?\". That and the fact in should have been a two-day movie rather than a week. Thinking how you could have shown the Sundance winner and you chose this one instead because Mexican-American films haven't done well.",
      "created_at": "2006-10-15T06:32:47.000Z"
    },
    {
      "author": "nicole",
      "body": "Oh RJ. I didn't know you had film booking experience? We'll definitely keep that in mind next time we need someone to do something other than speculate on our decision-making process.",
      "created_at": "2006-10-15T06:46:20.000Z"
    },
    {
      "author": "Ian",
      "body": "Jeez, RJ.  At least you could keep this kind of commentary in the forum, where the people who read it know to put their RJ Glasses on first.<br/><br/>Try to look at your comment from an outsider's perspective.  It's critical in a condescending what-were-you-thinking way.  Rather than frame your opinion as part of a dialogue (talking TO somebody), you've chosen to talk ABOUT a problem.  It's as if you walked into a room where people were already speaking with each other and you announced at large, \"The carpet's ugly.\"  Try to be constructive; try to engage others in a respectful exchange.  If Dan and Nicole didn't know you, they would assume you were trying to pick a fight.",
      "created_at": "2006-10-15T10:25:35.000Z"
    },
    {
      "author": "jhawk",
      "body": "<b>Ian stepped up to the plate, and hit this homer:</b><br/><br/><i>Jeez, RJ. At least you could keep this kind of commentary in the forum, where the people who read it know to put their RJ Glasses on first. </i><br/><br/>Nominated for Quote of the Year.   Do I have a second?",
      "created_at": "2006-10-15T18:51:03.000Z"
    },
    {
      "author": "jhawk",
      "body": "Being as mathmatically inclined as RJ is to being tactful, I still dig the hell out of blogs like this Dan.  <br/><br/>I woulda been a stats major if it weren't for all that math and stuff...:)  ",
      "created_at": "2006-10-15T18:54:28.000Z"
    },
    {
      "author": "nate",
      "body": "I second that.  I love the pretty graphs.  It's the part of an Inconvenient Truth that I enjoyed most.<br/><br/>I seem to be a good indicator of Moxie success:  I only saw one film on the least total ticket list (Kekexili), and two on the least average list (Parrots and Heart of the Game).  <br/><br/>Either that or I was just part of the problem.<br/><br/>Heart of the Game was INCREDIBLE.  It's a shame it did so poorly.<br/><br/>RJ Glasses!  An awesome concept.",
      "created_at": "2006-10-15T23:26:26.000Z"
    },
    {
      "author": "United States Geological Survey, Hawaii Division",
      "body": "Can we have our seismographic data back?",
      "created_at": "2006-10-16T22:10:17.000Z"
    },
    {
      "author": "Caleb",
      "body": "On Hawaii, I think they got a little carried away filming an episode of Lost or something...<br/><br/>On the graph, very interesting stuff. I agree with Brian about Duck Season. More people should have come to that one. It was very very good. And I'm curious to know what was going on around town the week Brothers and Guantanamo came. <br/><br/>On RJ, Ian couldn't be more right. But he understands nothing about the film business, so please remember this. ",
      "created_at": "2006-10-17T09:16:50.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
