{
  "id": 458,
  "title": "November calendar",
  "body": "Well, we just finished our November calendar, and let me tell you... it's going to be a controversially profane month. Just in time for the holidays, right?! We'll also be making a big upgrade to the auditorium in the very near future, but more on that later. Let's see what's coming up:\r\n\r\n<b><a href=\"http://www.deathofapresident.com/\">DEATH OF A PRESIDENT</a></b> - (Nov. 1 - 7) - Three of the largest theater chains in the nation (Regal, Cinemark, AMC) are refusing to show D.o.a.P., which easily makes it one of the most, if not THE MOST controversial films of 2006.\r\n\r\n<b><a href=\"http://www.sonyclassics.com/quinceanera/\">QUINCEANERA</a></b> - (Nov. 1 - 7) - The darling of the Sundance Film Festival, QUINCEANERA took home both the Audience Award and the Grand Jury Prize, a feat that hadn't been repeated since THREE SEASONS swept the awards in 1999.\r\n\r\n<b><a href=\"http://www.microcinema.com/programResult.php?program_id=576\">ANIMATED SHORTS</a></b> - (Nov. 8 & 9, 24 & 25, Dec. 1 & 2) - Keeping with the tradition we started last November, we're presenting another fun and crazy array of animated short films from around the world... maybe a locally-made short on the front too!\r\n\r\n<b><a href=\"http://lokifilms.com/site/jesuscamp.html\" class=\"broken\">JESUS CAMP</a></b> - (Nov. 8 - 14) - Campbell only played this acclaimed and crazy film for a week, so we've decided to tack on another week for those of you who didn't get a chance to see it.\r\n\r\n<b><a href=\"http://www.theusversusjohnlennon.com/\">US VS. JOHN LENNON</a></b> - (Nov. 10 - 21) - When I first heard of this film, I informed Nicole that if we weren't able to get it, I'd close the theater... such is my love for John Lennon. Lo and behold, here it is, and The Moxie lives to fight another day!!!\r\n\r\n<b><a href=\"http://www.shortbusthemovie.com/\" class=\"broken\">SHORTBUS</a></b> - (Nov. 15 - 28) - Most of you probably know SHORTBUS as \"that film with real sex in it.\" Well, that's exactly what it is... and we'll be enforcing a strict 18+ on this hot piece of property.\r\n\r\n<b><a href=\"http://www2.foxsearchlight.com/confetti/\">CONFETTI</a></b> - (Nov. 22 - 28) - We figured it would be a good idea to offer a more light-hearted, non-X-rated film around the Thanksgiving holiday... you know, for those families that <i>don't</i> like watching real sex on film.\r\n\r\n<b><a href=\"http://www.rialtopictures.com/shadows.html\">ARMY OF SHADOWS</a></b> - (Nov. 29 - TBD) - ARMY OF SHADOWS, a 1969 WWII film that's finally making it's US debut, is one of the most highly-rated films of the year (<a href=\"http://www.metacritic.com/film/titles/armyofshadows\">just look at all those 100s!</a>).\r\n\r\n<b><a href=\"http://www3.ifctv.com/thisfilm/about.php\" class=\"broken\">THIS FILM IS NOT YET RATED</a></b> - (Nov. 29 - TBD) - An investigative documentary into who the MPAA is, and why they give movies certain ratings. Hilarious and informative, what more could you ask for? Seriously, visit the website and watch the trailers.\r\n\r\nI think November is going to be a great month, not only because of the films, but because we're getting new chairs!!! And by \"new\" I mean \"older than our current\" chairs. Then how, you ask, is that an upgrade? Let me tell you: 1) the chairs are made of iron and the folding mechanism consists of 2 moving parts, a HUGE upgrade from our degrading aluminum chairs, and 2) the chairs are coming from the Landers' balcony! I think it's fitting that one of Springfield's most historic theaters would pass their chairs along to us, and by \"fitting\" I mean \"awesome.\" I hope to have the chairs in by the end of November, but it might be more like December.\r\n\r\nAs for our old chairs, we're selling them for $10 a pop... or less if you're willing to take more than five of them. Just think how cool your friends would think you are once you buy your very own Moxie chair! They'd think you were AWESOME!Ok, gotta run... more details soon.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-10-22T00:28:18.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brad",
      "body": "GO SEE ARMY OF SHADOWS!!!!\r\nGO SEE ARMY OF SHADOWS!!!!\r\nGO SEE ARMY OF SHADOWS!!!!\r\nGO SEE ARMY OF SHADOWS!!!!\r\n\r\nthe best film from one of the best directors of all time. the best movie i've seen all year, hands-down. for god's sake don't miss this one..",
      "created_at": "2006-10-22T00:54:52.000Z"
    },
    {
      "author": "drm00se",
      "body": "What an amazing month. There are several movies I plan to see here. And my roommate and I are in the process of deciding how many Moxie chairs we can fit in our room.",
      "created_at": "2006-10-22T06:11:04.000Z"
    },
    {
      "author": "Ian",
      "body": "\"Movies\" are in the minority, eh?  Right on, right on.",
      "created_at": "2006-10-22T07:29:19.000Z"
    },
    {
      "author": "Ian",
      "body": "Oops.  I was confused.",
      "created_at": "2006-10-22T07:32:53.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Looking jam-packed, something I was hoping. Guessing The Queen, Little Children and Keeping Mum in December?\r\n\r\nAlso, make some flyers and I'll post ads for Jesus Camp all over my church (I've recommended it already to some churchgoers and told one of my youth leaders how she'd kick Becky Fischer's ass in a fight).",
      "created_at": "2006-10-22T07:39:05.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "this \"november\" you speak of... i like it.. i like it alot....\r\n\r\noh.. and chairs?... im not sure where i would put it\r\nbut for 10 bucks...  id take the one with my name on it i guess\r\nunless you sell the one with my name on it\r\nin that case.. i dont want any other fart soaked chairs",
      "created_at": "2006-10-22T09:34:24.000Z"
    },
    {
      "author": "erin",
      "body": "AMAZING!\r\n\r\ni love the moxie.",
      "created_at": "2006-10-22T19:08:52.000Z"
    },
    {
      "author": "flawedstitches",
      "body": "I WANT A MOXIE CHAIR! I WANT IT I WANT IT I WANT IT!\r\n\r\nso i will have one.\r\n\r\nAmazing month of movies, by the by.\r\n\r\nThanks for stealing all of my money, Moxie.",
      "created_at": "2006-10-23T22:31:53.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Person who likes Brian's chair:\r\n\r\nHello beans, goodbye spray!",
      "created_at": "2006-10-25T23:45:13.000Z"
    },
    {
      "author": "joadload",
      "body": "I saw \"Factotum\" last night and it was a very mellow drunk. I think it could walk itself home if it needed to. All three leads put in really solid perfomances. Lili Taylor's bruised and weathered body was a force.\r\nThe word from Silverlake is \"The U.S. v. John Lennon\" is a must. A why do Marina and I cry during trailers at the Moxie? It always happens. It's as if Nicole is putting manipulative psychotropes in our bottle of Fitz. Damn you, Hollywood! \r\n\"The Silence of Sleep\" was real life. I think people need to realize that. Charlotte Gainsbourg's album, when it comes in the mail this week, is going to be gear.\r\nFor December, \"The Little Children.\"\r\nI just read a wonderful story about Jackie Earl Haley in EW and this film is topping my list of must sees.\r\nhttp://www.ew.com/ew/report/0,6115,1551413_1|37044||0_0_,00.html\r\n\r\nCheers.",
      "created_at": "2006-10-31T06:17:29.000Z"
    },
    {
      "author": "joadload",
      "body": "I saw \"Factotum\" last night and it was a very mellow drunk. I think it could walk itself home if it needed to. All three leads put in really solid perfomances. Lili Taylor's bruised and weathered body was a force.\r\nThe word from Silverlake is \"The U.S. v. John Lennon\" is a must. Why do M and I cry during trailers at the Moxie? It always happens. It's as if Nicole is putting manipulative psychotropes in our bottle of Fitz. Damn you, Outside Hollywood! We will not be your test subjects.\r\n\"The Silence of Sleep\" was real life. I think people need to realize that. Charlotte Gainsbourg's album, when it comes in the mail this week, is going to be gear.\r\nFor December, \"The Little Children.\"\r\nI just read a wonderful story about Jackie Earl Haley in EW and this film is topping my list of must sees.\r\nhttp://www.ew.com/ew/report/0,6115,1551413_1|37044||0_0_,00.html\r\n\r\nCheers.",
      "created_at": "2006-10-31T06:19:23.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
