{
  "id": 459,
  "title": "Three little factoids",
  "body": "<b>First</b>, if you're curious about where to get your tickets for the <a href=\"http://www.moxiecinema.com/films/136\" class=\"broken\">ROCKY HORROR PICTURE SHOW</a> on Halloween, allow me to enlighten you: The Landers' box office. They've been selling like hotcakes (although I doubt they'll sell out before opening night), so here's the pertinent info you seek:\r\n\r\n<b>Box Office Hours & Info</b>\r\n- Weekdays: 11:00 am to 5:00 pm\r\n- Saturdays: 3:00 pm until showtime\r\n- Sundays: 12:00 pm until showtime\r\n- Phone: 417-869-1334\r\n- Faxline: 417-869-4047\r\n\r\n<b>Secondly</b>, November's calendar is online and ready to go. I hope to have the print version available late Wednesday evening. If you see a movie you're excited about, why not hop over to <a href=\"http://www.moxiecinema.com/forum\" class=\"broken\">the forums</a> and discuss it with the rabid forum hounds.\r\n\r\n<b>Thirdly</b>, Nicole and I are going to Game Freakin' FIVE on Thursday night in St. Louis!!!! You wouldn't believe how excited I am about this! As many of you might know, <a href=\"/post/76\">I'm a rabid Cardinals' fan</a>, so this is like a dream come true for me. Also, if you're thinking to yourself, \"WOW! The Moxie must be doing gangbusters if they have enough money to go to the World Series!,\" you couldn't be more wrong. I used my side kitty, which is money I've saved from various programming side jobs, to pay for the tickets.\r\n\r\nI guess I could've waited a couple years until I'm a millionaire to go to the World Series, but it just wouldn't mean as much. It's much more romantic to empty your entire savings, when you probably shouldn't, to pay for the tickets. Hard earned, baby! HARD EARNED! And if you're keeping track, this is the third life goal I've accomplished in my short 26 year life:\r\n\r\n1. Marry a pretty girl (check)\r\n2. Start my own business (check)\r\n3. See the Cardinals in the World Series (soon to be checked)\r\n\r\nI'll have a full report on Friday. Can you imagine how great it would be if they win again tomorrow night, and then on Thursday WIN IT ALL?!!! NO, no, no. I don't want to jinx it.\r\n\r\nI'd totally shit my pants though. Totally!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-10-25T08:36:12.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "El Brian de Moore",
      "body": "ive been hearing alot about these \"cardinals\" lately....\r\nreminds me of the time they were on strike... so we got to go down onto the field.. and walk around.. and watch some machine make bats... right before throwing a few balls off the mound... yeah... if i liked this 'baseball' that might have left some sort of great impression on me... ",
      "created_at": "2006-10-25T09:41:16.000Z"
    },
    {
      "author": "Ian",
      "body": "Bring your digital camera in case you DO shit your pants.\r\n\r\nAnd congratulations on going to the game.",
      "created_at": "2006-10-25T11:05:31.000Z"
    },
    {
      "author": "Ian",
      "body": "Also, maybe bring a pair of pants to change into.",
      "created_at": "2006-10-25T11:05:51.000Z"
    },
    {
      "author": "jhawk",
      "body": "What is this \"baseball\" that you speak of?\r\n\r\nYou can use every cent of the money the Moxie makes for Cards tickets.  As long as you don't spend it on hookers and blow, I don't care.  Wait.  That's fine too.  As long as you don't spend it on puppy dogs.  Yeah, no more dogs. \r\n\r\nEnjoy the game, we'll throw a kegger and trash the place while you're gone.  ",
      "created_at": "2006-10-25T17:02:01.000Z"
    },
    {
      "author": "Steph V. Horn",
      "body": "Well, since I am living 30 miles from Detroit Rock City now, aaannnd the coach of the Tigers is from the area I live in now, aaannnnnddd since I see most of the Tigers play while they're at the Mudhens the year before, I should root for them.\r\n\r\nBut since you and Nic are going, I hope your hard earned money is spent happily and the Cards win. Only for you guys. For no one else. Because deep down, I want the tigers to win.",
      "created_at": "2006-10-25T17:39:44.000Z"
    },
    {
      "author": "elliott",
      "body": "thats awesome. i am excited for you. and jealous. if suppan pitches tonight like he has been i think it will be (knock knock) in a good state on thurdsay... lucky.\r\n\r\n-el\r\np.s. i also would shit my pants. \r\n",
      "created_at": "2006-10-25T18:46:06.000Z"
    },
    {
      "author": "nate",
      "body": "There would be pants shitting all around.",
      "created_at": "2006-10-25T18:59:50.000Z"
    },
    {
      "author": "nicole",
      "body": "Yeah, you should have seen my pants when he told me he bought the tickets.\r\n\r\nBut even I had a fantastic time!",
      "created_at": "2006-10-28T08:15:19.000Z"
    },
    {
      "author": "jack",
      "body": "The MF and OF monthly card are sold with low price!!The FFXI CDKey is in wholesale by low price!!<a href=\"http://www.wowgold-best.com\">game</a>\r\n",
      "created_at": "2006-10-31T05:55:45.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
