{
  "id": 460,
  "title": "Dan & Nic's trip to the World Series",
  "body": "I know I promised a full World Series update on Friday, but it's been a busy weekend. Either way, excuse or not, here's the 99% true account of our trip to the World Series, told mostly in pictures:\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/103006/IMG_0003.jpg\" width=\"425\" />\r\n\r\nNicole couldn't find a Cardinals' sweatshirt that suited her, so she bought a red hooded zip-up and used sparkly puff paint to make the logo. Isn't she creative?! I wanted her to write something on the back like \"I hate Kenny Rogers... both of them!\" or \"Kenny Rogers is a bastard,\" but she refused.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/103006/IMG_0007.jpg\" width=\"425\" />\r\n\r\nWhen we got to the stadium at 6:00 pm, the teams were already warming up, which meant the game was ON! Up until that point, every media outlet in St. Louis was predicting that the game was going to be rained out, as it had the night before, despite the fact that it hadn't rained all day. It never rained once during the game, but it was amazingly cold... easily the coldest baseball game I've ever been to in my life. We had blankets and hand warmers, which helped quite a bit.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/103006/IMG_0009.jpg\" width=\"425\" />\r\n\r\nOur seats were on the second deck along the third base line. We were high enough that you could see the entire field without moving your head around, yet close enough to see the numbers on the players jerseys. And the best part was that we had a little hiding space behind our seats to store our stuff. AWESOME!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/103006/IMG_0011.jpg\" width=\"425\" />\r\n\r\nThis was the rally towel they handed out at the gate. I can't tell you how many times I hit myself in the eye with this thing. One minute you'd be spinning your rally towel with 47,000 other fans, then something would happen, you'd lose your concentration, and POP... the towel hits you right in the eye. My right eye is still sore from that night.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/103006/IMG_0023.jpg\" width=\"425\" />\r\n\r\nThis photo was either taken right after or right before I hit myself in the eye. If I'm spinning the towel in the air, you know a good eye poppin' isn't far off.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/103006/IMG_0012.jpg\" width=\"425\" />\r\n\r\nAwwww! The glow of the stadium lights make us look incredibly tan, don't they. I wish we had those lights in our bathroom.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/103006/IMG_0013.jpg\" width=\"425\" />\r\n\r\nI'm grinning like a mule eating briers... and check out my playoff beard. That's one burly bastard! Speaking of which, on our way into the stadium a lady stopped me and asked, \"is that a playoff beard?\" To which I replied, \"why yes. Yes, it is.\" She then asked if I minded being interviewed about my beard.\r\n\r\nNow, I've grown accustomed to people admiring my massive beard - asking to touch it, comb it, have their kids picture taken with it - but this was the first time I'd ever been interviewed because of my beard. Long story short, our 20 minute interview made the cut and appeared on Weekend America, a radio show that plays on many NPR stations across the nation (not in Springfield, natch). Click <a href=\"/pix/mp3/beard_show_32.mp3\">here</a> to listen to the story, and <a href=\"http://weekendamerica.publicradio.org/programs/2006/10/28/st_louis_beards.html\">here</a> to see the associated slideshow.\r\n\r\nI should write to the host and tell her that if she ever refers to my facial hair as a \"really ugly playoff beard\" again, I'll hunt her down and rub it all over her face... even though I shaved it off on Saturday morning, after the Cards won. WOO HOO!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/103006/IMG_0020.jpg\" width=\"425\" />\r\n<img src=\"http://moxie.danchilton.com/pix/grum/103006/IMG_0021.jpg\" width=\"425\" />\r\n\r\nThese last two shots are my favorites since you can see all the people, and get a sense of the excitement. It was absolutely amazing! Easily one of the greatest moments of my life. The fans were all so cheerful too. I received about 15 high fives from the guy sitting next to me, whose name I never managed to get. We talked about all kinds of baseball stuff. It was as if we'd known each other for years. I even offered him some peanuts! Simply amazing.\r\n\r\nWell, I better cut it off here, or else I'm likely to go on and on about it. GO CARDS!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-10-31T00:27:34.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "El Brian de Moore",
      "body": "gomz.. ur beards all over the internets!",
      "created_at": "2006-10-31T00:54:58.000Z"
    },
    {
      "author": "nate",
      "body": "I would have given some unspecified body part to be there.  That sounded awesome.",
      "created_at": "2006-10-31T01:16:53.000Z"
    },
    {
      "author": "tim",
      "body": "thats quite a fetching beard.",
      "created_at": "2006-10-31T01:18:21.000Z"
    },
    {
      "author": "alrescate",
      "body": "You cannot imagine how jealous I am of you.",
      "created_at": "2006-10-31T01:34:18.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "... heh.... texture",
      "created_at": "2006-10-31T04:01:40.000Z"
    },
    {
      "author": "stevie_g",
      "body": "If I weren't going to the Bears-Rams game on Dec. 11, or if I hadn't been at the first game of any kind at the new Busch (the Springfield-Memphis thing), OR if I was a Cardinal fan instead of a Cub fan, I might be jealous...\r\n\r\nWHO AM I KIDDING! I'M JEALOUS! JEALOUS ON SO MANY LEVELS!\r\n\r\nyou lucky bastard...",
      "created_at": "2006-10-31T09:01:02.000Z"
    },
    {
      "author": "stevie_g",
      "body": "Nice pix, BTW...",
      "created_at": "2006-10-31T09:02:10.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
