{
  "id": 461,
  "title": "Rocky Horror and current events",
  "body": "I meant to originally write this post on Wednesday, but I've been <a href=\"http://games1.org/games/red.swf\" target=\"_blank\" class=\"broken\">sooooo busy</a> over the last few days (as per usual)! I hope you'll forgive me.<br/><br/>THE ROCKY HORROR PICTURE SHOW was a HUGE success. The 7:00 show was only a few people shy of capacity, and both the 9:30 and midnight shows sold out. It was insane! That was the first time I had actually watched the movie from beginning to end. Of course, I spent most of my time watching the audience, who were loud and raunchy throughout the entire movie, just as good RHPS audience should be.<br/><br/>In addition to the film, Springfield Little Theatre also provided a shadow cast to act out the movie in front of the screen, which made the entire experience even better. The actors and actresses did an awesome job. I was afraid (read: hopeful) that the actress portraying Janet was going to fall out of her bra when she was being chased across the stage by Dr. Frank-N-Furter. That would've been awful (*wink wink*)!<br/><br/>If you didn't make it out this year, we're planning on making it an annual event, so make sure you come next Halloween. And a word to the wise: buy your tickets early. I can't tell you how many people left pouting when they found out the last two shows were sold out. I even heard several rumors that people were scalping tickets on Walnut. CRAZY!<br/><br/>So you might have read in the news that President Bush was in Springfield yesterday and today, which strangely coincided with our week-long screening of DEATH OF A PRESIDENT. He couldn't have timed his trip more perfectly! To tell you the truth, I was half expecting him to show up last night for our 9:30 show, or at least send an SUV-load of Secret Service agents over to intimidate Nicole and me.<br/><br/>Also of note, Ted Haggard (the now ex-president of the Evangelical Organization who got busted for buying drugs and \"services\" from a male prostitute) is all over the news just before we open JESUS CAMP, which I believe he has a cameo in. Pretty spiffy, eh?! November is lining up to be quite the controversial month, both at The Moxie and beyond!!!<br/><br/>Ok, it's intermission time, so I better roll.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-11-04T08:51:57.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "curtis",
      "body": "I'm SOOOO glad this is going to be an annual event.  It really was a lot of fun.  I went at midnight, and it was a blast.",
      "created_at": "2006-11-07T06:16:09.000Z"
    },
    {
      "author": "Caleb",
      "body": "But I thought commenting on the blog was only for us crazy forumers now anyway? Down with the outsiders!",
      "created_at": "2006-11-06T04:09:54.000Z"
    },
    {
      "author": "God",
      "body": "I enjoyed this blog post, Dan. Thank you.",
      "created_at": "2006-11-06T01:32:12.000Z"
    },
    {
      "author": "nicole",
      "body": "They don't call me Type A for nothing!",
      "created_at": "2006-11-06T01:30:37.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Oh Nicole, you're so cute with your \"order\" and your \"sanity\".",
      "created_at": "2006-11-06T01:27:12.000Z"
    },
    {
      "author": "nicole",
      "body": "I have no idea what's going on here.<br/><br/>But did anyone notice that these are the comments for the blog post? So when people read the blog, these are the comments they see! And the blog gets a lot more readership than the forum does, so please put on your Sunday best and behave.",
      "created_at": "2006-11-06T00:18:26.000Z"
    },
    {
      "author": "Master RJ",
      "body": "<blockquote><cite>Posted By: Caleb</cite><blockquote><cite>Posted By: Master RJ</cite>After I hugged a girl</blockquote>TMI</blockquote><br/><br/>It was an innocent hug. She seemed insecure, so I gave her a hug.",
      "created_at": "2006-11-05T22:05:30.000Z"
    },
    {
      "author": "Caleb",
      "body": "<blockquote><cite>Posted By: Master RJ</cite>After I hugged a girl</blockquote>TMI",
      "created_at": "2006-11-05T22:03:27.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Operation Marketing Strategy was mostly a failure. After I got approval from The Verizon Guy (Nate, the youth group leader) two weeks ago and Erika (you guys might like her, she's nice) this morning, I posted four ads, including one next to some chili for the chili contest later during the Chiefs-Rams (prediction: Chiefs 35, Rams 21) game. But then, the failure came. After posting an ad next to the snack bar, the little idiot who heads it refused the ad. Then, he asks Verizon Guy about it and he says he never approved it. Betrayal! The ads were trashed. And adding insult to injury, a guy stole another girl I liked and now the girl hates me for my open hatred for him. But, I do have good news. After I hugged a girl, I started talking about the film to a few and I think we delivered some word. Dan, you should have backed me up and we could have overpowered Verizon Guy and The Little Snack Bar Nazi.",
      "created_at": "2006-11-05T22:01:50.000Z"
    },
    {
      "author": "erin",
      "body": "RJ! dont you dare.....<br/>brick?<br/>how could you...?<br/>okay.",
      "created_at": "2006-11-05T19:29:21.000Z"
    },
    {
      "author": "Caleb",
      "body": "Brick was incredibly good. And considering it was the director's first feature film, I consider it to be even better than it probably is. Most directors have to work at it for a while before making something so good.<br/><br/>Speaking of Rian Johnson, he's got a new film in the making called The Brothers Bloom. It stars Rachel Weisz (woot!) and it's about a family of con men trying to con Weisz.",
      "created_at": "2006-11-05T21:54:05.000Z"
    },
    {
      "author": "Master RJ",
      "body": "It was a two-in-one.<br/><br/>P.S.: Why did everyone think Brick was so great? Sure it was good, but it was in dire need of the scissors.",
      "created_at": "2006-11-05T13:09:54.000Z"
    },
    {
      "author": "erin",
      "body": "and i know what it was.... it was a letter to the moxie customers... about how you were wrong about brick.<br/>(i think?)<br/><br/><br/><br/>edit: reading above what dan said much earlier. sheesh. im blind. yes. thats what it was. brick...... duh.",
      "created_at": "2006-11-05T12:12:30.000Z"
    },
    {
      "author": "erin",
      "body": "man... when you get to college youre hand writing gets even worse. over the past three years my hand writing has gone from bubbly girly letters to chicken's with no claws scratchings.<br/><br/>and when i sign my name..... its not pretty. cursive e's are hard to make.",
      "created_at": "2006-11-05T12:09:37.000Z"
    },
    {
      "author": "erin",
      "body": "caleb.... she showed multiple people at the moxie while they were talking at the cinebar....<br/>why would she have showed other people if nobody was supposed to know?<br/><br/>it was a letter about him being wrong about brick.. or whatever. it wasnt a secret.",
      "created_at": "2006-11-05T12:06:42.000Z"
    },
    {
      "author": "Caleb",
      "body": "Too late. Guess he didn't mind, but still! This is why I worry about you saying things on the Moxie Forum that I tell you not to say anything about!<br/><br/>;-)",
      "created_at": "2006-11-05T07:51:34.000Z"
    },
    {
      "author": "dan",
      "body": "<img src=\"http://i123.photobucket.com/albums/o297/bjork24/animated%20gifs/ceilingcat.gif\" alt=\"Ceiling Cat\" />",
      "created_at": "2006-11-05T07:02:34.000Z"
    },
    {
      "author": "Master RJ",
      "body": "<blockquote><cite>Posted By: erin</cite>i remember you showing caleb and i some letter or something he wrote (perhaps this is the same thing?)...<br/>and me thinking...wow this kid has no penmanship skills.<br/>its okay rj. i have handwriting schizophrenia...</blockquote><br/><br/>Yes, my writing isn't very neat. But nothing is very neat for me anyway.",
      "created_at": "2006-11-05T07:24:01.000Z"
    },
    {
      "author": "Caleb",
      "body": "ERIN!!!!! NICOLE TOLD US NOT TO TELL THAT SHE SHOWED US THAT! DELETE THIS COMMENT IMMEDIATELY!",
      "created_at": "2006-11-04T23:12:43.000Z"
    },
    {
      "author": "dan",
      "body": "He made us one for BRICK.",
      "created_at": "2006-11-04T10:28:23.000Z"
    },
    {
      "author": "erin",
      "body": "i remember you showing caleb and i some letter or something he wrote (perhaps this is the same thing?)...<br/>and me thinking...wow this kid has no penmanship skills.<br/>its okay rj. i have handwriting schizophrenia...",
      "created_at": "2006-11-04T10:32:49.000Z"
    },
    {
      "author": "Ian",
      "body": "Wait, RJ has cool hand-drawn ads???<br/>POST THAT SHIT, RJ.",
      "created_at": "2006-11-04T10:23:57.000Z"
    },
    {
      "author": "dan",
      "body": "<blockquote><cite>Posted By: Master RJ</cite>What about those flyers for my church? I think I can get some new faces and faces away from that craptastic One Night With The King.</blockquote><br/>RJ, how about you make one of your cool hand-drawn ads for JESUS CAMP?",
      "created_at": "2006-11-04T10:22:37.000Z"
    },
    {
      "author": "Master RJ",
      "body": "What about those flyers for my church? I think I can get some new faces and faces away from that craptastic One Night With The King.",
      "created_at": "2006-11-04T10:05:54.000Z"
    },
    {
      "author": "Ian",
      "body": "pictars!!",
      "created_at": "2006-11-04T09:49:30.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
