{
  "id": 463,
  "title": "The Moxie is not affected by the Springfield bar ban",
  "body": "Yesterday, Springfield voters chose to enact a ridiculously Orwellian law that effectively bans anyone under the age of 21 from all establishments that derive 60% or more of their total revenue from the sale of alcohol. The bar ban, obviously, casts a Springfield in a bad light, is harmful to the entire downtown business community, and will most likely have an immediate and lasting effect on the out-of-town enrollment at both MSU and Drury. I'm not, however, going into detail about my feelings about the ban, because this blog is about The Moxie, not my political leanings.\r\n\r\nWith that being said, it's come to our attention within the last few hours that people are under the impression that the bar ban affects The Moxie. This is not true. Our alcoholic sales make up less than 8% of our total revenue - a far cry from the 60% needed to fall under the umbrella of the ban. The Moxie has always been, and will always be, an all-ages venue (unless, of course, you're wanting to come see SHORTBUS, which will be an 18+ show). As far as I know, only ten businesses are affected by the ban. I'm not sure which ones, but that's the word on the street. I've also heard the ban has more holes in it than a Norwegian colander, but that's beside the point... the damage has already been done.\r\n\r\nSo, one last time for emphasis: <b>The Moxie is not affected by the bar ban. We have always been, and will always be, an all-ages venue (unless you're watching SHORTBUS).</b>\r\n\r\nAnd in other news, three beers are on the way out. Next time you're in, wish a final adios to Boulevard Pale Ale, Mueller Pale Ale, and Schlafly Stout, which are all on special until they run out. The incumbent beers lost their seats to Fat Tire, Sierra Nevada Pale Ale, and Guinness, which will be available in the upcoming weeks. Despite the sudden influx of non-Missouri beers, local beers still hold a majority over the beer menu. A fourth race between Michelob Ultra and Newcastle Brown is still too close to call.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-11-09T07:33:00.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "erin",
      "body": "hey! thats juard! i didnt know...\r\ni should have clicked sooner.\r\n\r\nhi juard!",
      "created_at": "2006-12-13T07:26:08.000Z"
    },
    {
      "author": "Caleb",
      "body": "Ok, I won't tell him.",
      "created_at": "2006-12-13T04:32:10.000Z"
    },
    {
      "author": "EdMo",
      "body": "Don't ever tell him that because he will giggle.",
      "created_at": "2006-12-13T03:57:03.000Z"
    },
    {
      "author": "Caleb",
      "body": "Faulty introduced me to Stella Artois and Grolsch. Both are now two of my favorite beers.",
      "created_at": "2006-12-12T22:19:58.000Z"
    },
    {
      "author": "FaultyGoblin",
      "body": "You have no idea how much Ed loves Guinness, no matter how much I try to dissuade him...",
      "created_at": "2006-12-12T09:47:52.000Z"
    },
    {
      "author": "EdMo",
      "body": "Hey, I still like all of your beers, too.  Took me a while to get used to Stella, but I ended up liking it, no?\r\n\r\nSo\r\n\r\nPlease\r\n\r\nQuit\r\n\r\nCOMPLAINING!",
      "created_at": "2006-12-12T18:59:12.000Z"
    },
    {
      "author": "EdMo",
      "body": "I'm so pumped for Guinness.  Dan.  You have no idea.  How much.  I love.  Guinness.",
      "created_at": "2006-11-11T03:18:49.000Z"
    },
    {
      "author": "Megster",
      "body": "oh yes... my apologies...",
      "created_at": "2006-11-11T01:43:07.000Z"
    },
    {
      "author": "Megster",
      "body": "....ugh.  yep...you saw through our charade as siblings... \r\n\r\nseriously, wtf?",
      "created_at": "2006-11-11T01:04:24.000Z"
    },
    {
      "author": "dan",
      "body": "<blockquote><cite>Posted By: Megster</cite>seriously, wtf?</blockquote>\r\nDon't question the Cougar King, Meganne.",
      "created_at": "2006-11-11T01:42:06.000Z"
    },
    {
      "author": "nate",
      "body": "If you draw a beard, or even photograph it, it takes the beard's soul away.",
      "created_at": "2006-11-10T23:58:36.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Today's Game Of Pretend:\r\nMeganne is Finger's mom (RJ as Cougar King)",
      "created_at": "2006-11-10T23:58:56.000Z"
    },
    {
      "author": "Megster",
      "body": "don't worry brother...we'll get you a nice fake i.d.... do you think they'll take mine?  maybe if we drew a beard on the picture?",
      "created_at": "2006-11-10T23:56:07.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Man, I saw one of my favorite bands at the Outloand this summer... Sound Team. This sucks.",
      "created_at": "2006-11-10T23:54:36.000Z"
    },
    {
      "author": "Master RJ",
      "body": "I knew it! Calvin really does have problems. Now tell me how Hobbes talks!",
      "created_at": "2006-11-10T23:49:58.000Z"
    },
    {
      "author": "nate",
      "body": "Oh, and by the way...\r\n\r\nGuinness!!!!!!!!!!!!!!!!!!!!!!\r\n\r\nDo I get an employee discount on Guinness????\r\nThis would make me a raging alcoholic that will hang around the Moxie even more than I already do.",
      "created_at": "2006-11-10T23:48:20.000Z"
    },
    {
      "author": "nate",
      "body": "Outside of loopholes for the bars themselves that we already discussed, everything I've read is that those underage band members are just as banned as the underage audience.",
      "created_at": "2006-11-10T23:01:42.000Z"
    },
    {
      "author": "Master RJ",
      "body": "The manager will pull some strings (Pull some strings! Pull some strings!).",
      "created_at": "2006-11-10T22:57:29.000Z"
    },
    {
      "author": "dan",
      "body": "What about bands that have members who are under 21? Will they have to play the affected bars sans one or two original members?",
      "created_at": "2006-11-10T22:55:35.000Z"
    },
    {
      "author": "Master RJ",
      "body": "<blockquote><cite>Posted By: nate</cite>An excellent point, Caleb.\r\n\r\nApparently they need to make a new one where some kid says that sitting quietly in his room, back straight, upright, eyes forward, with his hands folded neatly across his lap, is his \"anti-drug.\"\r\n\r\nBecause I think that's what they want.</blockquote>\r\n\r\nAd in 2064:\r\n\r\nDrugs: The Anti-Drug",
      "created_at": "2006-11-10T21:00:28.000Z"
    },
    {
      "author": "Caleb",
      "body": "Megster, you have opened my eyes.",
      "created_at": "2006-11-10T20:34:41.000Z"
    },
    {
      "author": "Megster",
      "body": "you guys are waaay off... obviously now kids will engage in enriching community service projects and read the bible in their spare time.  geesh.  i thought that was pretty clear.",
      "created_at": "2006-11-10T20:31:07.000Z"
    },
    {
      "author": "nate",
      "body": "An excellent point, Caleb.\r\n\r\nApparently they need to make a new one where some kid says that sitting quietly in his room, back straight, upright, eyes forward, with his hands folded neatly across his lap, is his \"anti-drug.\"\r\n\r\nBecause I think that's what they want.",
      "created_at": "2006-11-10T20:28:37.000Z"
    },
    {
      "author": "Caleb",
      "body": "Whatever happened to the whole anti-drug PSA's? There is one about music and how it's an anti-drug. I'm sure youngsters will still be interested in playing music and all that, but now their only option to perform is probably playing a Christian rock song at a local liberal church. BRING ON THE DRUGS!",
      "created_at": "2006-11-10T20:25:28.000Z"
    },
    {
      "author": "Caleb",
      "body": "Um... the Belmonte. And... that's about it. Most the places that had shows popular among younger audiences are now off limits. If The Outland Ballroom gets rid of its bar then everything will be there.",
      "created_at": "2006-11-10T20:23:10.000Z"
    },
    {
      "author": "curtis",
      "body": "I have heard the Billiard's Blue Room is not affected.",
      "created_at": "2006-11-09T21:25:07.000Z"
    },
    {
      "author": "dan",
      "body": "Hello",
      "created_at": "2006-11-10T01:48:23.000Z"
    },
    {
      "author": "eille08",
      "body": "does anyone know where we can see a list of businesses that i'm freaking not allowed in anymore, even if I don't plan on drinking, but just seeing a show, because i'm 19?\r\n\r\nwow, that must be a run-on",
      "created_at": "2006-11-10T05:13:34.000Z"
    },
    {
      "author": "Aaron J Scott",
      "body": "I'm writing in Harp Lager for my candidate.",
      "created_at": "2006-11-09T09:39:16.000Z"
    },
    {
      "author": "Caleb",
      "body": "Fat Tire! Guinness! Yesss!",
      "created_at": "2006-11-09T08:45:12.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
