{
  "id": 464,
  "title": "JESUS CAMP knocks 'em dead",
  "body": "After 7 shows, JESUS CAMP has tied AN INCONVENIENT TRUTH for the highest average attendance per showing. Un-freaking-believable. We knew it would bring in people, but we never would've guessed FOUR sold out shows in a row! And we had to turn people away each time! With a reception like that, we might just have to bring it back for an encore presentation in early December... but don't hold me to that, because we have a lot of films to show.<br/><br/>JESUS CAMP... who would've thunk it. No wonder this girl is crying!<br/><br/><img src=\"http://www.moxiecinema.com/pix/movies/140.jpg\" />",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-11-15T09:54:51.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "gillenstien",
      "body": "<blockquote><cite>Posted By: Master RJ</cite><blockquote><cite>Posted By: nate</cite>When will we get to see the movie making fun of gays?</blockquote><br/><br/>When Hell freezes over.</blockquote><br/><br/>FAG   <br/>i made fun of gay people<br/>who wants to go ice skating?",
      "created_at": "2006-11-16T05:57:54.000Z"
    },
    {
      "author": "Master RJ",
      "body": "<blockquote><cite>Posted By: The Four Finger Soc Em</cite>Yeah... uhh, just about every mainstream comedy in the last ten years makes fun of gays... and many other movies. It's a very tired act, I mean of course it's ignorant and offensive, but it's not a funny topic anymore, like in Wedding Crashers, I had just had enough, that's the first time watching an agreeable fun movie like that where I stopped to see everyone around me laughing, and I just wasn't...</blockquote><br/><br/>I hate it in rom-coms when the male friend of the girl is gay. It's been done so many times and nothing is different.",
      "created_at": "2006-11-16T03:47:53.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Yeah... uhh, just about every mainstream comedy in the last ten years makes fun of gays... and many other movies. It's a very tired act, I mean of course it's ignorant and offensive, but it's not a funny topic anymore, like in Wedding Crashers, I had just had enough, that's the first time watching an agreeable fun movie like that where I stopped to see everyone around me laughing, and I just wasn't...",
      "created_at": "2006-11-16T03:05:52.000Z"
    },
    {
      "author": "Erik",
      "body": "I had to change this post as I had offended myself.  Sounds like this documentary is accomplishing exactly what a good documentary should, getting people to think.",
      "created_at": "2006-11-16T01:26:28.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "? ive seen plenty of movies that make fun of gays<br/>hell.. most shows with gay people in it.. make fun of gays<br/>what do most comedians do?  make fun of themselves...<br/>whites make fun of whites.. asians of asians... blacks of blacks <br/>and yes gays make fun of gays<br/><br/>it all just depends.. on how its done",
      "created_at": "2006-11-16T00:58:23.000Z"
    },
    {
      "author": "Master RJ",
      "body": "<blockquote><cite>Posted By: nate</cite>When will we get to see the movie making fun of gays?</blockquote><br/><br/>When Hell freezes over.",
      "created_at": "2006-11-16T00:53:38.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "id say they can edit it any way they want.. to make them look a little more crazy..<br/>and id say certain music choices and things.. added to that<br/>but im *positive* they could have done much worse... if they had wanted too<br/>but what made it seem pretty even handed to me.. was that there were no voiceovers<br/>or anything of the like.... it was just them.. talking about their own beliefs..<br/>the only other side of things we saw..  was of course the radio guy..<br/>and he was being pretty broad with most of his comments.. i thought",
      "created_at": "2006-11-16T00:53:35.000Z"
    },
    {
      "author": "nate",
      "body": "When will we get to see the movie making fun of gays?",
      "created_at": "2006-11-16T00:42:59.000Z"
    },
    {
      "author": "curtis",
      "body": "You should do an encore showing, seeing that I cannot tell the difference between JESUS CAMP and THE US VERSUS JOHN LENNON.  And I have not gotten the chance to see it.",
      "created_at": "2006-11-16T00:17:44.000Z"
    },
    {
      "author": "dan",
      "body": "@Erik: to answer your question earlier, the audience demographic was about 40% regulars, 30% students, 20% new faces, 10% very obviously Christian families. During intermission at one screening, a guy came out and said:<br/><br/>Man: It sure seems like they're making fun of religion to me.<br/>Nicole: Really? I've heard a lot of people say it's very even-handed.<br/>Man: Hmph. I'd like to see you show a movie making fun of gays and see what happens.<br/><br/>I'd categorize that gentleman in the 10% demographic. It was an interesting blend, to say the least... and I'm almost certain we're doing an encore showing in early December.",
      "created_at": "2006-11-16T00:03:01.000Z"
    },
    {
      "author": "Master RJ",
      "body": "<blockquote><cite>Posted By: El Brian de Moore</cite><blockquote><cite>Posted By: Master RJ</cite>Mmm, cheesecake. And Morgan Webb.</blockquote>you are not allowed to speak morgan webb's name... you are not worthy.... this is the point at which i would turn your mic off (oh.. and innocent bystander my ass)<br/><br/>oh.. erik... sitting in front of me.. was a girl with a cross on the back of her shirt.. i didnt catch what the front said<br/>but im assuming she was a nice christian girl... but even she was shaking her head at the crazies on the screen</blockquote><br/><br/>I will get you.",
      "created_at": "2006-11-15T23:58:15.000Z"
    },
    {
      "author": "nate",
      "body": "<blockquote><cite>Posted By: Erik</cite><blockquote><cite>Posted By: nate</cite>It's only fair to say that the vast majority of self-described Christians in this country are not anything nearly like the Jesus Camp mold.</blockquote><br/><br/>I'm often finding that folks like these (in the movie), make it harder for people to actually find faith in Christ.</blockquote><br/><br/>There's not any doubt for me Erik.  I absolutely believe it.  <br/>I've tried to explore many of the meanings underlying Christianity on my own, but I'm alway driven away from anything organized just from the sort of thing Jesus Camp portrays, even when certain intolerances trickle down to the more moderate denominations.  You can definitely blame the current atmosphere for most of my agnosticism, believe me.",
      "created_at": "2006-11-15T23:04:19.000Z"
    },
    {
      "author": "nate",
      "body": "Oh, no, I wasn't trying to beat you over the head with a point.  I know you weren't condemning them all.  It's just a point I like to raise from time to time.  <br/><br/>One of my mini-social networks I have here in town is full of the most liberal progressive non-judgmental but devout Christians you are ever likely to meet.  They give me hope.  I alson think on the national level their numbers are growing.  We'll see.",
      "created_at": "2006-11-15T23:00:59.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "yes... sorry.. didnt mean for it to seem that i thought otherwise...  it was the use of the word \"but\"  right?<br/>a good portion of the christians i know.. are nice, cool people... though ive also met my fair share christians that arent evangelical <br/>that are still completely looney in a similar fashion<br/><br/>i agree with a good portion of the moral ideas that christians preach ...<br/>reasoning would tell me that there *has* to be a good portion of christians that practice those morals.. ... <br/>... only problem i have..is when they tend to act like non-christians couldnt have similar morals<br/><br/>was that last part slightly unrelated? eh",
      "created_at": "2006-11-15T22:57:26.000Z"
    },
    {
      "author": "nate",
      "body": "It's only fair to say that the vast majority of self-described Christians in this country are not anything nearly like the Jesus Camp mold.",
      "created_at": "2006-11-15T21:59:09.000Z"
    },
    {
      "author": "Erik",
      "body": "<blockquote><cite>Posted By: nate</cite>It's only fair to say that the vast majority of self-described Christians in this country are not anything nearly like the Jesus Camp mold.</blockquote><br/><br/>I'm often finding that folks like these (in the movie), make it harder for people to actually find faith in Christ.",
      "created_at": "2006-11-15T22:51:02.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "<blockquote><cite>Posted By: Master RJ</cite>Mmm, cheesecake. And Morgan Webb.</blockquote>you are not allowed to speak morgan webb's name... you are not worthy.... this is the point at which i would turn your mic off (oh.. and innocent bystander my ass)<br/><br/>oh.. erik... sitting in front of me.. was a girl with a cross on the back of her shirt.. i didnt catch what the front said<br/>but im assuming she was a nice christian girl... but even she was shaking her head at the crazies on the screen",
      "created_at": "2006-11-15T21:54:20.000Z"
    },
    {
      "author": "nate",
      "body": "This calls for cheesecake!  (the sold outness of Jesus Camp, that is)",
      "created_at": "2006-11-15T18:59:05.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Mmm, cheesecake. And Morgan Webb.",
      "created_at": "2006-11-15T19:18:50.000Z"
    },
    {
      "author": "Erik",
      "body": "I'm curious Dan.  Did you get any sense of the audience make up?  I know from the forum that there were a lot of viewers who disagreed with the \"camp\", but were there a lot who you would think were in favor?  Any good comments overheard on the way out?",
      "created_at": "2006-11-15T21:47:04.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Brian is Bill O'Reilly. I am just an innocent bystander.",
      "created_at": "2006-11-15T18:47:43.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Always live with an open mind.",
      "created_at": "2006-11-15T18:13:37.000Z"
    },
    {
      "author": "erin",
      "body": "<blockquote><cite>Posted By: El Brian de Moore</cite>i told you to shut the fuck up...<br/>didnt you see it? it was awesome</blockquote><br/><br/>okay. this is funny. but only because i can totally hear brian saying this when i read it.... heeheee.",
      "created_at": "2006-11-15T18:28:54.000Z"
    },
    {
      "author": "erin",
      "body": "it was perhaps the most disturbing thing ive seen since that one scene in cache (sp?)...<br/><br/>i told brian afterwards that i need to thank my parents for raising me the way they did. protecting me from crazy people like that....",
      "created_at": "2006-11-15T18:06:40.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "rj....  <br/><br/>.... shut the fuck up...",
      "created_at": "2006-11-15T12:11:45.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "I DID IT!!!",
      "created_at": "2006-11-15T12:12:04.000Z"
    },
    {
      "author": "Master RJ",
      "body": "<blockquote><cite>Posted By: El Brian de Moore</cite>I DID IT!!!</blockquote><br/><br/>Did what?",
      "created_at": "2006-11-15T13:11:42.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "i told you to shut the fuck up...<br/>didnt you see it?  it was awesome",
      "created_at": "2006-11-15T13:43:05.000Z"
    },
    {
      "author": "Master RJ",
      "body": "<blockquote><cite>Posted By: El Brian de Moore</cite>i told you to shut the fuck up...<br/>didnt you see it? it was awesome</blockquote><br/><br/>Take off.",
      "created_at": "2006-11-15T13:49:28.000Z"
    },
    {
      "author": "Master RJ",
      "body": "<blockquote><cite>Posted By: Ian</cite>RJ...I'm not sure what you're talking about, but it's maybe noydb.</blockquote><br/><br/>Group sales are when different groups buy tickets. It's big business for the theatres and this was one of those movies in which sales would be done.",
      "created_at": "2006-11-15T12:01:56.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "what was it.. she said? \"that'll show those animal rights people\"<br/>something to that effect...<br/><br/>i never realize how much god hated animals.... my eyes have been opened",
      "created_at": "2006-11-15T11:54:32.000Z"
    },
    {
      "author": "Ian",
      "body": "\"I think he was Muslim.\"",
      "created_at": "2006-11-15T11:55:20.000Z"
    },
    {
      "author": "Ian",
      "body": "RJ...I'm not sure what you're talking about, but it's maybe noydb.",
      "created_at": "2006-11-15T11:49:22.000Z"
    },
    {
      "author": "dan",
      "body": "nope.",
      "created_at": "2006-11-15T11:43:32.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "good thing i got my ticket online..<br/>great (extremely disturbing) film",
      "created_at": "2006-11-15T11:44:23.000Z"
    },
    {
      "author": "Master RJ",
      "body": "So I'm guessing you used the group sales idea?",
      "created_at": "2006-11-15T11:16:26.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
