{
  "id": 466,
  "title": "Moxie marketing survey",
  "body": "Last month, a group of graduate students from Drury approached Nicole and I with a request to use our business as the focus of their marketing analysis thesis. By allowing them to analyze all of our marketing efforts, and dissect our various demographics, they'll be able to prepare a detailed report of what we're doing right, and where we need to improve. And the best part of it all, it's FREE! College projects are the best.<br/><br/>As part of their research, they're conducting an online survey targeted towards Moxie customers and non-customers alike. If you have a little spare time (it shouldn't take more than a few minutes), please <a href=\"http://www.questionpro.com/akira/TakeSurvey?id=575411\" target=\"_blank\" class=\"broken\">click here</a> to take the survey. It's completely anonymous, so you don't have to worry about us spitting in your popcorn if you give us bad marks. Also, the more honest you are with your answers, the more it will help us improve our services.<br/><br/>Also, if you know anyone else who could take the survey, feel free to forward <a href=\"http://www.questionpro.com/akira/TakeSurvey?id=575411\" target=\"_blank\" class=\"broken\">the survey link</a> onto them. Thanks in advance!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-11-18T06:52:51.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "curtis",
      "body": "\"How often do you attend Artwalk?\"",
      "created_at": "2006-11-19T01:26:56.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "once a week!",
      "created_at": "2006-11-19T01:37:07.000Z"
    },
    {
      "author": "Caleb",
      "body": "That question was ludicrous!",
      "created_at": "2006-11-19T13:34:00.000Z"
    },
    {
      "author": "tim",
      "body": "Whoa! i got a 100% on the test!!!! what do i get???",
      "created_at": "2006-11-18T11:58:21.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "<blockquote><cite>Posted By: Master RJ</cite>You guys are perfect. One day, you shall be a four-screen theatre and I will do some odd jobs for free.</blockquote>rj.. you<em> know</em> im going to keep saying that stuff.. cause its funny... no matter if you play nice or not :-)<br/>im sure it will lose its comedic value at some point.... i just havent  reached such a point yet",
      "created_at": "2006-11-18T12:05:56.000Z"
    },
    {
      "author": "drm00se",
      "body": "Can I take it twice? Or seven times?",
      "created_at": "2006-11-18T11:50:53.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "... drury students?  i thought RJ was already doing this?",
      "created_at": "2006-11-18T07:38:38.000Z"
    },
    {
      "author": "Master RJ",
      "body": "You guys are perfect. One day, you shall be a four-screen theatre and I will do some odd jobs for free.",
      "created_at": "2006-11-18T10:22:07.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
