{
  "id": 467,
  "title": "Black Friday savings, and the December calendar",
  "body": "For those of you who don't receive, or maybe just don't read our newsletter, don't forget about our super special deal on Friday and Saturday ONLY. If you buy a standard 10 ticket bulk pass for $50, we'll throw in TWO EXTRA TICKETS, which means you're getting 12 tickets for $50... that's $4.16 per ticket! There's no better deal in town! Buy one for everyone you know, including yourself! If you buy five of them, it's like getting a sixth one absolutely FREE! You can't beat that deal with an electrified deal-beatin' stick!!!<br/><br/>I also just finished the December calendar, and hope to have the printed version available tonight. Here's what we've got on the menu for the final 31 days of 2006:<br/><br/>THIS FILM IS NOT YET RATED and ARMY OF SHADOWS will both finish up on December 5th.<br/><br/><i><u>WEEK 1: December 6 - 12</u></i><br/><br/>+ <b>FUR: AN IMAGINARY PORTRAIT OF DIANE ARBUS</b> - The new film from Steven Shainberg, (director of SECRETARY), starring Nicole Kidman and Robert Downey, Jr..<br/><br/>+ <b>JESUS CAMP</b> - We turned away so many people during our numerous sold out shows that we had to bring it back. Some people threatened to burn us to the ground if we didn't.<br/><br/><i><u>WEEK 2: December 13 - 19</u></i><br/><br/>+ <b>RUNNING WITH SCISSORS</b> - Starring Alec Baldwin, Annette Benning, Brian Cox, Gwyneth Paltrow, Evan Rachel Woods, and Joseph Fiennes, this is probably the single most anticipated film of the month.<br/><br/>+ <b>AMERICAN HARDCORE</b> - A new documentary about the hardcore punk movement in the early-to-mid 1980s. It's got Henry Rollins and Flea in it, who happen to be two of the most likable guys on the planet... what more could you ask for?<br/><br/><i><u>WEEK 3: December 20 - 26</u></i><br/><br/>+ <b>RUNNING WITH SCISSORS</b> - continues for another week.<br/><br/>+ <b>MY BOSS IS AN IDIOT</b> - New local film from Nate Black and Brandon Goodwin, the same duo that brought you A PIANO BY CHRISTMAS last December.<br/><br/>+ <b>HOMEMADE HILLBILLY JAM</b> - Another \"back by popular demand\" title. If you missed this family-friendly documentary about Springfield's very own Big Smith, then you can't seriously consider yourself a Springfieldian. I also talked the director into making a limited run of special edition DVDs just in time for Christmas!!!<br/><br/><i><u>WEEK 4: December 27 - TBD</u></i><br/><br/>+ <b>SHUT UP & SING</b> - A new documentary about the Dixie Chicks and Natalie Maines's anti-Bush comment that nearly ruined their career.<br/><br/>+ <b>F*CK</b> - From the people who brought you THE ARISTOCRATS, here comes F*CK. All the same comedians, along with respected journalists, celebrities, and porn stars, team up to discuss their favorite word, and find out why it's so risque.<br/><br/>Hope to see you guys here for most, if not all, of them!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-11-23T04:18:10.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "daveadams",
      "body": "Can I get my hands on one of these HHJ DVDs from 800 miles away? Or can I reserve one to pick up at your Will Call window?",
      "created_at": "2006-11-27T09:04:18.000Z"
    },
    {
      "author": "dan",
      "body": "I think that can be arranged Dave. E-mail a little closer to Christmas, and I'll give you the downlow.",
      "created_at": "2006-11-27T22:49:21.000Z"
    },
    {
      "author": "curtis",
      "body": "I'm pretty sure I'm excited for all of those movies.  Plus I missed Jesus Camp AND Homemade Hillybilly Jam.  So now I am cutthroat about seeing them.",
      "created_at": "2006-11-24T11:42:35.000Z"
    },
    {
      "author": "Caleb",
      "body": "AWESOME MOVIE LINEUP! Maybe I can actually watch all of them too, since school will be winding down.",
      "created_at": "2006-11-24T21:55:08.000Z"
    },
    {
      "author": "erin",
      "body": "there has been so many movies at the moxie ive wanted to see but never got the chance.<br/><br/>im packing in the movies this winter break.<br/><br/>i kinda wanna watch shortbus again....<br/>does this make me a pervert?",
      "created_at": "2006-11-25T01:26:29.000Z"
    },
    {
      "author": "Caleb",
      "body": "yes erin, it does.",
      "created_at": "2006-11-25T02:31:15.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: Master RJ</cite>It's not jam-packed like November, but Shut Up And Sing's coming, so it's good.<br/><br/>P.S.: Keeping Mum and Little Children in January? What about Harsh Times?</blockquote><br/><br/>You are really pushing the buttons, RJ.  LEARN!",
      "created_at": "2006-11-25T12:46:39.000Z"
    },
    {
      "author": "brad",
      "body": "american hardcore was great. i love that whole scene, the time period, so i was really into it. if you're not familiar w/ it, you might not like it so much, or you'll just be plain frightened. but its a great music doc.<br/><br/>i'll be there for shut up and sing..",
      "created_at": "2006-11-23T08:43:36.000Z"
    },
    {
      "author": "Master RJ",
      "body": "<blockquote><cite>Posted By: The Four Finger Soc Em</cite>RJ... I doubt they have anything set for January, you should really learn from the things they've said... many, many times before in answers to your questions. And man... let Harsh Times go, it looks awful.</blockquote><br/><br/>I'm a very impatient person and I can get fidgity easily.<br/><br/>By the way, I hate when Campbell 16 skips wide releases and therefore I'm forced to wait for the DVD. And Christian Bale fans will want to see it. Same goes for Eva Longoria (my mom wouldn't mind seeing it for this reason).",
      "created_at": "2006-11-23T08:35:48.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "RJ... I doubt they have anything set for January, you should really learn from the things they've said... many, many times before in answers to your questions. And man... let Harsh Times go, it looks awful.",
      "created_at": "2006-11-23T08:24:24.000Z"
    },
    {
      "author": "Master RJ",
      "body": "It's not jam-packed like November, but Shut Up And Sing's coming, so it's good.<br/><br/>P.S.: Keeping Mum and Little Children in January? What about Harsh Times?",
      "created_at": "2006-11-23T08:02:34.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "rj...<br/><br/>.....<br/><br/>ahem.. anyway.. these movies look good... <br/>i might even watch all of them..<br/>even jesus camp again!!... just cause i like getting freaked out by little kids",
      "created_at": "2006-11-23T07:56:13.000Z"
    },
    {
      "author": "Master RJ",
      "body": "No, that's called \"Don't Call Me Faggot, Family Values Man\".",
      "created_at": "2006-11-23T07:05:10.000Z"
    },
    {
      "author": "nate",
      "body": "That must be the movie that makes fun of the gays.",
      "created_at": "2006-11-23T05:10:13.000Z"
    },
    {
      "author": "dan",
      "body": "They're more used to the \"F word\" on the coasts. That's like us Midwesterners watching a movie called DAG-NAB-IT.",
      "created_at": "2006-11-23T04:53:13.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Let's hope F**k does well, unlike with the New York and Los Angeles areas, where it flopped.",
      "created_at": "2006-11-23T04:47:04.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
