{
  "id": 468,
  "title": "Time for a little sprucing up around here",
  "body": "Winter seems to be the season of change here at The Moxie. Over the last few weeks we've seen 3 beers go, and 3 new ones join the menu (Guniness, Fat Tire, Sierra Nevada Pale Ale); my dad installed a big piece of glass toward the back of the Cinebar with our logo frosted on it; I modified our old-fashioned rewind table with a 1/2\" variable speed hammer drill; the Moxie jingle and intro have finally gone into rotation; and even more changes are on the horizon. We'll be replacing all the chairs on the 20th and 21st of December, installing a new menu board around the same time, getting new shirts, stickers, and buttons made just in time for the holidays, and, if all goes well, unveiling a cool new marquee in January or February. You won't even recognize the place by the time we're done!\r\n\r\nAlso, in time for the busy holiday season, we're going to start selling our gift certificates and bulk passes online. I hope to have this feature fully operational by Thursday or Friday, and then expand it to include merchandise a little later down the road. As always, I'll keep everyone updated here on the blog.\r\n\r\nOther than that, it's been business as usual around these parts. Some of our movies have done great (SHORTBUS <b>;)</b> ), some of them have done better than average (US VS. JOHN LENNON <b>:)</b> ), and some of them have sucked the hind teat (CONFETTI <b>:(</b> ). SHORTBUS came and went without so much as stirring up a grandmother fart's worth of controversy, which, to tell you the truth, was kind of surprising. My guess is that the people who might protest a movie like SHORTBUS don't even know we exist... or maybe they DO know we're around, but don't want to look narrow-minded. Either way, The Moxie is still 100% protest-free... despite having been quietly branded as \"that theater that only shows liberal movies.\"\r\n\r\nI feel a slight tickle in my throat, so I'm going to go gulp down a mixture of Airborne and Gatorade, and then get back to work on the gift certificate ordering form. Until next time, gentle reader... be good, and if you can't be good, be careful. Adios!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-11-29T06:47:00.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "jhawk",
      "body": "<blockquote><cite>Posted By: Cosmik</cite>I'm not even sure what a cockpunch is, but sounds very bad.  Or dirty.  Or both.</blockquote>\r\nThey didn't invent it, but I'm pretty sure The Onion made it popular...\r\n\r\n<a href=\"http://photobucket.com/\" target=\"_blank\"><img src=\"http://i69.photobucket.com/albums/i58/jhawk65807/cockpunch.jpg\" border=\"0\" alt=\"Photobucket - Video and Image Hosting\"></a>",
      "created_at": "2007-01-19T05:50:15.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Steven Seagal is Cock Puncher! In The Onion Movie, if it ever comes out (Onion fans can now shit their pants).",
      "created_at": "2007-01-19T04:46:15.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Him and Jack Chick should just S.T.F.U.",
      "created_at": "2007-01-19T03:18:13.000Z"
    },
    {
      "author": "Cosmik",
      "body": "I'm not even sure what a cockpunch is, but sounds very bad.  Or dirty.  Or both.",
      "created_at": "2007-01-19T04:33:25.000Z"
    },
    {
      "author": "Ian",
      "body": "<blockquote><cite>Posted By: jhawk</cite>Fred Phelps is a guy I'd cockpunch in a cocaine heartbeat. What a dick.\r\n\r\nAnd it takes a lot to piss ME off...</blockquote>\r\n\r\nHmm.  One point.",
      "created_at": "2007-01-19T03:14:31.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Who is Fred Phelps?\r\n\r\nEdit: forget it, I found him on Wikipedia.",
      "created_at": "2007-01-18T03:28:44.000Z"
    },
    {
      "author": "jhawk",
      "body": "Fred Phelps is a guy I'd cockpunch in a cocaine heartbeat.   What a dick. \r\n\r\nAnd it takes a lot to piss ME off...",
      "created_at": "2007-01-18T03:01:31.000Z"
    },
    {
      "author": "Cosmik",
      "body": "You haven't REALLY been protested until Fred Phelps and his ilk show up.  Not that they would.  They've threatened several times (the most recent time I can remember being the VCT's production of The Laramie Project) but the never actually show.  Bastards.",
      "created_at": "2007-01-18T02:41:12.000Z"
    },
    {
      "author": "jhawk",
      "body": "I bet when word gets around that \"Fuck\" is playing, <em>someone </em>will protest. \r\n\r\nHow do you get <em>that </em>word around, though? (Minus the numerous times I append it to my everyday speech directed at SGF drivers)",
      "created_at": "2006-11-29T18:58:40.000Z"
    },
    {
      "author": "cynicalheretic",
      "body": "We should invite Ann, I bet the Moxie could get a big boon from all of the advertising she would do for us on Fox News -- the truely greatest news station on earth...    Anyway back to reality, I have been here in springfield for 4 months and have yet to make it to the Moxie.  I am making my first official visit this weekend!!! YAY   Actually i never heard of the place until 5 days ago.",
      "created_at": "2006-11-29T10:47:12.000Z"
    },
    {
      "author": "tim",
      "body": "<blockquote><cite> We'll be replacing all the chairs on the 20th and 21st of December, installing a new menu board around the same time</blockquote>\r\n\r\nThis could be the forum party! we could help install stuff! or at least unwrap it, or something, i can break down cardboard boxes... if you guys need a hand i can be free labor for a day, well, kind of free, my price for hire tends to be a giant cookie and a coffee, OBO.",
      "created_at": "2006-11-29T09:48:01.000Z"
    },
    {
      "author": "nate",
      "body": "Awesome.",
      "created_at": "2006-11-29T06:56:52.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Just like the Bible Belt Too Tight ads, Ann Coulter Would Hate Our Theatre.",
      "created_at": "2006-11-29T08:23:54.000Z"
    },
    {
      "author": "dan",
      "body": "<blockquote><cite>Posted By: nate</cite>Interesting.  Have you really heard this kind of feedback?</blockquote>\r\nYes.",
      "created_at": "2006-11-29T06:56:30.000Z"
    },
    {
      "author": "nate",
      "body": "<blockquote><cite>Posted By: dan</cite>The Moxie is still 100% protest-free... despite having been quietly branded as \"that theater that only shows liberal movies.\"\r\n</blockquote>\r\n\r\nInteresting.  Have you really heard this kind of feedback?\r\nI could see how one might get this impression, but I feel that's a result that all the interesting documentaries that take any sort of ideaological stance almost all come from a \"liberal\" viewpoint.  I think there are some interesting documentaries to be made that come from a conservative view, (a <em>legitimate</em> conservative view), such as critiques on free markets and large social programs, how large government spends our money, or the limits of political correctness and the limitations it sometimes puts on free speech.\r\n\r\nThe point is, I think there are plenty of conservative views that deserve the feature length docu-treatment, but I think we have been trained at this point to not expect them.  They are just not getting made.  I find that interesting.",
      "created_at": "2006-11-29T06:55:27.000Z"
    },
    {
      "author": "dan",
      "body": "You have to spend money to make money, right? Right?\r\n\r\n<small>I really should've taken a business class at some point during my 5 years in college</small>",
      "created_at": "2006-11-29T06:52:40.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "bulk tickets..... great idea\r\n\r\nso... from the sound of it.. you guys are making money... good for you!!  \r\n... unless you are just spending money like crazy.. so you can declare bankruptcy... in that case.. for shame!",
      "created_at": "2006-11-29T06:50:59.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
