{
  "id": 469,
  "title": "CLOSED THURSDAY NIGHT!",
  "body": "Due to today's severe Winter weather, which has yet to let up, we will not be opening tonight (Thursday, November 30th). I'd hate to see anyone risk coming out in the current conditions... it's just not worth it. So let it snow and ice all night, and we'll dig out tomorrow.<br/><br/>Have a cozy evening, and we'll see you this weekend!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-12-01T03:34:31.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "El Brian de Moore",
      "body": "<blockquote><cite>Posted By: Megster</cite>and now i sort want pizza which...is ridiculous at ths hour...</blockquote>dominos on cherry is open till 3am.. .... uhm.. but its 4am now.... twas a long night for me",
      "created_at": "2006-12-02T15:03:00.000Z"
    },
    {
      "author": "Caleb",
      "body": "I always tip 20%, so if your pizza was $10, I would have given a $2 tip. However considering the snow/building, I would have upped it to $3. So Nate, you did good old man.",
      "created_at": "2006-12-02T20:41:38.000Z"
    },
    {
      "author": "Ian",
      "body": "Nate, don't feel bad about the tip you gave.  You're at that age when you start to live in the past, when three dollars was probably extravagent.  When people kept their lawns mown and kids showed respect.<br/><br/>Seriously, tho, Nate, I'd have tipped three and felt good about myself.<br/><br/>Btw I think I've got like a scalp pimple on the back of my head!  Or it's a bite!",
      "created_at": "2006-12-02T12:42:50.000Z"
    },
    {
      "author": "erin",
      "body": "im a terrible tipper i guess.",
      "created_at": "2006-12-02T11:34:11.000Z"
    },
    {
      "author": "Megster",
      "body": "hmmm..well...i hear at haruno on wednesdays after nine thirty...there's an awesome cocktail waitress who loves good tips...<br/><br/>and now i sort want pizza which...is ridiculous at ths hour...<br/><br/>and yea...i would've tipped five too...i'm a ridiculous tipper",
      "created_at": "2006-12-02T11:30:09.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "yeah... i would have tipped five.. if it had been me<br/>not saying anything about your 3 nate.. sorry... 3 is a fine tip<br/>but ive been doing this for over 3 years now.. which is long enough to make me nearly over tip.. most places i go<br/>hell.. ill give the sonic girl 3 bucks.. and she just walks about 15 feet at most... (i usually park close to the door)",
      "created_at": "2006-12-02T11:26:34.000Z"
    },
    {
      "author": "Megster",
      "body": "brian...i would've tipped you more... i'm an insanely good tipper because i have been a waitress off and on for sooooooooooooooooo long...",
      "created_at": "2006-12-02T11:19:03.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "3 was fine.. but if it had been <em>me</em>.. i would have expected 5.. because im so easy on the eyes<br/>... if meg was still working there.. and i delivered to her.. i would have been okay with 3.. because shes a girl",
      "created_at": "2006-12-02T05:07:00.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "oh.. and dan.. i have yet to make good friends with every manager...<br/>so currently i can only swing such a thing.. when certain people are working<br/>at some point it will surely happen",
      "created_at": "2006-12-02T05:08:07.000Z"
    },
    {
      "author": "dan",
      "body": "Brian, the pizza for tickets trade is still available.",
      "created_at": "2006-12-02T04:46:36.000Z"
    },
    {
      "author": "nate",
      "body": "Oh wow.  Three on ten wasn't enough?  I'm a former waiter!  I'm good with these things!",
      "created_at": "2006-12-02T04:54:04.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "yeah... and you tipped him three bucks (i know stuff) i would have upped it to four.. because of the elevator.. wtf nate!?<br/>and yes.. i am \"open and stuff\"  as well as i like to be stalked<br/>youre probably only the 3rd person thats called me because of facebook that didnt have my number previously",
      "created_at": "2006-12-02T04:31:48.000Z"
    },
    {
      "author": "nicole",
      "body": "mmm, pizza.",
      "created_at": "2006-12-01T23:03:31.000Z"
    },
    {
      "author": "erin",
      "body": "mmm pizza and milk.",
      "created_at": "2006-12-01T23:54:19.000Z"
    },
    {
      "author": "Ian",
      "body": "But don't call them and ask Brian to come to your office!  Crazy fool!",
      "created_at": "2006-12-01T22:58:07.000Z"
    },
    {
      "author": "Ian",
      "body": "314-229-6794 is Brian's celldog.",
      "created_at": "2006-12-01T22:58:40.000Z"
    },
    {
      "author": "nate",
      "body": "Too late.  I already did.  And she said she would try but couldn't make promises.  Then I called Brian on his cell by checking his Facebook, because he seemed like the type that would put his number on there - you know, very open and stuff.<br/>None of it mattered:  The pizza just arrived, and it was not carried by Brian.  Nor was it a hot girl, which I told Brian would be the only acceptable substitute.<br/>I thought about not even tipping the guy, but then I reconsidered.  It's not <em>his</em> fault for not being Brian <em>or</em> a hot girl.",
      "created_at": "2006-12-01T23:01:45.000Z"
    },
    {
      "author": "nate",
      "body": "Who do you deliver for again, Brian?",
      "created_at": "2006-12-01T21:08:07.000Z"
    },
    {
      "author": "Ian",
      "body": "I know Brian's at work now, so unless he delivers near his home and stops in to visit the Internet (which he does with frightening regularity), he'll be unable to answer you, Nate.<br/><br/>He delivers for Domino's, the one on National and Cherry.  831-1110.  I've got it memorized.",
      "created_at": "2006-12-01T22:57:46.000Z"
    },
    {
      "author": "erin",
      "body": "i hope she wasnt talking about \"drinking apple pie.\"<br/><br/>megster... you wouldnt dare promote drunken pizza delevery.",
      "created_at": "2006-12-01T20:39:38.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "i want some apple pie!<br/>im delivering again today... starting in about 30 minutes.. on through the night<br/>someone call me with an address",
      "created_at": "2006-12-01T21:06:59.000Z"
    },
    {
      "author": "Ian",
      "body": "RJ, one point.",
      "created_at": "2006-12-01T12:00:35.000Z"
    },
    {
      "author": "nate",
      "body": "<blockquote><cite>Posted By: Megster</cite>brian... that sucks. better luck next time with your lady friend...and if you're delivering near phelps grove park, come in for some apple pie</blockquote><br/><br/>This gives me a warm fuzzy feeling - the idea that you can be out working, driving around, and be able to stop randomly at a friend's house because you happened to be nearby and be fed pie.  It's like a Frank Capra movie.",
      "created_at": "2006-12-01T20:33:54.000Z"
    },
    {
      "author": "Master RJ",
      "body": "<blockquote><cite>Posted By: El Brian de Moore</cite>i made 34 deliveries during this \"cozy evening\" ......... i wasnt even scheduled to work tonight<br/><br/>.... suck</blockquote><br/><br/>Sorry, Dante. I hope Randall can keep you company.",
      "created_at": "2006-12-01T11:36:03.000Z"
    },
    {
      "author": "Megster",
      "body": "brian... that sucks.  better luck next time with your lady friend...and if you're delivering near phelps grove park, come in for some apple pie",
      "created_at": "2006-12-01T09:38:47.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "i made 34 deliveries during this \"cozy evening\"  ......... i wasnt even scheduled to work tonight<br/><br/>.... suck",
      "created_at": "2006-12-01T09:29:42.000Z"
    },
    {
      "author": "jhawk",
      "body": "YOU!   You made this weather, didn't you, Nicole to get three nights off!!?? :) <br/><br/>Seriously, I DO worry about everyone else's horrible driving.  I think most people know my stance on SGF drivers.  ;) <br/><br/>Drive safe and we'll catch you guys this weekend some time...",
      "created_at": "2006-12-01T03:55:10.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Break in!",
      "created_at": "2006-12-01T03:51:32.000Z"
    },
    {
      "author": "nicole",
      "body": "That means I have THREE nights off in a row. What have I done to deserve such great luck?",
      "created_at": "2006-12-01T03:52:35.000Z"
    },
    {
      "author": "dan",
      "body": "Sorry Jeff. I'm sure you could've expertly handled the drive here, but I didn't want other, less-experienced drivers to tempt fate. There's still plenty of time to see it.<br/><br/>Downtown is really eerie right now... all the businesses are slowing closing down, one by one.",
      "created_at": "2006-12-01T03:45:21.000Z"
    },
    {
      "author": "jhawk",
      "body": "Dammit.  The perfect storm (so to speak) of weather, boredom, Metacritic and Moxie Forum members, and my excellent driving skillz led to the <em>perfectly </em>planned night... <br/><br/>*shakes tiny fist at the sky* <br/><br/>:(",
      "created_at": "2006-12-01T03:43:17.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
