{
  "id": 47,
  "title": "Revelation, Number One",
  "body": "<center><img src=\"http://moxie.danchilton.com/pix/grum/76_moxie.gif\"></center><br/>Thar she blows! The Moxie's NEW official logo, designed and submitted by the talented <a href=\"http://www.morawk.com/aaron\" target=\"_blank\">Aaron Scott</a>. Utilizing a typeface from the late 19th century (Victorian/Realist era), Aaron's logo reflects the simple, clean, fun, semi-whimsical, psuedo-retro spunk that is <b>THE MOXIE</b>. For his efforts, Aaron is receiving a GMail invite AND a $50 gift certificate to the website of his choice, as well as having his logo prominently featured at the top of the sidebar. I think the final decision came down to scalability, which Aaron's logo has in spades. It's as easy to visualize on the big screen as it is on letterhead, a plastic cup, or a T-Shirt.<br/><br/>I'd like to again thank everyone who took the time to submit a logo... without you, we wouldn't have received any submissions at all. As you can see by the title of this post, another revelation is coming down the pike. What ever could it be? The true location of Midwestburg? Dan's waist size? The true location of Dan's hat (I bet you saw that one coming a mile off)? You'll just have to wait and read!<br/><br/>By the way, I apologize for the extended break between this post and the last one... last week was a hectic one, to say the least. My parents had to bring my aunt to St. Louis to have an emergency valve expansion procedure performed on her heart. Fortunately, my aunt's operation went off without a hitch and she's now recouping back at home, but I had to push back my intended week of business plan revising to this week. So, as usual, I'll keep everyone posted to new updates, of which there have been a few, but more on that later.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-08-16T19:58:00.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Stephanie",
      "body": "When the T-shirts are available, let me know...I'll get them for the whole family!<br/><br/>Good logo, too.",
      "created_at": "2004-08-16T21:44:30.000Z"
    },
    {
      "author": "bjork24",
      "body": "You got it, Steph.",
      "created_at": "2004-08-16T22:06:06.000Z"
    },
    {
      "author": "Fyse",
      "body": "Er, the layout's not looking too hot, Dan. Maybe it's just my browser, but what's the sidebar up to? Looks like a missing &lt;/div&gt; to me.<br/><br/>Very cool logo, and it makes me so glad I resisted the temptation to whip one up myself. Bring on the merchandise!",
      "created_at": "2004-08-17T00:25:21.000Z"
    },
    {
      "author": "Fyse",
      "body": "Or maybe it isn't a missing &lt;/div&gt;. Hell, I don't know what I'm talking about...",
      "created_at": "2004-08-17T00:30:21.000Z"
    },
    {
      "author": "bjork24",
      "body": "Fyse, what browser/OS are you using?",
      "created_at": "2004-08-17T00:39:59.000Z"
    },
    {
      "author": "Tim",
      "body": "Very nice logo indeed!",
      "created_at": "2004-08-17T00:39:59.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Tim!",
      "created_at": "2004-08-17T00:46:37.000Z"
    },
    {
      "author": "whitty",
      "body": "yeah, the sidebar is sitting down at the bottom of the page for me, too.",
      "created_at": "2004-08-17T01:25:08.000Z"
    },
    {
      "author": "Fyse",
      "body": "I'm using XP Pro and Internet Explorer 6.0, so should be fully CSS-P compatible.",
      "created_at": "2004-08-17T01:51:35.000Z"
    },
    {
      "author": "Fyse",
      "body": "This might be your problem...<br/><br/>#right {<br/>\tfloat: left;<br/>\twidth: 240px;<br/>\tpadding-left: 20px;<br/>}<br/><br/>Should it read 'float: right;' ?",
      "created_at": "2004-08-17T01:55:38.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ah ha! It's the little logo I put over in the sidebar. It was a few pixels too large, so IE automatically dropped the sidebar down to the bottom. It should be fixed now. Ironically, IE 6.0 parses CSS incorrectly, which is why so many designers have to utilize the box hack method to make their &lt;div&gt;s act correctly.",
      "created_at": "2004-08-17T04:03:14.000Z"
    },
    {
      "author": "Fyse",
      "body": "I knew if I posted my own diagnosis I'd wind up looking foolish. I've used CSS-P in my blog, but in rather a half-arsed way, and I clearly have a lot still to learn. I'll have to have another look at your source code and style sheets. I'm intrigued by what exactly the 'box hack method' is.<br/><br/>Oh, and I can now see your layout in its former glory, perfectly proportioned logo and everything.",
      "created_at": "2004-08-17T04:17:23.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "I'm glad everyone is digging the logo! I for one am incredibly excited about the new theatre, and I hope I can do more to help Dan and Nicole make it happen.",
      "created_at": "2004-08-17T05:05:51.000Z"
    },
    {
      "author": "bjork24",
      "body": "Aaron, we're still short about 75 grand. Could you help us out with that? Ha ha, just kidding... maybe. Thanks again for the great logo!",
      "created_at": "2004-08-17T05:49:58.000Z"
    },
    {
      "author": "Oz",
      "body": "Hey Dan, the logo rocks!  Seriously, print up about 10 of 'em on T-shirts, mark 'em up 25%, and try to sell them here.  I promise to buy one.  If you only make 10, you won't be out much if I'm the only one to buy.  If you sell all 10, maybe you've got a way to drum up that 75 thou.....over the next 30 years, of course, but you'd be moving in the right direction.",
      "created_at": "2004-08-17T06:31:44.000Z"
    },
    {
      "author": "bjork24",
      "body": "Maybe you, and the others who mentioned T-Shirts, are on to something... hmmm.",
      "created_at": "2004-08-17T06:43:08.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "LOVE the logo! And sign me up for a t-shirt. Seriously.",
      "created_at": "2004-08-17T08:58:19.000Z"
    },
    {
      "author": "sandra",
      "body": "love the logo...i think i like it better than mine!  Do you know about cafepress.com?  I've never used them but thinking about it.",
      "created_at": "2004-08-17T09:56:45.000Z"
    },
    {
      "author": "whittler",
      "body": "Get foxy at the Moxie!<br/>In detox? Hit the Mox!<br/>Why go poxy, when you can go Moxie?<br/>You be my proxy, while I'm at the Moxie!<br/><br/>Marketing genius! Absolute gold!",
      "created_at": "2004-08-17T10:17:52.000Z"
    },
    {
      "author": "einahpets",
      "body": "Wait, I know where Midwestburg is! Isn't it in...",
      "created_at": "2004-08-17T16:23:02.000Z"
    },
    {
      "author": "justin",
      "body": "use CafePress.com to print some shirts right now. RIGHT NOW.",
      "created_at": "2004-08-17T20:42:46.000Z"
    },
    {
      "author": "Chuck",
      "body": "Excellent design. Simple, yet fun.",
      "created_at": "2004-08-18T14:02:23.000Z"
    },
    {
      "author": "ChuckJ",
      "body": "I liked that logo immediately when Aaron submitted.  Great design and great selection!<br/><br/>Best,<br/><br/>Chuck",
      "created_at": "2004-08-19T13:23:45.000Z"
    },
    {
      "author": "Amy",
      "body": "I love the logo! Simple yet strong and powerful. I love how the \"the\" is on the side. The merchandise looks good too.",
      "created_at": "2004-08-20T01:59:40.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
