{
  "id": 474,
  "title": "The last post of 2006",
  "body": "Hello again. Sorry for the delay between posts, but for the last two weeks we've been busier than a bunch of beavers in a chopstick factory. Switching the old chairs with the ones from the Landers ended up taking five days, when we thought we could get it done in TWO. Turns out there were three different chair sizes, which meant we had to reorganize the entire stock, and carefully lay out each row to optimize the space. In the end we ended up gaining a seat (76 baby!), and we should be able to add cup-holders in the very near future. I can't even begin to tell you how much better these seats are than the last ones. You'll just have to come in and try them out for yourself. A big THANK YOU goes out to my dad, who, as usual, loaned his hard labor and skillful expertise in getting the new chairs in. Thanks Dan1!<br/><br/>I still haven't had time to hang up our new chalk menu board, which is currently just sitting in the back, mocking me every chance it gets. Maybe I can get that done tomorrow morning... or Monday... or soon. Also of note, we paid for our new neon sign on Friday - hooray for last minute business expenditures to help lower our taxes! - which means the front of our building will be sporting some super swell signage come mid-January.<br/><br/>I imagine this will be the last post of 2006, which means the next one will mark the fourth year to have seen a blog post.... 2004, 2005, 2006, and, coming soon, 2007. I typically don't do the whole \"new year's resolution\" thing, but my 2006 resolution was to have a real resolution for 2007, which means I'm going to try and be more organized this upcoming year. I'm joining the GTD cult in hopes of streamlining my schedule to the point where I can find more time to write... aside from the blog, the forum, and the 10 billion spam e-mails I send each day. I'm not exactly sure what I'm going to write at this stage, but I'd like to get back in the groove of spitting out a few thousand words per day. That might mean an increase in blog activity, but it could just as easily mean I scale back even more on the blog so I can focus on writing outside of my comfortable \"all things Moxie\" genre. I guess we'll just have to wait and see.<br/><br/>So, until then, I hope everyone has a safe and happy new year, and we'll look forward to seeing you at The Moxie in 2007.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2006-12-31T02:20:04.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brad",
      "body": "damn!<br/><br/>1 point for nate.",
      "created_at": "2007-01-06T07:03:26.000Z"
    },
    {
      "author": "nate",
      "body": "<em>Off topic!</em>  Your post mentioned 2007.",
      "created_at": "2007-01-06T03:09:33.000Z"
    },
    {
      "author": "brad",
      "body": "last means there are no more. posts in 2006. because it is now 2007. hence, no more posts in 2006.",
      "created_at": "2007-01-06T03:05:07.000Z"
    },
    {
      "author": "nate",
      "body": "<em>Lastpostof2006!!</em> Yeah!",
      "created_at": "2007-01-06T01:56:55.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Yeah... YEAH! That was Ian's nickname back at camp! Hahahahahahahahahahahahahahaheheheeeeh. Frat fart. AWESOME.",
      "created_at": "2007-01-02T09:56:49.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "if i recall correctly.... the blog posts were to be moderated as well... not quite as much as some of the other categories<br/>but... i think we are all in fear of being <em>too witty</em> in this category... thus the lack of comments",
      "created_at": "2007-01-06T01:47:56.000Z"
    },
    {
      "author": "Ian",
      "body": "Fart factory!",
      "created_at": "2007-01-02T05:36:17.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Witty? What do ya mean? Like... FART?",
      "created_at": "2007-01-01T02:03:47.000Z"
    },
    {
      "author": "Maddy",
      "body": "What is this?  This post has been up for four hours, and no one has responded yet?  What the hell am I supposed to read if you all don't do your part and keep me entertained with your witty antics?",
      "created_at": "2006-12-31T07:15:58.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
