{
  "id": 475,
  "title": "This is the first post of 2007",
  "body": "And it's not nearly as exciting as the title would have you think. I just want to make note of three things, and then I'll let you get back to whatever it is that you were just doing... right before you starting reading this.\r\n\r\nFirst, I'm making it my goal in 2007 to write one blog post per week. Nothing less, nothing more (well, maybe more, but don't hold your breath). If all goes according to plan, you can expect a new post every Monday, unless, of course, I'm in the hospital, on a cruise, or away from my computer for any other reason. My hope is that this new schedule will allow me to get back into the routine of writing regularly, and spur me to create bigger, better, and more engaging posts. After doing this for nearly three years now, I have to continually find ways to keep things sexy, or else it just feels like a chore.\r\n\r\nI can't think of any other way to relate that feeling.\r\n\r\nSecondly, COPYING BEETHOVEN has been the hit surprise of January. I've said it once, and I'll say it again, never underestimate the power of Ed Harris with hair extensions. The man is like a babe magnet for the 55 and over crowd. Imagine a movie with Ed Harris, Tommy Lee Jones, Judy Dench, AND Maggie Smith! It would be like... I don't know what, but it would be <i>something</i>.\r\n\r\nFinally, The Moxie is the featured business in this week's edition of the Springfield Business Journal, so make sure you pick one up when you get a chance. I'd paste the article here, but I got in trouble last time I did that, so it would be best, for the time being, for you to seek out an SBJ of your own.\r\n\r\nAnd that's it for today. The first post of 2007, on the second Monday of 2007. Hmm, looks like I'm going to have to throw in an extra post to make up for the lost day back on the first. Make sure to tune in next week for a nice big article about everyone's favorite new downtown development: College Station.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-01-09T09:09:19.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "drm00se",
      "body": "Oddly enough, I started receiving the Springfield Business Journal at my dorm room a few weeks ago by what must have been an error in their system or something. I've been throwing them out because I'm an apathetic young whippersnapper (wow, spell check recognized that word, lol), but I just pulled out the most recent one and read it. I'm glad it doesn't make you look stupid.\r\n\r\nBecause you're not.",
      "created_at": "2007-01-10T03:10:46.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Jerry Jacob's back?!",
      "created_at": "2007-01-10T03:02:23.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Grant?",
      "created_at": "2007-01-10T00:51:24.000Z"
    },
    {
      "author": "dan",
      "body": "Thanks Steve!",
      "created_at": "2007-01-09T22:56:13.000Z"
    },
    {
      "author": "Ole",
      "body": "The SBJ article is a full page and well done.  I especially like the photo by Aaron, who captures our favorite movie theatre owners enjoying their new seats and the interview.  Classic.",
      "created_at": "2007-01-09T22:50:19.000Z"
    },
    {
      "author": "nicole",
      "body": "My goal in 2007: See more movies! Yeah!",
      "created_at": "2007-01-09T09:42:52.000Z"
    },
    {
      "author": "nicole",
      "body": "You're forgetting there is a difference between blog posts and forum posts.\r\n\r\nTHis is a WHISPER. You don't need to reply back.",
      "created_at": "2007-01-09T09:42:10.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "\"Cool, Tommy Lee Jones and Judi Dench. (Note: I'm guessing you decided not to show Keeping Mum? It would have been hilarious.)\r\n\r\nActually, I made the first post of 2007, but I'm not complaining.\"\r\n\r\nYes, you are. Twice, in fact! Alright, bra!",
      "created_at": "2007-01-09T09:35:25.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Cool, Tommy Lee Jones and Judi Dench. (Note: I'm guessing you decided not to show Keeping Mum? It would have been hilarious.)\r\n\r\nActually, I made the first post of 2007, but I'm not complaining.",
      "created_at": "2007-01-09T09:30:52.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
