{
  "id": 477,
  "title": "The coming of College Station",
  "body": "Ever since the College Station development broke ground about a month ago, people have been voicing their concern over the fate of The Moxie. We've <a href=\"http://www.moxiecinema.com/forum/comments.php?DiscussionID=647\" class=\"broken\">discussed it at length on the forum</a>, and it's been popping up more and more in discussions with customers and other downtown business owners, which is why I thought it would be a good time to bring the issue to the forefront (a.k.a. the blog).\r\n\r\nFor those of you who aren't from Springfield, and might not know what I'm talking about, College Station is a new downtown development that is being built a block and a half North of The Moxie. When completed, the complex will offer tens of thousands of leasable square footage to lure more businesses to downtown Springfield. The anchor of College Station will be a fourteen (14!!!) screen Hollywood Theaters' multiplex, which I wrote about a <a href=\"/post/60\">long, long time ago</a>.\r\n\r\nOver the years, the development has been caught up in various stages of limbo, but since the ground was ceremoniously broken in mid-December, they've been moving lickity-split... announcing an opening date for the theater of February 2008. So, what does this mean for The Moxie? The answer, of course, is \"I don't know.\" No one knows, but that hasn't stopped certain people (including some reporters) from asking us very pointed questions about our future.\r\n\r\nAre we worried about College Station? Of course we are! No self-respecting small business would want a giant competitor to move in right next to their store. It may be true that we're going after different movies, and appealing to different audiences, but butts are butts, and both of our seats will need to be filled if either business is going to survive. So, let's prognosticate a bit and see what we can come up with:\r\n\r\nWe'll start with the worst-case scenario and move our way up. Let's imagine it's late Summer, 2008. There are five or six huge Hollywood blockbusters on the horizon, as well as one crossover indie flick that's wowing audiences and critics alike. Campbell 16 and Hollywood immediately go head-to-head for the big fish, and Hollywood comes up empty-handed. Campbell is an aggressive booker, and has proven, time and again, their dominance in the Springfield market.\r\n\r\nSo, what's Hollywood to do? They scan the market, and pick whatever looks fresh, including the little crossover indie flick that had MOXIE written all over it. We, however, are left with the smallest of the small films... the ones that audiences have proven, time and again, they simply won't show up for. Now, you may be thinking, why can't The Moxie play the bigger films along with Hollywood and Campbell, and let the audiences decide which theater they want to watch it in? Well, unfortunately for us, distribution doesn't work like that. If it did, I'd gladly go to head-to-head with the multiplexes. We have a growing, core audience of Moxie fanatics who I have no doubt would forego stadium seating, rocking chairs, and movable armrests to watch a movie in our cozy little theater... but they're rarely given the opportunity to choose between us and them. That's just the way distribution works. In a situation like this, you can see how it wouldn't take long for the inevitable to set in. Tiny niche films fulfill our mission, but if we want to continue showing those, we need the occasional crossover hits to pay the bills.\r\n\r\nNow, let's look on the brighter side of things. First of all, Hollywood Theaters is owned by Wallace Theater Holdings, a big corporation, as tends to be the case with most businesses whose name ends with the word \"holdings.\" Although many people might think they're evil, one thing that corporations are NOT is stupid. They're run by armies of intelligent people who dress much nicer, and have much better health insurance than Nicole or I COMBINED! I mean, do you really think a big corporation, with its battalion of high-end executives, would invest millions of dollars opening a new multiplex if they hadn't already done an extensive competition analysis? And do you really, in the deepest depth of your heart, believe that the same corporation, with its regiment of pencil pushers, would commit to a project that would put them at a disadvantage to the biggest competitor in town? Of course not!\r\n\r\nWallace realizes that for them to be able to fill fourteen auditoriums with hundreds upon hundreds of derrieres each and every night, that they must be outside of an imaginary radius around Campbell 16 (drawn, of course, by the distributors to create competitive situations). There's no if, ands, or buts about it. Hollywood can't sustain a 14 screen theater on Campbell's sloppy seconds, and knowing this helps me sleep a little better at night. They know it, I know it, and now you know it.\r\n\r\nCorporate geniuses or no, we're not going to allow ourselves to believe that Hollywood is simply going to overlook us and focus on films that we couldn't get in the first place. We're going to proceed in much the same way as any small business would in the face of incoming competition: whining on the blog, sabotage, and an eventual pilfering of the coffers followed by a quick getaway to the Cayman islands. Ha ha! I kid! I kid! 2007 is going to be a big year for The Moxie! We're going to expand on our mission of bringing quality film to Springfield, continue collaborating with local businesses to create even more unique movie-going experiences, and do a whole bunch of other stuff that we haven't even thought of yet.\r\n\r\nHow many times have the entrepreneurial among you daydreamed of heading a small, locally-owned business in the shadow of an evil, greedy corporation? It's not really the case here, but I like to think it is... on occasion. I also like to imagine Nicole and I are Eskimos when our heat and power goes out for 36 hours straight... if you catch my drift.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-01-16T10:31:22.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Master RJ",
      "body": "AMC has morning discount shows, so they're cool in my book. I visited the Barrywoods in 1999 and it was a paradise in my little nine-year-mind. And they had poster dislays with posters unlike Campbell 16 though they're improving with posters.",
      "created_at": "2007-02-09T21:18:26.000Z"
    },
    {
      "author": "johnb",
      "body": "Dan, one of those \"reporters\" here.  The Community Free Press is dedicated to \"Community\" and that includes the Moxie. Anything I can do and anytime you need me to do it--just call. Springfield has needed the Moxie for years and now that it is here it would be a sin to see it go. Ain't gonna happen my friend--not as long as I have the public's ear (or eye as it might be). The way I see it--Moxie good!  Hollywood, who knows? Look at your audience. Do they look mainstream? Thank God for the Moxie. We finally have somewhere to go and fit in.  I don't mind watching a few commercials while I  wait for the movie to start, but personally, I would rather have a beer.  Hang in there buddy, Springfield's real people need you.",
      "created_at": "2007-02-09T20:40:08.000Z"
    },
    {
      "author": "Cosmik",
      "body": "I remember as recently as 5 years ago wishing and praying an AMC would open in Springfield.  Before Home Depot, I had a one-man campaign to get AMC to build a multiplex on that site.  (I still think it was a great idea.)  AMC had big, clean, comfortable, way cool theatres (as multiplexes go) with great audio and video.  I would routinely drive to KC or Tulsa to see the Oscar-nominated films that came through there.  Now, we have the Moxie, and I wouldn't have it any other way.  \r\n\r\n(Since, by reading this forum, I know I'm not the ONLY one who made entire weekend road trips out of seeing films at the Landmark, the Tiv, or other art houses in STL or KC, I now wonder if those guys miss us.)  :)",
      "created_at": "2007-02-05T00:26:50.000Z"
    },
    {
      "author": "evilvet",
      "body": "I see a Gremlin parked every now and then, and an occasional Pacer, but...\r\nI still don't think that anyone could touch you and the experience (beer) you have to offer (beer) in the art/indie moviehouse game.  People's tastes are complex.  People will walk by a barber shop charging 10 bucks for a haircut to go to get the same one at a place they enjoy and feel more comfortable in and pay a hundred bucks for it.  Same goes for hamburgers, or a bar.  A cineplex playing an art movie doesn't make it an art house.  Your theatre will never need to have a sign up that says, \"Caution:  This movie doesn't talk to you in English.  Reading required.\" Keep workin' it.",
      "created_at": "2007-02-04T23:22:16.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: Cosmik</cite>Kansas City-based AMC Theatres, the No. 2 U.S. movie chain after Regal Theaters, said today (Tuesday) that it plans to set aside 72 screens in 39 U.S. cities to show traditional art-house fare. The exhibitor said that it planned to introduce independent and foreign film fare under a program dubbed \"AMC Select.\" Initial films under the program are due to debut this weekend, including the Al Gore global-warming documentary An Inconvenient Truth and Robert Altman's A Prairie Home Companion. In an interview with today's Los Angeles Times, AMC CEO Peter Brown said, \"We are constantly thinking about how we can get more people to come to the theaters,\" Brown said. \"This is realizing the promise of the megaplex -- we are broadening out the depth and breadth of the [movies] available.\" The move puts AMC in direct competition with Mark Cuban's Landmark Theatres, which operates 57 theaters with 213 screens, making it the nation's largest art-house chain.</blockquote>\r\n\r\nIsn't Epic Movie art-fare enough for them?\r\n\r\n\r\n\r\n<blockquote><cite>Posted By: dan</cite>This is why we're happy we don't have an AMC in town.</blockquote>\r\n\r\nI would have to agree with you, Dan.  Although...they did have stadium seating before everyone else...and that cool MovieWatchers program...which became obsolete to me when several friends begain working at AMC...and I got free passes.  They are the chain back home, and although they are very clean, very nice theatres...they recently devoured Loew's...one of the oldest movie chains....and are hungry for more.",
      "created_at": "2007-02-04T23:21:43.000Z"
    },
    {
      "author": "dan",
      "body": "This is why we're happy we don't have an AMC in town.",
      "created_at": "2007-02-04T22:44:15.000Z"
    },
    {
      "author": "Cosmik",
      "body": "Today I happened across this interesting news item from last spring.  While I'm not too directly concerned (yet), it speaks to an interesting possible trend, and may shed some light on the C16 and CS14 debates here.\r\n\r\n\"Art\" Films Coming to the Megaplex\r\nTue, May 02 2006, 3:48 PM\r\nby from imdb.com\r\n\r\nKansas City-based AMC Theatres, the No. 2 U.S. movie chain after Regal Theaters, said today (Tuesday) that it plans to set aside 72 screens in 39 U.S. cities to show traditional art-house fare. The exhibitor said that it planned to introduce independent and foreign film fare under a program dubbed \"AMC Select.\" Initial films under the program are due to debut this weekend, including the Al Gore global-warming documentary An Inconvenient Truth and Robert Altman's A Prairie Home Companion. In an interview with today's Los Angeles Times, AMC CEO Peter Brown said, \"We are constantly thinking about how we can get more people to come to the theaters,\" Brown said. \"This is realizing the promise of the megaplex -- we are broadening out the depth and breadth of the [movies] available.\" The move puts AMC in direct competition with Mark Cuban's Landmark Theatres, which operates 57 theaters with 213 screens, making it the nation's largest art-house chain.",
      "created_at": "2007-02-04T22:18:21.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "I will pay money for caleb's punch also. Oh my godfather, I'm so thirsty right now!",
      "created_at": "2007-01-25T08:18:25.000Z"
    },
    {
      "author": "brad",
      "body": "nice 47 ronin reference! shit, now i have to go pop in that dvd...",
      "created_at": "2007-01-25T07:43:11.000Z"
    },
    {
      "author": "FaultyGoblin",
      "body": "RJ that's like asking what if the earth falls out of geosynchronous orbit and hurdles towards the sun... could it happen.. in theory yes... but is it likely anytime soon... no...",
      "created_at": "2007-01-25T07:34:11.000Z"
    },
    {
      "author": "Master RJ",
      "body": "But what if Dick Clark dies?",
      "created_at": "2007-01-25T07:28:36.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: FaultyGoblin</cite>Continued involvement in the community, acting as a showcase for local film makers, and frankly keeping your customers from emulating the 47 ronin and you can probably ride out the storm.</blockquote>\r\n\r\nProps?",
      "created_at": "2007-01-25T07:29:56.000Z"
    },
    {
      "author": "FaultyGoblin",
      "body": "Hmm. Well the moxie has the advantage of having roots among the community,\r\nlocal events such as SATO48, Short competitions, and having patrons among the art community means there will be a niche of fiercly loyal customers so long as \r\nsome napoleonic level blunder is avoided.. (It is never a good idea to invade Russia, so Dan you call for that and well yeah...)\r\n\r\nI think Campbell 16 could use with a little headache, and if they get into a protracted struggle drawing customers from each other in some wagnerian popcorn price slashing operatic fashion all the better. I'd much rather pop downtown to see a movie at a generic place, then face rude general managers and blatant price gouging miles down Campbell.\r\n\r\nAs for trader joe's I'm in St. Louis at least five times a semester so I get my supplies as often as needed, though I miss Vivanos on the Hill and dream of containers of cheeses, and italian meats falling from the heavens to save me from what passes for deli food here.\r\n\r\nI think the small indies being picked up might increase in the short term, but in the long run its the explosive laden, top heavy, effects buffets that draw in the generic plex customers. That or romantic comedies.. If I ever have to go to another romantic comedy that isn't Shakespeare ever again... \r\nFox searchlight, Sony Pictures Classics, etc. may keep the movies in the buzz in the theatres but giant companies are beasts comprised in large measure by market research, fear of litigation, and bloated salaries...   The moxie will be able to show films that would be deemed a public relations nightmare in bible belt SouthWest Missoruri, while the multiplex may worry about losing customers in a very broad demographic.  \r\n\r\nMovies like the Puffy Chair, don't have the production value to play in those markets but are perfect for our crowd.\r\n\r\nThe initial impact may be unpleasant as folks who randomly wander into the moxie may be drawn away at least at first. But the moxie much like Dick Clark won't die..\r\nContinued involvement in the community, acting as a showcase for local film makers, and frankly keeping your customers from emulating the 47 ronin and you can probably ride out the storm.\r\n\r\nYou could always serve Caleb's punch ... I'd pay ... money for that stuff....",
      "created_at": "2007-01-25T07:09:20.000Z"
    },
    {
      "author": "stevie_g",
      "body": "Getting back to the subject at hand...\r\n\r\nDan, I believe in my heart and my mind that The Moxie has nothing to worry about. You fill a unique niche that a multiplex can never touch. It's apples and asian pears. You each have your own seperate market.  People aren't coming to you to see <em>Pirates of the Caribbean</em> or <em>Shrek</em>; they are coming to the Moxie to see <em>Jesus Camp</em> and <em>Transamerica</em>. Take <em>An Inconvenient Truth</em> as your solace - they stayed away in droves at Campbell Suxteen; they filled The Moxie. Whether the multiplex is across town or down the block, the affect on the Moxie will be the same...none.",
      "created_at": "2007-01-24T07:55:53.000Z"
    },
    {
      "author": "nate",
      "body": "That thing about the cheeses just made me a little hot and breathless.",
      "created_at": "2007-01-18T20:34:43.000Z"
    },
    {
      "author": "brad",
      "body": "i often run in on my way home from the bus stop, grab a few chunks of cheese, then leave. thanks, whole foods.",
      "created_at": "2007-01-18T21:43:43.000Z"
    },
    {
      "author": "tim",
      "body": "whole foods hurts me... thier veggie chili is so good! that and thier wonderful selection of cheese, and free samples keep getting me, they refresh the cheese samples around 5p every day so it's nice to try a bunch of cheese and then walk home. I could never buy a vegetable from them however, toooo expensive. We have this place in town, that has the cheepest and largest selection, and everytime i leave with two large bags of veggies and fruit, i feel like i just robbed them... unlike whole foods where i leave feeling robbed. \r\n\r\nuh,\r\n\r\nman, college station blows!!!",
      "created_at": "2007-01-18T20:06:55.000Z"
    },
    {
      "author": "jhawk",
      "body": "I gotta know, now.   What city do you live in, <strong>brad</strong>?   You're in the bizarro opposite world of us where WF is the only choice...",
      "created_at": "2007-01-18T19:04:07.000Z"
    },
    {
      "author": "brad",
      "body": "well that's the only choice where i live. but i literally live next door to a whole foods, and what started off as a quiet rumble of discontent w/ the place, has grown over the past year and a half to pure unabashed disgruntlement. and don't get me wrong, i still go there to get food often, because i'm lazy. it's like when i lived in misery, when i was lazy i'd go to wal mart to grab stuff quickly..now it's whole foods. weirdness. but paying for little things all the time at their prices really gets to you after awhile (not to mention your pocketbook). but every time i'm around 9th ave, i go over to the amish market and buy whatever i can stuff in my bag. damn-nabbit that place is great.",
      "created_at": "2007-01-18T03:16:34.000Z"
    },
    {
      "author": "Cosmik",
      "body": "Figs?  Hah.  Try guava.  I'm with the Hawk.  I'd willingly pay more for what I can get at Whole Foods (and, in fact, frequently do, not to mention the cost of driving to KC or STL.)",
      "created_at": "2007-01-18T02:42:59.000Z"
    },
    {
      "author": "jhawk",
      "body": "Ah.  I see your points.   In a city which had a choice of alternative places to get organic foods, I'd say your arguments are valid.  \r\n\r\n\"Organic\" in Springfield is literally a locally-owned business which sells their eggs (for example) at small stores like Mama Jeans.  There's not much choice to begin with here, so anything that adds to our choices would be good in this market.  \r\n\r\nWhat Whole Foods would offer for Springfield as well are the varied items that would never make it here anyway that local stores can't ship in for cost reasons.  (Ever tried to find figs in Springfield?  Impossible, even in season.)  \r\n\r\nI would pay more for a place that could offer things like this (organic, FTO, etc) and I'm willing to bet there are others as well...",
      "created_at": "2007-01-18T02:28:20.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Brussels sprouts, ick.",
      "created_at": "2007-01-18T00:55:31.000Z"
    },
    {
      "author": "brad",
      "body": "way overpriced, usually bad quality foods. most things that say 'organic' actually are not completely organic (milk, meat, eggs, etc). just a beef i have. you can get much better quality food for much cheaper prices at many other places. plus their delis are the worst of any store i can think of. i take personal offense at this, since i used to work in a deli at a natural market in seattle. whole foods is like the mcdonald's of natural markets. or like the wal-mart, b/c when they move in, all the local stores go out of business. \r\n\r\nso yes, that is why. i simply don't like them. \r\n\r\nand i never react, i always overreact :)",
      "created_at": "2007-01-17T23:18:25.000Z"
    },
    {
      "author": "Cosmik",
      "body": "Yeah, but where else are you gonna get spinach and feta cakes, or maple roasted brussels sprouts, or rosemary pork loin, or any number of other delicious foods... in a DELI?  :)  (You get what you pay for.  In this case, convenience.)  And even with prices as high as they are, didn't Brad overreact just a little?  (I can't wait for the forum party.  We'll end up standing in a doorway, blocking foot traffic, arguing about the relative merits of Whole Foods vis a vis their pricing.)",
      "created_at": "2007-01-17T22:27:25.000Z"
    },
    {
      "author": "dan",
      "body": "I like Whole Food, Jeff, but they're insanely expensive.",
      "created_at": "2007-01-17T22:17:35.000Z"
    },
    {
      "author": "Cosmik",
      "body": "There's an Amish Country Store (not sure if it's the same thing) next to the Shops at Branson Meadows.  Never been there, but friends seem to like it.",
      "created_at": "2007-01-17T22:14:51.000Z"
    },
    {
      "author": "jhawk",
      "body": "<blockquote><cite>Posted By: brad</cite>fuck whole foods! there, i said it. i feel better now.</blockquote>\r\nWhat's with the Whole Foods hate?   As far as I've been able to tell, they're always strongly involved with the communities they're located in, both with their products and with their services.  I've only been to two (STL and PHX) but they seem to have fairly good business practices.   Curious, but what's the reason(s) why you dislike them so much? \r\n\r\nAlso, I'd love to have a Amish Market as well.  We only have limited things when they have our Farmer's Market during season here in SGF.  A year round market might survive here, though I'd bet...",
      "created_at": "2007-01-17T22:11:56.000Z"
    },
    {
      "author": "Cosmik",
      "body": "Wow, Brad, what's your problem with Whole Foods?  Man, I love their stuff.  Is there something I should know?\r\n\r\nWhat college station really needs is a Bamboo Lounge; a dark, cheap lounge with volcanoes and waterfalls and waitresses in grass skirts and cocoanut bras and waiters in board shorts and drinks with umbrellas that have names like \"Suffering Bastard\" and \"Scorpion Bowl\" and appetizers on a pupu platter and karaoke once a week.\r\n\r\nMaybe MSU will extend the shuttle system to this new CS parking garage, so it'll be a shorter walk to the Moxie.  :)",
      "created_at": "2007-01-17T20:57:55.000Z"
    },
    {
      "author": "brad",
      "body": "fuck whole foods! there, i said it. i feel better now.\r\n\r\nthe greatest food store in the entire world is the amish market on 9th ave. holy crap, that is my personal food heaven. puts all of these 'natural market' chains to shame.\r\n\r\nand to keep on topic - i think it will be a good thing for the moxie, and not necessarily a bad thing. it will bring more people in, and once they realize there are 2 different types of theaters, well i think more people will start coming in. won't necessarily be in competition w/ you. not that i know a thing about distribution either..but.. think positively!",
      "created_at": "2007-01-17T20:52:06.000Z"
    },
    {
      "author": "nicole",
      "body": "I'm just bummed that the Trader Joe's rumor got squashed. I was already daydreaming...",
      "created_at": "2007-01-17T05:27:50.000Z"
    },
    {
      "author": "Master RJ",
      "body": "But hey, the Gap WILL return.",
      "created_at": "2007-01-17T07:12:57.000Z"
    },
    {
      "author": "Megster",
      "body": "<blockquote><cite>Posted By: nicole</cite>I'm just bummed that the Trader Joe's rumor got squashed. I was already daydreaming...</blockquote>\r\n\r\noh me too, nicole!! maybe...someday...",
      "created_at": "2007-01-17T20:29:13.000Z"
    },
    {
      "author": "jhawk",
      "body": "Still dreaming of a Whole Foods, though...\r\n\r\n*sigh*",
      "created_at": "2007-01-17T20:42:33.000Z"
    },
    {
      "author": "Cosmik",
      "body": "The Fremont.  THAT'S the one!  Thanks!  Pfew!  :)\r\n\r\nI think the CS14 is primarily targeting the masses of students at Drury, MSU and Central HS, as well as the family audiences that live in midtown or farther north, rather than the southern 'burban (Kickapoo and Glendale) peopes.  I could be wrong.  But not usually.  So probably not this time, either.  ;)",
      "created_at": "2007-01-17T05:14:25.000Z"
    },
    {
      "author": "Master RJ",
      "body": "<blockquote><cite>Posted By: Cosmik</cite>I've also pretty much said everything I have to say in the previous blogs/posts. I won't pretend to know how large theatre chains and/or distributors work, but I can't see any 14-plex trying to subsist on \"sloppy seconds\". First, I think they'd try to run on second-run films, a la the Palace, which is historically what happens to theatres in Springfield. (The Tower? The Town & Country 6? The Petite III? The One Across Battlefield From The Petite III Whose Name I Can't Remember?)\r\n\r\nThe Moxie will thrive by continuing to build its core audience base of discerning film fans who want more than just the latest flash-in-the-pan blockbuster. There. I said it, and I'm glad.</blockquote>\r\n\r\nThat was the Fremont. Great theatre. The Moxie will continue to thrive, especially when College Station opens. There are hundreds of films the Moxie can show and people will show up. The word spread, and a long life shall reign supreme.",
      "created_at": "2007-01-16T22:39:50.000Z"
    },
    {
      "author": "evilvet",
      "body": "I like your business model much better than theirs.  Yours is much more streamlined, lotech and relies on excellent customer service.  My 12 year old daughter went to see the Dixie Chicks movie for her first Moxie viewing the other night and was blown away by the experience.  It was like no other movie experience she has ever had (and no, I didn't feed her any Fat Tires).  College Station will be just like anywhere else in the USA, with the air hockey table in the lobby and the 55-gallon drums of popcorn and soda for $18.  So why drive past those that already exist closer to go to this one?  For instance if you had a Steak and Shake or McDonalds a mile from your house, it would be an exceptional circumstance to motivate you to drive to one 5 miles away to experience essentially the same thing.\r\n\r\nJust as you can get a steak at Shoneys or Ihop, it's nothing like what you get for much more money at Gallery Bistro.  I was at KC and went to a movieplex downtown, it it was nowhere near as crowded as the one I frequented out in the Southern burbs.  It was actually quite deserted.  Are people in this community going to drive down Campbell and Glenstone, past the outlying theatres closer to home to go to College Station?  And if they do, are they going to do anything more than climb right back into their cars and vamoose back to their subdivision?\r\n\r\nThe \"build it and they will come\" strategy may work for something unique like a Cardinals stadium or an arena, but assuming that folks will come downtown for a generic theatre is risky.  Discovery Centers, art districts, great restaurants, theatre, and Moxie-type theatres, those are all things that do well as downtown destinations (especially college towns)because they are unique and therefore worthy of a special trip.\r\n\r\nAs long as Bijeans isn't worried about Ziggies, you shouldn't be worried about College Station.",
      "created_at": "2007-01-16T20:29:26.000Z"
    },
    {
      "author": "Master RJ",
      "body": "I've said it once and I'll say it again, don't worry.",
      "created_at": "2007-01-16T11:52:49.000Z"
    },
    {
      "author": "Cosmik",
      "body": "I've also pretty much said everything I have to say in the previous blogs/posts.  I won't pretend to know how large theatre chains and/or distributors work, but I can't see any 14-plex trying to subsist on \"sloppy seconds\".  First, I think they'd try to run on second-run films, a la the Palace, which is historically what happens to theatres in Springfield.  (The Tower?  The Town & Country 6?  The Petite III?  The One Across Battlefield From The Petite III Whose Name I Can't Remember?)\r\n\r\nThe Moxie will thrive by continuing to build its core audience base of discerning film fans who want more than just the latest flash-in-the-pan blockbuster.  There.  I said it, and I'm glad.",
      "created_at": "2007-01-16T20:26:45.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
