{
  "id": 478,
  "title": "Valentine's Day 2007",
  "body": "After much deliberation and hand wringing, we have decided NOT to continue our tradition of showing films about female genital mutilation on Valentine's Day. I know this might come as a shock to the the four people who came to see MOOLAADE last year on Valentine's Day, but we decided to strike out and try something new. This year for V-Day we will be hosting our second \"Dinner and a Movie\" event at Mille's. The film will be the romantic French classic AMELIE, starring tooth-shattering cutie Audrey Tautou, and dinner and desert will be provided by Mille's... of course.<br/><br/>As was the case with our first \"Dinner and a Movie\" in March of 2006, seating will be limited. Tickets are $50 per couple (includes 2 tickets, dinner, desert, and non-alcoholic drinks), and will go on sale on February 1st. We will NOT be doing online sales for this event, so you will need to swing by the theater to pick up your super special event pass. Again, I apologize to those of you who were looking forward to the next installment in our female genital mutilation series. Keep your hopes up though... there's always next year!<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/012207/amelie.jpg\" width=\"425\" />",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-01-23T09:33:58.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "EdMo",
      "body": "I know a few....",
      "created_at": "2007-02-06T07:08:56.000Z"
    },
    {
      "author": "dan",
      "body": "Too late. The show's all sold out. Now we get to deal with pissed off procrastinators for the next week.",
      "created_at": "2007-02-06T06:43:44.000Z"
    },
    {
      "author": "dan",
      "body": "Maybe we could have a special cage set up for the \"singles.\"",
      "created_at": "2007-02-06T05:08:43.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: dan</cite>Maybe we could have a special cage set up for the \"singles.\"</blockquote><br/><br/>YEAH!  I could go then!",
      "created_at": "2007-02-06T06:28:56.000Z"
    },
    {
      "author": "ingrid",
      "body": "dan, you COULD section off the corner with a big black curtain and reserve those last six seats for single people. ariananana and i and others could crouch in the dark, eating chocolate ice cream without spoons and jealously eying the couples. no one would have to know.<br/>this is my suggestion.",
      "created_at": "2007-02-06T04:39:58.000Z"
    },
    {
      "author": "dan",
      "body": "This event is THREE couples away from being totally sold out.",
      "created_at": "2007-02-06T04:33:42.000Z"
    },
    {
      "author": "ariananana",
      "body": "i had emergency surgery on valentine's day.<br/><br/>i like the whole single persons bit...how about a giant vat of chocolate ice cream? orrr you could just sell pints of ben and jerry's....",
      "created_at": "2007-02-06T03:55:47.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "<blockquote><cite>Posted By: ingrid</cite>brian, i would ask you to go with me platonically, but you might be unable to resist my Special Low-Cut Valentine's Day Shirt charms, and that would make things between us awkward. plus, we would ruin each other's chances of actually meeting someone to sleep with.</blockquote>gomz low cutzx!   .... i would go with you.. but as of yesterday they only had two tickets left... <br/>are those gone yet.. danicole?<br/>im pretty sure if we introduced ourselves to everyone as swingers... we could work something out<br/>okay and *now* i read what ian commented... i think its workable",
      "created_at": "2007-02-05T03:09:48.000Z"
    },
    {
      "author": "Ian",
      "body": "You would go to a couples event to find other people to sleep with?  Use each other to shoehorn into swinging?  That's so crazy it just might work.",
      "created_at": "2007-02-05T02:02:39.000Z"
    },
    {
      "author": "dan",
      "body": "Our first dinner and a movie event was like that. You could buy one ticket and sit alone in the corner, silently crying into your water glass. Only the V-Day event is a per couple ticket. All the others will be the typical per-ticket sales.",
      "created_at": "2007-02-03T01:21:56.000Z"
    },
    {
      "author": "ingrid",
      "body": "brian, i would ask you to go with me platonically, but you might be unable to resist my Special Low-Cut Valentine's Day Shirt charms, and that would make things between us awkward. plus, we would ruin each other's chances of actually meeting someone to sleep with.",
      "created_at": "2007-02-04T21:27:38.000Z"
    },
    {
      "author": "Megster",
      "body": "hmmm. nate... that was a bridget jones reference... interesting...",
      "created_at": "2007-02-02T20:19:23.000Z"
    },
    {
      "author": "nate",
      "body": "I like that idea.<br/><br/>Dan and Nicole will never do it, though.  They're one of <em>them</em>, the couplers, and they have no empathy for single people and their scaly, reptilian skins.",
      "created_at": "2007-02-02T20:12:10.000Z"
    },
    {
      "author": "jeffreyL",
      "body": "So my best gal pal's favorite movie is \"Amelie\" and I tell her about this event.  We get SO excited.  Then we realize it's ON Valentine's Day, and now her boyfriend wants to take her.  The nerve!  Any plans for a Moxie Pitiful Pathetic Single Persons Dinner and a Movie?",
      "created_at": "2007-02-02T17:34:44.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "remember how my parents got divorced on valentines day?<br/>that was fun<br/><br/>.....<br/>... i need a date",
      "created_at": "2007-02-02T14:26:12.000Z"
    },
    {
      "author": "nicole",
      "body": "Still working on it.",
      "created_at": "2007-01-29T07:49:46.000Z"
    },
    {
      "author": "risk2",
      "body": "Whatever happened to the Painted Veil coming to the moxie in feb?",
      "created_at": "2007-01-29T07:41:10.000Z"
    },
    {
      "author": "ariananana",
      "body": "that sounds like a pretty adorable way to celebrate a hallmark event. kudos to something that doesn't involve a teddy-bear stuffed with asbestos from Walgreen's/ shitty chocolate.",
      "created_at": "2007-01-29T03:32:23.000Z"
    },
    {
      "author": "FaultyGoblin",
      "body": "Yeah..... Proof that france needs another invasion... Irreversible... *shudder*<br/>That way Nate will get to study Victory in Europe day mk 2.. (Now with shinier toys)",
      "created_at": "2007-01-27T00:28:25.000Z"
    },
    {
      "author": "Ian",
      "body": "<blockquote><cite>Posted By: tim</cite>you guys should rent irreversible for V-Day... thats totally not awkward.</blockquote><br/><br/>Best Date Movie Evar.<br/><br/>/cry",
      "created_at": "2007-01-26T21:39:46.000Z"
    },
    {
      "author": "Master RJ",
      "body": "V.D. Police, a-comin'!",
      "created_at": "2007-01-26T21:37:52.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Too much World War II!!!!!!!!!!!!!!!",
      "created_at": "2007-01-26T20:50:21.000Z"
    },
    {
      "author": "brad",
      "body": "you mean vd day?",
      "created_at": "2007-01-26T21:29:14.000Z"
    },
    {
      "author": "erin",
      "body": "caleb, caleb, caleb.<br/>lier, lier pants on fire.",
      "created_at": "2007-01-26T18:24:44.000Z"
    },
    {
      "author": "nate",
      "body": "I haaaaate V Day.  Too alone-ish, every year.<br/><br/>Now V-<em>E </em>day, when the Allies declared victory in Europe in May of 1945, <em>that </em>I love.",
      "created_at": "2007-01-26T20:45:16.000Z"
    },
    {
      "author": "tim",
      "body": "you guys should rent irreversible for V-Day... thats totally not awkward.",
      "created_at": "2007-01-26T12:07:22.000Z"
    },
    {
      "author": "Caleb",
      "body": "Erin I would take you out for Valentine's, but for some reason I think that would be incredibly awkward. Unless we were renting porn. Then it would be business as usual.",
      "created_at": "2007-01-26T10:37:03.000Z"
    },
    {
      "author": "erin",
      "body": "well....<br/>i bet my parents will get me a card for valentines.<br/>so i wont be TOTALLY lonely.<br/>with my awesome paper card!!!!!<br/><br/>wooh!",
      "created_at": "2007-01-26T09:51:56.000Z"
    },
    {
      "author": "Ian",
      "body": "jes!  (yes)",
      "created_at": "2007-01-25T07:46:06.000Z"
    },
    {
      "author": "brad",
      "body": "\"Ian, FTW!\"<br/><br/>fits perfectly on my 4 fingers. i point my fists at you ian!",
      "created_at": "2007-01-25T07:44:01.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: jhawk</cite>I'm with everyone who says \"Bah\" to Valentine's day.  Cupid can _____ my ______ .</blockquote><br/><br/>mow my lawn.<br/>eat my sandwich.<br/>learn my lessons.",
      "created_at": "2007-01-25T07:27:48.000Z"
    },
    {
      "author": "jhawk",
      "body": "Sorry.  <strong>F</strong>or <strong>T</strong>he <strong>W</strong>in.",
      "created_at": "2007-01-25T07:26:23.000Z"
    },
    {
      "author": "Ian",
      "body": "frak the what?",
      "created_at": "2007-01-25T07:09:01.000Z"
    },
    {
      "author": "FaultyGoblin",
      "body": "sounds like Enya... <br/>No valentine's day is the easiest and therefore most expensive day of the year to get a date. No one likes being single on Valentine's day, not even priests... after all they have to hear confession.. Did anyone else find the irony of a cupid figure on a day called Saint Valentine's day? No?",
      "created_at": "2007-01-25T07:14:17.000Z"
    },
    {
      "author": "brad",
      "body": "i got that tattooed on my fingers the other day.",
      "created_at": "2007-01-25T07:00:44.000Z"
    },
    {
      "author": "Ian",
      "body": "Have my money.",
      "created_at": "2007-01-25T04:47:35.000Z"
    },
    {
      "author": "jhawk",
      "body": "Ian, FTW!",
      "created_at": "2007-01-25T04:51:24.000Z"
    },
    {
      "author": "brad",
      "body": "eat my sandwich.",
      "created_at": "2007-01-25T03:43:00.000Z"
    },
    {
      "author": "jhawk",
      "body": "I'm with everyone who says \"Bah\" to Valentine's day.  Cupid can _____ my ______ .",
      "created_at": "2007-01-25T02:59:08.000Z"
    },
    {
      "author": "brad",
      "body": "i'm with erin. bah!",
      "created_at": "2007-01-24T23:39:13.000Z"
    },
    {
      "author": "drm00se",
      "body": "The girl I've been dating made plans long ago with her friends for this V-Day, so I'm going to the AFI concert. Otherwise, we'd be doing this.",
      "created_at": "2007-01-24T23:22:39.000Z"
    },
    {
      "author": "dan",
      "body": "7-ish",
      "created_at": "2007-01-24T02:53:56.000Z"
    },
    {
      "author": "Caleb",
      "body": "Coolio! Except less gangsta!",
      "created_at": "2007-01-24T02:59:02.000Z"
    },
    {
      "author": "erin",
      "body": "...............<br/><br/>valentines.<br/>bah!",
      "created_at": "2007-01-24T07:21:47.000Z"
    },
    {
      "author": "Caleb",
      "body": "What time does this thing start by chance?",
      "created_at": "2007-01-24T02:49:26.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Here I am, the hype man of Valentine's Day to save your ass!",
      "created_at": "2007-01-24T02:25:07.000Z"
    },
    {
      "author": "EdMo",
      "body": "Damn, oh damn.  I will miss out on this V-day thing.  I have class. (Breathes a sigh of relief as he has an actual excuse this year for not participating in the day of love).",
      "created_at": "2007-01-24T02:11:39.000Z"
    },
    {
      "author": "brad",
      "body": "yeah d00d! gomz! so ch'awesome! just show it, loop that one scene! people will flock to the theater.",
      "created_at": "2007-01-23T22:35:09.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Or, show Hard Candy again. That movie is so awesome.",
      "created_at": "2007-01-23T22:24:42.000Z"
    },
    {
      "author": "nicole",
      "body": "Dan's only  half right. We'll be doing possibly two FREE showings of \"Until the Violence Stops,\" a documentary to help raise awareness about domestic abuse and beyond. This helps kick off Drury and MSU's productions of The Vagina Monologues. Dates and times will be on the February schedule.<br/><br/>So, for those of you who were looking forward to women's issues (geesh Dan), please don't fret.",
      "created_at": "2007-01-23T22:10:50.000Z"
    },
    {
      "author": "Master RJ",
      "body": "<blockquote><cite>Posted By: jhawk</cite>RJ, you apologize right now for:<br/><br/>1. Kidnapping my date.<br/>2. Making her apologize for her movie.<br/>3. Well...just being you.<br/><br/>I'm waiting.</blockquote><br/><br/>Fudge off. The Da Vinci Code sucked. Now, I'm getting her to sign on to make Terrence Malick's new film.",
      "created_at": "2007-01-23T21:12:48.000Z"
    },
    {
      "author": "Caleb",
      "body": "<blockquote><cite>Posted By: Ian</cite>The problem, Caleb, is finding a date who doesn't look plain after watching AMELIE.</blockquote>Good point.",
      "created_at": "2007-01-23T20:48:48.000Z"
    },
    {
      "author": "jhawk",
      "body": "RJ, you apologize right now for: <br/><br/>1.  Kidnapping my date. <br/>2.  Making her apologize for her movie. <br/>3.  Well...just being you.  <br/><br/>I'm waiting.",
      "created_at": "2007-01-23T20:03:06.000Z"
    },
    {
      "author": "Ian",
      "body": "Classic RJ.  Ergo, minus one.  Innovate.<br/><br/>The problem, Caleb, is finding a date who doesn't look plain after watching AMELIE.",
      "created_at": "2007-01-23T15:00:54.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Just fly to Paris and kidnap her, then make her apologize for The Da Vinci Code.<br/><br/>Now Dan, when does the schedule come out?",
      "created_at": "2007-01-23T12:00:46.000Z"
    },
    {
      "author": "Caleb",
      "body": "Sounds awesome. Now to just find a date...I wonder if Miss Tautou is free?",
      "created_at": "2007-01-23T09:46:03.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
