{
  "id": 479,
  "title": "The Moxie, The Gillioz, and The Landers: Your friendly downtown cinema triumvirate",
  "body": "Over the last year, we've been working and consulting with The Gillioz in hopes of bringing 35mm film back to their gorgeous 1,200 seat movie palace, and I'm proud to finally announce that an agreement has been made between our two theaters. We're currently working on a fundraiser to help kick-start the projector budget, but if all goes as planned, you could start seeing Moxie premieres at The Gillioz as early as this Summer.\r\n\r\nBy premiering our larger films at The Gillioz, we're hoping that we'll be able to impress the distributors enough to give us a little leverage when it comes to booking films. After all, one sold out show at The Gillioz is the equivalent of SIXTEEN sold out shows at The Moxie!!! Needless to say, this is a huge  opportunity for our little theater, and we're extremely grateful The Gillioz has decided to partner with us.\r\n\r\nFor the fundraiser event, we're planning on screening a film called PRESERVE ME A SEAT, which is a documentary following the attempts of several communities to save their town's historic movie theaters from the wrecking ball. I don't think there could be a more perfectly suited film for our kick-off event. I'll keep everyone updated as we work on firming up a date.\r\n\r\nAnd let's not forget about The Landers! Although our first classic series was pretty much busted by crappy weather, we still have plans to bring lots of unique film events to their screen as well... including annual screenings of RHPS, and much, much more! All in all, 2007 is going to be a very good year for downtown cinema.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-01-30T06:50:37.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Finy",
      "body": "AWESOME.",
      "created_at": "2007-02-05T03:04:03.000Z"
    },
    {
      "author": "EdMo",
      "body": "Back on topic!\r\n\r\nI love this merging of theatres...it basically takes the concept of a multiplex but spreads it over town into unique locations.  It's like going to be one of those wedding hotels with different themed rooms.\r\n\r\nI still need to check out the Gilloiz.",
      "created_at": "2007-01-31T03:55:13.000Z"
    },
    {
      "author": "jhawk",
      "body": "Use your +2 Sword of Destiny to parry!",
      "created_at": "2007-01-31T03:46:35.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: Caleb</cite>Well, I'm taking it back away, among other things:\r\n\r\nEd: -1\r\nIan: +1\r\nNate: -50</blockquote>\r\n\r\nCaleb:  +death.",
      "created_at": "2007-01-31T03:29:58.000Z"
    },
    {
      "author": "Caleb",
      "body": "Well, I'm taking it back away, among other things:\r\n\r\nEd: -1\r\nIan: +1\r\nNate: -50",
      "created_at": "2007-01-31T00:44:25.000Z"
    },
    {
      "author": "EdMo",
      "body": "Eh, Sliced bread II was a rehash of Sliced Bread 1....except with wheat.",
      "created_at": "2007-01-30T19:40:23.000Z"
    },
    {
      "author": "Ian",
      "body": "Ed, I'm sorry, but I gotta do this.  Minus one.",
      "created_at": "2007-01-30T22:51:53.000Z"
    },
    {
      "author": "nate",
      "body": "No, I liked it Ed, so I'm giving you that point back.  Ian's not the boss of us.",
      "created_at": "2007-01-30T23:59:00.000Z"
    },
    {
      "author": "brad",
      "body": "if this is the Versailles treaty, let's hope one of those big theaters doesn't pull a Germany on us. \r\n\r\nThis is the coolest thing since Sliced Bread! And it's sequel, Sliced Bread II!",
      "created_at": "2007-01-30T19:29:23.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: jhawk</cite>I heard it was actually a<strong>Pentavirate</strong>until the Rothschilds bowed out and Colonel Sanders went tits up.  Ooh, I hated the Colonel with his wee<em>beady</em>eyes, and that smug look on his face.<em>Oh, you're gonna buy my chicken! Ohhhhh!</em></blockquote>\r\n\r\nYou married an ax murderer?",
      "created_at": "2007-01-30T19:19:31.000Z"
    },
    {
      "author": "jhawk",
      "body": "I heard it was actually a <strong>Pentavirate </strong>until the Rothschilds bowed out and Colonel Sanders went tits up.  Ooh, I hated the Colonel with his wee <em>beady</em> eyes, and that smug look on his face. <em>Oh, you're gonna buy my chicken! Ohhhhh!</em>",
      "created_at": "2007-01-30T19:13:19.000Z"
    },
    {
      "author": "tim",
      "body": "Awesome Dancole! and everyone involved, that sounds fricken great! (good work!)",
      "created_at": "2007-01-30T17:23:59.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: The Four Finger Soc Em</cite>Versailles was pretty sweet, dude.</blockquote>\r\n\r\nDon't forget Ghent, either.\r\n\r\nBritish impressed our seamen.  I wish I was joking.",
      "created_at": "2007-01-30T13:08:03.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "i vote <strong>yay</strong> on this",
      "created_at": "2007-01-30T12:54:31.000Z"
    },
    {
      "author": "Cosmik",
      "body": "RHPS would have been the most fun ever at the Gilloiz - before they renovated it.  That's the thing - it works best in a crappy old movie house.\r\n\r\nOne of my favorite classic cinema nights was watching Singin' In The Rain at the Wang Center in Boston - on a 6 story high movie screen.",
      "created_at": "2007-01-30T10:56:10.000Z"
    },
    {
      "author": "EdMo",
      "body": "This is like the best treaty since....\r\n\r\n...\r\n\r\n...\r\n\r\nwell it's just too awesome to be compared to anything!",
      "created_at": "2007-01-30T09:57:42.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Versailles was pretty sweet, dude.",
      "created_at": "2007-01-30T10:09:19.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
