{
  "id": 48,
  "title": "The Moxie Shop",
  "body": "Well, I can't say that I approve the base prices CafePress.com charges for their products, or the quality of the material they use, but either way... you asked for it! I give you <a href=\"http://www.cafepress.com/the_moxie\" target=\"_blank\">THE MOXIE SHOP</a> for all your Moxie branded thong needs! In order to make some small bit of profit, which will all go towards the theater, I jacked up each price by $3.00, which makes some items a little TOO pricey, but (suprisingly) makes others marketably comparable. So have fun, shop around, read all the little blurbs that I wrote at 11:30 at night (that's pretty late for me, folks). If you don't see anything you like, the donation button at the bottom of the side bar is still working... he he he. Yippee!\r\n\r\nAlso, if you do buy some merchandise, please send us an action shot of you and your new found coolness. Just slip into your new shirt/bib/thong/clock, snap a picture of yourself, and e-mail it to [ the.moxie at gmail dot com ]. Cool? Cool.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-08-17T20:53:31.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "einahpets",
      "body": "Nice merchandise.Will Nicole order a truckload of thongs?",
      "created_at": "2004-08-17T21:06:13.000Z"
    },
    {
      "author": "bjork24",
      "body": "Probably not. But that's okay, b/c I drew the logo on all the thongs she already owns with a sharpie. There's no escaping it!",
      "created_at": "2004-08-17T21:20:27.000Z"
    },
    {
      "author": "Nicole",
      "body": "You two are nuts.",
      "created_at": "2004-08-18T02:33:36.000Z"
    },
    {
      "author": "Tim",
      "body": "Rad, good sir.  Not sure about the wonky description on the Jr. Raglan, but it's all good.  I'm saving my pennies for the jersey.",
      "created_at": "2004-08-18T02:55:58.000Z"
    },
    {
      "author": "bjork24",
      "body": "What is a Jr. Raglan anyways? Isn't it just a tiny baseball jersey? I mean, really? Wonky!",
      "created_at": "2004-08-18T03:35:21.000Z"
    },
    {
      "author": "Fyse",
      "body": "Blimey, is this for real? It seems to be, but then I see you have Dog T-shirts advertised. Really?\r\n\r\nAny plans to open an English branch of 'Moxie Merchandising Inc'? However much I'd love a 'The Moxie' mousepad, I feel that having one flown over from the states would be rather excessive. It would probably elevate me from 'enthusiastic' to 'scary and possibly dangerous'...",
      "created_at": "2004-08-18T03:47:29.000Z"
    },
    {
      "author": "bjork24",
      "body": "Fyse, if you can send me something related to John Lennon or Shakespeare, I'll buy you the mousepad and send it to you.",
      "created_at": "2004-08-18T04:24:52.000Z"
    },
    {
      "author": "Fyse",
      "body": "It's a deal.",
      "created_at": "2004-08-18T05:28:09.000Z"
    },
    {
      "author": "Gaychel",
      "body": "This is too cool!  Cheers Dan and Cheers Nicole!  Do you really think you're going to get pictures of girls (or men) in the thong?",
      "created_at": "2004-08-18T08:55:07.000Z"
    },
    {
      "author": "John",
      "body": "I like how the thongs are \"Made in the USA\", but the boxers aren't.",
      "created_at": "2004-08-18T10:16:54.000Z"
    },
    {
      "author": "bjork24",
      "body": "My friend Justin suggested I buy the thong, take a picture of myself in it, and then sell T-Shirts with the picture of me in a thong on them. Justin, if you want to see me in a thong that badly... I'll do it!",
      "created_at": "2004-08-18T17:12:23.000Z"
    },
    {
      "author": "Stephanie",
      "body": "I've just put up a post about the merchandise...hopefully, that will lead to more traffic...and more cash for the Moxie!",
      "created_at": "2004-08-18T19:08:10.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks, Steph!",
      "created_at": "2004-08-18T19:12:52.000Z"
    },
    {
      "author": "mod",
      "body": "is it only DEALED between u and Fyse? cos yeaa, i'm the one who's living way too far in indonesia. and so even the moxie's cool  bumper sticker's shipping fee will cost me. just too far :(",
      "created_at": "2004-08-18T20:13:24.000Z"
    },
    {
      "author": "bjork24",
      "body": "Of course not, Mod. If you can offer something cool from Indonesia, I'd be happy to buy you a Moxie product and send it your way.",
      "created_at": "2004-08-18T20:31:56.000Z"
    },
    {
      "author": "Oz",
      "body": "I was going to get a t-shirt for myself, but when I saw they have t-shirts for dogs....well, clearly that is way to go!  Now where's my tape measure....",
      "created_at": "2004-08-18T21:30:48.000Z"
    },
    {
      "author": "bjork24",
      "body": "Your dog would look so cool in a Moxie shirt... the $5,000 dog!",
      "created_at": "2004-08-18T23:34:24.000Z"
    },
    {
      "author": "Sandra",
      "body": "wow, i didn't realize my question would turn into reality.  the logo looks great on all the merchandise. now i'm double jealous.",
      "created_at": "2004-08-19T04:52:15.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
