{
  "id": 480,
  "title": "The one that was written really fast",
  "body": "This post was going to be about hemorrhoids, but I recently found out that 417 Magazine named The Moxie Blog <a href=\"http://www.417mag.com/417-Magazine/February-2007/Citizencom/\">one of the five best blogs in Springfield</a>, so I guess I better act the part. I tell you what, those 417 folk are good people.\r\n\r\nMy mind is a bit shot today, so this post is going to consist of as many small paragraphs I can write between now and when intermission rolls up in 15 minutes. It's like free association, only better because I'm drinking orange juice.\r\n\r\nNicole and I went to Memphis last week to visit her mom. I watched THE DEPARTED in one of the nicest theaters I've ever seen. It had a bar, a fountain in the lobby, an internet cafe, and tasty pretzels. We got a flat tire on the way home.\r\n\r\nOur Valentine's Day event (Dinner and a Movie at Mille's) sold out tonight, which means we're going to feel the wrath of a million procrastinators for the next week. Better luck next year, fellas.\r\n\r\nPAN'S LABYRINTH starts on Wednesday, and we couldn't be more excited! We've already been pre-selling tickets for this weekend's shows, which is always a good sign. It's been a long road to opening day, same goes with VOLVER, and we're glad to finally be distancing ourselves from all that nastiness back in January. If all goes well, this February should knock Feb. 2006 out of the water.\r\n\r\nMmm, this orange juice is amazing.\r\n\r\nRemember when I resolved to make 2007 the year I get organized? Well, that's boring. I've now changed it to the year I watch 100+ movies, read 10+ books, and go to 1+ play -- 2007, the year of culturatin' Dan. Seriously though, Nicole and I used to watch well over 150 movies a year before we opened The Moxie, and it's sad when you run a movie theater but can't even find time to watch your own freaking films.\r\n\r\nWe watched THE QUEEN last night at Springfield 8. It was really good. That's the 10th movie I've seen in 2007, and we'll be watching another tonight. I'm well on my way to 100! Woot woot!\r\n\r\nNicole and I are excited to try the new standalone Chic-fil-a on South Glenstone. I just wish it were closer. South Springfield seems to be moving further and further away these days. I'm sure that's how some people feel about downtown too.\r\n\r\nSpeaking of the south side, did you know that if you picked up the Battlefield Mall and dropped it onto downtown, it would literally stretch from one side to the next. I made a scaled representation of it once, but I can't seem to find it. Nicole says it's upstairs (the representation). It's too cold to go up there.\r\n\r\nThe Moxie is going to be a lot easier to find, come mid-February, because we're finally getting our new neon sign installed! It's going to look a little something like <a href=\"http://www.stagedoorchicago.com/images/chicagoTheater_2.png\">this</a>, only bigger.\r\n\r\nThat about does it for today's post. Intermission is nigh upon me, so I better skedaddle. Until next time!\r\n\r\n<small>And I still have hemorrhoids.</small>",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-02-06T07:47:43.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: Becca</cite>Pescatarian.  (I eat seafood.)\r\n\r\nEven when I still ate poultry I wouldn't eat Chik Fil A because I HATE malls so passionately.\r\n\r\nNow there's the standalone but even if I ate meat, I wouldn't be able to go there because I don't eat fast food.</blockquote>\r\n\r\nIf seafood wasn't so expensive, I'd eat it every day.",
      "created_at": "2007-02-13T20:13:27.000Z"
    },
    {
      "author": "Master RJ",
      "body": "She's a Steve Jobs-arian (Steve Jobs also eats fish).",
      "created_at": "2007-02-13T08:45:32.000Z"
    },
    {
      "author": "Becca",
      "body": "Pescatarian.  (I eat seafood.)\r\n\r\nEven when I still ate poultry I wouldn't eat Chik Fil A because I HATE malls so passionately. \r\n\r\nNow there's the standalone but even if I ate meat, I wouldn't be able to go there because I don't eat fast food.",
      "created_at": "2007-02-13T06:28:45.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: Becca</cite>There's nothing for me to eat at Chik Fil A so I avoid it.</blockquote>\r\n\r\nVegetarian?  Or I hate Chicken-arian?",
      "created_at": "2007-02-13T04:44:55.000Z"
    },
    {
      "author": "Becca",
      "body": "There's nothing for me to eat at Chik Fil A so I avoid it.",
      "created_at": "2007-02-13T04:42:31.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: nate</cite>Big signs won't make you happy, Ed.</blockquote>\r\n\r\nAt least I can pretend.",
      "created_at": "2007-02-07T21:03:31.000Z"
    },
    {
      "author": "nate",
      "body": "Big signs won't make you happy, Ed.",
      "created_at": "2007-02-07T20:56:28.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: tim</cite>\"The Moxie is going to be a lot easier to find, come mid-February, because we're finally getting our new neon sign installed! It's going to look a little something like this, only bigger.\"\r\n\r\nHEY! i lived across from there!!!!</blockquote>\r\n\r\nYou cool people and your big city living....\r\n\r\nI need to get outta this town someday.",
      "created_at": "2007-02-07T19:49:06.000Z"
    },
    {
      "author": "tim",
      "body": "\"The Moxie is going to be a lot easier to find, come mid-February, because we're finally getting our new neon sign installed! It's going to look a little something like this, only bigger.\"\r\n\r\nHEY! i lived across from there!!!!",
      "created_at": "2007-02-07T12:02:50.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "I have never had Chik-Fil-A.",
      "created_at": "2007-02-07T09:35:40.000Z"
    },
    {
      "author": "Seth",
      "body": "<blockquote><cite>Posted By: The Four Finger Soc Em</cite>I have never had Chik-Fil-A.</blockquote>\r\n\r\nThat's an awful shame.\r\n\r\nI got my Chick fix today.  An eight pack of nuggets and a chicken sandwich.",
      "created_at": "2007-02-07T11:27:35.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: Seth</cite>YES IT IS.  Even after they had closed last night they had at least 40 people inside of the building still eating.  I remember about 5 years ago the rumor was that Chick Fil-A did not think a store outside the mall would make it in Springfield...ha ha.</blockquote>\r\n\r\nI mean, it's a good sandwich...but not worth waiting 20 minutes for.",
      "created_at": "2007-02-07T05:35:59.000Z"
    },
    {
      "author": "Seth",
      "body": "<blockquote><cite>Posted By: EdMo</cite><blockquote><cite>Posted By: Seth</cite>The new Chick Fil-A is great, mostly because it is not in the mall.  Though, only staying open till ten makes it hard to eat there during the week.  I just drove there a few hours ago and missed a chicken sandwich by 5 minutes.  :(</blockquote>\r\n\r\nAnd it's always busy....like...SERIOUSLY busy....such a small parking lot, too.</blockquote>\r\n\r\nYES IT IS.  Even after they had closed last night they had at least 40 people inside of the building still eating.  I remember about 5 years ago the rumor was that Chick Fil-A did not think a store outside the mall would make it in Springfield...ha ha.",
      "created_at": "2007-02-07T00:58:42.000Z"
    },
    {
      "author": "nicole",
      "body": "I went to Target the other day, and it took me 20 minutes to get there! Where are we, St. Louis or something?",
      "created_at": "2007-02-06T23:22:28.000Z"
    },
    {
      "author": "nate",
      "body": "<blockquote><cite>Posted By: dan</cite>South Springfield seems to be moving further and further away these days.</blockquote>This is so true.  I'm not sure if you meant that the growth is heading that way, so it is actually physically moving further away, or if you meant that as more and more services and destinations arrive in the center city area, the south side just seems like such an out-of-the way detour.  I definitely feel the latter.  I get south of Sunshine <em>maybe </em>once a week, sometimes not even that.  Everything I need and patronize is in a 2 square mile area... ...strangely enough centered on The Moxie, including the Moxie itself (which I need) and Dan himself (whom I patronize).",
      "created_at": "2007-02-06T20:27:24.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: Seth</cite>The new Chick Fil-A is great, mostly because it is not in the mall.  Though, only staying open till ten makes it hard to eat there during the week.  I just drove there a few hours ago and missed a chicken sandwich by 5 minutes.  :(</blockquote>\r\n\r\nAnd it's always busy....like...SERIOUSLY busy....such a small parking lot, too.",
      "created_at": "2007-02-06T11:00:25.000Z"
    },
    {
      "author": "Seth",
      "body": "The new Chick Fil-A is great, mostly because it is not in the mall.  Though, only staying open till ten makes it hard to eat there during the week.  I just drove there a few hours ago and missed a chicken sandwich by 5 minutes.  :(",
      "created_at": "2007-02-06T10:50:56.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "i love the use of the word culturatin'",
      "created_at": "2007-02-06T08:24:08.000Z"
    },
    {
      "author": "jhawk",
      "body": "And <em><a href=\"http://www.urbandictionary.com/define.php?term=skedaddle\">skedaddle</a></em>.   <em>Make Haste</em> just doesn't work...",
      "created_at": "2007-02-06T08:35:49.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "I like \"free-association (with orange juice) Dan\". That was good. Enjoyable. And catchy. mm, not sure if it was catchy, but... sure... it was catchy.",
      "created_at": "2007-02-06T07:58:20.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
