{
  "id": 481,
  "title": "Moxie Cinema and the Terrible, No Good, Very Bad Day...aka The Projector Broke",
  "body": "<b>UPDATE:</b> The projector is working again. All shows are BACK ON, BABY!\r\n\r\nI always hate to be the bearer of bad news, but here it is anyways:\r\n\r\nLast night while we were testing the brand new beautiful print of Pan's Labyrinth, the projector pretty much exploded. It was scary - sparks and fumes, loud popping noises, and pieces flying about. It turns out something happened with either the rectifier (sp?) or the lamphouse, both of which are instrumental pieces for projecting a film onto our screen.\r\n\r\nAlas, Dan and Justin stayed up until early early morning taking the projector apart and putting it back together, and they would have gotten it to work (they're pretty talented guys) except for the fact that there's one piece that busted and can't be fixed. It needs a new part. \r\n\r\nSo, they are on their way to St. Louis to pick up parts and hopefully get everything back up and running for Thursday shows. Yes, that means tonight's shows are cancelled.\r\n\r\nGreat timing, eh? I mean, it's not like we're opening the most anticipated film of the year tonight or anything. Or maybe there's a jinx attached with the film?\r\n\r\nWe apologize for any inconvenience (I know there were a lot of excited people - me included - who were planning on watching the film tonight). If you already purchased your ticket, you may stop by tonight to pick up a free pass from 6pm to 8pm, otherwise we'll give them to you when you come in next (but don't try to be sneaky - we have a ticket count).\r\n\r\nAnd now I'm going to cry in the corner. I'm not very good with stressful situations.",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2007-02-07T22:54:36.000Z",
  "author": "Nicole",
  "comments": [
    {
      "author": "The Four Finger Soc Em",
      "body": "Yeah, I've been dying to see it... so... I might be dead by then.",
      "created_at": "2007-02-10T03:43:08.000Z"
    },
    {
      "author": "Megster",
      "body": "oh...max if you go sunday, i can go with you probably... but certainly don't plan around that... go see though...so it can be discussed...",
      "created_at": "2007-02-09T20:05:34.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: dan</cite><b>UPDATE:</b>The projector is working again. All shows are BACK ON, BABY!</blockquote>\r\n\r\nThank heavens.  WOOT!",
      "created_at": "2007-02-09T04:09:13.000Z"
    },
    {
      "author": "risk2",
      "body": "Congrats!",
      "created_at": "2007-02-09T08:51:16.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Wait... me, meg? I won't be there tonight sadly. Nor tomorrow due to LPA. So I guess I have to wait til saturday, or maybe even Sunday if I just wait til Katharine can go.\r\n\r\nBONKERSSSSSSSSSSSnakes.",
      "created_at": "2007-02-09T03:58:10.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Yay!",
      "created_at": "2007-02-09T03:31:27.000Z"
    },
    {
      "author": "Megster",
      "body": "yippee! see you tonight!",
      "created_at": "2007-02-09T03:39:23.000Z"
    },
    {
      "author": "HonkeyHero",
      "body": "Congrats!! I'm sure you guys weren't too stressed... :-)",
      "created_at": "2007-02-09T03:22:36.000Z"
    },
    {
      "author": "brad",
      "body": "killer",
      "created_at": "2007-02-09T02:43:20.000Z"
    },
    {
      "author": "Megster",
      "body": "nate is ante... which is his new nickname... yay... i enjoy renaming people...",
      "created_at": "2007-02-09T02:17:11.000Z"
    },
    {
      "author": "dan",
      "body": "<b>UPDATE:</b> The projector is working again. All shows are BACK ON, BABY!",
      "created_at": "2007-02-09T02:26:53.000Z"
    },
    {
      "author": "ariananana",
      "body": "evian is naive backwards....thank you, reality bites.",
      "created_at": "2007-02-09T01:10:34.000Z"
    },
    {
      "author": "nate",
      "body": "You do realize that the anagram of \"barista\" is \"stab ari,\" don't you?\r\n\r\n\r\n<small>I notice these things.</small>",
      "created_at": "2007-02-09T01:05:50.000Z"
    },
    {
      "author": "ariananana",
      "body": "i used to be a barista...i could make everyone macchiatos...only if the projector can autodrip the espresso.",
      "created_at": "2007-02-09T00:49:58.000Z"
    },
    {
      "author": "EdMo",
      "body": "We could build a time machine with all that gadgetry...or at least an espresso machine.",
      "created_at": "2007-02-08T22:46:16.000Z"
    },
    {
      "author": "Caleb",
      "body": "Very entertaining slideshow. That new lamphouse looks HUGE. And it looks like it's got lots of new switches on the back!",
      "created_at": "2007-02-08T20:22:37.000Z"
    },
    {
      "author": "evilvet",
      "body": "Man, Cosmik, that must've been one helluva watch.",
      "created_at": "2007-02-08T18:28:46.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: evilvet</cite>Man, Cosmik, that must've been one helluva watch.</blockquote>'\r\n\r\nHaha.  Pun.",
      "created_at": "2007-02-08T19:57:21.000Z"
    },
    {
      "author": "Cosmik",
      "body": "Boy, I had a lamp blow up once on my watch.  (Of course, since it was my first exploding lamp, and it was encased in the projector house, I didn't know what the sound was, only that I heard it, but I couldn't find anything off in the dark of the projection floor, and I couldn't really hear either of the guests in the theatre yelling.  Finally the manager radioed up and I took a peek in the theatre, saw it was dark and thought \"ah, THAT'S what that was.\")  It was a big mess of glass shards, and being new to the job, I didn't know how to change the lamp yet.\r\n\r\nThis looks SO much worse.",
      "created_at": "2007-02-08T18:14:57.000Z"
    },
    {
      "author": "Becca",
      "body": "Dan, your dedication to keeping the Moxie in good working order is something to be admired and respected.",
      "created_at": "2007-02-08T14:37:17.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "\"the bulb in this sucker is so bright it will knock holes in walls, just like the laser in REAL GENIUS with Val Kilmer. \"\r\n\r\nnice",
      "created_at": "2007-02-08T11:44:11.000Z"
    },
    {
      "author": "justin",
      "body": "I just bought a new camera and I'm all itchy to use it, so I took it with us to St. Louis to document the entire Moxie projector saga.  Check it out:\r\n\r\n<a href=\"http://www.flickr.com/photos/justinglow/sets/72157594524050945/\">http://www.flickr.com/photos/justinglow/sets/72157594524050945/</a>\r\n\r\nI recommend starting with the first picture and working forward, because it's done in a refreshing narrative style!",
      "created_at": "2007-02-08T11:21:25.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "One day when roads cross and planets align, I may fling an avatar on there, but for now I shall remain... The Unavatator.\r\n\r\nThat sucked.",
      "created_at": "2007-02-08T10:17:27.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "All four fingers.",
      "created_at": "2007-02-08T09:56:51.000Z"
    },
    {
      "author": "Caleb",
      "body": "Max, you need an icon. Or are you going against the grain on purpose? \r\n\r\nWhat about this: <img src=\"http://aycu09.webshots.com/image/9648/2004502447867023130_fs.jpg\" alt=\"\" />\r\n\r\nIf you like it, go into your account setup and put the following into the icon section:\r\nhttp://aycu09.webshots.com/image/9648/2004502447867023130_fs.jpg \r\n\r\n(Off topic, sorry) Get well soon projector!",
      "created_at": "2007-02-08T10:06:51.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: dan</cite>NEWS: After an extremely long two days, and a quick 8 hour trip to STL and back, I'm happy to report that the new projector pieces are sitting safe inside the Moxie. An electrician will be by in the morning to rewire the new rectifier, and I'm hoping I can get a projection tech from Joplin to swing by and help me finish the install. Keep your fingers crossed that Joplin Joe doesn't have any plans tomorrow afternoon!!!\r\n\r\nMore updates to come.</blockquote>\r\n\r\nCrossed.",
      "created_at": "2007-02-08T09:50:49.000Z"
    },
    {
      "author": "jhawk",
      "body": "I try to make 'em count. :)",
      "created_at": "2007-02-08T02:26:10.000Z"
    },
    {
      "author": "dan",
      "body": "NEWS: After an extremely long two days, and a quick 8 hour trip to STL and back, I'm happy to report that the new projector pieces are sitting safe inside the Moxie. An electrician will be by in the morning to rewire the new rectifier, and I'm hoping I can get a projection tech from Joplin to swing by and help me finish the install. Keep your fingers crossed that Joplin Joe doesn't have any plans tomorrow afternoon!!!\r\n\r\nMore updates to come.",
      "created_at": "2007-02-08T09:42:03.000Z"
    },
    {
      "author": "evilvet",
      "body": "So Dan and Justin are off to Saint Louis to get a part.  Does that make them...LABYRINTH RETRIEVERS??",
      "created_at": "2007-02-08T01:47:54.000Z"
    },
    {
      "author": "jhawk",
      "body": "HAHAHA!!!\r\n\r\nThread over, <strong>evilvet </strong> wins!",
      "created_at": "2007-02-08T01:55:44.000Z"
    },
    {
      "author": "nate",
      "body": "Too soon.",
      "created_at": "2007-02-08T01:55:55.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: jhawk</cite>Here ya go Cosmik.  I need Photoshop at work like I need a hole in the head.\r\n\r\n<a href=\"http://photobucket.com/\"><img border=\"0\" alt=\"Photobucket - Video and Image Hosting\" src=\"http://i69.photobucket.com/albums/i58/jhawk65807/get-well-moxie-1.jpg\"></img></a></blockquote>\r\n\r\nJhawk...you've become one of my top forumers.  You are a wit among wits.",
      "created_at": "2007-02-08T02:09:16.000Z"
    },
    {
      "author": "jhawk",
      "body": "Here ya go Cosmik.  I need Photoshop at work like I need a hole in the head. \r\n\r\n<a href=\"http://photobucket.com/\" target=\"_blank\"><img src=\"http://i69.photobucket.com/albums/i58/jhawk65807/get-well-moxie-1.jpg\" border=\"0\" alt=\"Photobucket - Video and Image Hosting\"></a>",
      "created_at": "2007-02-08T01:08:12.000Z"
    },
    {
      "author": "Cosmik",
      "body": "So, Brian, when can I pick up my ticket from you?  ;)",
      "created_at": "2007-02-08T00:58:11.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Why didn't Alexander just blow his brains out? I mean, he was going to anyway. The most depressing children's book ever.\r\n\r\nI should write a sequel: Alexander and His Prozac",
      "created_at": "2007-02-08T01:04:18.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "very sad news indeed.... geez... just think if they were both sold  out.. how many seats 70? 72?   144 tickets?\r\nthat sucks so bad.... we are going to have to work extra extra hard.. to get everyone we know to come in to see this\r\n\"ive seen it already\"  oh yeah?  see it again!!...its on me!!",
      "created_at": "2007-02-08T00:51:43.000Z"
    },
    {
      "author": "Cosmik",
      "body": "<img src=\"http://a764.g.akamai.net/f/764/16742/1h/www.1800flowers.com/800f_assets/images/flowers/images/shop/catalog/9011.jpg\" alt=\"\" />\r\n\r\nI tried to make the background transparent and add it to Jeff's photo, but I'm a photoshop loser and this is the best I could do.  Still, hope the projector likes the flowers. :)",
      "created_at": "2007-02-08T00:51:15.000Z"
    },
    {
      "author": "nicole",
      "body": "I forgot to mention the one good thing that can come out of this: people can watch Lost now (including me!)...",
      "created_at": "2007-02-07T23:11:24.000Z"
    },
    {
      "author": "HonkeyHero",
      "body": "Sorry guys, that is bad news... :-(  Guess I'll do my taxes instead... Hope it all works out and I'll plan on see you all Thursday or Friday...",
      "created_at": "2007-02-07T23:19:37.000Z"
    },
    {
      "author": "Becca",
      "body": "It's okay, dan and nicole.  We've waited this long, we can stand anyother 24 hours.  I do find the level of mishap surrounding thie movie quite odd though...",
      "created_at": "2007-02-07T23:59:58.000Z"
    },
    {
      "author": "jhawk",
      "body": "<a href=\"http://photobucket.com/\" target=\"_blank\"><img src=\"http://i69.photobucket.com/albums/i58/jhawk65807/get-well-moxie.jpg\" border=\"0\" alt=\"Photobucket - Video and Image Hosting\"></a>",
      "created_at": "2007-02-08T00:05:12.000Z"
    },
    {
      "author": "Becca",
      "body": "rofl",
      "created_at": "2007-02-08T00:07:48.000Z"
    },
    {
      "author": "nate",
      "body": "jhawk, you have quite the talent for putting humorous spins on bad situations.\r\n\r\nBut yes!  We'll all be there one way or the other!",
      "created_at": "2007-02-08T00:34:25.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
