{
  "id": 482,
  "title": "Projector Pains",
  "body": "So, here's how it went down:\r\n\r\n<b>Tuesday, 11:50 pm</b> - We decided to have an \"employees only\" test screening of PAN'S LABYRINTH to help free up a few seats for paying customers on opening night, and to make sure the print looked okay. Everyone was there - Nate, Caleb, Ed, Justin, Nathaniel, Nicole, and me. A few minutes before midnight, I turned on the projector lamp and heard a noise that sounded like a fuse being lit. I saw smoke coming from the rectifier, so I immediately shut the projector off. I looked the rectifier over, and decided to go ahead and strike the lamp again. I flipped it on, and everything seemed to be working. The movie started about ten minutes after midnight.\r\n\r\n<b>Wednesday, 12:24 am</b> - Fourteen minutes into the film, the screen went black. I bolted into the booth and tried to manually turn the bulb back on. Nothing. More smoke was coming out of the rectifier, so I shut everything down, and brought in our spare rectifier from the storage room.\r\n\r\n<b>Wednesday, 12:45 am</b> - Justin and I successfully removed the old rectifier, and wired in the new one. We restored power to the projector, held our collective breath, and flipped the switch.\r\n\r\n<b>Wednesday, 12:45:02 am</b> - The back of the lamphouse exploded in a plume of sparks, smoke, and flimsy foil shrapnel. Everyone ducked, and Ed let out a nervous toot. I cut power to the projector and surveyed the carnage.\r\n\r\n<b>Wednesday, 12:50 am</b> - I brought our spare lamphouse from the back, in hopes of salvaging the parts that had exploded in the last lamphouse. It was also evident, upon passing power through the spare rectifier, that it too was faulty. Our best course of action would be to remove the burned transformer from the first rectifier, replace it with the transformer from the spare rectifier (which wasn't working), and switch out the two lamphouses. Between the two of us, Justin and I had only the slightest notion of what the hell we were doing.\r\n\r\n<b>Wednesday, 2:15 am</b> - Justin and I successfully removed the burned transformer from the first rectifier, and replaced it with the transformer from the spare rectifier, which, for all we know, could be just as useless as the first one.\r\n\r\n<b>Wednesday, 3:30 am</b> - We successfully removed the exploded lamphouse and replaced it with the spare, being careful to diagram the exact schematics, and tag each wire with helpful names like \"tits\" and \"poop.\"\r\n\r\n<b>Wednesday, 3:30:34 am</b> - Justin and I giggle at the wires named \"tits\" and \"poop.\"\r\n\r\n<b>Wednesday, 3:40 am</b> - After going over all our connections, and checking each and every wire (in both the rectifier and lamphouse), I restored power to the projector and flipped the switch.\r\n\r\nNothing.\r\n\r\n<b>Wednesday, 3:50 am</b> - We call it a night. I'd had an incredibly long day -- woke up at 8:30, spent six hours at my parent's house clearing and burning limbs, and in the process developed a nice rumbling cough and a sore throat.\r\n\r\n<b>Wednesday, 9:30 am</b> - I called our projection technician, in hopes of an easy fix. No such luck. He suggested wiring in an extension cord to the rectifier, and sticking my voltage meter in a place I'd rather not repeat in polite company. I had no idea what he was talking about, so I asked the inevitable question, \"is this going to be more trouble than it's worth? Should I just bite the bullet and buy a new lamphouse?\" The answer was \"yes,\" so my next call was to our equipment dealer in Saint Louis.\r\n\r\n<b>Wednesday, 10:00 am</b> - I got in touch with our equipment dealer, and was pleased to hear that they had a much newer, much improved lamphouse in their warehouse. It was going to cost several pretty pennies, but it was a necessary improvement / investment. In fact, we should've upgraded a long time ago. I'd grown complacent with our shitty old lamphouse, and was now paying the price.\r\n\r\n<b>Wednesday, 10:30 am</b> - I hurriedly broke down IRAQ IN FRAGMENTS, which finished its run on Tuesday night, and got it ready to ship to the next theater.\r\n\r\n<b>Wednesday, 11:45 am</b> - Despite not knowing if the projector would be working by Friday, I built our ad for the Weekend section of the News-Leader, which included a large promotional ad for PAN'S LABYRINTH. I crossed my fingers and swallowed the stress into my eagerly awaiting ulcers.\r\n\r\n<b>Wednesday, 1:00 pm</b> - Once our equipment dealer got back from lunch, I called him again to double check that the new lamphouse and rectifier were ready to go, and find out how late he was going to be open. He'd be in the office until 4:30, which meant it was time to hit the road.\r\n\r\n<b>Wednesday, 1:30 pm</b> - Justin and I jumped in the car and hit the road. My lack of sleep, worsening cold, and mountain of stress made for a safe road trip.\r\n\r\n<b>Wednesday, 2:45 pm</b> - We stopped at a truck stop in BFE to take a leak. They had hundreds of custom-made wooden clocks, decorated with the visage of every country star in the sky: Kenny Rogers, Willie Nelson, Patsy Cline, and many more that I didn't recognize. In a show of uberhuman restraint, Justin and I opted out of buying at least four country star clocks.\r\n\r\n<b>Wednesday, 4:29 pm</b> - We pulled into the parking lot of my equipment dealer. After a brief chat, we headed over to their storage unit to pick up the new lamphouse and rectifier.\r\n\r\n<b>Wednesday, 4:58 pm</b> - With the new equipment safely loaded in the car, we squeezed back into 5 o'clock traffic and headed further into the city for a nice dinner at Stir Crazy in Creve Coeur.\r\n\r\n<b>Wednesday, 5:45 pm</b> - We sat down to a heaping plate of stir fried vegetables and rice. Justin finished his entire meal, but I could only manage half of mine. I added \"supressing the urge to vomit\" to my growing list of ailments, paid the waitress, and we were once again on the road.\r\n\r\n<b>Wednesday, 6:30 pm</b> - We finally made it out of St. Louis proper. By this point, I was so exhausted and sick that I figured we had roughly a 1 and 6 chance of making it home without being involved in an accident.\r\n\r\n<b>Wednesday, 7:49 pm</b> - I had to pull over and buy two cans of Red Bull to make it the rest of the way. I chugged them both in less than 15 minutes.\r\n\r\n<b>Wednesday, 8:05 pm</b> - Justin and I were singing and dancing to some mad Ludacris beats.\r\n\r\n<b>Wednesday, 9:00 pm</b> - I call my friend Clark. Clark owns the Circle Cinema in Tulsa, and since our projection technician was on a job in Northern Illinois, I figured he (Clark) might be able to loan us his tech for a day or two. In a stroke of luck, Clark informs me that his technician is from Joplin (a mere 45 minutes away from Springfield), and that he'd probably be able to help us out. Unfortunately we'd have to wait until the morning to call his tech, who we affectionately named \"Joplin Joe,\" since he was the \"early to bed, early to rise\" type.\r\n\r\n<b>Wednesday, 9:30 pm</b> - We arrive safely back at the Moxie. Justin and I unload the new lamphouses and rectifier, recount our harrowing journey to Nicole, and finally call it a night.\r\n\r\n<b>Wednesday, 10:45 pm</b> - After a relaxing shower, and a bowl of Fruity Pebbles, I hit the sack.\r\n\r\n<b>Wednesday, 10:46 pm</b> - After a minute of punching the sack of grain that we keep in our apartment for no apparent reason, I head to bed.\r\n\r\n<b>Wednesday, 10:52 pm</b> - I fall asleep.\r\n\r\n<b>Thursday, 8:00 am</b> - I wake up and call \"Joplin Joe.\" I inform him of our crisis, and he agrees to come to the theater at noon. I thank my lucky stars, jump out of bed, and make myself a heaping congratulatory bowl of Honey Nut Cheerios.\r\n\r\n<b>Thursday, 9:00 am</b> - Our electrician (who Nicole had called while we were on the road to St. Louis) arrives at The Moxie to help me wire in the new rectifier. I show him the new equipment, and he promptly explains that the rectifier requires triple phase current. \"This building,\" he explains, \"only has single phase current.\"\r\n\r\n<b>Thursday, 9:07 am</b> - I clinch my fists so tightly, blood pools up in my palms. \"Ok,\" I say, feigning calmness, \"what can we do to get triple phase current?\"\r\n\r\n\"Well, you can either upgrade the entire service to the building... \"\r\n\r\n<i>$$$$$$$$$</i>\r\n\r\n\"... or you can buy a phase converter.\"\r\n\r\n<i>How much will a phase converter cost?</i>\r\n\r\n\"Oh, I'm not sure. Maybe a thousand dollars or so. It really depends on how big it needs to be.\"\r\n\r\n<i>Are these \"phase converters\" readily available?</i>\r\n\r\n\"Sometimes. If it's on the shelf, I can get one to you tomorrow. If not, I'd have to order one, which could take a week or two.\"\r\n\r\n<i>Oh. I see.</i>\r\n\r\n<b>Thursday, 9:10 am</b> - More blood in palms.\r\n\r\n<b>Thursday, 9:15 am</b> - Our electrician leaves. He promises to call later when he finds out about a phase converter.\r\n\r\n<b>Thursday, 10:00 am</b> - I tell Nicole the bad news. \"Our fate is in Joplin Joe's hands. If he can't get the old lamphouse working, we're screwed.\"\r\n\r\n<b>Thursday, 12:00 pm</b> - Joplin Joe arrives. I tell him the situation, and he doesn't look pleased.\r\n\r\n\"How do you know the transformer that you replaced is going to work?\"\r\n\r\n<i>I don't.</i>\r\n\r\n\"Well, let's give 'er a shot.\"\r\n\r\n<b>Thursday, 12:28 pm</b> - After testing the rectifier, Joplin Joe sticks his screwdriver into the rectifier to manually jump a connector.\r\n\r\n<b>Thursday, 12:28:02 pm</b> - Like the first one before it, the back of the spare lamphouse explodes in a plume of sparks, smoke, and flimsy foil shrapnel. Somewhere, Ed lets out a nervous toot.\r\n\r\n\"What was that?!\"\r\n\r\n<i>I think it was the same capacitor that exploded in the last lamphouse.</i>\r\n\r\n\"Hmm. That's not good.\"\r\n\r\n<b>Thursday, 12:55 pm</b> - After looking at the electrical schematics, Joplin Joe determines that the blown capacitor won't keep the lamphouse from operating. We continue to work on the spare lamphouse.\r\n\r\n<b>Thursday, 1:30 pm</b> - After a half hour of disappointing results, I suggest we try the first lamphouse again. Afterall, if the blown capacitor isn't needed, then we should be able to get it working again. Joplin Joe agrees.\r\n\r\n<b>Thursday, 1:45 pm</b> - We get the old lamphouse back in place. Joplin Joe wires it up, restores power, and flips the switch. I hold my breath.\r\n\r\n<b>Thursday, 1:45:02 pm</b> - The lamp crackles back to life, and after 36 hours without it, our screen is once again bathed in the refreshing light of a fully functional lamphouse. Joplin Joe and I jump into the air and exchange high fives. I pull a couple Werther's Originals from my pocket and hand one to Joe. This was truly a moment worth cherishing.\r\n\r\nAnd that's pretty much how it went down. I do want to add a few notes:\r\n\r\n- Before driving to St. Louis, we called Springfield 8 in the hope that they could lend us a hand. As luck would have it, their tech was in town (from Michigan) servicing a projector at their theater. The manager said they'd be happy to send him over, but they'd need to clear it with the home office first. An hour later they called back. Goodrich's corporate office had told Springfield 8 to do whatever needed to be done to get our projector up and running again. We were elated! In the end, however, their technician was called away to an IMAX theater in Iowa, but he gave us his number and told us to call him if we needed any assistance.\r\n\r\nAnother theater in Springfield, in direct competition with us, bending over backwards to help The Moxie. That, and a million other reasons, is why we love Springfield Great so dearly. Thanks again guys!\r\n\r\n- As for the rotary phase converter. Our electrician told me it might be cheaper if I bought one on my own - that way he wouldn't have to tack on his usual mark-up. After a couple calls, and endless searches on the internets, I found one for less than $600. It should be here by the end of the week.\r\n\r\n- Justin took pictures as this story unfolded. You can follow along, picture by picture, here: <a href=\"http://www.flickr.com/photos/justinglow/sets/72157594524050945/\">St. Louis Projector Project</a>.\r\n\r\nAnd that, my friends, is where we stand today. We should have our new lamphouse up and running within the next couple weeks. I'm not sure if we'll have to close down for a day to install it, but I'll definitely let you know if that's the case. I feel exhausted just from writing all of that. I better go get some water.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-02-14T09:34:29.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "El Brian de Moore",
      "body": "\"I pull a couple Werther's Originals from my pocket and hand one to Joe. This was truly a moment worth cherishing.\"\r\n\r\nthats beautiful... especially in my mind...",
      "created_at": "2007-02-14T13:01:32.000Z"
    },
    {
      "author": "rpayton",
      "body": "A truly stoic effort. Perhaps Sisyphus should have been given a movie projector instead of a boulder.",
      "created_at": "2007-02-14T11:10:49.000Z"
    },
    {
      "author": "EdMo",
      "body": "Jesus.  That's all I gotta say.\r\n\r\n\r\n\r\nP.S.  I don't \"toot\" that much.",
      "created_at": "2007-02-14T11:16:36.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Dan, I haven't read that much at one time in a while. Now, that's embarassing for me, but a testament to you. Good show, chap. Good show.\r\n\r\nYeah, people don't use \"chap\" anymore. It's 'cause it's not funny. Whatever, am I right?",
      "created_at": "2007-02-14T10:09:17.000Z"
    },
    {
      "author": "nate",
      "body": "That was riveting.",
      "created_at": "2007-02-14T19:12:20.000Z"
    },
    {
      "author": "ariananana",
      "body": "I just remember buying my tickets with Austin (Pan's Screamer...lolzzz) and Nicole saying that the guy from Joplin had \"McGyvered\" the projector...it was awesome.....\r\n\r\nI still hold true to the fact that after you buy a piece of electronic equipment, the manufacturer throws out all the parts you might need if it breaks....or they store them away in siberia.\r\n\r\n\r\nbut hooray!",
      "created_at": "2007-02-14T19:56:52.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: ariananana</cite>\r\nI still hold true to the fact that after you buy a piece of electronic equipment, the manufacturer throws out all the parts you might need if it breaks....or they store them away in siberia.\r\n\r\n</blockquote>\r\n\r\nSorry to sound like a conspiracy theorist, but how else do manufacturers make money?  If they build stuff that lasts a long time, they won't have as many future buyers.  They build things flimsy, like CD players or whatever, so that they break within a year and you have to get a new one.  It's smart on their part to maximize profits.",
      "created_at": "2007-02-14T21:01:24.000Z"
    },
    {
      "author": "nicole",
      "body": "To be fair, our projector is, like, 300 years old.",
      "created_at": "2007-02-14T21:21:27.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: nicole</cite>To be fair, our projector is, like, 300 years old.</blockquote>\r\n\r\nI'm speaking more along the lines of consumer products....kinda went off on what Ariaannananannanan said.  I should have mentioned that I wasn't speaking of projectors anymore.\r\n\r\nClarity is essential to efficiency!",
      "created_at": "2007-02-14T21:22:42.000Z"
    },
    {
      "author": "nate",
      "body": "Whenever I left my cell phone charger in Dallas, and needed a new one, Cingular and Best Buy and everybody told me they didn't make that charger anymore.  Best Buy even told me that Cingular told them to pull that charger model off the shelves.  The cell phone model is literally like 2 years old.  I'll let you guess why they do that.\r\n\r\nThe only thing that saved me from having to buy a Razr to replace my perfectly good year old phone, was that my grandparents were nice enough to go to FedEx and ship the charger to me for $10.\r\n\r\nLike Ed, I too am wary of coming across like a hippie conspiracy theorist, but run into a couple complications like that, and you quickly start to see how much of our decisions are directed by behemoth corporations.",
      "created_at": "2007-02-14T21:31:32.000Z"
    },
    {
      "author": "ariananana",
      "body": "<blockquote><cite>Posted By: EdMo</cite><blockquote><cite>Posted By: ariananana</cite>\r\nI still hold true to the fact that after you buy a piece of electronic equipment, the manufacturer throws out all the parts you might need if it breaks....or they store them away in siberia.\r\n\r\n</blockquote>\r\n\r\nSorry to sound like a conspiracy theorist, but how else do manufacturers make money? If they build stuff that lasts a long time, they won't have as many future buyers. They build things flimsy, like CD players or whatever, so that they break within a year and you have to get a new one. It's smart on their part to maximize profits.</blockquote>\r\n\r\nhi, sarcasm",
      "created_at": "2007-02-14T22:42:16.000Z"
    },
    {
      "author": "nate",
      "body": "I think ed knew you were being sarcastic.  I think he was just springboarding off your comment to rant about something... like I did.  Right Ed?  I mean, I am allowed to speak other people's thoughts on here, right?",
      "created_at": "2007-02-14T23:54:16.000Z"
    },
    {
      "author": "Megster",
      "body": "how else would any of us know what we were thinking?",
      "created_at": "2007-02-15T00:02:25.000Z"
    },
    {
      "author": "ariananana",
      "body": "es cierto.",
      "created_at": "2007-02-15T00:03:12.000Z"
    },
    {
      "author": "nicole",
      "body": "<blockquote><cite>Posted By: nate</cite>Whenever I left my cell phone charger in Dallas, and needed a new one, Cingular and Best Buy and everybody told me they didn't make that charger anymore.  Best Buy even told me that Cingular told them to pull that charger model off the shelves.  The cell phone model is literally like 2 years old.  I'll let you guess why they do that.</blockquote>\r\n\r\nNate...do we live the same lives? That's EXACTLY what happened to me, even in Dallas! But I ended up buying a new Razor.",
      "created_at": "2007-02-15T02:31:01.000Z"
    },
    {
      "author": "nate",
      "body": "Well, you bent to the will of The Man.\r\n\r\nBut otherwise we are the same:  we do both love Watership Down.  \r\n\r\nAnd look at Dan's butt...",
      "created_at": "2007-02-15T02:44:34.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: nate</cite>I think ed knew you were being sarcastic.  I think he was just springboarding off your comment to rant about something... like I did.  Right Ed?  I mean, I am allowed to speak other people's thoughts on here, right?</blockquote>\r\n\r\nYou got it!  You are my voice in the senate, Nate.",
      "created_at": "2007-02-15T03:45:19.000Z"
    },
    {
      "author": "nate",
      "body": "se-Nate.",
      "created_at": "2007-02-15T03:54:08.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
