{
  "id": 483,
  "title": "PAN'S LABYRINTH and the five week stamina",
  "body": "The rumors are true. We're holding on to PAN'S LABYRINTH, and will continue playing it well into March. It's been an exhilarating ride from the day we were originally supposed to open PAN'S, and the projector exploded, to now. I have a feeling it's going to be a long, long time until another film comes along and surpasses PAN'S numbers. The best thing about the film, from a business standpoint, is the incredible amount of new faces it's been bringing to the theater. If I were to guess, which is exactly what I'm about to do, I'd say 50% of more of the audiences have been Moxie virgins. You can't pay for that kind of exposure!<br/><br/>Still, despite these euphoric last two weeks, I know in the back of my mind that it won't last forever. The theater exhibition industry is all about the highs and lows, feast or famine, Billings or Clever (ha ha!). As much as I love being on top, I know it won't be long before we're back on bottom, sucking the hind teat... but let's not be pessimists today. Let's relish the here and now, and toast our glasses to the sky.<br/><br/>After all, it only takes... a couple bad... sandwiches... to make... a... donkey... omelet. I forgot what I was talking about.<br/><br/>The new Moxie sign should be going up this week! Woo hoo!<br/><br/>PS - check the calendar for additional PAN'S showings, and for the new March line-up... coming soon!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-02-20T07:33:02.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Master RJ",
      "body": "I do know for a fact (through Dan and Nicole) that Venus, Perfume and maybe Miss Potter are to follow, but New Line still holds on to Little Children with a frim grip.",
      "created_at": "2007-02-20T08:00:16.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Dan. <br/>Smile. <br/>Big one.<br/>Gimme one of those donkey omelets to go.",
      "created_at": "2007-02-20T08:07:00.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Another confirmed by Dan and Nicole title: American Cannibal, a documentary on a series produced by the promoters of the Paris Hilton sex tape. I had this confused with Behind The Mask, a horror film with Robert Englund about a serial killer who allows a film crew to film his kills before killing the film crew. That also sounds good and would be a good Moxie title (Starz will air it in a few months though, they produced it).",
      "created_at": "2007-02-20T08:14:00.000Z"
    },
    {
      "author": "ariananana",
      "body": "<blockquote><cite>Posted By: Master RJ</cite>I do know for a fact (through Dan and Nicole) that Venus, Perfume and maybe Miss Potter are to follow, but New Line still holds on to Little Children with a frim grip.</blockquote><br/><br/>miss potter! i love the old peter rabbit books, so i'm very excited for that one.<br/>and i'm excited pan's is staying!",
      "created_at": "2007-02-20T08:15:29.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "I'm flockin' people to that schnaz. Frisco time. All shall see Pan's.",
      "created_at": "2007-02-20T08:45:17.000Z"
    },
    {
      "author": "Becca",
      "body": "I want to document the new sign's placement.  My camera does too.",
      "created_at": "2007-02-20T14:02:56.000Z"
    },
    {
      "author": "Aprilcakes",
      "body": "I'm so excited about the sign, and that the theater is getting so many new people in!!!  Yaaaaahooooo!",
      "created_at": "2007-02-20T22:12:27.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "<blockquote><cite>Posted By: Master RJ</cite>but New Line still holds on to Little Children with a firm grip.</blockquote>dont we all?  wait... what?<br/><br/>(phil hacked my account)",
      "created_at": "2007-02-21T14:14:20.000Z"
    },
    {
      "author": "tim",
      "body": "donkey omelets... is that slang for testicles?",
      "created_at": "2007-02-22T05:59:48.000Z"
    },
    {
      "author": "brad",
      "body": "i just wanted to second/third the comments on the awesome-ness of the pan's success. i hope volver does the same for you homies, you deserve it.",
      "created_at": "2007-02-22T10:00:33.000Z"
    },
    {
      "author": "stevie_g",
      "body": "Hey, keep us abreast of the of the new sign; if I'm free at the time, I'd like to come shoot some pictures for posterity.",
      "created_at": "2007-02-22T23:20:18.000Z"
    },
    {
      "author": "Vikingwarrior",
      "body": "I could really go for a donkey omelet...",
      "created_at": "2007-03-25T18:54:38.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
