{
  "id": 484,
  "title": "Blah blah blah... what's new",
  "body": "Wow! It's been a whirlwind of a week. Monday came and went, and I completely forgot to write a new post. In fact, I didn't remember until my dad asked me earlier today if I had stopped updating the blog. Thanks for the reminder dad.\r\n\r\nBetween the additional showings of PAN'S LABYRINTH, which are still packing the house no matter when we schedule them, and the MFAS's film festival, we worked nearly 50 hours this last weekend. We barely had time to schedule in 7 hours of sleep! Either way, we made it through, and our film schedule is finally starting to return to normal.\r\n\r\nNicole and I will be heading up to Columbia on Friday for the True/False Film Festival, so you can expect my next post to be a lengthy review of all the films we were able to pack in over the weekend. If all goes well, we should be seeing thirteen new documentaries, and meeting lots of cool filmmakers. We're leaving the theater in the capable hands of our trustworthy employees, and Nate too, so hopefully we won't have a repeat of last year's T/F weekend... which I won't even bother recapping. If you stop by, make sure to give them a hard time.\r\n\r\nAs for our much anticipated neon sign, it's still sitting in the shop, waiting for final approval from the city before it can be installed. Apparently the permit was given to the wrong person, who stuck it in the wrong folder, where it sat unnoticed for nearly a month and a half, which is why we're still waiting. I'm hoping it will be up in early March, but you never know. Keep your fingers crossed.\r\n\r\nIn other news, I finally broke down and bought a new computer, an HP laptop. It's been nearly five years since my last computer, so I figured it was time for an upgrade. I'm glad I decided to go with a laptop instead of building another desktop PC, because I'm really tired of being chained to one place when I need to get work done. I'm already fantasizing about working in such exotic locales as: our apartment, the FRONT of the Cinebar, in the auditorium, the Mudhouse, Panera Bread, the library... basically anywhere I can pick up a decent WiFi signal. I can't wait!\r\n\r\nWhat else? What else?\r\n\r\nHmm, I think that's it. My mind's fried right now, so I better end this before I start going on about how nice certain actresses looked at the Oscars. Adios, until next week!!!\r\n",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-02-28T06:55:20.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Caleb",
      "body": "<blockquote><cite>Posted By: dan</cite>If you stop by, make sure to give them a hard time.</blockquote>Thanks Dan!!! :-P",
      "created_at": "2007-02-28T07:10:10.000Z"
    },
    {
      "author": "nate",
      "body": "I'm stealing popcorn.",
      "created_at": "2007-02-28T07:53:08.000Z"
    },
    {
      "author": "evilvet",
      "body": "Pan's Lab bought you a shiny laptop.  Nice!",
      "created_at": "2007-02-28T08:48:12.000Z"
    },
    {
      "author": "dan",
      "body": "<blockquote><cite>Posted By: evilvet</cite>Pan's Lab bought you a shiny laptop.  Nice!</blockquote>\r\nWell, in all actuality, my freelance programming bought me a new laptop. PAN'S helped us pay for our new sign though.",
      "created_at": "2007-02-28T09:18:34.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: nate</cite>I'm stealing popcorn.</blockquote>\r\n\r\nI'm stealing Nate's popcorn.",
      "created_at": "2007-02-28T09:37:19.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "<blockquote><cite>Posted By: EdMo</cite><blockquote><cite>Posted By: nate</cite>I'm stealing popcorn.</blockquote>\r\n\r\nI'm stealing Nate's popcorn.</blockquote>im getting free popcorn ..........4 life!\r\n\r\n....  suckaahs!",
      "created_at": "2007-02-28T14:56:53.000Z"
    },
    {
      "author": "HonkeyHero",
      "body": "I almost got free popcorn the other day... \r\n\r\nAnd Nate spilled half my soda and I have a pretty good idea some saliva was also in the bottle... \r\n\r\nOh and it was cool to meet you Nate... Even with the spit soda..",
      "created_at": "2007-02-28T23:04:51.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
