{
  "id": 485,
  "title": "A great weekend... True or False?",
  "body": "I've been sitting here for the last 15 minutes trying futilely to write the first paragraph of this post, but nothing seems to sound right. It's difficult to adequately express all the stuff that happened this weekend - all the films we saw at T/F, the fear of leaving the theater for an entire weekend, the popper breaking, the new lamphouse being installed, and on and on and on. I guess the easiest way to approach this is to simply break it down like I always do; using disjointed sections that have no connection to each other.<br/><br/>Let's begin.<br/><br/><b>T/F 2007</b><br/><br/>This year's True / False Film Festival was absolutely amazing. We managed to cram in eight movies, two events, and several tons of food into a three day excursion to our old stomping ground, Columbia, MO. The festival kicked off on Friday with the \"March march,\" a festive pseudo-parade that marched from The Blue Note to the Missouri Theater, where it culminated in a street party, complete with fire jugglers. After the march, it was time to start watching movies. Here's a brief synopsis and review of all the films we managed to see:<br/><br/>- IN THE SHADOW OF THE MOON - This was the opening night film, and it was fantastic. The movie focuses on the Apollo space program, which might seem a bit boring or overdone, but the director skillfully used never-before-seen footage along with candid, and often hilarious, interviews from nearly every surviving Apollo astronaut (except Neil Armstrong, who is notoriously reclusive) to craft an enlightening and engaging film. The film has a very wide appeal, and I'm sure it will grace The Moxie's screen later this year.<br/><br/>- AIR GUITAR NATION - This hysterical film documents the formation of the first U.S. Air Guitar competition, and the cast of wacky participants who would become the nascent sport's first superstars. It's fast-paced, hilarious, and surprisingly inspirational. We have HUGE plans for this one, but I won't tell you what they are just yet. I would, however, encourage you to blow the dust off your old air guitar, and start polishing up your moves...<br/><br/>- THE ARMSTRONGS - This BBC series-turned-film is an Office-esque look at a married couple, the Armstrongs, who run their own DIY sun porch business. The premise had potential, and there were numerous \"laugh out loud\" moments, but the film seemed to struggle under the weight of a feature length running time. Had it been a 30 minute episode, which is what it was originally, it would've been perfect.<br/><br/>- MANDA BALA - The winner of the Cinematography Award and the Grand Jury Prize at this year's Sundance Film Festival, this film was an incredible, almost unbelievable journey into the seedy underground of Sao Paulo. Unfortunately, Nicole and I had a difficult time staying awake during this feature... not because it was boring, but because we were having a hard time seeing the subtitles, and we were really full (and slightly drunk) from the Filmmaker's Fete. We're terrible, I know.<br/><br/>- THE THIRD MONDAY IN OCTOBER - Wonderful film about middle school student body elections. Imagine SPELLBOUND, but replace spelling bee competition, with heated middle school campaign tactics (stenciled shirts, poster vandalism, free handmade stickers). This was a HUGE crowd-pleaser, and one you'll definitely be seeing at The Moxie... probably around election time next year.<br/><br/>- RAIDERS: THE ADAPTATION - The film lots of people have heard of, but few have been lucky enough to see. This film is a loving recreation, shot by shot, of INDIANA JONES AND THE RAIDERS OF THE LOST ARC, directed, acted, and produced between 1982 and 1988 by a group of dedicated teenagers from Mississippi. It. Was. Awesome. But getting to hear the guys talk about making the film was even more awesome, if you can imagine. I'd love to bring this film, along with the filmmakers, to Springfield one day... but they seem pretty busy these days.<br/><br/>- AMERICAN SHOPPER - This was the closing night film, and it was well worth the wait. The short synopsis is \"a film about the sport of 'aisling',\" but that doesn't really do it justice, since you probably have no idea what the hell \"aisling\" even is. You will though... oh yes, you will. The film was funny, touching, and filmed entirely in Columbia, MO, in the old grocery store Nicole and I used to shop at. This one will definitely be showing up in Springfield, sooner or later.<br/><br/>And now I don't know what else to write. I originally started this post three days ago, so it seems very disjointed to me now. Let's see... what else? What else?<br/><br/>Oh yeah, the popper broke on Saturday night, and it's still in the shop. The guy who's repairing it told me it should be ready tomorrow, but I'm not holding my breath. They offered to rent us a popper for $75 a day, but I doubt we could sell enough popcorn to make our money back. Talk about a ripoff!<br/><br/>The new lamphouse was installed on Monday. We upgraded from a single phase 1600 watt bulb, to a triple phase 2000 watt bulb. The result is a slightly brighter picture that is uniformly lit from side to side, and is much more stable (i.e. no more flickering). It's a huge, HUGE improvement.<br/><br/>Ok, I'm spent. End of post.<br/>",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-03-08T08:54:26.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nicole",
      "body": "Yowza! True False was the best weekend in ages. Did Dan mention all the free food? I don't think he was clear on that. I'm talking, chocolate mousse, spring rolls, high-end vodka, Schlafly beer, wine, green tea sodas...the selection of food rivaled the selection of films. But I think the films won the battle. They were amazing this year.",
      "created_at": "2007-03-08T09:17:28.000Z"
    },
    {
      "author": "EdMo",
      "body": "I was saddened when the popper went kaput.  I was on a roll, serving out popcorn freshness to eager new patrons who were falling in love with the Moxie's awesome environment.  And then, it suddenly, without warning, shot off.  No explosions like the projector.  No noises of any kind.  It's like it just gave up on life...<br/><br/>Until the repaired, more fully operations popper battlestation will commence popping.  Then all will be well.",
      "created_at": "2007-03-08T09:35:35.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Man, those all sound SO good.<br/><br/>Definitely Raiders, Third Monday In October, and Air Guitar ones! Those are excitin' me!<br/><br/>Election time <em>NEXT YEAR</em>?! Really, Dan?",
      "created_at": "2007-03-08T09:36:46.000Z"
    },
    {
      "author": "dan",
      "body": "<blockquote><cite>Posted By: The Four Finger Soc Em</cite>Election time<em>NEXT YEAR</em>?! Really, Dan?</blockquote><br/>That's straight from the mouth of the filmmaker. I was hoping they'd push it earlier, but they want to do a big coordinated marketing effort with various candidates, etc..",
      "created_at": "2007-03-08T09:39:21.000Z"
    },
    {
      "author": "nicole",
      "body": "These films are on the festival circuit right now. It will probably take a good while for most of them to make it to theaters. We're biting our nails with anticipation!",
      "created_at": "2007-03-08T09:41:25.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Wow. Can you tell us if you'll be getting it?<br/><br/>And just so you know, I REALLY wanna see that Raiders one. And I'm sure Brook would be even more excited.",
      "created_at": "2007-03-08T09:42:18.000Z"
    },
    {
      "author": "dan",
      "body": "We'll be trying to get nearly every film we saw at some point in the future.",
      "created_at": "2007-03-08T09:44:15.000Z"
    },
    {
      "author": "dan",
      "body": "And here's a <a href=\"http://www.indiewire.com/ots/2007/03/truefalse_serve.html\">nice article</a> on T/F from IndieWire.",
      "created_at": "2007-03-08T09:53:11.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Alright, sweet, bra. (slides reflective sunglasses back on and heads out into the night surf)",
      "created_at": "2007-03-08T09:53:30.000Z"
    },
    {
      "author": "HollywoodOz",
      "body": "Long time listener, first time caller.<br/><br/>Saw Air Guitar Nation at SXSW last year and haven't had a better time at any movie since.<br/><br/>So. Frickin'. Great.<br/><br/>I just felt the urge to say that, because greatness should be trumpeted. Or air guitared. <br/><br/>While wearing a Hello Kitty backpack.",
      "created_at": "2007-03-08T14:26:46.000Z"
    },
    {
      "author": "nate",
      "body": "These all sound <em>sooooo </em>great.<br/><br/>I feel stupid for never having gone up for this before (though the last 2 years I had to fill in at the moxie).<br/>But we're always bemoaning the lack of culture in the region, and here, not 2 hours away, is one of the premiere film festivals that just happens to focus on what has quickly become my favorite <em>type </em>of film in recent years.  (type?  genre?)<br/>Whatever.  I <em>love </em>documentaries!!!",
      "created_at": "2007-03-08T20:27:36.000Z"
    },
    {
      "author": "HollywoodOz",
      "body": "In that case, may I recommend keeping an eye out for <a href=\"http://www.darkonthemovie.com/\">Darkon</a>.<br/><br/>Second best doco I saw last year, and it seems to have inexplicably missed the massive stonking release and permanent place in popular culture that it deserves.",
      "created_at": "2007-03-08T23:28:54.000Z"
    },
    {
      "author": "tim",
      "body": "DARKON!!!!! (i second this)",
      "created_at": "2007-03-09T08:14:28.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
