{
  "id": 486,
  "title": "The Moxie and The Gillioz, Together At Last!!!",
  "body": "If you've been to The Moxie over the past two weeks, I'm sure you've heard me go on and on, at considerably length, about our newly forged partnership with The Gillioz, and our upcoming fundraiser on March 30th. I even made a trailer for the event - complete with the \"Let's All Go To The Lobby\" jingle! Suffice it to say, we're extremely excited about this opportunity, and even more so about our kick-off event at the end of the month. For those of you who have no idea what I'm talking about, or haven't been lucky enough to hear one of my twelve minute introductions (six of which is about The Gillioz), let me fill you in on what's going down.\r\n\r\nI originally announced our partnership with The Gillioz back in <a href=\"/posts/484\">late January</a>, and since that time we've been working to organize a big event to mark the beginning of our joint venture to bring bigger and better films downtown. So, on the evening of Friday, March 30th we'll be hosting a FREE screening of PRESERVE ME A SEAT at The Gillioz. The film, which has been making the rounds on the film festival circuit, documents the attempts of several American cities to save their historic movie theaters from the wrecking ball. We even managed to talk the film's director, Jim Fields, to drive down from Omaha, Nebraska to speak at, and film the event.\r\n\r\nAlthough we're calling this event a fundraiser, don't feel like you can't come if you can't donate some money. In fact, if you find yourself in the position of not having money to donate, but still wanting to help further our cause, the simple act of showing up would be a donation in and of itself. My goal is to fill the theater to capacity, all 1,100 seats, so everyone there can really, truly feel what it's like to see a film in a destination theater. When was the last time you watched a film with 1,100 other people? Can you remember the last time you were in an auditorium that was just as spectacular and inspiring as what was playing on the screen?\r\n\r\nIf we can sell out the auditorium on March 30th, it will be the largest indoor movie audience in Springfield since the Gillioz closed its doors nearly 30 years ago in 1979. Imagine the impact that will have on the audience! If we do our job right, every person in attendance will become a walking advertisement for future film events. Seeing a film in such a unique auditorium is contagious, it's addictive, and most importantly, it's something you'll want to do again and again.\r\n\r\nSo, please, come one, come ALL! Bring your friends, bring your family, drag strangers in from off the street. Help us make this one of the biggest movie events in Springfield, and we'll do our best to keep you coming back with unique film programming that you'll only be able to see at The Gillioz and The Moxie.\r\n\r\nHere's to the beginning of a beautiful friendship!\r\n\r\n<img src=\"http://www.moxiecinema.com/pix/movies/180.jpg\" width=\"425\" alt=\"Together at last\" />",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-03-13T05:13:49.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "The Four Finger Soc Em",
      "body": "This is a great idea, and I'll try to attend, but there is one problem, it's during Spring Break. Don't know if we'll be back yet...",
      "created_at": "2007-03-13T04:17:46.000Z"
    },
    {
      "author": "dan",
      "body": "If it helps, it will be over by 9:00, so there's still plenty of time to go out. If you can't come, Max, make sure you tell all your friends about it.",
      "created_at": "2007-03-13T04:19:34.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Well, yes, I will def. spread the word, it's just that there may be lots of people out of town. But it'll be a great big deal, and I'm sure there'll be ample persons. And again, I'm going if I can.",
      "created_at": "2007-03-13T04:22:32.000Z"
    },
    {
      "author": "permutation",
      "body": "I will try to be there, too! The Rainbow Girls have missed you guys these last two weeks (we're the crazy ladies who drink martiniis and come in on mondays). Last Monday was a movie we'd already seen and today we all had work commitments (YECH).\r\n\r\nI know you didn't need our life story but.....that's just how I roll. See you soon!",
      "created_at": "2007-03-13T04:40:33.000Z"
    },
    {
      "author": "Caleb",
      "body": "Danicole: you should make a Facebook \"event\" for this and then you guys can invite all us and we can all invite all our friends and they can invite theirs and so on... It might help a little at least!",
      "created_at": "2007-03-13T04:56:14.000Z"
    },
    {
      "author": "dan",
      "body": "<blockquote><cite>Posted By: Caleb</cite>Danicole: you should make a Facebook \"event\" for this and then you guys can invite all us and we can all invite all our friends and they can invite theirs and so on... It might help a little at least!</blockquote>\r\nDone and done.",
      "created_at": "2007-03-13T05:31:05.000Z"
    },
    {
      "author": "dan",
      "body": "BTW, that amazing picture was taken by Justin Glow, master photographer.",
      "created_at": "2007-03-13T05:31:33.000Z"
    },
    {
      "author": "Maddy",
      "body": "Wowsers!  Can someone make a paper cut out of me and put it in a seat?  I want to be there... but alas, there are too many miles to drive and state lines to cross...",
      "created_at": "2007-03-13T06:08:32.000Z"
    },
    {
      "author": "nicole",
      "body": "We could probably make some \"seat fillers\" of celebrities, like when they do a trial run of the Oscars. Yeah!",
      "created_at": "2007-03-13T06:56:42.000Z"
    },
    {
      "author": "nate",
      "body": "This will be cool.",
      "created_at": "2007-03-13T17:40:23.000Z"
    },
    {
      "author": "Megster",
      "body": "i will try to come... but i might be out of town still... i will at least try to send as many people as i can...",
      "created_at": "2007-03-13T17:44:23.000Z"
    },
    {
      "author": "evilvet",
      "body": "It's unfortunate that we couldn't arrange a veterinary health care event to coincide with this exciting night that would call attention to pet intestinal parasites.  We could have set up a microscope in the lobby for a different kind of free screening, and called the gala \"Preserve Me a Seat, Bring Me A Stool.\"",
      "created_at": "2007-03-15T00:27:31.000Z"
    },
    {
      "author": "ariananana",
      "body": "i've invited everyone i know. my parents are going to go.",
      "created_at": "2007-03-15T19:24:09.000Z"
    },
    {
      "author": "cerealbyter",
      "body": "Hey Dan!!! I've been threatening people on myspace to get them to go to your Gillioz movie. I think I may have to cut off this one guys feet.....I probably won't be able to make it....",
      "created_at": "2007-03-19T02:34:50.000Z"
    },
    {
      "author": "dan",
      "body": "<blockquote><cite>Posted By: cerealbyter</cite>Hey Dan!!! I've been threatening people on myspace to get them to go to your Gillioz movie. I think I may have to cut off this one guys feet.....I probably won't be able to make it....</blockquote>\r\nI appreciate it! Do what you must!",
      "created_at": "2007-03-19T04:12:24.000Z"
    },
    {
      "author": "ariananana",
      "body": "....if you are going to get handbills, let me know....i am more than happy to hand them out at mi escuela/colegio (?) but yes...thank god for facebook invites",
      "created_at": "2007-03-19T16:40:53.000Z"
    },
    {
      "author": "Master RJ",
      "body": "I'll be coming!",
      "created_at": "2007-03-29T20:39:57.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
