{
  "id": 487,
  "title": "Grilled Cheese at The Moxie",
  "body": "Since we opened over a year and a half ago, one of the most frequent requests we've had is to add more \"real food\" to the Cinebar menu. If you were to come into The Moxie tonight, the only hunger-quenchers we have to offer are popcorn, candy, and our tasty baked goods from Tea Bar and Bites. While that selection is enough for most people, we still get requests for something a bit more substantial.\r\n\r\nWe've considered several options in the past: roasted nuts, hot dogs made from locally-grown beef, pizza, etc.. After considering the cost of equipment, and the space needed, we ended up nixing those ideas, but we recently starting consider something new... grilled cheese sandwiches.\r\n\r\nWhat we're envisioning is having a choice of 3 or 4 different cheeses, a couple different types of bread, and maybe some special seasonings to really make the sandwiches POP in your mouth. We'd need to buy a professional panini grill, like the kind they use at Panera Bread, but that's really the only special equipment we'd need. And since cheese has a much longer shelf life than pizza or hot dogs, we won't have to be constantly throwing away uneaten food.\r\n\r\nNow, this isn't something that's going to happen overnight, so don't expect to be able to order a delicious Moxie grilled cheese this weekend. We'll have to wait until we clear off our business credit card, which will probably be in the next month or two, before we can afford a high-quality panini grill, but after that... prepare to stuff yourself silly with the best grilled cheese sandwiches this side of the Mississippi!\r\n\r\nAWESOME!\r\n\r\nSo what do you think? Would you partake of a tasty Moxie Grilled Cheese (MGC)?",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-03-21T05:21:47.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Master RJ",
      "body": "I'm for it.\r\n\r\nBy the way, Dan, are you afraid of losing business from the Dive-In Theatre that just opened? I'm just asking.",
      "created_at": "2007-03-21T04:29:53.000Z"
    },
    {
      "author": "dan",
      "body": "<blockquote><cite>Posted By: Master RJ</cite>By the way, Dan, are you afraid of losing business from the Dive-In Theatre that just opened?</blockquote>\r\nNope.",
      "created_at": "2007-03-21T04:40:22.000Z"
    },
    {
      "author": "moxie-lover89",
      "body": "grilled cheese sounds delighful. \r\nbut i must know, where is this drive-in theater????",
      "created_at": "2007-03-21T04:55:18.000Z"
    },
    {
      "author": "dan",
      "body": "It's the Dive-In Theatre, they're a new second-run theater downtown. You can check out their website <a href=\"http://www.diveintheatre.com\">here</a>.",
      "created_at": "2007-03-21T05:34:51.000Z"
    },
    {
      "author": "tim",
      "body": "grilled cheese is brilliance. that and a beer. wow. \r\nhow much would you consider charging for one of those there grilled guys?",
      "created_at": "2007-03-21T06:04:15.000Z"
    },
    {
      "author": "dan",
      "body": "<blockquote><cite>Posted By: tim</cite>how much would you consider charging for one of those there grilled guys?</blockquote>\r\nI'm not sure yet. We'll have to wait and see how much the ingredients will cost us. I'd imagine somewhere around $3 or $4.",
      "created_at": "2007-03-21T06:07:58.000Z"
    },
    {
      "author": "HollywoodOz",
      "body": "I have two words for you - Craigs List.\r\n\r\nWait, is that one word or two?\r\n\r\nThere are tons of cafes and restaurants going out of business every day, and there's a lot of ex-restaurant equipment for sale on CL as a result. I nearly bought a big ass pizza oven for $1500 just last week. So close...\r\n\r\nSeriously though, don't buy restaurant equipment new. It's shinier, but no better.",
      "created_at": "2007-03-21T08:20:29.000Z"
    },
    {
      "author": "HollywoodOz",
      "body": "BTW, the Dive-In's testimonials page is a must-see.",
      "created_at": "2007-03-21T08:23:28.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "I would buy a grilled cheese more often than not. My mouth is watering as we speak... well, until I used the phrase \"my mouth is watering\" just there, because that saying always turned me off. But I'm still ON for grilled cheese, oh baby!",
      "created_at": "2007-03-21T09:48:07.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "i too would be all about this grilled cheese\r\nespecially the thought of exotic breads.. cheeses.. and seasonings....\r\nim sure nicole could come up with some gread recipe ideas...\r\n\r\nand this dive in theater?  i somehow hadnt heard of it \r\nim sure ill check it out at some point.... but reading their website (which could use a better web designer.. err)\r\n... i admit i am a bit apprehensive... ...im not much for people yelling and talking through a movie\r\nmaybe ill go see one that ive already watched many times over... to ensure that i dont get pissed off at people",
      "created_at": "2007-03-21T10:10:35.000Z"
    },
    {
      "author": "Caleb",
      "body": "grilled cheese...yumz...\r\n\r\nAnd yeah - the whole talking during the movie thing at the Dive-in really turns me off to the whole idea. That and the fact that you have to watch it on an LCD unless you get the special projection screen seats. And their website....yeah.\r\n\r\nI love the Moxie. :-)",
      "created_at": "2007-03-21T10:31:05.000Z"
    },
    {
      "author": "nate",
      "body": "This is, like, the best idea you've ever had, Danicole, the BEST, and I'm going all the way back to your births.  <em>Maybe </em>it's runner up to the decision to marry each other, and then the decision to open the Moxie - <em>maybe </em>- but even that's only because those decisions were necessary prerequisites to making this grilled cheese sandwich thing happen.  dear jesus.",
      "created_at": "2007-03-21T16:11:43.000Z"
    },
    {
      "author": "Maddy",
      "body": "My [enter religious diety here]!\r\n\r\nThat is the most [adjective] website I have ever seen.  It is worse than [competitor].com.  No one should ever put a website up for the public when it is still so [adjective].  Geesh, it is good to know [name and/or names] are making their site so personable.\r\n\r\n[Name of poster]",
      "created_at": "2007-03-21T16:55:58.000Z"
    },
    {
      "author": "nate",
      "body": "re Dive In:    I like their logo!  Really!",
      "created_at": "2007-03-21T17:10:42.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "<blockquote><cite>Posted By: nate</cite>re Dive In:    I like their logo!  Really!</blockquote>when i made my comment above.. i came close to saying something along the lines of 'at least their logo is nice'  ... but i didnt get around to it",
      "created_at": "2007-03-21T18:34:17.000Z"
    },
    {
      "author": "HonkeyHero",
      "body": "Yep... I'm all for a real tasty 'gourmet' grilled cheese... You guys and your market tapping extensions...\r\n\r\nJust count on a lot more clean up...  (Melted cheese in the chairs!!!)",
      "created_at": "2007-03-21T19:47:16.000Z"
    },
    {
      "author": "dan",
      "body": "<blockquote><cite>Posted By: HonkeyHero</cite>Just count on a lot more clean up...  (Melted cheese in the chairs!!!)</blockquote>\r\nThat's another thing we considered, and one of the main reasons we decided not to do pizza. I don't know about you guys, but I've never made a mess with a grilled cheese sandwich. Plenty of crumbs, yes... but melted cheese? Do you open your sandwich and lick out the innards? Is that how they taught you to eat your sandwiches in Everton? Weird!",
      "created_at": "2007-03-21T20:08:24.000Z"
    },
    {
      "author": "nate",
      "body": "Mmmm... lick innards.",
      "created_at": "2007-03-21T20:12:59.000Z"
    },
    {
      "author": "HonkeyHero",
      "body": "No, but I do remember a few instances in the old Everton Cafeteria where the Grill cheese was taken apart and the innards were used as glue to put under the seats or on a wall.  I know the Moxie would not allow these types of patrons anywhere near the theater.  I guess it would be kinda the same as letting people sit on couches in the Dive Theater and worrying about people peeing on the cushions of the couch to be funny.  Or not... I don't know... I'm from Dade County...\r\n\r\nIn other news... The federal reserve did not change interest rates... Fly Stocks fly",
      "created_at": "2007-03-21T21:54:39.000Z"
    },
    {
      "author": "dan",
      "body": "Nicole is making me a grilled cheese sandwich right now. Here's the line-up:\r\n\r\nCinammon\r\nHeavy wheat bread slice\r\n4 apple slices\r\n2 slices of mild cheddar\r\nHeavy wheat bread slice\r\nCinammon\r\n\r\nShe's making herself an Italian grilled cheese, but I'm not sure what's on it.",
      "created_at": "2007-03-21T21:59:07.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "ill be right over!",
      "created_at": "2007-03-21T22:01:19.000Z"
    },
    {
      "author": "nate",
      "body": "Apple slices?!\r\n\r\n\r\nThe question/exclamation mark is not meant to indicate alarm/abhorrence, but rather some combination of surprise/intrigue/trepidation, probably in that order...",
      "created_at": "2007-03-21T22:16:20.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "cheese and apples go very good together\r\nthough ive never had such a thing with bread in the mix... i cant imagine that it would be bad though\r\nespecially with cinnamin.... mmmm",
      "created_at": "2007-03-21T22:22:27.000Z"
    },
    {
      "author": "HonkeyHero",
      "body": "OK Dan, \r\n\r\nI guess I will be your Guinea Pig if you and Nicole would like to create several variations of the Grill Cheese, I will make a special trip to the Moxie tommorow and sample them for you.  You may observe my eating habits inside the theater as well, if you must.  I guess someone has to make the sacrifice in order to lead the Moxie to even more success...\r\n\r\nAlso you will have to figure out your profit margins on this endeavor, and make sure you don't cannibalize your profits! I.E. Popcorn is $2.50 but costs you .25c  Grill cheese cost $3.00 but costs $2.00 to make.  But I'm sure you are already considering this all, especially since you went to Billings and all...",
      "created_at": "2007-03-21T22:22:34.000Z"
    },
    {
      "author": "nate",
      "body": "Employees first.",
      "created_at": "2007-03-21T22:24:28.000Z"
    },
    {
      "author": "dan",
      "body": "The cinammon apple grilled cheese was delicious. The apples were warm on the outside, but still cold and crunchy in the center, and they complimented the cheddar cheese perfectly. I didn't use much cinammon, but I could taste it ever few bites.",
      "created_at": "2007-03-21T22:25:19.000Z"
    },
    {
      "author": "HonkeyHero",
      "body": "Employees last, they would be biased!",
      "created_at": "2007-03-21T22:29:10.000Z"
    },
    {
      "author": "dan",
      "body": "<blockquote><cite>Posted By: HonkeyHero</cite>Also you will have to figure out your profit margins on this endeavor, and make sure you don't cannibalize your profits! I.E. Popcorn is $2.50 but costs you .25c  Grill cheese cost $3.00 but costs $2.00 to make.  But I'm sure you are already considering this all, especially since you went to Billings and all...</blockquote>\r\nThat's sound advice, Honkey... as in, it sounds like something <a href=\"http://www.moxiecinema.com/forum/comments.php?DiscussionID=870&page=1#Item_7\">I already said</a>. What can I expect though... you are from Everton.",
      "created_at": "2007-03-21T23:03:40.000Z"
    },
    {
      "author": "HonkeyHero",
      "body": "You barely mentioned that...   If I was grading you would get half a point... ^..^  (which is still failing)  \r\n\r\nI guess I need a new substitute since you are getting rid of my precious Ginger Ale...",
      "created_at": "2007-03-21T23:28:50.000Z"
    },
    {
      "author": "evilvet",
      "body": "Dan and Nicole:  How big of a Pannini maker do you need?  I think we may have a kitchen one lying around.  I know we have a classic american skillet (lightly used) that even has a grilled cheese setting we could lend you (Note:  The more times you get married, the more kitchen appliances you accumulate).\r\n\r\nIn the meantime, I have a great food holdover idea:  POP TARTS!  They are warm and addicting, incredibly nostalgic, and Dillon's carries every variety (generic and the real deal) ever conceived.  Heck, they could even be toasted by the customer according to their personal tastes.    DO NOT buy one of those You-Bake Waffle Irons for Moxie Waffle Lovers (Becca) they have at Comfort Inns.  They drive me nuts.",
      "created_at": "2007-03-21T23:51:22.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "thumbs down to poptarts",
      "created_at": "2007-03-22T00:07:20.000Z"
    },
    {
      "author": "evilvet",
      "body": "Don't be so quick to judge.  Pop Tarts and Beer?  A classic collegiate staple.",
      "created_at": "2007-03-22T00:36:48.000Z"
    },
    {
      "author": "dan",
      "body": "I appreciate the offer, Dr. Evilvet, but I think we're going to hold out for a professional unit, since they can grill a sandwich in just a little over a minute.",
      "created_at": "2007-03-22T00:37:37.000Z"
    },
    {
      "author": "evilvet",
      "body": "Hot pocket?",
      "created_at": "2007-03-22T00:42:47.000Z"
    },
    {
      "author": "tim",
      "body": "nicole & dan, \r\nmy parents have a crusty george forman grill you guys can have, if you want to make with the meats, the fat cup is gone, but i bet if you ask politely they will give you one of their little fish shaped soap dishes. \r\n\r\njust give me the heads up and i will give you their cell digits. \r\n\r\ncool?",
      "created_at": "2007-03-22T00:47:09.000Z"
    },
    {
      "author": "dan",
      "body": "We have our very own George Foreman Grill, but thanks for the offer!",
      "created_at": "2007-03-22T01:14:07.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "im getting very hungry for some sort of grilled sandwhich\r\nall ive eaten today.. was some andy's....  (with phil and caleb!)",
      "created_at": "2007-03-22T01:18:25.000Z"
    },
    {
      "author": "nicole",
      "body": "My grilled cheese was provolone and wheat bread, which I then cut into strips and dipped into HOMEMADE marinara sauce.",
      "created_at": "2007-03-22T03:31:18.000Z"
    },
    {
      "author": "nate",
      "body": "Dear God.",
      "created_at": "2007-03-22T03:37:33.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "I'm so excited. Nicole, will you pack me a lunch one day?\r\n\r\nI mean that <em>is</em> a joke, but... seriously.",
      "created_at": "2007-03-22T03:50:23.000Z"
    },
    {
      "author": "Master RJ",
      "body": "You made me think of elementary schools and the reasons I almost always brought a lunch.\r\n\r\nDid you know Pop Tarts aren't favorable with vegetarians?",
      "created_at": "2007-03-22T04:01:29.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Did you know your that if your hand is bigger than your face, you have scoliosis?\r\n\r\nC'mon, RJ's dad... c'mon RJ's dad...",
      "created_at": "2007-03-22T04:07:21.000Z"
    },
    {
      "author": "Caleb",
      "body": "Man...Danicole's future children are <em>luuucky. </em>\r\n\r\nAnd RJ - just curious... Why aren't pop tarts favorable with vegetarians?",
      "created_at": "2007-03-22T04:15:55.000Z"
    },
    {
      "author": "nicole",
      "body": "<blockquote><cite>Posted By: Master RJ</cite>Did you know Pop Tarts aren't favorable with vegetarians?</blockquote>\r\n\r\nThere are a lot of foods that aren't favorable to vegetarians...like meat.",
      "created_at": "2007-03-22T04:18:33.000Z"
    },
    {
      "author": "Master RJ",
      "body": "<blockquote><cite>Posted By: The Four Finger Soc Em</cite>Did you know your that if your hand is bigger than your face, you have scoliosis?\r\n\r\nC'mon, RJ's dad... c'mon RJ's dad...</blockquote>\r\n\r\nThat's cancer.\r\n\r\n\r\n\r\n\r\n<blockquote><cite>Posted By: Caleb</cite>Man...Danicole's future children are<em>luuucky.</em>\r\n\r\nAnd RJ - just curious... Why aren't pop tarts favorable with vegetarians?</blockquote>\r\n\r\nThe filling is made from gelatin, which contain extract from animal bones.",
      "created_at": "2007-03-22T04:21:53.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "I'm eager to hear where he got that information. tell us, RJ, did you see some snippet of a news headline on Good Morning America that you just had to relay to us or did you suddenly have an ingenius pop tart epiphany?",
      "created_at": "2007-03-22T04:22:09.000Z"
    },
    {
      "author": "Caleb",
      "body": "I looked it up - RJ is right, BUT I'm betting many vegetarians wouldn't care as much about gelatin, but I could be wrong. <em>Vegans</em> on the other hand...they definitely would.",
      "created_at": "2007-03-22T04:29:53.000Z"
    },
    {
      "author": "jhawk",
      "body": "@tim:  Your previous post slayed me.  Still kinda laughing...\r\n\r\n@Caleb:  Nice icon. \r\n\r\nSpeaking of, <em><strong>Lost </strong></em>is on.",
      "created_at": "2007-03-22T05:00:09.000Z"
    },
    {
      "author": "HollywoodOz",
      "body": "Back when I was young enough to be proud of my stupidity, my buddies and I used to go to McDonalds a few times a week for eats. Our local McD's was located in what had previously been an old 40's ballroom, and then a roller disco, so it had these wicked high ceilings and all sorts of awesome art deco design that was half a century old... so of course we'd open our burgers and fling the pickle slices as high as we could to see if we could hit the roof.\r\n\r\nAfter a few years of that, the black, blue and green pickles (they turn blue before they go black) numbered many dozens, and the manager of the place eventually cleaned it all up and, in doing so, painted over the art deco.\r\n\r\nThe moral of the story is 1) I'm a dick. 2) My buddies are dicks. 3) Careful what you put in those grilled cheese sandwiches, and that the individual bits won't stick to a screen when flung by bags o'douche.",
      "created_at": "2007-03-22T09:02:22.000Z"
    },
    {
      "author": "twin33",
      "body": "OF COURSE. Grilled cheese = yummy.\r\n\r\nWhat kind of cheese are you thinking about? Jap cheese would be my vote.",
      "created_at": "2007-03-22T18:43:20.000Z"
    },
    {
      "author": "dan",
      "body": "<blockquote><cite>Posted By: twin33</cite>What kind of cheese are you thinking about?</blockquote>\r\nHmm, that's a good question. We'll probably have to put it up to a vote when we get closer to grilled cheese time. My three favorites are Colby Jack, Cheddar, and American, but I'll eat any type of hard cheese.",
      "created_at": "2007-03-22T20:20:53.000Z"
    },
    {
      "author": "nate",
      "body": "<blockquote><cite>Posted By: dan</cite>My three favorites are Colby Jack, Cheddar, and American.</blockquote>\r\nMan, could you <em>be </em>any more from Billings?",
      "created_at": "2007-03-22T20:24:50.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "im willing to bet that nicole has at least 5 recipes already written up",
      "created_at": "2007-03-22T20:27:47.000Z"
    },
    {
      "author": "Megster",
      "body": "provolone is delicious in grilled cheese... i think i already posted my perfect grilled cheese recipe in another thread... italian bread, provolone, garlic powder, olive oil butter and toasting in a toaster oven... delicious!",
      "created_at": "2007-03-22T20:41:24.000Z"
    },
    {
      "author": "nate",
      "body": "No, I don't think you did.  Unless it was the food thread a ways back.  That sounds frickin' delicious.",
      "created_at": "2007-03-22T20:42:31.000Z"
    },
    {
      "author": "nate",
      "body": "Make me a grilled cheese.  NOWZ.",
      "created_at": "2007-03-22T20:42:54.000Z"
    },
    {
      "author": "dan",
      "body": "Provolone is quite delicious too. It's in my top five, along with some other cheese.",
      "created_at": "2007-03-22T20:45:53.000Z"
    },
    {
      "author": "nicole",
      "body": "I'm a big fan of semi-soft cheeses. Not sure how those would taste in grilled cheese...plus it would be so fattening! But man, a brie grilled cheese? I've made baked brie before...",
      "created_at": "2007-03-22T20:56:16.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "swiss is probably my favorite cheese...\r\nprovolone... cheddar... are probably the next two in line\r\nbut im not opposed to trying some fantastical exotic cheese that isnt quite as common\r\n\r\ncheese is probably the main reason i could never be vegan\r\ni could go without meat (although that would be quite difficult at first)\r\nand then i could go without milk... or butter or other such things.. without too much trouble i dont think\r\nbut... no cheese?   ludicrous ...",
      "created_at": "2007-03-22T20:56:22.000Z"
    },
    {
      "author": "ariananana",
      "body": "Dan, you said something about locally-grown beef? My dad owns American Pasturage, and I'm sure he'd be more than willing to strike a deal, especially because I know my mom and I patronize zee moxizizayyy...I don't know, but....schwhatevs?\r\n\r\n\r\nGrilled cheese sounds awesome.....gouda.....swiss.....mmm",
      "created_at": "2007-03-22T21:25:28.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Colby Jack? Wasn't he on Survivor?",
      "created_at": "2007-03-22T21:34:30.000Z"
    },
    {
      "author": "twin33",
      "body": "you all are crazy commenters, i wrote my question about types of cheese 2 hrs ago and already there have been 10 comments, i can't believe i haven't tapped into your addicting wed-based fun until now...\r\nplease say that someone else like jalapeno cheese. Its fantastic.",
      "created_at": "2007-03-22T21:36:41.000Z"
    },
    {
      "author": "nate",
      "body": "<blockquote><cite>Posted By: Master RJ</cite>Colby Jack? Wasn't he on Survivor?</blockquote>\r\nThat's funny because on Season 2 of Survivor (in Australia) the guy's name was Colby.\r\n\r\nWhich is the same name that the cheese (Colby) has.\r\n\r\nThey have the same name.  Too funny.  \r\n\r\nAm I right people?",
      "created_at": "2007-03-22T21:36:52.000Z"
    },
    {
      "author": "nate",
      "body": "Welcome, twin!  Prepare to lose a large portion of your life to the forums.",
      "created_at": "2007-03-22T21:38:37.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "this is the part.. where i look up the name Michelle Houghton on facebook..\r\nand weird her out by mentioning it... and then later on when we run into eachother IRL ... she'll realize im harmless and somewhat normal\r\n... wait.... what?  no facebook profile?   WTF?   \r\nwhats with kids today... dont they want to stay on the cutting edge?\r\nlaziness.. i say",
      "created_at": "2007-03-22T21:43:07.000Z"
    },
    {
      "author": "dan",
      "body": "Michelle is the first and only person to get engaged at the Moxie... and she and her husband, Jeff, hung out with us during T/F weekend.",
      "created_at": "2007-03-22T22:23:32.000Z"
    },
    {
      "author": "nicole",
      "body": "Ari - is American Pastorage the one out in Marionville? If so, I'm planning on making a field trip out there later this spring.",
      "created_at": "2007-03-22T22:30:18.000Z"
    },
    {
      "author": "evilvet",
      "body": "Although even less appealing to vegetarians than Pop Tarts, you kids are just a few ingredients away from the perfect sandwich.  The Reuben.  Ahh, the smell of saurkraut and corned beef wafting through the Moxie auditorium air...I'd pray to it.",
      "created_at": "2007-03-22T22:59:41.000Z"
    },
    {
      "author": "ariananana",
      "body": "<blockquote><cite>Posted By: nicole</cite>Ari - is American Pastorage the one out in Marionville? If so, I'm planning on making a field trip out there later this spring.</blockquote>\r\n\r\nyes, that's my dad's office! Let me know when you're going, i'll come out too and mi madre and i will make tea and crumpets. seriously on the crumpets bit.",
      "created_at": "2007-03-22T23:06:54.000Z"
    },
    {
      "author": "Master RJ",
      "body": "The smell of sauerkraut makes me gag.",
      "created_at": "2007-03-22T23:07:31.000Z"
    },
    {
      "author": "evilvet",
      "body": "I thought American Pastorage was a Philip Roth book.",
      "created_at": "2007-03-22T23:15:12.000Z"
    },
    {
      "author": "ariananana",
      "body": "Pasturage.",
      "created_at": "2007-03-22T23:20:19.000Z"
    },
    {
      "author": "tim",
      "body": "<blockquote><cite>Posted By: nicole</cite>I'm a big fan of semi-soft cheeses. Not sure how those would taste in grilled cheese...plus it would be so fattening! But man, a brie grilled cheese? I've made baked brie before...</blockquote>\r\n\r\ni just made a brie grilled cheese! well... broiled. \r\non crispy french bread with maple syrup, walnuts, and a light dusting of chili powder. \r\n\r\nsooooooo goooooood.",
      "created_at": "2007-03-23T00:35:39.000Z"
    },
    {
      "author": "nate",
      "body": "Danicole:  Did you guys consider PB & J's?\r\n\r\nWait.  Who do I think I'm talking to?  Of course you considered it.  I guess I'm wondering why it was rejected.  Too blah and/or easily made at home to convince people to buy them?  I think you could sell them cheap... maybe $2, and that would be a good incentive, yes?  I'd buy the hell out of $2 PB & J's.  Don't kiss me after, though.",
      "created_at": "2007-03-23T00:39:38.000Z"
    },
    {
      "author": "Caleb",
      "body": "<blockquote><cite>Posted By: nate</cite>I'm wondering why it was rejected.</blockquote>do you want to scrub peanut butter and jelly off the seats, nate?",
      "created_at": "2007-03-23T00:44:55.000Z"
    },
    {
      "author": "nate",
      "body": "Is that worse than melted cheese?  There would be some smearage here and there, but no more than the cheese, I'd imagine.\r\nAnd there would be no cheese-griller thing to clean every night either.",
      "created_at": "2007-03-23T00:49:07.000Z"
    },
    {
      "author": "nate",
      "body": "Wait.  Let me be clear, I'm not advocating PB&J's <em>instead </em>of grilled cheeses, but in <em>addition </em>to.  I'm just saying, that if we're willing to clean a cheese-griller thingy every night, then should we rule out PB&J's because there will be a bit of jelly on the floor, and <em>no </em>cheese-griller thingy to clean?  Just wonderin'.",
      "created_at": "2007-03-23T00:51:02.000Z"
    },
    {
      "author": "Caleb",
      "body": "Ooh, good points. Yes, the cheese on the seats/floor will be a fun new addition to the Moxie. But I'm still excited for grilled cheese.",
      "created_at": "2007-03-23T00:52:36.000Z"
    },
    {
      "author": "dan",
      "body": "I don't think the cheese will be a problem. Unlike jelly, cheese doesn't drip out of a properly grilled sandwich. It's also about appeal. I think grilled cheese would be more appealing to more people than PB&J.",
      "created_at": "2007-03-23T00:58:01.000Z"
    },
    {
      "author": "nate",
      "body": "*sigh*",
      "created_at": "2007-03-23T00:59:08.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Plus, cheese isn't sticky.",
      "created_at": "2007-03-23T01:04:01.000Z"
    },
    {
      "author": "dan",
      "body": "And futhermore, PB&J is pretty much just that... peanut butter & jelly, but imagine all the different varieties of grilled cheese we can make! With just TWO choices of bread, THREE choices of cheeses, and THREE choices of spice, you can make over 40 different kinds of grilled cheese sandwiches.",
      "created_at": "2007-03-23T01:10:20.000Z"
    },
    {
      "author": "tim",
      "body": "at the cafe in my alma mater, they had a huge basket in the fridge of giant PB & J's for 2 bucks a piece, i would have starved to death if it wasn't for those delicious nut buttered babies. cheap. filling. delicious. point is, no one can get sick of PB & J, they can be premade, and if served wrapped up in plastic, there would be no drippage, start at one end and and unwrap as you eat. perfect! \r\n\r\ndo this too!!!! \r\n\r\nORANGE SODA AND PB&J would be the bees knees.",
      "created_at": "2007-03-23T01:10:45.000Z"
    },
    {
      "author": "tim",
      "body": "<blockquote><cite>Posted By: dan</cite>And futhermore, PB&J is pretty much just that... peanut butter & jelly, but imagine all the different varieties of grilled cheese we can make! With just TWO choices of bread, THREE choices of cheeses, and THREE choices of spice, you can make over 40 different kinds of grilled cheese sandwiches.</blockquote>\r\n\r\nnope! \r\n\r\nthere are many types of nut butters, breads, and jelly, spices, and fruits. \r\n\r\nnutella and bananas!\r\nfluffernutters!\r\nalmond butter with black berry jam!\r\nPB & Honey\r\n seriously, think of the combinations !!!!",
      "created_at": "2007-03-23T01:14:55.000Z"
    },
    {
      "author": "nate",
      "body": "I was thinking the pre-made route too, wrapped in plastic, though that limits tim's mega combination extravaganza that he also suggests.  Seems to me like you have to go one route or the other.\r\nBut whatever.  I'm just happy with the grilled cheese thing.  And the combinations!",
      "created_at": "2007-03-23T01:30:14.000Z"
    },
    {
      "author": "Caleb",
      "body": "Heh heh. Tim is making some very good points...and it wouldn't require the purchase of a grill...",
      "created_at": "2007-03-23T01:34:12.000Z"
    },
    {
      "author": "EdMo",
      "body": "Feta is excellent grilled...maybe a Mediterranean grilled cheese?\r\n\r\nFeta, olive tapenade (sp?), romaine lettuce?",
      "created_at": "2007-03-23T01:36:59.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "now... ... before i say anything.. let me explain that i *LOVE*  PB & J\r\ni have in stock a variety of different kinds of peanut butter and jelly at all times\r\n... have you seen some of the new flavors they've of peanut butter come out with over the past few years?  its insane!!\r\n\r\nbut never the less... i really dont like the thought of pb&j being at the moxie\r\nthats something ... anyone could make\r\n\r\nbut having special recipe... super fancical (not a word) grilled cheeses.... \r\nnow that is just plain genius.. and cant be easily recreated\r\nalso ... (as dan stated and i already kinda thought) my brain cant imagine cheese \r\ndripping out of a grilled cheese sandwich very easily... but obviously jelly would be all over the place\r\nunless you didnt put much on it... but i wouldnt want a PBJ with only a little *J* in the mix",
      "created_at": "2007-03-23T02:18:25.000Z"
    },
    {
      "author": "jhawk",
      "body": "Messy?  Unpossible...\r\n\r\n<img src=\"http://biomesblog.typepad.com/the_biomes_blog/files/grillcheese.jpg\" alt=\"Gooey dripping cheese\" />",
      "created_at": "2007-03-23T02:40:51.000Z"
    },
    {
      "author": "Ian",
      "body": "Bring on the grilled cheese and put it in my mouth.",
      "created_at": "2007-03-23T02:55:36.000Z"
    },
    {
      "author": "EdMo",
      "body": "The only cheese I have in the house is some Osceola 5-year aged Sharp Cheddar....should I grill it?  SHOULD I????",
      "created_at": "2007-03-23T03:27:08.000Z"
    },
    {
      "author": "twin33",
      "body": "El Brian De Moore said: \"this is the part.. where i look up the name Michelle Houghton on facebook..\r\nand weird her out by mentioning it... and then later on when we run into eachother IRL ... she'll realize im harmless and somewhat normal\r\n... wait.... what? no facebook profile? WTF? \r\nwhats with kids today... dont they want to stay on the cutting edge?\r\nlaziness.. i say\"\r\n\r\nOh Brian Brian Brian.... i am so cutting edge you have no idea. And I am by no means lazy. we could have a contest and i might just kick your ass... \r\nJ/k: i have a myspace profile, not facebook. its on my account info now so that you and other stalkers can look me up.",
      "created_at": "2007-03-23T05:03:43.000Z"
    },
    {
      "author": "twin33",
      "body": "Oh, and on the pbj subject, i think that could be too bland. You could get a crep maker though and make CREPS w/ nutella and bananas, breakfast creps, cheese creps... omg i'm hungry.",
      "created_at": "2007-03-23T05:05:27.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "crepes are one of the best things ever\r\ni myself can make a pretty mean crepe...  i usually dont get overly fancy with them though.. perhaps some cream cheese and a little jelly or fruit\r\ngood stuff\r\n\r\nbut yes hi.. thanks for making my stalking easier... to be honest.. *im* the one thats lazy\r\nsurely if i would have put effort into it.. i probably could have found this myspace page on my own\r\nhence why i would never truly be a good stalker... i give up too easily\r\nso go ahead.. kick my ass if you must... figuratively or literally... im too lazy to fight back",
      "created_at": "2007-03-23T05:25:25.000Z"
    },
    {
      "author": "twin33",
      "body": "yes, nice meeting you. nice meeting ALL of you...\r\nwell, except dan and nicole. i know you.\r\nbtw: are you guys going to do some air guitar fun things?",
      "created_at": "2007-03-23T05:29:06.000Z"
    },
    {
      "author": "nicole",
      "body": "<blockquote><cite>Posted By: twin33</cite>btw: are you guys going to do some air guitar fun things?</blockquote>\r\n\r\nOh it's going to be great! We are in the planning process right now, and will make bigger announcements soon.\r\n\r\nMmmm, I love love crepes. The best one I had was a Crepe Belle Helene or something, where it was vanilla cream, poached pears, and chocolate sauce. Yum.",
      "created_at": "2007-03-23T05:37:28.000Z"
    },
    {
      "author": "ariananana",
      "body": "you guys should have....like....every once in a while...\"reuben night\" or \"burger night\". that would be cool. but i am down for the grilled cheese!",
      "created_at": "2007-03-23T16:52:52.000Z"
    },
    {
      "author": "Megster",
      "body": "i definately love the grilled cheese idea and do not love the pbj suggestion... but just to be conversational... has anyone else tried almond butter?  like peanut butter but...in my humble opinion...yummier?  they have a machine that makes it from almonds right in front of you in mama jeans... i love it with a little honey on toast... delicious.\r\n\r\n\r\nweird megster more info than you wanted tid bit:  i loathe jelly, jam, marmalade... all that... cannot stand it.",
      "created_at": "2007-03-23T17:12:52.000Z"
    },
    {
      "author": "tim",
      "body": "ahem'\r\n\r\n<blockquote><cite>almond butter with black berry jam!</blockquote>\r\n\r\n:)",
      "created_at": "2007-03-23T17:16:46.000Z"
    },
    {
      "author": "ariananana",
      "body": "almond and cashew butter are reaalllllyyyyy good.....so is nutella! yummy!",
      "created_at": "2007-03-23T17:17:58.000Z"
    },
    {
      "author": "Megster",
      "body": "<blockquote><cite>Posted By: tim</cite>ahem'\r\n\r\n<blockquote><cite>almond butter with black berry jam!\r\n\r\n:)</cite></blockquote>\r\n\r\n:)</blockquote>\r\n\r\noh tim... i should have known... <em>of course</em> the man who shares my love for almond breeze has to enjoy almond butter as well!",
      "created_at": "2007-03-23T17:24:05.000Z"
    },
    {
      "author": "nate",
      "body": "Damn.  You guys are hard on the PB&J idea.  I was just talkin out loud.  \r\nI mean damn yo.",
      "created_at": "2007-03-23T18:05:11.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Yeah, I want some real hefty plates of nachos.",
      "created_at": "2007-03-23T18:49:33.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Cocoa butter isn't for eating, so that can't be used for Peanut Butter Jelly Time.",
      "created_at": "2007-03-23T18:59:47.000Z"
    },
    {
      "author": "ariananana",
      "body": "<blockquote><cite>Posted By: Master RJ</cite>Cocoa butter isn't for eating, so that can't be used for Peanut Butter Jelly Time.</blockquote>\r\n\r\noh RJ....",
      "created_at": "2007-03-23T19:15:14.000Z"
    },
    {
      "author": "Caleb",
      "body": "CHILLEE DOGGEES!",
      "created_at": "2007-03-23T20:16:50.000Z"
    },
    {
      "author": "tim",
      "body": "<blockquote><cite>Posted By: nate</cite>Damn. You guys are hard on the PB&J idea. I was just talkin out loud.\r\nI mean damn yo.</blockquote>\r\n\r\nturncoat. \r\n\r\n\r\nwe need to fight this Nate, even if it takes us to the steps of city hall.",
      "created_at": "2007-03-23T20:20:42.000Z"
    },
    {
      "author": "Master RJ",
      "body": "It's Peanut Butter Jelly Time!",
      "created_at": "2007-03-23T20:29:20.000Z"
    },
    {
      "author": "EdMo",
      "body": "Man, almonds are seeping into everything these days!",
      "created_at": "2007-03-23T20:41:50.000Z"
    },
    {
      "author": "ariananana",
      "body": "<blockquote><cite>Posted By: EdMo</cite>Man, almonds are seeping into everything these days!</blockquote>\r\n\r\n\r\nbecause they're tasty!",
      "created_at": "2007-03-24T00:40:10.000Z"
    },
    {
      "author": "EdMo",
      "body": "eh to almonds.\r\n\r\nYEH to pecans!\r\n\r\n\r\nPecans with grilled cheese?  I think so.",
      "created_at": "2007-03-24T01:29:03.000Z"
    },
    {
      "author": "tim",
      "body": "<blockquote><cite>Posted By: EdMo</cite>\r\nYEH to pecans!\r\n\r\n\r\nPecans with grilled cheese?  I think so.</blockquote>\r\n\r\nmy name is timothy weidelman, and i approve this message.",
      "created_at": "2007-03-24T09:39:15.000Z"
    },
    {
      "author": "Vikingwarrior",
      "body": "<blockquote><cite>Posted By: EdMo</cite>eh to almonds.\r\n\r\nYEH to pecans!\r\n\r\n\r\nPecans with grilled cheese?  I think so.</blockquote>\r\n\r\nno no no no and no!!",
      "created_at": "2007-03-24T20:54:53.000Z"
    },
    {
      "author": "Caleb",
      "body": "you guys don't know what you're talking about. walnuts are obviously the best nut. And The Moxie is on Walnut! So how perfect would it be to sell \"The Walnut Special\" (or something cleverly named by Danicole instead of my cheesy attempt) and it would have WALNUTS ON IT!!!",
      "created_at": "2007-03-25T01:13:03.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "the walnut *street* special\r\n\r\n.... but either way cashews are the best nut... everyone knows that",
      "created_at": "2007-03-25T04:19:46.000Z"
    },
    {
      "author": "Caleb",
      "body": "I <em>love</em> cashews, but I have a slight food allergy to them, and throw up when I eat them (unless if they're in something, like cashew chicken - then I'm usually fine).",
      "created_at": "2007-03-25T04:29:30.000Z"
    },
    {
      "author": "ariananana",
      "body": "How about pine nuts! \r\n\r\nyeah.",
      "created_at": "2007-03-25T06:17:00.000Z"
    },
    {
      "author": "Vikingwarrior",
      "body": "the only way pine nuts should be there is if they're in Pesto, and I agree with  Caleb's theory about Walnuts, even though I'm allergic to them.",
      "created_at": "2007-03-25T18:55:46.000Z"
    },
    {
      "author": "ariananana",
      "body": "it would be fun to have a forum night where we all made signature sandwiches...and they could be on the menu? like....an RJ would be really sticky peanut butter sandwich that could annoy you, depending on your level of tolerance....or something",
      "created_at": "2007-03-25T21:56:02.000Z"
    },
    {
      "author": "Master RJ",
      "body": "We should have an Ariana Botsford Night, dedicated entirely to her celebrity stories (the Tarantino story tops everything).",
      "created_at": "2007-03-26T02:44:21.000Z"
    },
    {
      "author": "ariananana",
      "body": "<blockquote><cite>Posted By: Master RJ</cite>We should have an Ariana Botsford Night, dedicated entirely to her celebrity stories (the Tarantino story tops everything).</blockquote>\r\n\r\nlame....\r\n\r\nmy sandwich would be crunchy...peanut butter and nutella and soy sauce with spicy turkey grilled to crispy perfection.\r\n\r\n\r\nI know for a fact Max would have straight-up ketchup sandwiches.",
      "created_at": "2007-03-26T03:14:06.000Z"
    },
    {
      "author": "Master RJ",
      "body": "I wish Tarantino thought me how to swim. Then I could have learned something in person (I've already learned to make esoteric film references).",
      "created_at": "2007-03-26T03:22:54.000Z"
    },
    {
      "author": "dan",
      "body": "<blockquote><cite>Posted By: Master RJ</cite>I've already learned to make esoteric film references</blockquote>\r\nYou don't say!",
      "created_at": "2007-03-26T03:35:10.000Z"
    },
    {
      "author": "Master RJ",
      "body": "But Tarantino was first at it.",
      "created_at": "2007-03-26T03:40:57.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: ariananana</cite><blockquote><cite>Posted By: Master RJ</cite>We should have an Ariana Botsford Night, dedicated entirely to her celebrity stories (the Tarantino story tops everything).</blockquote>\r\n\r\nlame....\r\n\r\nmy sandwich would be crunchy...peanut butter and nutella and soy sauce with spicy turkey grilled to crispy perfection.\r\n\r\n\r\nI know for a fact Max would have straight-up ketchup sandwiches.</blockquote>\r\n\r\nAri, if you made this sandwich for me, I'm sure I would love it....and love you...forever.\r\n\r\nFOR---EV---ER.....",
      "created_at": "2007-03-26T03:44:11.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Sandwiches:\r\ntoasted peanut butter\r\npeanut butter and jelly\r\nfour-cheese (American, swiss, pepperjack, Monterey jack)\r\nsausage and egg on pancake",
      "created_at": "2007-03-26T03:49:29.000Z"
    },
    {
      "author": "ariananana",
      "body": "<blockquote><cite>Posted By: EdMo</cite><blockquote><cite>Posted By: ariananana</cite><blockquote><cite>Posted By: Master RJ</cite>We should have an Ariana Botsford Night, dedicated entirely to her celebrity stories (the Tarantino story tops everything).</blockquote>\r\n\r\nlame....\r\n\r\nmy sandwich would be crunchy...peanut butter and nutella and soy sauce with spicy turkey grilled to crispy perfection.\r\n\r\n\r\nI know for a fact Max would have straight-up ketchup sandwiches.</blockquote>\r\n\r\nAri, if you made this sandwich for me, I'm sure I would love it....and love you...forever.\r\n\r\nFOR---EV---ER.....</blockquote>\r\n\r\n\r\nwhich one?\r\n\r\n\r\n\r\ni wish i still worked at emacks...i made some amazinnggggg sandwiches...i can't even lie...",
      "created_at": "2007-03-26T03:49:35.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: ariananana</cite>my sandwich would be crunchy...peanut butter and nutella and soy sauce with spicy turkey grilled to crispy perfection.</blockquote>\r\n\r\nthis one.",
      "created_at": "2007-03-26T03:59:07.000Z"
    },
    {
      "author": "ariananana",
      "body": "mmmhmmm......what about a macaroni and cheese sandwich?",
      "created_at": "2007-03-26T04:04:53.000Z"
    },
    {
      "author": "Master RJ",
      "body": "A little messy. It works as possibly the greatest pizza ever created (at Cici's, give it a try), though.",
      "created_at": "2007-03-26T05:19:39.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Man, I was so gross. I did eat ketchup sandwiches when I was kid. And nowadays on a good weekend.",
      "created_at": "2007-03-26T06:31:24.000Z"
    },
    {
      "author": "Caleb",
      "body": "Funny story. I loved ketchup as a kid. I ate it on everything. And I HATED mustard. With a passion. \r\n\r\nNow I LOVE mustard. And I still like ketchup but it's not what it used to be to my tastebuds.",
      "created_at": "2007-03-26T06:35:10.000Z"
    },
    {
      "author": "curtis",
      "body": "GRILLED CHEEESE GOOOOD",
      "created_at": "2007-03-26T06:46:57.000Z"
    },
    {
      "author": "ariananana",
      "body": "I had a friend who ate mayonnaise  (yes i say may-oh!-naze) sandwiches. gomzzz nasty!",
      "created_at": "2007-03-26T07:01:21.000Z"
    },
    {
      "author": "tim",
      "body": "<em>currently vomiting in mouth...</em>",
      "created_at": "2007-03-26T07:02:14.000Z"
    },
    {
      "author": "ariananana",
      "body": "oooh....how about apple and cheese sandwiches!!",
      "created_at": "2007-03-26T07:14:09.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "If I could change one thing in this world... I would take all the mayonaise off the planet entirely and not allow it to ever be made again.\r\n\r\nYeah, THAT would be my one thing. For sure.",
      "created_at": "2007-03-26T07:26:35.000Z"
    },
    {
      "author": "EdMo",
      "body": "Awww....\r\n\r\nI like Mayo.\r\n\r\n\r\n::: Ed walks away, hanging head low::::",
      "created_at": "2007-03-26T07:45:45.000Z"
    },
    {
      "author": "ariananana",
      "body": "Mayonaise is okay in like..egg salad.",
      "created_at": "2007-03-26T08:17:09.000Z"
    },
    {
      "author": "Caleb",
      "body": "Ok, I have been called \"weird\" many a time for liking this...but guess it's time I share:\r\n\r\nI love mayo on my grilled cheese. I usually don't like mayo that much at all, but I LOVE it on grilled cheese. Try it sometime! 1 slice of bread (wheat!), 1 slice American cheese, mayo layer, 1 slice American cheese, 1 slice of bread (wheat!). I swear it's good.",
      "created_at": "2007-03-26T08:31:29.000Z"
    },
    {
      "author": "Becca",
      "body": "I read this (to myself and then out loud to Nathaniel) and then skipped the majority of the comments because I just wanted to say that Nathaniel's immediate reaction was hysterical laughter and a big \"f- yeah.\"\r\n\r\nI'm lactose intolerant myself, but I might be able to stomach a grilled cheese once in a while just 'cause it's such a great idea.",
      "created_at": "2007-03-26T09:55:06.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "i think my reaction was very similar.. actually..  :-)\r\n\r\nand ari... im pretty sure earlier in this thread... dan mentioned a apple and cheese grilled sandwich... with cinnamon even",
      "created_at": "2007-03-26T18:34:44.000Z"
    },
    {
      "author": "Seth",
      "body": "Grilled cheese would make me want to drop by the moxie, before I go to work, just for a grilled cheese.  \r\n\r\nThe Moxie and Merles Hotdogs should merge together...my friend suggested this possibility to me the other night and I can't quit thinking about how great chili cheese tots and a movie would be.",
      "created_at": "2007-03-26T22:00:40.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "nooooooo\r\n\r\n.... ian loves merle's \r\ni dont like it at all...\r\nwell i like their dessert treats\r\nbut ive noticed nothing at all special about their hotdogs... and they use regular.. cheap hot dog buns\r\nand then it cost almost as much as hot dogs at a baseball game... or some such event\r\nthen ian would now say 'well i usually go on chili cheeto whatever day.. and its on special that day.. so its cheaper'  \r\neh... well .... i dont like chili cheeto whatever mixed together... it looks like a plate of puke\r\ni like chili in a bowl with crackers and cheese... on a cold winter day\r\n... not on a hot dog with cheetos on a hot summer day\r\n\r\ndid i get carried away there?  sorry im not in a great mood :-)",
      "created_at": "2007-03-26T22:09:08.000Z"
    },
    {
      "author": "ariananana",
      "body": "their hot dogs are ok, i admit to an indulgence in a chilli dog every once in a while. but GOOMZ that ooey gooey chocolate butter cake makes my heart sing.\r\n\r\nWhat about casper's chili? i've allwaayyysss wanted to try it.",
      "created_at": "2007-03-26T23:05:23.000Z"
    },
    {
      "author": "nate",
      "body": "Casper's chili = good.  But only every so often.",
      "created_at": "2007-03-26T23:12:19.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "ive never had the chili there either.. but they make damn good burgers",
      "created_at": "2007-03-26T23:15:22.000Z"
    },
    {
      "author": "jhawk",
      "body": "<blockquote><cite>Posted By: El Brian de Moore</cite>ive never had the chili there either.. but they make damn good burgers</blockquote>\r\nCheeseburger with a side of chili from Caspers is a Medical Event waiting to happen, but it's SOOOOO good...",
      "created_at": "2007-03-26T23:16:56.000Z"
    },
    {
      "author": "ariananana",
      "body": "when do they open? \r\n\r\n\r\nand...i just ate THE grilled cheese that danicole has to have...\r\n\r\nrye-pumpernickel swirl bread\r\nprovolone, sharp cheddar, pepperjack, gouda and allouette\r\nand a little mustard for kicks!",
      "created_at": "2007-03-26T23:20:55.000Z"
    },
    {
      "author": "FaultyGoblin",
      "body": "A grilled cheese sandwich with Marmite on it is one of life's greatest joys.\r\n\r\nOtherwise some provolone, peppered tomatoes, with prosciutto, on fresh bread toasted in olive oil = yum.\r\nEvery now and again some ragu sauce with Edam on top is excellent.\r\nBut kudos on the grilled idea, its real food that everyone likes, boo on the pb&j",
      "created_at": "2007-03-27T03:00:18.000Z"
    },
    {
      "author": "Vikingwarrior",
      "body": "Prosciutto +eggplant+cream cheese+crusty french bread+BBQ sauce = The Steve",
      "created_at": "2007-04-03T04:56:07.000Z"
    },
    {
      "author": "Becca",
      "body": "Whatever happened to the grilled cheese idea?",
      "created_at": "2007-07-03T23:19:52.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "It's still <del>brewin'</del> grillin'.",
      "created_at": "2007-07-04T02:17:34.000Z"
    },
    {
      "author": "jhawk",
      "body": "Oh, Max.   That was so cheesy.  ;)",
      "created_at": "2007-07-04T02:45:10.000Z"
    },
    {
      "author": "Segundo Paso And The Fun Facts",
      "body": "only the entrepreneurs of the year could get people excited and buzzing about grilled cheese... AND THEN NOT PRODUCE IT.\r\ncost = nothin'. it's genius\r\n\r\ni put mayo on cheese quesadillas, just right on top\r\n\r\ni also don't hesitate to kick you in the throat if you got something you wanna say 'bout it.",
      "created_at": "2007-08-12T12:28:28.000Z"
    },
    {
      "author": "Ian",
      "body": "The temp tonight's dipping into the mid-forties.\r\n\r\nPlease get that grilled cheese thing going.",
      "created_at": "2007-09-15T10:15:59.000Z"
    },
    {
      "author": "brad",
      "body": "i need some fuckin french toast, NOW.",
      "created_at": "2007-09-15T10:51:00.000Z"
    },
    {
      "author": "Girl #2",
      "body": "GRILLED CHEESE!!!!!",
      "created_at": "2007-10-17T05:58:48.000Z"
    },
    {
      "author": "drm00se",
      "body": "Mmm...",
      "created_at": "2007-10-17T06:36:05.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "grilled cheese AND clam chowDAH!",
      "created_at": "2007-10-17T19:48:09.000Z"
    },
    {
      "author": "aringilbert",
      "body": "Ill let you know that it is not good to read the moxie grilled cheese forum late at night.  I cant say that I wasnt compelled to make my own.  Look forward to seeing this come through, Id love to have a gourmet grilled cheese sandwich while enjoying a movie.",
      "created_at": "2007-10-22T10:26:11.000Z"
    },
    {
      "author": "Cosmik",
      "body": "I would kill for a good grilled cheese right now.  \r\n\r\n(I actually have a good chowdah - in Orlando, you can get Manhattan-style Chowdah, which, while not as tummy warming good as Boston chowdah, is healthier for those of us on weight watchers.)",
      "created_at": "2007-10-23T04:20:13.000Z"
    },
    {
      "author": "Ian",
      "body": "We can't let this die.",
      "created_at": "2007-10-25T23:54:12.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "<a href=\"http://www.ffkatmff.com/\">http://www.ffkatmff.com/</a>  go there!!",
      "created_at": "2007-10-26T01:05:19.000Z"
    },
    {
      "author": "drm00se",
      "body": "I know I can't.",
      "created_at": "2007-10-26T03:10:09.000Z"
    },
    {
      "author": "Cosmik",
      "body": "I had to improvise grilled cheese.  I sprinkled grated parmesan, romano and asiago blend on bread and toasted it.  It was cheese and bread.  Not grilled but still nummy.",
      "created_at": "2007-10-26T06:32:52.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "I make a mean grilled swiss cheese on rye with carmelized roma tomatoes and basil.\r\n\r\nHey Phil! Grilled cheese party sometime soon!",
      "created_at": "2007-10-26T21:12:52.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "I want that item you just described in my mouth pronto!\r\n\r\nGOMZ! SPOILERZ!!!1 HIGHLIGHT -> [<font color=\"#FFFFFF\">That's what she said.</font>]",
      "created_at": "2007-10-26T23:45:46.000Z"
    },
    {
      "author": "nicole",
      "body": "We haven't forgotten about it - we've just had bigger things on our plate to deal with first!",
      "created_at": "2007-10-27T08:00:28.000Z"
    },
    {
      "author": "Cosmik",
      "body": "Ooh, bigger than a grilled cheese.  Um... cheesy garlic loaf?",
      "created_at": "2007-10-27T08:06:39.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Like serving Killer Shrew? (the MST3K-patented drink)",
      "created_at": "2007-10-27T08:26:54.000Z"
    },
    {
      "author": "Cosmik",
      "body": "You should get into the Guiness book by serving the world's largest grilled cheese.",
      "created_at": "2007-10-27T08:38:15.000Z"
    },
    {
      "author": "drm00se",
      "body": "Yes!",
      "created_at": "2007-10-27T09:32:54.000Z"
    },
    {
      "author": "Girl #2",
      "body": "<blockquote><cite>Posted By: thewayofthedinosaur</cite>I make a mean grilled swiss cheese on rye with carmelized roma tomatoes and basil.\r\n\r\nHey Phil! Grilled cheese party sometime soon!</blockquote>\r\n\r\n<blockquote><cite>Posted By: The Four Finger Soc Em</cite>I want that item you just described in my mouth pronto!\r\n\r\nGOMZ! SPOILERZ!!!1 HIGHLIGHT -> [<font color=\"#ffffff\">That's what she said.</font>]</blockquote>\r\n\r\nyes. why am I not eating this right. now. i'm sooo hungry now!",
      "created_at": "2007-10-27T20:37:56.000Z"
    },
    {
      "author": "Cosmik",
      "body": "Do you use fresh basil leaves, or just basil from a shaker jar?  I may have to buy some cheese, rye bread and tomatoes and make one of those.",
      "created_at": "2007-10-27T21:12:30.000Z"
    },
    {
      "author": "Cosmik",
      "body": "It would be cool if, during the 2008 Around the World festival (or Passport or whatever it was called since I can never get down to the Moxie for all those foreign films), you had a special Grilled Cheese sandwich for the country of each film's origin (during it's run, of course, not everything all summer.)  Like, a grilled gruyere and pear for France, grilled cheese, spam and egg for Britain, Grilled kaiser cheese with saurkraut on rye for Germany, that sort of thing.",
      "created_at": "2007-10-27T21:14:19.000Z"
    },
    {
      "author": "nicole",
      "body": "We may team up this year and do food for each film, and give-aways from Pastiche (because they always have global items). I'm excited!",
      "created_at": "2007-10-27T22:26:54.000Z"
    },
    {
      "author": "Girl #2",
      "body": "oh my gosh, that sounds awesome.",
      "created_at": "2007-10-27T23:54:47.000Z"
    },
    {
      "author": "drm00se",
      "body": "<blockquote><cite>Posted By: Cosmik</cite>It would be cool if, during the 2008 Around the World festival (or Passport or whatever it was called since I can never get down to the Moxie for all those foreign films), you had a special Grilled Cheese sandwich for the country of each film's origin (during it's run, of course, not everything all summer.)  Like, a grilled gruyere and pear for France, grilled cheese, spam and egg for Britain, Grilled kaiser cheese with saurkraut on rye for Germany, that sort of thing.</blockquote>\r\n\r\nThat sounds really disgusting, but I guess I'm the weird one here...",
      "created_at": "2007-10-27T23:55:26.000Z"
    },
    {
      "author": "Cosmik",
      "body": "There is nothing disgusting about designer grilled cheese.  \r\n\r\nPhillistine.  \r\n\r\n:)",
      "created_at": "2007-10-28T00:25:20.000Z"
    },
    {
      "author": "drm00se",
      "body": "I have the least interesting tastes in food (and everything else, for that matter) ever.",
      "created_at": "2007-10-28T10:56:37.000Z"
    },
    {
      "author": "Cosmik",
      "body": "Designer grilled cheese is uninteresting?  Or am I missing the point?  Seriously - think about it.  Myzthra and grilled onion, or Jarlsburg and apple, or whatever.  Yum! \r\n\r\n(I wonder if you could make a tandoori chicken grilled cheese?)",
      "created_at": "2007-10-28T21:22:26.000Z"
    },
    {
      "author": "Girl #2",
      "body": "moose is just saying he likes boring food",
      "created_at": "2007-10-29T01:13:13.000Z"
    },
    {
      "author": "drm00se",
      "body": "Lanie, you know me so well.\r\n\r\nDesigner grilled cheese is way too interesting for me.\r\n\r\nI definitely love normal grilled cheese, though :-)",
      "created_at": "2007-10-29T03:22:49.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "I support you in all the designer grilled cheese endeavors Cosmik!!!!",
      "created_at": "2007-11-03T19:13:30.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "bump",
      "created_at": "2008-09-10T09:47:04.000Z"
    },
    {
      "author": "nate",
      "body": "total bump",
      "created_at": "2008-09-10T20:16:49.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
