{
  "id": 489,
  "title": "2007 Ozarks Regional AIR GUITAR Championship",
  "body": "Sorry I haven't written in awhile. I was sick for the majority of last week, and we've been walls to the balls busy around here... so, please forgive me. In hopes of making it up to you, I posted a <a href=\"/episodes/10\">new episode of MoxieTV</a> (first one in four months), AND a <a href=\"/phlogs/39\">new phlog</a> (the last one was nearly a year and a half ago!). Check 'em out and let me know what you think. Now, let's jump straight into the meat of today's post...<br/><br/><b>OZARKS REGIONAL AIR GUITAR CHAMPIONSHIP</b><br/><br/>Yes, it's true. The Moxie and The Landers are teaming up to bring you the coolest event to hit Springfield since last January's ice storm. As you may or may not know, a new documentary called <a href=\"http://www.airguitarnation.com/new/\" target=\"_blank\" class=\"broken\">AIR GUITAR NATION</a> is currently making the rounds in limited release. In anticipation of its arrival in Springfield, we're hosting the first (of what we hope to be annual) Ozarks regional air guitar championship. We even have our own website for it: <a href=\"http://www.OzarksAirGuitar.com\" target=\"_blank\" class=\"broken\">www.OzarksAirGuitar.com</a>. SWEET!<br/><br/>In case you think we're joking, here's a clip of C-Diddy (one of the main competitors from AIR GUITAR NATION) jamming out to a song by Extreme from the BILL & TED'S EXCELLENT ADVENTURE soundtrack.<br/><br/><object width=\"425\" height=\"350\"><param name=\"movie\" value=\"http://www.youtube.com/v/Y29pxfykxY8\"></param><param name=\"wmode\" value=\"transparent\"></param><embed src=\"http://www.youtube.com/v/Y29pxfykxY8\" type=\"application/x-shockwave-flash\" wmode=\"transparent\" width=\"425\" height=\"350\"></embed></object><br/><br/>That's exactly the caliber of performance we're looking for. The preliminaries are going to be held at the Outland on May 2nd (that's a Wednesday night), where we'll select the top five competitors to proceed to the finals, which will be held at The Landers on June 2nd (that's a Saturday night). We'll be hosting a special screening of <a href=\"http://www.airguitarnation.com/new/\" target=\"_blank\" class=\"broken\">AIR GUITAR NATION</a> at The Landers on June 2nd, followed immediately by the final performances from our top five competitors. We're still in the final stages of sorting out the super sweet prizes, but it will most likely be a wad of cold hard cash ($500+), OR an all-expenses paid trip to Dallas so the winner can compete for a chance to go to the World Air Guitar Championship in Oulu, Finland, OR maybe even both!!!<br/><br/>We're SUPER pumped for this event (if my copious amount of capital letters didn't ALREADY give that AWAY), and you should be too. If you know a closet air guitar god or goddess, make sure you tell them about this event. Then you can come along and cheer for them at the preliminaries AND the finals (if they're good). SWEEEEEEEEEEEEEEEEEEEEEET!!!!!! Ok, it's time to open the theater. We'll post new info to the <a href=\"http://www.OzarksAirGuitar.com\" target=\"_blank\" class=\"broken\">OzarksAirGuitar.com</a> site as it becomes available, so check back often.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-04-11T02:50:53.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nate",
      "body": "Maybe the best moxie vv episode yet.",
      "created_at": "2007-04-11T03:10:14.000Z"
    },
    {
      "author": "nate",
      "body": "Some of those sitting positions looked uncomfortable, like you were running out of ideas on how to sit.",
      "created_at": "2007-04-11T03:15:58.000Z"
    },
    {
      "author": "Caleb",
      "body": "Hilarious.",
      "created_at": "2007-04-11T07:16:45.000Z"
    },
    {
      "author": "nicole",
      "body": "The Moxie TV episode played at the Take Pride in Springfield Event, but unfortunately whoever was in charge of lowering the screen didn't lower it all the way, so you couldn't see all the subtitles. But that Little Superstar. He's funny, I guess he didn't need subtitles.",
      "created_at": "2007-04-11T09:23:53.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "jesus... that guy is awesome...<br/>to be honest im not sure if i would find him quite as awesome.. if not for the hello kitty breastplate",
      "created_at": "2007-04-11T11:04:49.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "and yes... fantastic moxie tv episode    <br/><br/>..... *share on facebook*<br/>justin needs to hurry and post it to his youtube profile so that i can delete this share.. and share the youtube one instead<br/>because it looks prettier like that on facebook",
      "created_at": "2007-04-11T11:31:52.000Z"
    },
    {
      "author": "Caleb",
      "body": "Oh, and be sure to make Facebook and MySpace events about this! It spreads the word like wildfire! I would create one but it seems more legit or something if it's created by Moxie Cinema. <br/><br/>When will the Gillioz learn to just let Dan run the projector??",
      "created_at": "2007-04-11T18:17:28.000Z"
    },
    {
      "author": "nicole",
      "body": "I'm working on it today (the MySpace profile)",
      "created_at": "2007-04-11T21:12:53.000Z"
    },
    {
      "author": "Caleb",
      "body": "Everyone I have told about this is psyched.",
      "created_at": "2007-04-12T01:41:51.000Z"
    },
    {
      "author": "Vikingwarrior",
      "body": "This is made up, lol.",
      "created_at": "2007-04-13T08:23:45.000Z"
    },
    {
      "author": "dan",
      "body": "Nope. It's as real as it gets. 100% real.",
      "created_at": "2007-04-13T09:35:34.000Z"
    },
    {
      "author": "Vikingwarrior",
      "body": "I'm very glad it is.",
      "created_at": "2007-04-13T12:35:42.000Z"
    },
    {
      "author": "jeffreyL",
      "body": "The Sundance Channel ran a documentary a few years back called \"Air Guitar in Oulu.\"  From what I remember, it was about one young man's attempts to get to the international competition in Finland.  They actually showed the competition in Oulu, which was hilarious and tragic all at the same time.  Priceless.",
      "created_at": "2007-04-13T21:37:26.000Z"
    },
    {
      "author": "Cosmik",
      "body": "Let me know when the Air Piano competition is.",
      "created_at": "2007-04-13T21:40:25.000Z"
    },
    {
      "author": "nicole",
      "body": "Jeff - I think that doc has a lot of footage that Air Guitar Nation uses.",
      "created_at": "2007-04-14T02:35:31.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
