{
  "id": 49,
  "title": "Midwestburg, thy name is...",
  "body": "The time has come to lift the veil that shrouds Midwestburg's true identity. Now that Cinema 24 has been knocked off Blogger's \"Blogs of Note\" list, the readership demographic has rapidly switched from hundreds of looky-loos to a core group of loyal, repeat visitors (you know who you are). I've decided to let my guard down and abate my fear of the wayward billionaire reading this blog and beating us to the punch (as in quickly buying a building, hiring a general manager, purchasing the equipment, and opening before we do). Of course, if any of my loyal readers happen to be wayward billionaires, or even mildly befuddled millionaires, I have a <a href=\"http://www.cafepress.com/the_moxie.13009876\" target=\"_blank\">wonderful American-made thong</a> with your name all over it.<br/><br/>I had originally intended on revealing the location of Midwestburg by divulging little hints - one per day - until someone got it right, but then I thought, \"are you really committed enough to write one hint a day? I mean, think about it... that's a lot of responsibility. Isn't there a reality show on TV tonight or something? Beach volleyball on NBC? Squeaky-voiced Romanians on the uneven bars?\"<br/><br/>\"You're right,\" I said to myself. \"Those Romanians do have squeaky voices.\"<br/><br/>Had I decided to go with the daily hints, I think they would've fell along these lines:<br/><br/><ol><li>Home of the world's largest fork</li><br/><li>Birthplace of cashew chicken</li><br/><li>Locale of the famous Hickok/Tutt gunfight</li><br/><li>More unsolved murders per capita than anywhere else in the US (although, my friend Doug is getting his P.I. license soon, so that statistic will soon fall in line)</li><br/><li>Second-highest number of fast food restaurants per capita behind Owensboro, Kentucky</li><br/><li>Sixth-lowest cost of living of any metropolitan area in the nation</li><br/><li>The southside Wal-Mart Supercenter is the most profitable Supercenter in the country, and was also the site of a celebration for selling the most duct tape of any other place in the United States... and probably the world too</li><br/><li>Home of the original (as in \"second\") Bachelor, Aaron Buerge</li><br/><li>Home of the Federal Medical Center, which has housed such notorious criminals as Gen. Manuel Noriega, John Gotti (who died there two years ago), Jeffrey Dahmer, Timothy McVeigh, and Al Capone.</li><br/><li>Known for having some of the most dynamic weather changes in the United States</li><br/><li>Home of the International Headquarters of the Assembly of God Church</li><br/><li>Regional celebrities include John Goodman, Kathleen Turner, Don Johnson, Bob Barker, Tess Harper, and some guy named Brad Pibb... or Piff... or Pitt or something.</li></ol><br/>In fact, if you can remember all the way back to my post about <a href=\"21\">hypotheticals</a>, and replace the names \"Jack and Jill\" with \"Brad and Jennifer\", you'll get a better idea of what the hell I was actually talking about that day.<br/><br/>So do you know where Midwestburg is yet? Well, let me give you one final hint: <b>it's where the Simpsons live!</b> That's right, Midwestburg, USA is none other than the effervescent Springfield, Missouri. Now all of the Springfieldian readership can let out a collective sigh of relief and feel free to comment about Springfield to their heart's content. I hope this doesn't take away any of the mystery or intrique from the blog. I feel kinda naked now. Hmm, I better put my pants back on. Wait a minute... where <i>are</i> my pants? And my hat!<br/><br/>Now that I've revealed Midwestburg's true location, I can finally write all those posts that I couldn't before, like: \"The theater will be in a town called Springfield\" and \"Here's a poem about Springfield\" and also \"A Clockwork Springfield\", but mostly \"Springfield! Springfield! Springfield!\" This post is really going to throw Google's page rank for a loop.<br/><br/>Also, for those of you who have seen <i>The Bourne Supremacy</i> and were w<br/>ondering where Jason Bourne was from... he's from Nixa, Missouri, which is a suburb of Springfield. In fact, Jason Bourne's character is based on me. For those of you who haven't seen the movie yet, I just completely ruined it for you. See you later!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-08-18T22:50:56.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "einahpets",
      "body": "I knew it! I knew it, I knew it, I knew it? So being your sister-in-law, how come you didn't tell me sooner?",
      "created_at": "2004-08-18T23:03:06.000Z"
    },
    {
      "author": "bjork24",
      "body": "You're my sister-in-law!!! How come you didn't tell ME sooner?!",
      "created_at": "2004-08-18T23:06:15.000Z"
    },
    {
      "author": "Tim",
      "body": "See, it all makes sense now.  You can get the word \"Springfield\" by writing out the word \"moxie\" twice (\"moxiemoxie,\" natch) and rearranging the resultant letters.  Of course, it was right there under our noses the whole time!  Blast you, Dan Bourne!",
      "created_at": "2004-08-18T23:26:21.000Z"
    },
    {
      "author": "bjork24",
      "body": "Natch! I love that word! It sounds so dirty, naturally.",
      "created_at": "2004-08-18T23:31:08.000Z"
    },
    {
      "author": "Matt",
      "body": "Actually, the Simpsons don't live in Springfield, Missouri, they live in Springfield, Kentucky.  And I thought it was going to be in Illinois...",
      "created_at": "2004-08-19T00:47:42.000Z"
    },
    {
      "author": "Matt",
      "body": "Oh yeah, I should have mentioned - first time commenter, long time reader.",
      "created_at": "2004-08-19T00:53:47.000Z"
    },
    {
      "author": "bjork24",
      "body": "Nice to hear from you, Matt.",
      "created_at": "2004-08-19T00:57:41.000Z"
    },
    {
      "author": "Newell",
      "body": "So... is the theatre near the nuclear power plant?",
      "created_at": "2004-08-19T01:18:50.000Z"
    },
    {
      "author": "Stefan",
      "body": "I knew it!  Well, the Missouri part, anyway.  (Actually, I'm kinda scared that I expended blood cells trying to figure out the \"Brad and Jen\" connection, but, you know, the whole Internet's that kind of experience on a daily basis, now isn't it?)",
      "created_at": "2004-08-19T02:06:48.000Z"
    },
    {
      "author": "bjork24",
      "body": "No, Newell, unfortunately the theater is nowhere near the nuclear power plant. It is, however, close to a florist who sells plants.",
      "created_at": "2004-08-19T02:06:52.000Z"
    },
    {
      "author": "bjork24",
      "body": "Stefan, don't strain yourself... or do. It's up to you. Wee! I'm not making any sense, am I?",
      "created_at": "2004-08-19T02:17:01.000Z"
    },
    {
      "author": "Allison",
      "body": "All the way until you said \"Springfield\", I was going to guess \"Kansas City\" (hadn't decided MO or KS yet).  But, as Bart & Milhouse sing, \"Springfield, Springfield! It's a hell of a town! The school yard's up, and the shopping mall's down...\"",
      "created_at": "2004-08-19T04:16:01.000Z"
    },
    {
      "author": "bjork24",
      "body": "Wow, I thought it was common knowledge that Brad Pitt was from Springfield... suppose not.",
      "created_at": "2004-08-19T04:41:52.000Z"
    },
    {
      "author": "Fyse",
      "body": "Wow, thats... actually rather anticlimactic. The wrong side of the Atlantic is still the wrong side of the Atlantic, unfortunately. Maybe I'll swing by the little US of A someday though.<br/><br/>Incidentally, technical question here. Is there any way I can get my favourite blogs by email? (Most notably this one of course) I'm going away this weekend for a whole month and I'll have access to email but no web browsing. I hear tell of things called syndicated feeds and Atom. Either of these relevant?!",
      "created_at": "2004-08-19T04:45:29.000Z"
    },
    {
      "author": "sandra",
      "body": "what kind of donuts will you sell at your concession stand....puurrrrple?",
      "created_at": "2004-08-19T04:53:38.000Z"
    },
    {
      "author": "bjork24",
      "body": "Fyse, there are three sites that can help you out: <a href=\"#\" onClick=\"window.open('http://www.blo.gs',''); return false;\">blo.gs</a>, <a href=\"#\" onClick=\"window.open('http://www.technorati.com',''); return false;\">technorati</a>, or <a href=\"#\" onClick=\"window.open('http://www.bloglines.com',''); return false;\">bloglines</a>. Give one of those a try... I think they can do what you're looking for.<br/><br/>Sandra, everything we serve at the Cinebar will taste like purple.... mmmm, purple.",
      "created_at": "2004-08-19T05:04:46.000Z"
    },
    {
      "author": "Oz",
      "body": "Aha!  I was right...about the state!  Check the comments, my dear.  I am such a genius.<br/><br/>I have no idea how far Springfield is from Kansas City, but the Bread Winner's mother lives in Kansas City, so maybe we'll find our way to the Moxie during one of our visits to her.<br/><br/>One more thing:  Brad Pitt is from Missouri?  Is it just me, or did he suddenly become less attractive?",
      "created_at": "2004-08-19T07:14:50.000Z"
    },
    {
      "author": "bjork24",
      "body": "Oz, you are brilliant. Springfield is about 2.5 to 3 hours south of KC. I think there's something in the water, b/c everyone from Springfield looks like Brad Pitt... men and women alike.",
      "created_at": "2004-08-19T07:38:29.000Z"
    },
    {
      "author": "whitty",
      "body": "I knew it all along.  But then I am pretty smart.  And have 27 fast food restaurants within a mile radius of my home. I know the whole story of how cashew chicken was invented.  And my grandparents go to church with Brad Pitts' grandparents. <br/><br/>Springfield says \"HURRAH to the Moxie! We've needed you so!\"",
      "created_at": "2004-08-19T17:34:53.000Z"
    },
    {
      "author": "bjork24",
      "body": "Indeed, Whitty saw right through the Midwestburg veil nearly a month ago, but she's a Springfieldian, so you should expect nothing less than sparkling brillance.",
      "created_at": "2004-08-19T17:38:27.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "I was so hoping for Michigan, and I thought that Missouri was a little too obvious. But, I've done the drive through Missouri recently, and I can say that I could easily do it again. So at trip to the Moxie is definitely doable for me.",
      "created_at": "2004-08-19T18:12:19.000Z"
    },
    {
      "author": "bjork24",
      "body": "Whimsy, you're always welcome!",
      "created_at": "2004-08-19T18:22:34.000Z"
    },
    {
      "author": "Chuck",
      "body": "Can all the people who already knew the state please raise your hands. &lt;raises hand&gt;<br/><br/>Thank you.",
      "created_at": "2004-08-19T18:33:21.000Z"
    },
    {
      "author": "Nicole",
      "body": "&lt;raises hand&gt;",
      "created_at": "2004-08-19T21:49:26.000Z"
    },
    {
      "author": "bjork24",
      "body": "&lt;looks around&gt;&lt;sees others raising their hands&gt;&lt;slightly raises hand&gt;&lt;eyes widen&gt;&lt;lowers hand quickly&gt;&lt;looks around again&gt;&lt;raises hand&gt;&lt;lowers hand&gt;&lt;shakes head&gt;&lt;cries&gt;",
      "created_at": "2004-08-19T23:29:59.000Z"
    },
    {
      "author": "Amy",
      "body": "First The Moxie. What next a monorail?",
      "created_at": "2004-08-20T01:58:43.000Z"
    },
    {
      "author": "cass",
      "body": "spoke too soon Dan. Your back up on Bloggers, \"blog of note\".",
      "created_at": "2004-08-20T05:21:18.000Z"
    },
    {
      "author": "bjork24",
      "body": "What? Where? Are you trying to trick me, Cass? I don't see it.",
      "created_at": "2004-08-20T06:17:05.000Z"
    },
    {
      "author": "Chuck",
      "body": "Looks like we both made it back onto the list. Woo-hoo!",
      "created_at": "2004-08-20T07:52:08.000Z"
    },
    {
      "author": "bjork24",
      "body": "Okay, everyone. What are you talking about? I don't see our name on the blogs of note. What, am I taking crazy pills here?!",
      "created_at": "2004-08-20T16:42:30.000Z"
    },
    {
      "author": "Tim",
      "body": "Dang, a woman who plays video games <b>and</b> now I hear he's slept with a gymnast in college.  What's next, a personal Moxie appearance from Dan's ex, Phoebe Cates?  You're my deity, man.  Keep up the good work.  :)",
      "created_at": "2004-08-20T20:09:36.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ah yes, Phoebe and I dated back in the early 80s. We were just kids... I was 4, she was 19. It was great.",
      "created_at": "2004-08-20T20:18:09.000Z"
    },
    {
      "author": "cass",
      "body": "maybe I'm the one taking crazy pills, I don't see it there either",
      "created_at": "2004-08-20T20:59:56.000Z"
    },
    {
      "author": "ARON",
      "body": "Eek.  Springfield. <br/><br/>At least it isnt NORTH ST. LOUIS!  Dunt dunt DUNNNNNNNN",
      "created_at": "2004-08-20T22:12:03.000Z"
    },
    {
      "author": "bjork24",
      "body": "Or EAST ST. LOUIS! Dunt De Do Wap Wap!",
      "created_at": "2004-08-20T22:16:12.000Z"
    },
    {
      "author": "mike",
      "body": "Simpsons are based on places in Oregon. ",
      "created_at": "2005-06-12T10:51:59.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 7,
      "name": "Lists"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
