{
  "id": 490,
  "title": "ASK A FILM INDUSTRY PRO, PART I: Byron Smith",
  "body": "About a month and a half ago, I announced on the forum that I would be interviewing several film industry professionals, and posting the results to the blog in hopes of adding some sweet, sweet content. Well, part one is done and in the can. The first professional was none other than Byron Smith - former Springfieldian (er, Nixa-ian), SMS graduate, and big time editor out in LA since 2002. He may be best known to us Moxieteers as the editor of last December's hit film, RUNNING WITH SCISSORS, but he's also worked on F/X's popular show \"Nip/Tuck\", and is currently editing for HBO's \"Big Love.\" You can check out Byron's imdb page <a href=\"http://poll.imdb.com/name/nm1087821/\" target=\"_blank\">here</a>, and <a href=\"http://www.avid.com/profiles/061030_scissors_filmcomposer.asp\" target=\"_blank\" class=\"broken\">here's</a> a great article about his work on RUNNING WITH SCISSORS.<br/><br/>So, thanks to those of you who posted questions for Byron, and an especially big \"thank you\" to Byron for taking time out of his busy editing schedule to answer questions for a ragtag group of aspiring film industry fodder. Let the interview begin! HUZZAH!!!<br/><br/><b>1. <i>Tim asks:</i> Do you find your job overly frustrating? You receive someone else's work, and depending how everything turns out, you have the job and responsibility to make it into something. Do you find yourself overly frustrated with either, how the film you receive has been shot, or conducted? Depending on everything you receive it seems like a lot of downfalls in a project can be blamed on you, or you disagree with the approach, both seem like amazingly frustrating things to me. It's funny as an editor you have so much and so little control all at once, how do you deal with this? Does it bother you? Does it affect your attitude towards a project, or to what you do in general?</b><br/><br/>I can't really remember the last time I felt frustrated by the way something was shot, but I know I've felt it. When I was in film school I was pretty much tied down by poor shooting ninety percent of the time, and as a result I was ready to climb a tree with a bottle of Jack and just watch it all go up in smoke. As an editor, I bring the director's personal interpretation of story telling to the screen. Sometimes professional directors will miss something that would have made a great emotional beat, but that is very rare. I have had the opportunity to cut a lot of material over the last few years and been lucky enough to work with some talented people. Even when directors make ambitious choices, I've tried to use the problematic moments as opportunities to create something useful to the overall story. If a scene is hard I try to remind myself the possibilities are endless, and even after I cut a scene, but think something is wrong with the material, I know that when I begin to work with the director they will bring some new ideas. Collaborating alongside someone is so much easier than banging your head against a wall alone.<br/><br/>I know what you mean by how editors can potentially be blamed when a piece is unsuccessful. Before I started studying film, I know I was at fault for passing judgement on the editor when I didn't like something. But since I've become more experienced I know there are always a lot of voices within a cut. After the director, the cut may go through teams of producer notes and then studio notes. The editor has to play ball, or risk losing the job. If I get a note I feel is dangerous, I try to use my skills to spin the note and deliver what the producer or director wanted while still preserving the integrity. Actually, now I feel like I can be screening a film and detect something where the editor's hand was forced by an erroneous note. Once a critic actually singled me out in his review. I thought it was absolutely wild and hilarious, and I felt some slight gratification knowing that critic actually took the time to look up my name, and then waste space in his review to call me out. You make movies as a team, so you succeed or fail as a team. It's my job to help smooth out the bumps along the way, while being as pleasant to work with as possible. Most editors in Hollywood are excellent, it's who's lucky enough to get the job that turns into the next big movie with the acclaim.<br/><br/><b>2. <i>Nate asks:</i> A film like REQUIEM FOR A DREAM seemed to use different tools to create a new rhythm for the movie, but it seemed to use its quick cuts most of all. In a completely opposite direction, CHILDREN OF MEN also used its takes to fantastic effect, knowing when to cut away and when not to, in order to immerse the viewer. In your opinion, are there any recent movies that pushed the craft of editing forward, that did something genuinely new? Is there anywhere new left to go with the craft of editing, or at this point have we seen it all?</b><br/><br/>CHILDREN OF MEN and REQUIEM were both two highly-stylized films with two very different visual approaches. But like most films, both of those styles were decided long before getting to the edit room. I am certain that those long takes in CHILDREN OF MEN were shot without any cutaways, it was the director's vision from the very beginning to tell his story in that way. The same with Aronofsky; he shot snippets of a moment to drive the drama and add an unsettling impact. A director's vision drives the edit, you can see it in the dailies. When you watch them you get a sense of how it should be cut.<br/><br/>There is plenty left to be discovered in editing. It will be the stories that help push the craft forward. The style of the storytelling must be worthy to the content. Style and content go hand and hand, they must work in harmony.<br/><br/>THE GRADUATE is a prime example of a film that was unconventional for its time and exciting from an editorial perspective, as was RAGING BULL or BONNIE AND CLYDE. These days audiences are very capable of reading and understanding images in a fraction of a second. This increasing cine-literacy is something filmmakers can use to their advantage if they choose, but it must be fitting to the content.  However, at the same time, pop culture is strengthening one aspect of our viewing capability. I'm not sure that YouTube won't weaken us. \"Junk food\" content, like reality TV and the growing number of webcasters, may trick us into being poor viewers, forgiving bad stories and poor filmmaking when we go to the cinema.<br/><br/><b>3. <i>Caleb and Tim ask:</i> What are some tips you might have for soon-to-be MSU graduates hoping to land a post-production job in L.A.? Also, how the hell did you get where you are? Luck, school, connections?</b><br/><br/>To get a job in LA, you have to be in LA, but that's easier said than done. It's a daunting thing to move cross country. When I did it, I didn't know anyone at all, and on my first day I was crying into a pay phone. I didn't have a place to stay, so I spent my first night sleeping beside the pool of an apartment building. Film school gives you a lot of experience and allows you to meet people, even if those people are as clueless and poor as you. But nothing is as valuable as experience, and film school can provide you with at least something. It takes time, and you don't have to go to film school if you don't want to, but you have to be mentally prepared; ready to stick out a lot of lonely nights in an expensive and stressful city. I've been extremely lucky, but at any moment I too could be out of a job.<br/><br/><b>4. <i>Ed asks:</i> As a director, I think I'm giving my editors boredom (no one's complained...just kinda joking). I tend to favor as few shots as humanly possible and too much cutting, to me, takes away emotional impact (in generic scenes that is...more intense scenes of course need more cuts). Is this type of filmmaking a positive or negative experience for an editor to work with?</b><br/><br/>I agree with you, there is nothing wrong with telling your story in long takes. THE PHILADELPHIA STORY, WHO'S AFRAID OF VIRGINIA WOLF, and SUDDENLY LAST SUMMER are just a few of about a hundred examples when it was done perfectly. It requires your editor to really scrutinize performance; watching takes over and over again to pick the right one. It also takes actors who are able to deliver. There is something more magical by not cutting than by making a cut simply for cut's sake. I know that younger editors want to learn to cut, so it takes a lot of discipline to sit on a shot and still feel like you're making a significant contribution to the project.  Just make sure you're harnessing the power of the cinema and not just shooting a play.<br/><br/>If you sense they are bored by the project, hopefully they are still taking full advantage of the resources. For instance, I am very detailed with music and effects and I don't show my directors anything until I have a full mix. Even if a scene plays all in one shot, hopefully your editors remember to fill the space, that is what being a picture editor is all about.<br/><br/><b>1. Who is your favorite editor?</b> <i>I'll give you my top five in no particular order, because I think editors are so unknown that to name a single one would be short-sighted: Verna Fields, Joe Hutshing, Sally Menke, Arthur Schmidt, Tim Squyres.  Also, I should give you my two favorite sound guys: Rick Ash and Randy Thom.</i><br/><b>2. What's your favorite film, when judged solely on its editing?</b> <i>I've been sitting here for half an hour trying to think of a single film, but I'll have to give five: BLADE RUNNER, FORREST GUMP, GLORY, JAWS, OUT OF SIGHT.</i><br/><b>3. What aspect of editing do you like the most?</b> <i>Working with the director.</i><br/><b>4. What aspect of editing do you dislike the most?</b> <i>Waiting for picture to lock.</i><br/><b>5. Avid or Final Cut Pro?</b> <i>Avid, but I frequently use both.</i><br/><b>6. How much time, on average, are you allowed to cut a one-hour drama, such as \"Nip/Tuck\" and \"Big Love?\"</b> <i>Usually seven days for the editor's cut, and another four for the director's cut.</i><br/><b>7. Which looks better, film or DV?</b> <i>Film is still superior to originate on, but Digital Cinema is the best way to finish and project.</i><br/><b>8. Mac or PC?</b> <i>Mac</i>",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-04-17T07:10:09.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "EdMo",
      "body": "Thank you so much, Byron!<br/><br/><br/>Caleb, I think I may hold off on film school for a year, just to see if I truly need it.  Are you ready to make this adventure?",
      "created_at": "2007-04-17T07:47:25.000Z"
    },
    {
      "author": "tim",
      "body": "Awesome! thanks!<br/><br/>thanks for the lists of Favs! Sally Menke! Good Call! <br/>the love scene between J.Lo, and George Clooney in out of sight is one of my favorite scenes ever, Great Call!<br/><br/>yeah, thanks again.",
      "created_at": "2007-04-17T08:39:34.000Z"
    },
    {
      "author": "Caleb",
      "body": "Awesome! Thanks Byron. I really like your advice about Los Angeles. I am making that trip in August, so I will definitely heed your advice. <br/><br/>And I agree about the editing in Jaws. The editing <em>made</em> that movie. So good. <br/><br/>And thank you for saying Mac. It seems none of my media friends agree with me that Macs are better with Avid.",
      "created_at": "2007-04-17T12:18:07.000Z"
    },
    {
      "author": "EdMo",
      "body": "<blockquote><cite>Posted By: Caleb</cite>And thank you for saying Mac. It seems none of my media friends agree with me that Macs are better with Avid.</blockquote><br/><br/>*raspberry*",
      "created_at": "2007-04-17T17:17:39.000Z"
    },
    {
      "author": "HonkeyHero",
      "body": "Nice... really enjoyed reading this!!  GOOD WORK!",
      "created_at": "2007-04-19T01:22:46.000Z"
    },
    {
      "author": "rpayton",
      "body": "Good interview. I'd like to hear more about the move to LA and establishing a presence there. Also, do you know what kind of entry level jobs an aspiring screenwriter should look for? I know that's a different field, but I'd thought you might know.",
      "created_at": "2007-04-20T19:59:28.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 5,
      "name": "Interviews"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
