{
  "id": 491,
  "title": "Prizes for the Ozarks Regional Air Guitar Championship",
  "body": "We're nearly one week away from the preliminaries for the very first Ozarks Regional AIR GUITAR Championship, and I am PUMPED! We've received a ton of positive comments about the event, and I have a feeling we're going to have a decent turnout at the Outland next Wednesday night. My biggest worry, however, is that plenty of people will show up to WATCH, but not many will want to show off their sweet AIR GUITAR skillz. So, I'm asking for some assistance from you guys - tell everyone you know who might be the least bit interested in rocking out on stage to show up Wednesday night. We only need FIVE people to move on to the finals, so we're looking for AT LEAST 10 to 15 participants.\r\n\r\nI'm going to let you in on a little secret too... well, it's not really a <i>secret</i> secret, since I'm hoping you'll use this info to lure people to the preliminaries, but you get the idea. The winner of this year's event is going to win a LOT of cool stuff. We haven't announced the prizes on OzarksAirGuitar.com yet, but I'm going to give you guys an exclusive scoop on what the first annual Ozarks Regional Air Guitar Champion will take home with him or her:\r\n\r\n<ol><li>The champion will win a REAL guitar from Springfield Music, along with a year's worth of free guitar lessons.</li>\r\n<li>The winner will get to perform as an opening act during Q102's ROCKFEST.</li>\r\n<li>This hasn't been 100% confirmed yet, but we're pretty sure we'll be able to send the winner to Dallas (expenses paid), so they can compete for a chance to qualify for the WORLD AIR GUITAR CHAMPIONSHIP!</li>\r\n<li>There's also a very, very strong chance that the winner will take home some cold hard cash... the amount will be determined before they perform on June 2nd.</li>\r\n<li>They'll also win... are you ready for this?... a free Moxie t-shirt!!!! OMG!,</li></ol>\r\nSo there you have it. Run, go tell your friends, spread the word, and make sure you show up next Wednesday night for what will surely be one of the coolest, most unique events to hit Springfield in a long, long time. ROCK ON SPRINGFIELD!\r\n",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-04-25T07:57:35.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "The Four Finger Soc Em",
      "body": "Geez, that's a crazy amount of big-time stuff. You're killing us kids, Dan, killing the children.",
      "created_at": "2007-04-25T08:06:50.000Z"
    },
    {
      "author": "nicole",
      "body": "And the US Air Guitar Association will hold a spot for the winner at their Dallas regionals.",
      "created_at": "2007-04-25T10:05:45.000Z"
    },
    {
      "author": "brad",
      "body": "i would go for it, if i was going to be around for any of the other events..but i'll be out of the country. and i wouldn't want to disappoint my fans by cockteasing them w/ a mean solo next week and then nothing else afterwards..",
      "created_at": "2007-04-25T16:58:34.000Z"
    },
    {
      "author": "nicole",
      "body": "Watch Fox tonight at 9:30 for Dan talking about the event! Rumor has it, there's also going to be some press at the event. I'm so excited!\r\n\r\nDoes anyone want to be a \"sacrificial\" guitar player, where they perform to get the judges and audience warmed up?",
      "created_at": "2007-05-02T01:10:23.000Z"
    },
    {
      "author": "Megster",
      "body": "i think johnny greenwood vs. the ebola virus would be a super awesome sacrificial guitar player... or actually, maybe he should just enter... i have seen him do many a johnny impression on air guitar... \r\n\r\ni think my friends chris and tyler are both entering this.  i'm excited.",
      "created_at": "2007-05-02T01:12:28.000Z"
    },
    {
      "author": "nicole",
      "body": "Yowza! I've expressed my paranoia multiple times that we'll have a bunch of people watching, but nobody participating. This has the potential to be huge, people. You must participate! If it's a success, we can make it an annual tradition! Woohoo to annual traditions with The Landers (Rocky Horror!).",
      "created_at": "2007-05-02T01:27:22.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Well Meg, Jonny can't enter. He's just a wee 17 year old like me.",
      "created_at": "2007-05-02T01:33:10.000Z"
    },
    {
      "author": "Megster",
      "body": "oh yea... that sucks.  \r\n\r\nwell... i am going to force chirstopher to enter... he takes air guitar very seriously... and looks the part... super tall, lanky, shaggy haired, pierced tattooed guy... i even have a dragonforce solo in mind i know for a fact he has air guitared before.",
      "created_at": "2007-05-02T01:50:25.000Z"
    },
    {
      "author": "Megster",
      "body": "so... um, how does one enter this... do you just show up with your song?  because if i am going to be forcing people to enter, i need to know the procedure...",
      "created_at": "2007-05-02T01:54:54.000Z"
    },
    {
      "author": "nate",
      "body": "I have a day to pick a guitar solo and rehearse.  I don't know if it's gonna happen.  I may just go with something that will require no rehearsing... something that is in my very blood, something that with every note resonates in the very fibers of my being.  Something like \"Stairway to Heaven,\" or possibly \"My Sharona\" by the Knack.",
      "created_at": "2007-05-02T01:59:32.000Z"
    },
    {
      "author": "nicole",
      "body": "Just show up at 9pm at The Outland. $3 cover charge. It's going to be like Open Mic Night - so have a pre-made CD with your 60-second clip (it will be easier for the sound guy to play than to have to queue it up).",
      "created_at": "2007-05-02T02:00:49.000Z"
    },
    {
      "author": "brad",
      "body": "my sister is going to compete..i put a song together for her tonight. that's right...i'm the don king to her mike tyson. look out the rest of you foos! by the time she's done shredding, your asses will be melted to your seats!",
      "created_at": "2007-05-02T10:19:19.000Z"
    },
    {
      "author": "nicole",
      "body": "Only a few hours away! Raise your hand if you're competing...I'm so curious!",
      "created_at": "2007-05-02T22:26:26.000Z"
    },
    {
      "author": "Megster",
      "body": "hey...so kel and i are making a cd for our friends that are entering so their solos will be cued up and ready to go... is it ok if they are like 20 seconds too long?  so they have a little warning...?",
      "created_at": "2007-05-03T04:23:17.000Z"
    },
    {
      "author": "nicole",
      "body": "Yeah, that shouldn't be a problem.\r\n\r\nWoohoo!",
      "created_at": "2007-05-03T04:31:22.000Z"
    },
    {
      "author": "Megster",
      "body": "awesome!",
      "created_at": "2007-05-03T04:38:47.000Z"
    },
    {
      "author": "nicole",
      "body": "Actually - I take that back - it probably should be 60 seconds. If other people are only having the same amount of time...I think I misunderstood. Sorry!",
      "created_at": "2007-05-03T04:48:58.000Z"
    },
    {
      "author": "brad",
      "body": "i just have to say....that was fuckin 'a awesome. too bad half the crowd snorted too junk much beforehand...it got a little...wild, to say the least. but, it was ch'awesome..",
      "created_at": "2007-05-03T10:38:31.000Z"
    },
    {
      "author": "nicole",
      "body": "Thanks to everyone who came out - we had a really great time and have a superb lineup for June! This will definitely be an annual event, so for those who missed out this year - we'll do it again!",
      "created_at": "2007-05-03T11:16:34.000Z"
    },
    {
      "author": "fawx",
      "body": "if someone didn't get a picture of dan on stage carrying swamp thing around on his back, i'm going to throw a fit.",
      "created_at": "2007-05-03T19:41:38.000Z"
    },
    {
      "author": "Megster",
      "body": "oh man... i think kelly did... maybe... we will see... \r\n\r\ni am so proud of swamp thing.\r\n\r\n(because he didn't throw up or pass out or start a fight with anyone)\r\n\r\nhis little brother is going to be four finger's roommate next year...",
      "created_at": "2007-05-03T20:43:36.000Z"
    },
    {
      "author": "fawx",
      "body": "alot of us seemed pretty ramped up on testosterone and ready to do the man dance.\r\n\r\ni'm not sure how it started, with people wanting to get in fights, but i couldn't wait to roll up my sleeves, stick my glasses in my pocket, crack my knuckles, and hide in the bathroom.",
      "created_at": "2007-05-03T20:54:28.000Z"
    },
    {
      "author": "dan",
      "body": "I was only going to fight b/c that dude called Ingrid a bitch.",
      "created_at": "2007-05-03T20:59:51.000Z"
    },
    {
      "author": "fawx",
      "body": "i must have walked away right before that, since ashli chased me down and said something was happening.\r\n\r\ngood thing i didn't hear it, that would've been an embarassing fight for me.",
      "created_at": "2007-05-03T21:07:01.000Z"
    },
    {
      "author": "Megster",
      "body": "what?  what happened?  who called ingrid a bitch? was this after i left?",
      "created_at": "2007-05-03T21:08:53.000Z"
    },
    {
      "author": "Megster",
      "body": "oh wait... i completely forgot... people did pull ups last night... and i kicked gril #2's ass wrestling... wow... i forgot that whole episode... but there was real fighting? or potential real fighting? yikes.",
      "created_at": "2007-05-03T21:10:26.000Z"
    },
    {
      "author": "fawx",
      "body": "it was before the spontaneous pull up contest, i believe.",
      "created_at": "2007-05-03T21:10:44.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "WHOA. DAMMMMMMIT. Why did I have to miss this?! UGH.\r\n\r\nFirst off, Buterbaugh is named \"Swamp Thing\"? That's cool.\r\nSecond, Buterbaugh jumped on Dan's back?? That's... I can't decide.\r\nThird, if I follow the comments on this page correctly, Buterbaugh was on the who called Ingrid a bitch? NOT COOL.",
      "created_at": "2007-05-03T22:33:35.000Z"
    },
    {
      "author": "nate",
      "body": "No.  It was random dude wandering out shirtless out back behind the Mudlounge.  It was right after I pwnd Ingrid wrestling.  Dan and I were gonna go all Double Dragon on his ass, but then his mom came and picked him up.  So then we did pull ups.",
      "created_at": "2007-05-03T22:38:49.000Z"
    },
    {
      "author": "Megster",
      "body": "no...christopher is rowdy but he would not call ingrid a bitch...\r\n\r\nnate wrestled ingrid too?  did i wrestle ingrid?  i think i only wrestled lanie...\r\n\r\nbut yes buterbaugh (chris) was named swamp thing and he had a viking helmet on...lots of stick on tattoos (in addition to his real tattoos) and flannel shirt unbuttoned with the sleeves cut off and a denim vest that said \"eat shit and die\" on the back of it... \r\n\r\nchris is awesome.\r\n\r\nand i was confused by the jumping on dan's back thing... it seemed like this was something dan encouraged... i couldn't tell...",
      "created_at": "2007-05-03T22:44:41.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "I wanted to go.\r\n\r\n(Erin tear)",
      "created_at": "2007-05-03T22:53:04.000Z"
    },
    {
      "author": "fawx",
      "body": "shirtless dude wasn't shirtless until i saw him rip it off and throw it god knows where.  what was his deal?\r\n\r\ni also remember having to fight my way through yells and screams of \"sit down! don't go out there!\" just to peak around the corner.",
      "created_at": "2007-05-03T22:55:42.000Z"
    },
    {
      "author": "nate",
      "body": "<blockquote><cite>Posted By: Megster</cite>nate wrestled ingrid too? did i wrestle ingrid? i think i only wrestled lanie...</blockquote>\r\nWe wrestled outside, for about two seconds, which was about how long it took to put her ass on the ground, which got gravel on both of us.  It was, in fact, the first official wrestling match of the evening, though few were there to see it.  Lucky for Ingrid, I say.\r\nYeah!  100 pages of being proud of overpowering girls that are 60 pounds lighter than me!  Yeah!",
      "created_at": "2007-05-03T23:20:40.000Z"
    },
    {
      "author": "ingrid",
      "body": "um, nate? i think you are a little confused as to how things actually happened last night. \r\n\r\na) it took you an embarrassing minute and a half to get me down, and b) i don't think you are 60 lbs heavier than me and c) dan was going to fight the shirtless guy, you were just laughing and shiftily looking for the nearest exit.",
      "created_at": "2007-05-03T23:35:13.000Z"
    },
    {
      "author": "nate",
      "body": "I have never seen such a large collection of falsehoods in one post.  Slander!  or Libel!  I don't know which!  But it is one of those two!\r\n\r\nSeriously, Ingrid.  <em>Two </em>seconds, if that.  We can film it next time.  You can't be more than, like, 110 pounds.  And I just let Dan do the <em>talking</em>.  When I strike, I strike with cold, deadly silence.",
      "created_at": "2007-05-03T23:39:28.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "REMATCH!\r\n\r\n\r\n\r\nRemember when Dan told us to act civilized on these blog threads, because some people only read the blogs and we shouldn't be seen acting like such hooligans soiling the Moxie's good name? Pff.",
      "created_at": "2007-05-03T23:39:36.000Z"
    },
    {
      "author": "ingrid",
      "body": "it is hard for me to not be a hooligan.",
      "created_at": "2007-05-03T23:45:50.000Z"
    },
    {
      "author": "Ashli444",
      "body": "Nate- Ingrid totally took you down- I witnessed the whole thing! \r\n\r\nThe best part of last night was the impromptu pull-up contest! By the way, can anyone remember who won? Someone got 21 didn't they??",
      "created_at": "2007-05-03T23:47:57.000Z"
    },
    {
      "author": "Megster",
      "body": "21?  damn that is a lot of pull ups.",
      "created_at": "2007-05-03T23:49:29.000Z"
    },
    {
      "author": "Ashli444",
      "body": "<blockquote><cite>Posted By: fawx</cite>alot of us seemed pretty ramped up on testosterone and ready to do the man dance.\r\n\r\ni'm not sure how it started, with people wanting to get in fights, but i couldn't wait to roll up my sleeves, stick my glasses in my pocket, crack my knuckles, and hide in the bathroom.</blockquote>\r\n\r\nsuch a mama's boy... ;)",
      "created_at": "2007-05-03T23:49:32.000Z"
    },
    {
      "author": "nicole",
      "body": "The guy who ripped his shirt off in the parking lot was also the guy who threatened to beat up the judges for not putting Swampthing in the Top 5.",
      "created_at": "2007-05-04T01:28:01.000Z"
    },
    {
      "author": "nicole",
      "body": "And that was me who did 21 pull ups...if 21 is the same thing as 4, with Dan lifting me up to reach the bar each time.",
      "created_at": "2007-05-04T01:29:58.000Z"
    },
    {
      "author": "nate",
      "body": "Me.  That was <em>me </em>who lifted you up.  You flew higher than an eagle, for I was the wind beneath your wings.\r\n\r\nFlyyy, flyyyy, flyyyyyyyy... high against the sky,\r\nso high you almost touch the sky.\r\nThank me, thank me,\r\nthank God for me, the wind beneath your wings.",
      "created_at": "2007-05-04T01:33:15.000Z"
    },
    {
      "author": "Megster",
      "body": "<blockquote><cite>Posted By: nicole</cite>The guy who ripped his shirt off in the parking lot was also the guy who threatened to beat up the judges for not putting Swampthing in the Top 5.</blockquote>\r\n\r\nyep.  that is the d-bag i thought it was.  i will do something evil to him.  like kick him in the face... or, he's a skate boarder...perhaps a screw or two will go missing from his wheels... these things happen... \r\n\r\nCANNOT STAND THAT GUY.",
      "created_at": "2007-05-04T01:47:48.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Should I come over and take care of business, Meg?\r\n\r\nI'm the family muscle.\r\n\r\n\r\n\r\n\r\n\r\nNo, I'm not.",
      "created_at": "2007-05-04T01:51:47.000Z"
    },
    {
      "author": "nate",
      "body": "<blockquote><cite>Posted By: nate</cite>Me. That was<em>me</em>who lifted you up. You flew higher than an eagle, for I was the wind beneath your wings.\r\n\r\nFlyyy, flyyyy, flyyyyyyyy... high against the sky,\r\nso high you almost touch the sky.\r\nThank me, thank me,\r\nthank God for me, the wind beneath your wings.</blockquote>\r\n\r\nthis maybe should have gone in the music lyrics thread.  Sorry.",
      "created_at": "2007-05-04T02:04:04.000Z"
    },
    {
      "author": "dan",
      "body": "I was the one who lifted Nicole. Nate: you lifted Ingrid. I was also the one who you remember getting 21 chin-ups. It would've been more, but the rafter started to sag and splinter, so I gave it a break.",
      "created_at": "2007-05-04T03:08:53.000Z"
    },
    {
      "author": "nicole",
      "body": "We have video footage!\r\n\r\nHere are the two YouTube links:\r\nhttp://www.youtube.com/watch?v=If9VzgoYbpU\r\nhttp://www.youtube.com/watch?v=gVmRTOLwakw\r\n\r\nThanks to <a href=\"http://profile.myspace.com/index.cfm?fuseaction=user.viewprofile&friendID=40763123\">Blondie</a> who took pics and video all night.",
      "created_at": "2007-05-04T04:53:43.000Z"
    },
    {
      "author": "Megster",
      "body": "the d-bag guy was being his normal d-bag self last night and decided that punching chris in the face would be a good idea... according to an eye witness chris \"beat the holy fuck\" out of him... so there you go ingrid, dan, nate, all others he was an ass to... he has been punished.\r\n\r\nhe is also moving out of state very soon... so that makes me happy.",
      "created_at": "2007-05-04T05:05:19.000Z"
    },
    {
      "author": "brad",
      "body": "video! nice.",
      "created_at": "2007-05-04T06:52:21.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    }
  ]
}
