{
  "id": 492,
  "title": "2007 Ozarks Regional Air Guitar Preliminaries: SUCCESS!!!",
  "body": "I decided not to write a blog post last Monday, since I wanted to make a nice post about Wednesday night's Air Guitar preliminaries. I kind of like writing posts on Fridays... maybe I'll switch to my once-a-week publishing schedule to later in the week... or maybe not. It'll just appear sometime between Monday and Friday. But enough about that, let's talk some air guitar!<br/><br/>Nicole and I were nervous for the first half of Wednesday, worrying that no one would show up, or even worse, no one would compete. We were pleasantly surprised, however, by an incredible turn-out of nearly 100 people... on a Wednesday night even! We ended up having 14 contestants, which was more than enough to select our top five (plus the crowd favorite) to move on to the finals at the Landers on June 2nd. The competition was fierce, but the judges did a good job identifying the most qualified air guitarists.<br/><br/>And now, let me show you the pictures:<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/050407/1.jpg\" width=\"425\" /><br/><br/>This is Ran, lead singer for The Dirty Blondes, who acted as our emcee... MC Ran. He did a great job, and played a pivotal role in quelling the riot that nearly broke out when the winners were announced.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/050407/2.jpg\" width=\"425\" /><br/><br/>Here's a good portion of the audience that crammed into the Outland to watch some sweet air guitar action. There was at least another 20 to 30 people in the other side of the bar (behind the wall on the right). Our panel of esteemed judges can be seen on the bottom right, marking their scores. From left to right, Jim Wunderle (resident rock guy / columnist), Beth Domann (Artistic Director of the Landers), and Michael Brothers (music columnist for the News-Leader).<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/050407/3.jpg\" width=\"425\" /><br/><br/>Here's the first brave contestant, <b>Missouri Mullet Machine</b>, rocking out to Journey's \"Any Way You Want It.\" (Total score: 20.37)<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/050407/4.jpg\" width=\"425\" /><br/><br/>Next up, we have <b>David Von Rockenstein</b> (Total score: 21)<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/050407/5.jpg\" width=\"425\" /><br/><br/>And here is <b>Swamp Thing</b>, the 2007 audience favorite (Total score: 22.5). When he didn't make it into the top five, the crowd almost exploded. A lot of hate was thrown at the judges, but luckily Wunderle brought a crow bar, and was able to beat them off. I'm serious about Wunderle and the crow bar.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/050407/6.jpg\" width=\"425\" /><br/><br/>Here is <b>Shreadasaurus Rex</b>, wearing a shirt that I used to own back in the early 90s (Total score: 18.5)<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/050407/7.jpg\" width=\"425\" /><br/><br/>And here we have our first of five finalists, <b>Odin Von Shredenstein</b>, who will be competing as the #4 seed at the Landers (Total score: 24.75). His shirt didn't stay on for long.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/050407/8.jpg\" width=\"425\" /><br/><br/>The only duo of the night, <b>Mountain Lion & Timberwolf</b>, I'm not sure which is which, gave a respectable performance (Total score: 22.25).<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/050407/10.jpg\" width=\"425\" /><br/><br/>In what would be the first of two top qualifying performances, <b>Brendan Small</b> pulled out the iconic TOP GUN theme song, with some added mic stand fighting sweetness, and earned the #2 slot in the finals (Total score: 25.1).<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/050407/9.jpg\" width=\"425\" /><br/><br/>Bringing the house to its collective knees, <b>Mr. Mean-o</b> delivered a face-melting rendition of \"Hot For Teacher\" and wound up qualifying for the finals in the #1 slot (Total score: 25.65).<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/050407/11.jpg\" width=\"425\" /><br/><br/><b>Tenacious \"H\"</b> was our first of only two female contestants, and did a hair-tossing rendition of Lenny Kravitz's \"Are You Gonna Go My Way?\" (Total score: 17.5)<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/050407/12.jpg\" width=\"425\" /><br/><br/>Known simply as <b>Dirty</b>, this dude wowed the crowd with some flippin-cool back flips, and secured his spot as the #3 seed. (Total score: 25)<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/050407/13.jpg\" width=\"425\" /><br/><br/>Our second lady of the night, <b>Dick Dasterdly</b>, rocked out to \"Crazy Train,\" and had on a cool shirt that said \"The Legend\" and pointed down at her crotch. (Total score: 21.5)<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/050407/14.jpg\" width=\"425\" /><br/><br/>Our fifth and final contestant to qualify for the finals was the energetic <b>Fingerbang Freely</b> (Total score: 23)<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/050407/15.jpg\" width=\"425\" /><br/><br/>Wearing a joker hat, but tossing it prior to this picture, <b>Admiral Danger</b> rocked us slowly with \"Radio GaGa\" (Total score: 19.5).<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/050407/16.jpg\" width=\"425\" /><br/><br/>The final performer of the night was <b>Rifleman</b>, whose shoes glowed nearly as bright as his patriotism when he chose Hendrix's classic \"Star-Spangled Banner\" to bring a fitting end to the evening's festivities (Total score: 22)<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/050407/17.jpg\" width=\"425\" /><br/><br/>After the finalists, along with audience favorite, were announced, they were invited back on stage to perform an on-the-spot collective air guitar harmony. I forgot the song, but I think the pictures sing louder than the music ever could.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/050407/18.jpg\" width=\"425\" /><br/><img src=\"http://moxie.danchilton.com/pix/grum/050407/19.jpg\" width=\"425\" /><br/><br/>And finally, if the pictures aren't enough for you, check out the video that was captured by Outland regular <a href=\"http://profile.myspace.com/index.cfm?fuseaction=user.viewprofile&friendID=40763123\" target=\"_blank\" class=\"broken\">Bolivar Blondie</a>:<br/><br/><b>Part I</b><br/><br/><object width=\"425\" height=\"350\"><param name=\"movie\" value=\"http://www.youtube.com/v/If9VzgoYbpU\"></param><param name=\"wmode\" value=\"transparent\"></param><embed src=\"http://www.youtube.com/v/If9VzgoYbpU\" type=\"application/x-shockwave-flash\" wmode=\"transparent\" width=\"425\" height=\"350\"></embed></object><br/><br/><b>Part II</b><br/><br/><object width=\"425\" height=\"350\"><param name=\"movie\" value=\"http://www.youtube.com/v/gVmRTOLwakw\"></param><param name=\"wmode\" value=\"transparent\"></param><embed src=\"http://www.youtube.com/v/gVmRTOLwakw\" type=\"application/x-shockwave-flash\" wmode=\"transparent\" width=\"425\" height=\"350\"></embed></object><br/><br/>Don't forget about the finals on June 2nd! Come out and support your local air guitar gods!!!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-05-05T07:55:36.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "El Brian de Moore",
      "body": "nice<br/>dick dastardly... is brad's sister... for those of you unaware",
      "created_at": "2007-05-05T10:53:16.000Z"
    },
    {
      "author": "dan",
      "body": "and Rifleman is Nate... for those of you unaware.",
      "created_at": "2007-05-05T11:01:20.000Z"
    },
    {
      "author": "brad",
      "body": "and i am not the fat guy in spandex... for those of you unaware.",
      "created_at": "2007-05-06T07:48:47.000Z"
    },
    {
      "author": "nicole",
      "body": "This was my favorite night in a long time. I can't wait for the finals!",
      "created_at": "2007-05-06T08:15:56.000Z"
    },
    {
      "author": "nate",
      "body": "<em>The </em>Rifleman.",
      "created_at": "2007-05-06T21:36:43.000Z"
    },
    {
      "author": "Girl #2",
      "body": "I work with the fat guy in spandex...for those of you unaware",
      "created_at": "2007-05-07T02:10:54.000Z"
    },
    {
      "author": "nicole",
      "body": "Odin von Shredenstein was the only person I heard of talking about the event prior to it happening. It made me very happy.",
      "created_at": "2007-05-07T03:03:48.000Z"
    },
    {
      "author": "Caleb",
      "body": "Man, Shreadasaurus Rex was going crazy when it first started and knocked into me about three times, the second and third times spilling my beer all over me. Not fun.  But that's what you get when you're standing near the front of such a wild audience! <br/><br/>Fun times. Even when the Swamp Thing fans got out of hand.",
      "created_at": "2007-05-07T03:45:12.000Z"
    },
    {
      "author": "fawx",
      "body": "dick dastardly broke one of my roommates' ankles and two of my roommates' hearts.  how poetic.",
      "created_at": "2007-05-08T07:45:18.000Z"
    },
    {
      "author": "HonkeyHero",
      "body": "It looks like more skin would've equaled more points... Remember that next year Nate...<br/><br/>I very sad I missed this :-(",
      "created_at": "2007-05-08T22:21:51.000Z"
    },
    {
      "author": "nicole",
      "body": "Well, you still have another chance to watch! The finals are Saturday June 2nd @ 7pm!",
      "created_at": "2007-05-09T01:03:29.000Z"
    },
    {
      "author": "stevie_g",
      "body": "Sounds like a really cool photo op. I'll see if I can make the finals!",
      "created_at": "2007-05-11T05:22:43.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
