{
  "id": 494,
  "title": "Back to the ol' grindstone",
  "body": "Nicole and I had a great time on our cruise last week. It was our first real vacation since our honeymoon four years ago, and the most time we've ever taken off from the theater. May is a good time to take off, as it's traditionally our slowest month of the year. Next year we might just close the theater for a week or two allow ourselves some completely stress-free time off. We'll just have to wait and see.\r\n\r\nWe did find, however, that the best way to get back in the work groove is to throw yourself head-first into the longest weekend in Moxie history. We worked 36 hours last weekend, making it the longest three day work stretch since we opened. And if you were thinking to yourself, \"thirty-six hours in three days! That's incredible! Too bad a documentarian wasn't on hand to film such a historic event.\" Fear not. David, a dynamically dexterous documentarian from Dallas, hung out with us for nearly 20 hours, shooting footage for a <a href=\"http://www.road-dog-productions.com/cgi-bin/2007/05/moxie.html\">short documentary he's making about the Moxie</a>. Brad, our very own Moxie forum regular, was there as well, helping David capture sound for his film. We'll keep you updated as the film progresses.\r\n\r\nAnd that's it. Here's an air-brushed, color-corrected, mole-less picture of Nicole and I on our cruise. Enjoy!\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/052107/dan_nic.jpg\" width=\"425\" />\r\n\r\nAnd yes, we're both nude in that picture.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-05-22T02:02:12.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Cosmik",
      "body": "Both nude, yet remarkably sunburn free.  Hmmmmmmmm.",
      "created_at": "2007-05-22T02:23:07.000Z"
    },
    {
      "author": "dan",
      "body": "SPF 30, my friend.\r\n\r\n<small>SPF 45 below the belt</small>",
      "created_at": "2007-05-22T02:32:00.000Z"
    },
    {
      "author": "ariananana",
      "body": "high five to nicole for the glasses-sunglasses thing....really...i do that a lot too",
      "created_at": "2007-05-22T02:48:37.000Z"
    },
    {
      "author": "nicole",
      "body": "Yes. I'm awesome.",
      "created_at": "2007-05-22T04:10:37.000Z"
    },
    {
      "author": "brad",
      "body": "glasses w/in glasses! awesome.",
      "created_at": "2007-05-22T06:24:26.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
