{
  "id": 495,
  "title": "The Moxie Blog: Three years old and still not pulling down mad bank",
  "body": "<i><b>Day late and a dollar short</b> - This post was originally going to be published yesterday, but I got caught up reading through the archives, and the next thing I knew it was 7:00 on Friday. Sorry for the delay.</i><br/><br/>Today marks two big events for the old Moxie Blog: the three year blogoversary, AND the 500th post. It doesn't seem like I've been doing this for three years, but at the same time, when I read back through the archives, it feels like those events happened ages ago! Remember when that girl flashed me while I was changing the marquee? Or what about when I was caulking the front window and a lady rolled down her window to ask me if I was breaking into the building? Man... those were the days... the boob-flashin', burglary-suspectin', good ol' days.<br/><br/>*stares off in space*<br/><br/>*sighs*<br/><br/>I'm sorry. What were we talking about again? Oh yeah, the blog. My posting pace has slowed quite a bit over the last year or so, and I realize that the content isn't what it used to be, but things have a way of changing over time, you know. And, of course, now that I'm a disassociated, egomaniacal multi-millionaire, I really don't see the purpose of entertaining you lowly groundlings anymore.<br/><br/>*puffs on pipe*<br/><br/>*sighs*<br/><br/>In all seriousness though, I really am smoking a pipe. So, to mark this momentous occasion of both our three year blogoversary and the 500th post, I thought I'd look back and mock my past self for thinking life was sooooooo stressful back then. Let's go!!!!<br/><br/><a href=\"/posts/1\"><b>Post #1</b></a> - Ah, young naive Dan. So young, so naive. Naive. Naive. Naive. Young. Young. Yoive. This was back in the days when I'd idle away my free time daydreaming about running my own independent movie theater. In my mind's cinematic view, the camera would open on a packed auditorium, filled with a happy, laughing audience, and then slowly pan over their heads, moving closer and closer to the projection window, where you could just make out my silhoette. Cut to inside the booth, where we find young Dan feverishly typing out the next great American screenplay, while simultaneously making sure the projector is running fine. Watching movie after movie from the booth has allowed young Dan the opportunity to completely dissect and boil film down to its purest form. With this new-found information, Dan churns out script after script, until he eventually makes so much money that his butt explodes from the sheer size of his giant wallet. Looking back, I realize just how naive I really was - there's no way I could fit a desk and a typewriter in the booth. I mean, have you seen how small it is?!<br/><br/><a href=\"/posts/100\"><b>Post #100</b></a> - I managed to write 100 posts in less than six months. I was a MACHINE back then! This post features me complaining about money, or loans, or something financial... it's all a blur, to tell you the truth. I'm happy to see that I used the phrase \"sweaty wad.\"<br/><br/><a href=\"/posts/108\"><b>Post #108</b></a> - The six month mark. I was stressing out about telling Mee Ma (my grandmother) about the theater. I'm not going to make fun of that bit of stress, because if I were put in the same situation today, I'd be just as nervous. Mee Ma ended up being proud of us for starting the theater, although she never quit worrying for our financial, and overall well-being... as all good grandmothers do. Sadly, she passed away two days before the theater opened, so she never got to see the Moxie in operation. I'm sure she would've been proud.<br/><br/><a href=\"/posts/20\"><b>Post #200</b></a> - Work finally began on the theater. That was a very exciting time. In fact, I think I wrote that post from the Mudhouse... back when I didn't know anyone who worked there. Weird.<br/><br/><a href=\"/posts/220\"><b>Post #220</b></a> - The big one year mark. Blah blah blah blah blah blah. The theater still wasn't open yet, so I was just filling time. I should really start posting altered song lyrics again.<br/><br/><a href=\"/posts/300\"><b>Post #300</b></a> - Things are finally starting to take shape. Post #300 actually landed on the day of our first test run. How many of you made it to one of the test runs? Come on now, who are the REAL Moxie fans...?<br/><br/><a href=\"/posts/331\"><b>Post #331</b></a> - One year and a half. The infamous phantom smell. Enough said.<br/><br/><a href=\"/posts/400\"><b>Post #400</b></a> - Important information for the 2006 SATO showings. Hmm, that sounds familiar.<br/><br/><a href=\"/posts/413\"><b>Post #413</b></a> - The big two year mark. We were busy planning Moxie Week, the big celebration of our first year in business. Speaking of which, we better get on the ball for Moxie Week 2007!!! Don't plan on quite as many events, but do plan on another round of Moxie Shorts.<br/><br/><a href=\"/posts/472\"><b>Post #472</b></a> - Two and a half years old. Lots of change at the ol' teatro: we installed glass in our back pass-thru, created the drill-powered rewind table, built an online system for purchasing gift certificates and bulk passes, and started showing digital trailers. That seems like so long ago... but it was just six months ago.<br/><br/>And now here we are at post #500, AND the big three year mark. Let's look at how many posts I wrote for each year of the blog's existence:<br/><br/>Year 1 = 220 posts<br/>Year 2 = 193 posts<br/>Year 3 = 87 posts (AWESOME!)<br/><br/>At this rate, I'll be lucky to top 40 posts in year four... and then 10 posts in year five... and then in year six... well, I'll probably have outsourced this tedious \"blog writing\" business to someone else by that point. One can only dream.<br/><br/>Thanks again for sticking around for another year of the Moxie Blog. This next year will be chock-full with all kinds of future changing events: our first movie at the Gillioz (scheduled for sometime in June/July), new film series and Moxie-a-Go-Go events, the opening of College Station, and plenty of other things that we can't predict. Stick around... I might write a funny post eventually.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-05-26T04:27:13.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nate",
      "body": "Glancing over those early posts I find it funny that Dan used to respond to each and every comment.",
      "created_at": "2007-05-26T06:21:43.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "i remember all of this!!<br/>except for possibly that first post<br/><br/>... i do recall a certain questionnaire that was posted on morawk<br/>if i recall.. that was posted on there.. before the blog was started<br/>but it got me excited enough to keep track and become addicted to this place weve grown to love",
      "created_at": "2007-05-26T07:39:36.000Z"
    },
    {
      "author": "stevie_g",
      "body": "Dan,<br/><br/>Though I had read random early posts before, I took this opportunity to start from the beginning and read each and every post. I am now just past the point where you abandoned 425 for 408 (Post #68). Like a good book, I can't put it down...<br/><br/>I know this idea has been put forth before, but at some point in the future, once you have laid waste to College Station, when you have become mega-billionaires, and you have at last completed your 3D marquee, you need to take your blog posts (including Nicole's) and have them published as a journal. Not only have you been consistantly funny and entertaining through the ups and downs, it is a legitimate document of a couple's steadfast determination to realize their chunk of the American Dream, as well as a true guide to what it takes to start an independent enterprise from the ground up.",
      "created_at": "2007-05-28T03:37:30.000Z"
    },
    {
      "author": "dan",
      "body": "Thanks Steve. I've toyed with the idea of turning our story into a how-to book, or at the very least, publishing most of the blog in journal form, but I always seem to lose momentum once I get started. Who knows... maybe it'll just take time.",
      "created_at": "2007-05-28T04:29:10.000Z"
    },
    {
      "author": "brad",
      "body": "that's it, i'm moving to Midwestburg.",
      "created_at": "2007-05-28T04:48:09.000Z"
    },
    {
      "author": "ariananana",
      "body": "<blockquote><cite>Posted By: dan</cite>Thanks Steve. I've toyed with the idea of turning our story into a how-to book, or at the very least, publishing most of the blog in journal form, but I always seem to lose momentum once I get started. Who knows... maybe it'll just take time.</blockquote><br/><br/>that's actually kind of brilliant...i'm sure there are a lot of people who want to do what you've done. ideally, i'd love to do something like this when i retire...this would be about 60 years from now...but nonetheless...<br/><br/><br/><br/>I remember first reading about the Moxie in the newspaper, and then reading some of the first blogs from MoRawk.",
      "created_at": "2007-05-28T10:42:02.000Z"
    },
    {
      "author": "nicole",
      "body": "When you retire? Geesh. This has been the hardest two years of our lives. I thought people would want to relax once they retire! I know that's what I'll be doing...",
      "created_at": "2007-05-29T01:01:29.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "smoking... wrestling and getting your ears pierced?",
      "created_at": "2007-05-29T01:53:05.000Z"
    },
    {
      "author": "Megster",
      "body": "when i read the ari post above i wanted to smack her... on your behalf and for all business owners... when she retires... *pssh*... insolent, smug little bitch.  <br/><br/>but... you know... i want to smack her a lot.  <br/><br/>sorry... that may have been a tad overdarmatic.",
      "created_at": "2007-05-29T01:56:38.000Z"
    },
    {
      "author": "nicole",
      "body": "ha ha, no, that's a pretty good statement!",
      "created_at": "2007-05-29T02:56:35.000Z"
    },
    {
      "author": "ariananana",
      "body": "<blockquote><cite>Posted By: nicole</cite>When you retire? Geesh. This has been the hardest two years of our lives. I thought people would want to relax once they retire! I know that's what I'll be doing...</blockquote><br/><br/><br/>haha, i never run out of energy!<br/><br/><br/><br/> naw, that'd be so cool if you guys did that. you guys are gonna be (and have pretty much- yeah i'll say that you have) attained springfield legend status....it'd be so neat to publish your story.",
      "created_at": "2007-05-29T06:41:06.000Z"
    },
    {
      "author": "EdMo",
      "body": "The Moxie is about the only reason I'd wanna stay in Springfield.<br/><br/>Other than for the people who live there...aka...my friends and lovers.",
      "created_at": "2007-05-29T08:35:27.000Z"
    },
    {
      "author": "tim",
      "body": "<blockquote><cite>Posted By: EdMo</cite>The Moxie is about the only reason I'd wanna stay in Springfield.<br/><br/>Other than for the people who live there...aka...my friends and lovers.</blockquote><br/><br/>Can you not have international Lovers?",
      "created_at": "2007-05-29T08:45:32.000Z"
    },
    {
      "author": "EdMo",
      "body": "Only when I drink International Coffee",
      "created_at": "2007-05-29T08:49:21.000Z"
    },
    {
      "author": "Cosmik",
      "body": "With International Delights creamer?",
      "created_at": "2007-05-29T17:12:19.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Get rich quick scheme for Dan: sell T-shirts of cats scuba diving, like Max has. That's so money!",
      "created_at": "2007-05-29T22:11:05.000Z"
    },
    {
      "author": "ariananana",
      "body": "you guys should get an old fashioned photo-booth, a la Amelie. Now that's money!<br/><br/><br/>(and probably ridiculously expensive =[ )",
      "created_at": "2007-05-30T02:39:29.000Z"
    },
    {
      "author": "EdMo",
      "body": "and bulky.",
      "created_at": "2007-05-30T09:34:19.000Z"
    },
    {
      "author": "Master RJ",
      "body": "At the photo-booth, play inside lots of cool new wave tracks.",
      "created_at": "2007-05-30T10:28:27.000Z"
    },
    {
      "author": "CinemaUntapped",
      "body": "Aqtualy those booths arent expensive. you rent them. the problem is they break all the friggin time and compared to how often people use them and how often they break it's just not worth it.<br/><br/>By the way Dan, Nicole. You guys have done a wonderful job with this business venture and I hope for the best in the future. Like I said. If you guys ever ned another scren I gotcha covered.",
      "created_at": "2007-07-13T09:28:34.000Z"
    },
    {
      "author": "Becca",
      "body": "<blockquote><cite>Posted By: CinemaUntapped</cite>Aqtualy those booths arent expensive. you rent them. the problem is they break all the friggin time and compared to how often people use them and how often they break it's just not worth it.</blockquote><br/><br/>Is there ANYTHING you don't know about?",
      "created_at": "2007-07-15T02:47:30.000Z"
    },
    {
      "author": "Megster",
      "body": "<blockquote><cite>Posted By: Becca</cite><blockquote><cite>Posted By: CinemaUntapped</cite>Aqtualy those booths arent expensive. you rent them. the problem is they break all the friggin time and compared to how often people use them and how often they break it's just not worth it.</blockquote><br/><br/>Is there ANYTHING you don't know about?</blockquote><br/><br/>syntax, grammar, spelling, basic communication, biology, mythology..?<br/><br/>did i miss something?",
      "created_at": "2007-07-15T03:30:31.000Z"
    },
    {
      "author": "CinemaUntapped",
      "body": "Of course. But in my life I have done a lot of trades and i worked as a carney for almost 10 years so I do know alot about the amusement buisness.  I had 3 of those machines at one point and they always had trouble with the chemical mixture. even with black and white. The coin and bill slots always broke. they were just cruddy machines. Ask me about cars and I have next to nothing to say.",
      "created_at": "2007-07-15T10:29:28.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
