{
  "id": 496,
  "title": "Big events a-comin'",
  "body": "We've got some big stuff coming up, so I thought a quick blog post was warranted.<br/><br/><b>Ozarks Regional Air Guitar Finals / AIR GUITAR NATION Premiere - Saturday night at the Landers</b><br/><br/>This is going to be huge. If you didn't catch the preliminaries for fear of the bar scene, this is your chance to catch some air guitar goodness in the safe confines of The Landers (who just received their liquor license, by the way, so beer will be served). The night will begin with the Springfield premiere of AIR GUITAR NATION, which is one of the funniest, most enjoyable documentaries we've shown in a long time. This is how the evening will play out: you pay $10 at the door - I know, I know. You're probably thinking, \"TEN DOLLARS! That's pretty expensive, Dan. What else do I get out of it?\" Well, let me tell you. That $10 ticket gets you in to see AIR GUITAR NATION, plus the Air Guitar competition, which follows immediately after the movie, PLUS free cover at the official after-party at The Outland, which, obviously, follows immediately after the competition. That's THREE huge events for the price of one. Not a bad deal, if you ask me... and I know you won't! Be there, or be square, folks. It's going to be THE event Saturday night.<br/><br/><b>JUNE CALENDAR, and the 2nd annual Passport Summer Series</b><br/><br/>Our June calendar is live, so if haven't checked it out yet... what's the big hold up?! Every Summer we have a bevy of quality foreign films to choose from, so we decided to reinstate the Summer Passport Series, and cherry-pick the TEN best films from around the globe. Unlike last year, where all the eligible films (seven total) were crammed into one month, we're stringing these films out over June, July, and August. The first five, however, fall in June. We'll have the official 2007 Moxie passports ready by Friday, for the premiere of BLACK BOOK, so make sure you stop by and pick one up... and see BLACK BOOK. At the end of the Summer, all the passports that have collected TEN stamps will be thrown into a container of some sort - most likely my pants - and a winning passport will be drawn at random. The winner will receive a $500 travel gift certificate to a local travel agency, which they can then use to do some traveling of their own. With gas prices being what they are, we may give the winner a choice between a travel gift certificate, or $500 worth of gas. Either way, it's a sweet prize... and the eligible movies aren't too shabby either.<br/><br/>And finally <b>AQUA TEEN HUNGER FORCE COLON MOVIE FILM FOR THEATERS</b><br/><br/>If you're planning on seeing this, please, PLEASE buy your tickets early. We've had 5 sold out shows over the last week, and all the others were pushing capacity. I can't believe the audience response to this film! If there's one bit of advice you take from me today, please let it be this: buy. tickets. in. advance! You can swing by the theater early (even DAYS early), or buy them online whenever you like. As much as we enjoy being yelled out for not having tickets five minutes before the movie starts, I'd rather everyone be happy and buy in advance.<br/><br/>That's all. I hope you had a fun and relaxing three day weekend. Now, back to work!<br/>",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-05-30T07:46:56.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "drm00se",
      "body": "I have a bit of advice, too: Don't drink your weight in beer and kick the handle off the toilet.<br/><br/>Oh yeah, and don't sell this movie on ebay, 'cause they'll break into your house and tear your wife in half.",
      "created_at": "2007-05-31T01:54:51.000Z"
    },
    {
      "author": "ariananana",
      "body": "uh..so...is ATHF going to continue into june? i guess i should check the calendar.",
      "created_at": "2007-05-31T04:16:32.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "I won't be back in town til about 9 or 9:30 tomorrow night. I'm not happy about this. This makes me sad.",
      "created_at": "2007-06-01T21:43:43.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
