{
  "id": 497,
  "title": "Keeping busy, staying out of trouble",
  "body": "Hey guys. I realized today that I hadn't made a post in a while, so I thought I'd drop in and let you know that we're still here. You'd think during a month with traditionally low attendance, like June, that we'd have all sorts of free time on our hands, but that's rarely the case. We've been keeping busy with a jam-packed June schedule, preparations for Moxie Shorts, 35mm install at the Gillioz, and several other less glamorous projects. Whenever we get this busy, I tend to let the blog fall by the wayside, which you can look at as either a good or a bad thing. It's good that we're continually working on lots of new events and film series, but it's bad when I can't find the time to sit down and devote at least a half hour to writing about them.<br/><br/>As for The Gillioz projector install, the last piece of the 35mm projection system arrived yesterday, which means we should be installing sometime next week. Assuming that we don't run into any problems during the installation, you can expect to start seeing Moxie movies at The Gillioz sometime in July. Booking the first big Moxie/Gillioz film, however, has been an arduous task. Not only do we have to find a title with a wider appeal than our typical titles, but we also have to convince the distributors to give us a shot with a bigger film, instead of passing it off to one of the multiplexes (which is tougher than you'd think when one of your main competitors is known for aggressively pursuing any and all films that hold the slightest chance of making any money). We made a bid on SICKO, but that didn't work, so now we're looking for something big in July. Either way, I'll keep everyone abreast as we make progress.<br/><br/>I also want to let you know that we're hosting a special \"Teacher's Appreciation\" screening of CHALK on Sunday, July 1st at The Landers. Executive Producer David Gonzales, and one of the main actors will be in attendance to speak before and after the movie. Teachers with valid IDs get discounted tickets ($5), while everyone else pays regular admission prices ($8 adults, $6.50 for seniors and students). If you haven't watch the preview for CHALK yet, check it out <a href=\"http://www.chalkthefilm.com\" target=\"_blank\" class=\"broken\">here</a>, or you can check out our <a href=\"http://www.moxiecinema.com/films/204\" class=\"broken\">Moxie page for the film</a>. AND, if you're a Morgan Spurlock fan you should definitely come out, since they'll be giving away lots of free Spurlock-related schwag from SUPER SIZE ME and 30 DAYS. Spurlock, along with David Gonzales, is one of the executive producers for CHALK.<br/><br/>And last, but certainly not least, we're hosting our second live music show this Friday night with Columbia's own Foundry Field Recordings, and ex-Moxie employee / Springfield man-about-town JR Top's Sweetwater Abilene. More info, with links to videos and music <a href=\"http://www.moxiecinema.com/films/210\" class=\"broken\">HERE</a>. Tickets are $5 at the door, and it's guaranteed to be a great time!<br/><br/>Ok, that does it for now. Don't forget, our Summer Passport Series is still in full effect, so stop buy and catch some of the best international films... in the WORLD. It's like a three month film festival!!!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-06-13T06:22:23.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Master RJ",
      "body": "Rescue Dawn for July! Or You Kill Me (expands July 4th).",
      "created_at": "2007-06-13T07:25:20.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Or Sunshine (July 20th).",
      "created_at": "2007-06-13T07:25:55.000Z"
    },
    {
      "author": "ariananana",
      "body": "dan! nice work on organizing all that for CHALK!",
      "created_at": "2007-06-14T13:26:59.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Landers idea (for Halloween): Plan 9 From Outer Space...re-edited with the musical \"talents\" of William Shatner.",
      "created_at": "2007-06-14T13:49:41.000Z"
    },
    {
      "author": "drm00se",
      "body": "How dare you insult William Shatner?! He is a brilliant man! He is greater than any of us will ever be!",
      "created_at": "2007-06-21T04:28:11.000Z"
    },
    {
      "author": "Master RJ",
      "body": "I'm not \"insulting\" Shatner, just his \"singing\".<br/><br/>Hey. Mis-ter. Tam-bou-rine. Man. Play. A. Song. For. Me.",
      "created_at": "2007-06-21T04:58:16.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
