{
  "id": 498,
  "title": "The fall of the Avalon",
  "body": "The Avalon Cinema is a small, single screen theater situated about 2,000 miles to the West of us in Corvallis, Oregon (a town roughly 1/3 the size of Springfield). Like the Moxie, the Avalon is the only theater in its town to show smaller independent films, but after ten years of being in business, attendance has dropped so low that they can no longer pay their bills... and now another haven of alternative cinema is gone. Nicole and I took this news especially hard, mainly because Paul, the owner, had taken the time to answer our questions back in the nascent days of our own little cinema.<br/><br/>It's always difficult to see one of your own bite the dust, and it forces you to take stock in your own future. I can't say where the Moxie will be when we hit the big ten year mark (a mere EIGHT years away), but I sincerely hope we're still here. Paul is a great guy who worked seven days a week so he could share his passion for smaller films with his community, and it's a shame that after ten years, when the Avalon needed them most, Corvallis couldn't return the favor.<br/><br/>Following is a snippet from the lengthy e-mail that Paul sent out last week. If you'd like to read the whole thing, you can do so <a href=\"http://ericstoller.com/blog/2007/06/12/avalon-is-closing/\" target=\"_blank\">here</a>. The Avalon's <a href=\"http://www.avaloncinema.com\" target=\"_blank\" class=\"broken\">website</a> is still up, and if you'd like to send Paul a warm regard from Moxieland, his e-mail is near the bottom.<br/><br/><quote>Well kids,<br><br>For almost ten years the Avalon Cinema has been on Second Street creating the market for art and independent films in Corvallis and making such fare available to our community. After a final extensive remodel that brought in beer, wine, and food, it has become obvious that the Avalon Cinema no longer has a place in this fine town. Attendance has been dismal and the bills are not getting paid.<br><br>It would be easy for me to start waxing maudlin and sentimental. After all, there is a lot of history there. Not only for my customers, but for me, as well. There have been wonderful highs and soul searing lows. The days of the highs are gone.<br><br>With the coming to town of the Carmike 12-plex, the competition for movies has become fierce. The war was mostly between Carmike 12 and Ninth Street Cinemas and we are caught in the crossfire. There are only so many good movies out there and we used to get five or six of them a year. Now we get one or two. With so many first-run screens in town, both of the big theaters have started culling from my market to fill their screens. Since they are bigger, the movies will go to them. No matter how cool the Avalon was, it is the films that fill the seats. The stress of adding the Darkside to this town’s cinematic mix was the final straw. We basically killed the Avalon by building our own cool new theater.<br><br>When I’m at a low point, it gets very easy to be bitter about the local government having invited the cinema exhibition vampire that is Carmike over the threshold of our fair city to suck the life-blood out of what was cool about films here. And I have a sense of rage that five years after the death of the Whiteside, people are forming groups to try to do something with the building. Where the hell were they when it was a movie theater looking for ticket buyers? I guess buying a ticket isn’t as sexy as whining after the fact. The ounce of prevention this town needs is to support those places they want to see remain viable. Don’t count on your neighbors to do it for you, because the pound of cure will always be less desirable. Yes, if the Avalon and Darkside fold up and drift down the Willamette, it’s likely that you can see some good movies at the Regal and Carmike — if you don’t mind 20 minutes of ads, and higher prices, and someone trying to up-sell you every time you step into the neon lobby. But there will be no one left to take chances on the smaller, unproven titles.<br><br>So it goes.</quote>",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-06-24T07:09:18.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nate",
      "body": "This eats me up a little.",
      "created_at": "2007-06-24T09:34:42.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Megaplexes 10,458, Small One-Screen Theatres 42",
      "created_at": "2007-06-24T09:39:51.000Z"
    },
    {
      "author": "brad",
      "body": "boop sad",
      "created_at": "2007-06-24T14:56:11.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "This is sad. And I'd like to say, \"Dan and Nicole, don't worry, we'll always be here for ya, going to movies and keeping the Moxie well above water.\"But I can't really, 'cause I don't know. I do know though, that as long as I am in this town, I will keep going to and promoting the Moxie as much as I can.<br/><br/>Unless you fire me. Then, all bets are off.",
      "created_at": "2007-06-24T20:41:11.000Z"
    },
    {
      "author": "nicole",
      "body": "You should all definitely check out his website where it says \"People Say...the darndest things...\"<br/><br/>I cried a little I was laughing so hard.",
      "created_at": "2007-06-24T22:43:04.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "<blockquote>Do you ever play movies with a bestiality theme?<br/>-Question from customer out walking his dog.</blockquote><br/><br/>W.......... T................ F  ???",
      "created_at": "2007-06-25T01:20:56.000Z"
    },
    {
      "author": "nicole",
      "body": "Speaking of, we have a film with a similar theme coming to The Moxie in July...Zoo.",
      "created_at": "2007-06-25T01:43:21.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Yeah, I saw that on the tentative calendar. Gross, Nicole. Gross.",
      "created_at": "2007-06-25T01:50:35.000Z"
    },
    {
      "author": "Master RJ",
      "body": "I thought you refused to screen it due to the graphic content.",
      "created_at": "2007-06-25T02:03:15.000Z"
    },
    {
      "author": "dan",
      "body": "When have we ever refused to screen something due to graphic content?",
      "created_at": "2007-06-25T02:05:12.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Well, I remember you guys saying that you absolutely wouldn't show any movie that featured graphic, noticeable esoteric Jewish humor. Thank God. The Christian God, of course.",
      "created_at": "2007-06-25T02:18:58.000Z"
    },
    {
      "author": "stevie_g",
      "body": "I did a web search and came up with these:<br/><br/><a href=\"http://www.cinematour.com/tour/us/11317.html\">http://www.cinematour.com/tour/us/11317.html</a><br/><br/><a href=\"http://efilmcritic.com/feature.php?feature=1304\">http://efilmcritic.com/feature.php?feature=1304</a><br/><br/><a href=\"http://www.gazettetimes.com/articles/2007/06/21/news/community/4aaa03_avalon.txt\">http://www.gazettetimes.com/articles/2007/06/21/news/community/4aaa03_avalon.txt</a><br/><br/>I wanted to see for myself what the world was losing.<br/><br/>I'm suddenly feeling incredibly guilty about not frequenting the Moxie much lately...",
      "created_at": "2007-06-27T02:53:11.000Z"
    },
    {
      "author": "nate",
      "body": "If I lived in Corvallis, Oregon, I would totally have been a big time regular of The Avalon.",
      "created_at": "2007-06-27T02:59:25.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 12,
      "name": "Thoughts"
    }
  ]
}
