{
  "id": 499,
  "title": "No More Teacher's Dirty Looks!",
  "body": "Hello everyone! It's me, Nicole. Dan's away tonight, and he accidentally gave me the password to the blog administrative site...ha ha, oh man. He's going to be surprised tomorrow! I could put pictures of Cillian Murphy all over this place...\r\n\r\n<img src=\"http://img217.imageshack.us/img217/3998/mrsmurphycr9.jpg\">\r\n\r\nAhem. Anyways.\r\n\r\nThings are buzzing with excitement over here at The Moxie. Besides the fact that Dan's gone for the night and Caleb and I drank half our stock of Cream Soda (what?), we're in the midst of many extraordinary events.\r\n\r\nFirst, we've got CHALK, the hilarious Office-style film about high school, selling out its first two showings! We turned away some upset teachers tonight (and, though it's been about 8 years since high school, I still feel that hot flush of embarrassment when I disappoint a teacher). But on the plus side, I think we made a lot of teachers happy. Or at least, that's what the laughter coming from the auditorium indicated.\r\n\r\nWhat we're excited about is on Sunday night at The Landers (311 E Walnut), we're hosting a Teacher Appreciation Night with CHALK. Tickets are $5 for teachers, standard admission for everyone else. AND some of the filmmakers, who happen to be SMSU alumni, will be in attendance. The film is hilarious, even if you aren't in the education field. And what's great is that it's not making fun of public schools, but is like a valentine to the teachers who persevere and love their jobs in education. Tickets for Sunday night's show are available only at The Landers, so you can call them (869-1334), stop in (311 E Walnut), or visit their website <a href=\"http://www.springfieldlittletheatre.org\">(http://www.springfieldlittletheatre.org)</a>.\r\n\r\nAnother event we're excited for just came together today, and we'll have more info later in July. We are partnering up with Wilson's Creek National Battlefield to help them celebrate their 100 year anniversary (and I thought the 8 years since high school was a long time!). We'll be showing a series of Civil War documentaries made by an Emmy-award winning crew from Kansas City, complete with guest speakers, enthusiasts, and, if you're lucky, maybe we'll throw in some Civil War hardtack...keep your eyes peeled for more information on this series. Oh yeah, and it will be FREE!\r\n\r\nAnd lastly, something for you Harry Potter fans out there. If you haven't heard, the seventh and final installment of the Harry Potter books is being released at midnight, July 22. This is by far the biggest literary event of the century, possibly since the invention of the printing press, so downtown Springfield is celebrating it in a big way. Our block of Walnut and Campbell will transform into Diagon Alley (the major shopping district for wizards at Hogwarts). <a href=\"http://springfieldhotglass.com/\">Springfield Hot Glass Studio</a> will become Ollivander's Wand Shop, where Terry Bloodworth will create custom-made magic wands; <a href=\"http://wellfedhead.com\" class=\"broken\">Well Fed Head</a> will be Weasleys' Wizard Wheezes where they'll whip up a good dose of tricks, contests, games, and of course, have copies of the book; Shires for Hire will be in town for the night giving carriage rides to the wannabe wizards...\r\n\r\nAnd finally, The Moxie will become The Leaky Cauldron, showing <a href=\"http://www.moxiecinema.com/films/215\" class=\"broken\">Harry Potter and the Prisoner of Azkaban</a>, and serving up some kid-friendly Butter Beer. And trust Caleb and me. It's good stuff. We should know - we drank quite a bit tonight.",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2007-06-29T06:57:20.000Z",
  "author": "Nicole",
  "comments": [
    {
      "author": "Master RJ",
      "body": "Why The Prisoner of Azkaban over The Goblet Of Fire? The Prisoner Of Azkaban was a bastardazation of the book.",
      "created_at": "2007-06-29T08:09:05.000Z"
    },
    {
      "author": "nicole",
      "body": "Oh RJ. You're probably just upset because there's no Quidditch match in \"Azkaban.\"",
      "created_at": "2007-06-29T10:59:00.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "i dont like beer... but whatever butter beer is.... sounds delicious\r\n\r\nps: i miss you moxie... ive barely had the time to go to anything for quite a while\r\nbut tomorrow! tomorrow ive decided to come see chalk\r\nhopefully ill get there early enough to get a ticket",
      "created_at": "2007-06-29T11:47:22.000Z"
    },
    {
      "author": "Master RJ",
      "body": "<blockquote><cite>Posted By: nicole</cite>Oh RJ. You're probably just upset because there's no Quidditch match in \"Azkaban.\"</blockquote>\r\n\r\nIn the book, the Quidditch parts add something. In the film, they're reduced to a pointless scene and the rearranging of the plot. I actually nearly walked out from how boring it was.",
      "created_at": "2007-06-29T11:56:47.000Z"
    },
    {
      "author": "ariananana",
      "body": "i am SO there for the butter beer :D",
      "created_at": "2007-06-29T14:30:30.000Z"
    },
    {
      "author": "evilvet",
      "body": "I've never had butter beer; I hear its margarinally delicious.  If you drink it while eating a Butter Burger, will your insides melt?",
      "created_at": "2007-06-29T17:56:17.000Z"
    },
    {
      "author": "Megster",
      "body": "hmmm... after the \"caleb and i should know\" thing at the end i assumed butter beer was just a phrase to harry potter-ize cream soda... and i love cream soda...",
      "created_at": "2007-06-29T18:06:50.000Z"
    },
    {
      "author": "nicole",
      "body": "Oh no, Butter Beer is a special concoction that has Cream Soda as a base...sooo good.\r\n\r\nAnd yes, your insides will melt if you eat a butter burger...or at least get really slick...\r\n\r\nNext time you're in, RJ, I'll explain the fine points of character development, and why the Quidditch games don't mean much past the second book in the series.",
      "created_at": "2007-06-29T19:01:10.000Z"
    },
    {
      "author": "nate",
      "body": "my hermione and ron\r\nare gonna get it on.",
      "created_at": "2007-06-29T19:06:16.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "That's good photo shop, and \"keep your eyes peeled\" is such a gross phrase.",
      "created_at": "2007-06-29T22:18:09.000Z"
    },
    {
      "author": "nicole",
      "body": "Photoshop? I don't get it. You're looking at a real picture of us....",
      "created_at": "2007-06-29T22:44:49.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "No, yeah, I know. I'm just... I was just... I was just calling you \"shop\". Y'know, like a nickname. Heyyy... Shop.\r\n\r\n...Of course, it is. Of course it's a real picture.",
      "created_at": "2007-06-29T22:50:11.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Character development, isn't that what the first book was for?\r\n\r\nI wish Rowling would bring back Dobby.",
      "created_at": "2007-06-29T23:38:23.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "<blockquote><cite>Posted By: Master RJ</cite>Character development, isn't that what the first book was for?</blockquote> Hahahahahaha! God, that's good!",
      "created_at": "2007-06-29T23:57:16.000Z"
    },
    {
      "author": "Megster",
      "body": "wait...rj reads?  \r\n\r\nrj... come on.  have you actually read the books or was your previous rant about the movie not being true to whichever book just based on what the reviewers said?",
      "created_at": "2007-06-30T00:24:33.000Z"
    },
    {
      "author": "Master RJ",
      "body": "I read the first three and parts of four.",
      "created_at": "2007-06-30T00:38:45.000Z"
    },
    {
      "author": "nate",
      "body": "<blockquote><cite>Posted By: Megster</cite>have you actually read the books or was your previous rant about the movie not being true to whichever book just based on what the reviewers said?</blockquote>yeah I think it's that<img src=\"http://support.worldpay.com/examples/example_4/images/up_arrow.jpg\" alt=\"that\" />",
      "created_at": "2007-06-30T00:40:14.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Snazzy arrow, show-off.",
      "created_at": "2007-06-30T01:07:18.000Z"
    },
    {
      "author": "nicole",
      "body": "No, book one is exposition. Sets the whole scene. We're talking 7 books here. That's like, 2800 pages. These things take time. By book 3, they're 13...angst-ridden teenagers, which Cauron does an excellent job depicting in the film. Harry's all \"Why am I the one who's being targeted by Voldemort? I just want to make out with <strike>horses</strike> girls...\" and Hermione's like, \"Shut up Ron, I have no time for middle school boys, but secretly I have a crush on you and since you rebuffed me, I'm just going to wrap myself in my studies and time travel...\" By book Four, we get the climatic meet-up with a life-sized Voldemort, and by seven, it's going to all come together.\r\n\r\nWoohooooooo!",
      "created_at": "2007-06-30T02:08:13.000Z"
    },
    {
      "author": "nate",
      "body": "it's going to all come together as in hermione and ron are gonna get it <em>on</em>.",
      "created_at": "2007-06-30T02:16:53.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Was that a subtle Zoo plug in there, Nicole? \r\n\r\nNo wait, since when is making out with horses subtle?",
      "created_at": "2007-06-30T03:23:35.000Z"
    },
    {
      "author": "nicole",
      "body": "It's an <a href=\"http://www.equustheplay.com/pr/index.php\">Equus</a> plug, actually.",
      "created_at": "2007-06-30T03:28:06.000Z"
    },
    {
      "author": "Steve Richards",
      "body": "Dobby is J.K. Rowling's Jar Jar.  Seriously, he's worse than that stupid oaf Hagrid.  Come on, Master.  And yes, Ron and Hermione are going to do it.  Covered by the invisiblity cloak.  With Harry in the room.",
      "created_at": "2007-06-30T21:16:18.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "<blockquote><cite>Posted By: nicole</cite>It's an<a href=\"http://www.equustheplay.com/pr/index.php\">Equus</a>plug, actually.</blockquote> Oh, yeah. Yeahhhh, egh.",
      "created_at": "2007-07-01T00:04:44.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Dobby's more like R2-D2. Alfonso Cuaron was Rowling's Jar Jar.",
      "created_at": "2007-07-01T02:30:50.000Z"
    },
    {
      "author": "dan",
      "body": "<blockquote><cite>Posted By: Master RJ</cite>Dobby's more like R2-D2. Alfonso Cuaron was Rowling's Jar Jar.</blockquote>\r\nThat makes zero sense.",
      "created_at": "2007-07-01T03:08:46.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Alfonso Cuaron tried to ruin the franchise by taking many people's favorite installment and hacking it to pieces. Most fans I know hated the film version of The Prisoner Of Azkaban.",
      "created_at": "2007-07-01T04:59:23.000Z"
    },
    {
      "author": "Steve Richards",
      "body": "He TRIED to ruin the franchise.  You choice of words seems to imply Cuaron intentionally made a terrible movie.   Also, how could he ruin a franchise that Chris Columbus had been directing up to that point?  I have never talked to a Harry Potter fan who prefers either of the first two to Azkaban. \r\n\r\nAlso, how is Dobby like R2-D2 other than height?",
      "created_at": "2007-07-01T05:46:37.000Z"
    },
    {
      "author": "nate",
      "body": "People.  Seriously.  Use your /ignore function.",
      "created_at": "2007-07-01T05:53:08.000Z"
    },
    {
      "author": "nicole",
      "body": "But it's just too hard!",
      "created_at": "2007-07-01T06:30:22.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Harry Potter films are kids' movies aimed towards fans of the Harry Potter series. Cuaron ruined the Harry Potter series by taking out everything that makes a Harry Potter film, magic and Qudditch. Only when Mike Newell came in did it become good again.\r\n\r\nAnd now I'm afraid David Yates is going to ruin the series again.",
      "created_at": "2007-07-01T06:41:19.000Z"
    },
    {
      "author": "nate",
      "body": "/ignore off.\r\n\r\nI'll take a pass on your ludicrous rambling opinions, and instead make a simple observation about wording:  If you say somebody or something \"<em>ruined </em>the series,\" RJ, you can't then say that it was made right in the very next movie.  That's not what it means when you say a series was ruined.  When something's <em>ruined </em>it doesn't keep bouncing back and forth.  It's just kind of fucked.  That's what it means to be ruined.\r\n\r\n/ignore on.",
      "created_at": "2007-07-01T08:43:07.000Z"
    },
    {
      "author": "Master RJ",
      "body": "In short:\r\n\r\nPrisoner Of Azkaban: loved the book, hated the film\r\nThe Goblet Of Fire: hated the book, loved the film\r\n\r\nI was just mad they cut or rearranged my favorite parts from the book and turned it into boring slop. Nowadays, every time a big film adaptation opens, I watch the film first so I can show an interest in the book and possibly not be disappointed in the film.\r\n\r\nI wonder the majority of critics ever read The Prisoner Of Azkaban?",
      "created_at": "2007-07-01T09:03:36.000Z"
    },
    {
      "author": "Steve Richards",
      "body": "I want to point out that The Master \"hated\" Goblet of Fire the book, despite above stated that he had only read \"parts\" of it.  \r\n\r\nAnd how can you love one Potter book and hate another?  There is little difference among them.",
      "created_at": "2007-07-01T09:48:29.000Z"
    },
    {
      "author": "Master RJ",
      "body": "The Goblet Of Fire was about 1,000 pages. I attempted twice to read the whole thing, but was so bored with it, I stopped in the middle both times.\r\n\r\nNow, if it were Stephen King writing those 1,000 pages (some of his books run 1,000 pages), I would have loved it.",
      "created_at": "2007-07-01T09:57:14.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "<blockquote><cite>Posted By: nate</cite>People. Seriously. Use your /ignore function.</blockquote> You of all people, having more rants against RJ than even me I believe, know it can get pretty rough out there. Sometimes, ya gotta speak up. But it is USELESS. Totally, utterly worthless.\r\n\r\nAnd alas, I still have this to say: RJ, you are the most linear-minded fellow I have ever met. You're so literal and rigid that it strikes me as a very odd fact that you're human. I think instead you may be a robot made from Jay Leno humor, an abrasive sandpaper-like substance, and countless movie-themed books collected from various garage sales.",
      "created_at": "2007-07-01T13:04:30.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "<blockquote><cite>Posted By: dan</cite>AND some of the filmmakers, who happen to be SMSU alumni,</blockquote>so ive never heard exaclty who is going to be at landers.. nor what part they played in the making of the film... \r\n\r\nsomeone should list this information for my reading pleasure",
      "created_at": "2007-07-01T15:14:54.000Z"
    },
    {
      "author": "nicole",
      "body": "David Gonzales, executive producer\r\nChris Mass, actor and writer",
      "created_at": "2007-07-02T00:07:36.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Could we be seeing James Gunn or George Hickenlooper anytime soon? (both Missourians)",
      "created_at": "2007-07-02T02:24:16.000Z"
    },
    {
      "author": "HonkeyHero",
      "body": "Just a heads up from a cracker that has not read any of the books, but loves the movies: <strong>Prisoner Of Azkaban is the best Potter movie to date, hands down... It's a fact!! </strong>\r\n\r\nThey go in order from best to good: 3, 4, 2, 1",
      "created_at": "2007-07-03T19:26:29.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
