{
  "id": 50,
  "title": "Going down...",
  "body": "... to Springfield! What were you thinking? Geez. Seriously though, Nicole, Bogey, and I are high-tailing it down to Springfield today after work. I was originally hoping to cram in as many theater-related meetings as possible while we there, but I forgot that this was national \"leave Springfield\" weekend. Andrew and Doug, the building owners, are both out of town, and so is Tyler, the architect. We are, however, still meeting with Juli, the interior designer, for an hour or two on Sunday, and Aaron, the logo designer, to talk about future collaborations (i.e. posters, shirts, guerilla marketing, etc.). Not much else to report.\r\n\r\nI'll try to take a picture of the world's largest fork while I'm in town... and a picture of the theater building too. Of course, getting a picture of the fork has precident over one of the building. Well, that's about it... oh wait, one more thing.\r\n\r\nNicole has finally jumped on the blogging bandwagon and started her <a href=\"http://tapioca.urlblue.com\" target=\"_blank\" class=\"broken\">very own blog</a>, and so has her <a href=\"http://thoughts.urlblue.com\" target=\"_blank\" class=\"broken\">twin sister</a>. Soon, my entire family will have each started their own blog and the blogging community will be overtaken by my ilk. That is, if we can beat <a href=\"http://ignatz.brinkster.net/writing/retailblog.html\" target=\"_blank\">Tim</a> and his <a href=\"http://ignatz.brinkster.net/writing/foxymama.html\" target=\"_blank\">mom</a>... or <a href=\"http://jglow.blogspot.com\" target=\"_blank\" class=\"broken\">Justin</a> and his brother... or any of you other family bloggers. Family blogging unification is futile, you will be... not... something... something!\r\n\r\nNot... making... sense... must... stop... writing...",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-08-21T09:00:54.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "No shout out for me? Well, I guess I'm not family.",
      "created_at": "2004-08-20T21:23:21.000Z"
    },
    {
      "author": "bjork24",
      "body": "On the contrary. Read the post again, my non-related friend.",
      "created_at": "2004-08-20T22:03:41.000Z"
    },
    {
      "author": "justin",
      "body": "You're swell.",
      "created_at": "2004-08-20T22:24:17.000Z"
    },
    {
      "author": "bjork24",
      "body": "I know. The doctor told me to keep ice on it to reduce swelling. Maybe I should heed his words.",
      "created_at": "2004-08-20T22:32:45.000Z"
    },
    {
      "author": "thefoxymama",
      "body": "Yeah, but did they sleep with gymnasts?",
      "created_at": "2004-08-21T02:07:22.000Z"
    },
    {
      "author": "Oz",
      "body": "Nicole is a twin?  The Bread Winner is a twin.  Let's admit, when you're married to a twin, you always have to wonder.....",
      "created_at": "2004-08-21T06:38:23.000Z"
    },
    {
      "author": "Fyse",
      "body": "Looking forward to the giant fork. Have you ever been to Australia? They're obsessed with 'The worlds largest blankety-blank'. I've got photos of the worlds largest lobster, pineapple, rocking-horse, ned-kelly statue....\r\n\r\nI didn't figure out how to get posts by email, so looks like I'll have a lot to catch up on when I return. A month without Cinema 24! How will I cope?!",
      "created_at": "2004-08-21T16:13:55.000Z"
    },
    {
      "author": "Chuck",
      "body": "Dan, I've decided to mass produce my own line of Moxie t-shirts and pull the rug right out from under you. Bwa ha ha! First the Moxie Theatre, then the world!",
      "created_at": "2004-08-22T16:39:34.000Z"
    },
    {
      "author": "anon",
      "body": "Hey, check this out:\r\n\r\n\r\n<a href=\"http://www.boingboing.net/2004/08/22/movie_theater_repurp.html\" target=\"_blank\">link</a>\r\n\r\nXboxing in movie theaters.",
      "created_at": "2004-08-22T18:52:09.000Z"
    },
    {
      "author": "Tim",
      "body": "Yowsa, a front page mention on the Moxieblog.  How cool is that?  You're like, cool or something.  The rest of just wish we could code our blogs like you, techno-man!",
      "created_at": "2004-08-22T22:33:22.000Z"
    },
    {
      "author": "einahpets",
      "body": "As the twin sister, to answer that twin question, yes, you have to wonder...",
      "created_at": "2004-08-23T16:56:01.000Z"
    },
    {
      "author": "bjork24",
      "body": "Excellent link about the video game tourney, Anon. We were actually looking into doing something similar... hmm, I think I found a topic for today's post!",
      "created_at": "2004-08-23T22:11:05.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    }
  ]
}
