{
  "id": 500,
  "title": "CHALK another one up",
  "body": "<img src=\"http://moxie.danchilton.com/pix/grum/071007/movie-ranks.jpg\" width=\"425\" /><br/><br/>Ladies and gentlemen, we have a new Moxie record holder. After a two week run, CHALK has replaced AQUA TEEN HUNGER FORCE as our new #1 movie. The easiest way I've found to compare movies to each other is by tallying the Average People Per Show (APPS). Using this metric, I can compare a movie that only showed for one week against one that showed for five or more.<br/><br/>After AQUA TEEN, we thought it would be quite a while before we had a new all-time leader, but less than a month later CHALK has proven us wrong. What's even more crazy is that the 59 APPS only factors the screenings we had here at The Moxie. If you add in the attendance from our screening at The Landers, CHALK's APPS jumps to 77! That's more people than our theater will even hold!<br/><br/>The reason I included PAN'S LABYRINTH way down at #4 is because it still holds the record for the most shows, most tickets sold, biggest box office, and longest run (five weeks). When you show a movie as many times as we did PAN'S, and you <i>still</i> end up with an APPS that high... well, that's just damn impressive.<br/><br/>I hate to see CHALK go, but such is the ebb and flow of the single-screen calendar house. It's always depressing when you bid farewell to a movie that does huge amounts of business. ONCE is holding its own, which is good, but it's no CHALK. I wonder what the next #1 movie will be? We used to think nothing would top AN INCONVENIENT TRUTH, and yet nine months later here comes AQUA TEEN, and then CHALK. It's hard to imagine a movie being able to fill over 3/4 of our auditorium for every single show, but anything's possible. Anything you set your mind to can be achieved. Anything at all.<br/><br/>And now I'm off to the bathroom.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-07-11T07:19:01.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nate",
      "body": "I like the subtle reflections.",
      "created_at": "2007-07-11T07:30:46.000Z"
    },
    {
      "author": "dan",
      "body": "The reflections are Apple-tastic!",
      "created_at": "2007-07-11T07:34:42.000Z"
    },
    {
      "author": "Master RJ",
      "body": "I hate the fact that I might get into trouble by mentioning how much I hated Chalk.",
      "created_at": "2007-07-11T08:23:30.000Z"
    },
    {
      "author": "nate",
      "body": "RJ, it's not the fact that you hated it.  It's when, where, and how you choose to express that hate.  When I showed up a few minutes late to the Landers screening, you were in the lobby by the box office, loudly proclaiming that it was \"the worst thing you'd ever seen.  The <em>worst!\"</em><br/>I think you were asking for your money back, though I'm not certain.  Please note that this was only 5-10 minutes into the film, not the ideal length of time to adequately gauge whether something is, in fact, the worst thing you have ever seen.  Also?  There were a couple people standing around, looking at you oddly, whom I fear might have been the filmmakers themselves, or at least their family members.  You, of course, were oblivious to their presence, as you are oblivious to many things.<br/>I tried to bring you down gently, saying something like, \"Now, now RJ, it couldn't have been that bad,\" with a sort of nervous chuckle and look towards the box office people, and using some sort of moxie forum-ish camaraderie to bring you back into the fold and perhaps the auditorium, but you only got louder... and I gave up after about 5 seconds.",
      "created_at": "2007-07-11T08:47:17.000Z"
    },
    {
      "author": "Ian",
      "body": "Nate's Five Seconds is his trademark.  You fail that, buster, you fail Nate.",
      "created_at": "2007-07-11T09:34:41.000Z"
    },
    {
      "author": "Master RJ",
      "body": "When I direct and show films in special venues, I'd let people get refunds for the first thirty minutes and then halfway through, I'd create an effect when it looks like I hung myself from disappointment of people, people start freaking out, the film stops, people realize it's only a dummy and I appear shouting, \"You fuckers! You thought I killed myself from the people walking out early on! You fools! Continue the show!\" and give the audience the finger. I hope to make premieres like midnight performance shows.<br/><br/>And for festival shows, a special insert based from the most graphic scenes of \"Faces Of Death\" appears, with a caption showing, \"The lucky ones walked out. Get ready to enter Hell for the next (insert number here) minutes.\"",
      "created_at": "2007-07-11T09:55:25.000Z"
    },
    {
      "author": "nate",
      "body": "^ obliviousness ^",
      "created_at": "2007-07-11T09:57:41.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "GEEZ, RJ! WRITE A BOOK!",
      "created_at": "2007-07-11T11:02:46.000Z"
    },
    {
      "author": "Becca",
      "body": "RJ!  If you hated the damn movie so much why did you feel compelled to see it TWICE?  That's right buster, you didn't see me at the moxie when you went to the 9 pm showing on Tuesday, July 3rd because you have NO IDEA WHO I AM but I saw you.  And your mommy.<br/><br/>::evil laugh::<br/><br/>This is the single greatest post I've ever written.",
      "created_at": "2007-07-11T13:14:23.000Z"
    },
    {
      "author": "Master RJ",
      "body": "I saw The Valet that night.",
      "created_at": "2007-07-11T13:23:16.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "rj.. if you ever get banned form the moxie for good...<br/>there will be many many reasons.. as to why it happened<br/>i know youll never ever understand those reasons<br/>but let me assure you that they will be completely valid<br/><br/>anyway.. kudos to CHALK and its excellent run",
      "created_at": "2007-07-11T13:53:24.000Z"
    },
    {
      "author": "Ian",
      "body": "Yeah, I liked it.",
      "created_at": "2007-07-11T17:22:17.000Z"
    },
    {
      "author": "justin",
      "body": "People should never ask a theater for their money back, unless there has been some sort of glitch that's kept them from actually watching the movie.  It's not like the theater made the movie or anything, they're just doing you a favor by showing it.  The purpose of <em>going to see a movie</em> is to either enjoy it, or not.  It's entertainment.  There are no do-overs; you either like it and are happy, or you don't like it and move on to the next one.  All of this can be done without marching through a lobby and letting anyone within an earshot know how much you thought a particular film sucked.  <br/><br/>Chances are they don't care.  Really.<br/><br/>When you go to a restaurant, you may complain to the waiter that your steak isn't well-done like you ordered, but you'd be wrong to assume that it is, in fact, his fault, and not the fault of the person who actually prepared the food.  The waiter just delivers the item to you.  Do they deserve the barrage of complaints?  Of course not.  Do the other patrons of the restaurant deserve the barrage of complaints?  No.  By voicing your opinion to anyone who will pretend to not be listening, you come off looking like a  starved-for-attention ass.  <br/><br/>Think about it.  Which sounds better? <br/><br/>\"Hello, waiter sir, but I believe my steak is a little under-cooked.  Would it be a problem to cook it a bit longer?  Thanks.\" <br/>-- or -- <br/>\"WHAT THE FUCK, DUDE.  THIS FUCKING STEAK, MAN. UN-DER-COOKED.  WHAT KIND OF FUCKING WAITER ARE YOU?  THIS RESTAURANT IS A REAL PIECE OF SHIT. I WANT MY MONEY BACK.\"<br/><br/>Now let's bring it back full-circle, and apply it to theaters. Which sounds better?<br/><br/>(To friends) \"Man, that movie sucked.  Here's why...\"<br/>-- or --<br/>(To anyone within an earshot) \"WHAT THE FUCK. THAT WORST MOVIE EVER EVEN THOUGH I ONLY WATCHED 5 MINUTES OF IT.  TRUST ME, I KNOW WHAT I'M TALKING ABOUT HERE.  YOU KNOW HOW MANY MOVIES I'VE SEEN? A LOT.  TRUST ME. PSSH.\"<br/><br/>This was directed at no one in particular.",
      "created_at": "2007-07-11T21:24:41.000Z"
    },
    {
      "author": "nate",
      "body": "man what's gotten into Justin lately?  He's like, all opened up and crap.",
      "created_at": "2007-07-11T21:44:29.000Z"
    },
    {
      "author": "Becca",
      "body": "<blockquote><cite>Posted By: nate</cite>man what's gotten into Justin lately? He's like, all opened up and crap.</blockquote><br/><br/>I was about to say the exact same thing.  Well, almost.",
      "created_at": "2007-07-11T21:52:24.000Z"
    },
    {
      "author": "Steve Richards",
      "body": "When I worked at the Campbell 16, we had a rule that customers could get their money back until 30 minutes into the film; however, when THE DEEP END came out they made an exception because there was a homosexual sex scene more than 30 minutes after the start time.  Eventually, the box office cashiers started warning ticket buyers about the possibly offensive content in advance.  True story.",
      "created_at": "2007-07-11T22:20:57.000Z"
    },
    {
      "author": "dan",
      "body": "So that's why they called it THE DEEP END.",
      "created_at": "2007-07-11T22:25:37.000Z"
    },
    {
      "author": "nate",
      "body": "Ba dum bum.",
      "created_at": "2007-07-11T22:45:55.000Z"
    },
    {
      "author": "justin",
      "body": "I know. Look at me! Two big posts in a row!",
      "created_at": "2007-07-11T23:17:12.000Z"
    },
    {
      "author": "drm00se",
      "body": "<blockquote><cite>Posted By: Master RJ</cite>I saw The Valet that night.</blockquote><br/><br/>Yeah, that was when I tried to be nice to you in an attempt to make it so not everyone on these forums hates you, but you sure did a good job of shooting that down, didn't you? Oh well.",
      "created_at": "2007-07-12T01:24:16.000Z"
    },
    {
      "author": "Master RJ",
      "body": "I didn't even know who the hell you were! I thought you were a stranger out to kidnap me! My mother could have came in and asked me why I was talking to a stranger. I'm sorry.",
      "created_at": "2007-07-12T01:27:13.000Z"
    },
    {
      "author": "Megster",
      "body": "back to the beginning of this thread, wow that is really impressive... i'm glad... i am happy when anything does really well for our dear darling moxie and its lovely owners...but it is especially nice (for some reason) when it is a film i so thoroughly enjoyed... congrats to chalk for its new reigning status and to dan and nicole for another (moxie-sized) blockbuster!",
      "created_at": "2007-07-12T01:43:33.000Z"
    },
    {
      "author": "evilvet",
      "body": "The fact that this movie did so well during summer when there are fewer students, there are more things to do, and in a Cardinal crazy town makes this a grand achievement.<br/><br/>As I enter the moxiecinema.com website and  am directed to the homepage, the site is strategically designed so that a customer or potential customer is treated to a description of the movie that is playing, as well as a very clever and informational blog penned by the proprietors of The Moxie Cinema.  It is a marketing strategy for interested people to learn about the film being shown, and something about the personality of the owners and their theatre.  I think it is hugely disrespectful to The Moxie, Dan and Nicole, and potential paying customers that comments made on the owner's blog contain profanity or any other language that may dissuade interested persons from learning more about this outstanding business.    <br/><br/>I apologize if I am speaking out of turn or hurt feelings, but I know that they work incredibly hard and value every filmgoer who visits their theatre and this portion of their website.  They are very dedicated business people in a very serious business.  I care about what the Chiltons are trying to pull off.  Realizing that there is also a very vast and popular forum where people can fully exercise their free speech as freely as free speech can possibly meander, I think Dan and Nicole's much more accessible and much more mainstream <strong>blog portion </strong>should aspire to a higher standard  when comments are made.  In other words, if it is offensive to throw f-bomb laden tirades in the entryway of a theatre, it is probably equally offensive to do so at the entryway of a website.  Again, congrats.",
      "created_at": "2007-07-12T02:28:17.000Z"
    },
    {
      "author": "Becca",
      "body": "Firstly, mockumentary style movies are pretty hit and miss in my book but I thought CHALK was just ridiculously funny.  The spelling bee part was classic.  I really enjoyed it and I think it's awesome that the moxie (my absolute fav. movie theatre/popcorn vendor/hip hangout) had such great success with it.  <br/><br/>Secondly, I guess I sort of agree with evilvet though I think that's what the forum disclaimer is for.  I try to keep my language pretty PG on the forums in general mostly because I think that online words can be very easily misconstrued.  I can understand and am unoffended by most forumers word choices because a lot of us do know each other \"IRL\" and already have a rapport established.  <br/>I do think that we should maybe keep our more personal rants, tirades, jokes, and language choices on boards outside the blog or movie review categories, as these are the threads most likely to be viewed by guests.<br/><br/>Wait, I can't agree with my parents... I'm still a teenager for like...2 and a half more months!  Rebellion!  <br/><br/>Right, anyway...<br/><br/>This is the single greatest post I have ever written.  (Dan, can you enable signatures on the forum?)",
      "created_at": "2007-07-12T03:14:54.000Z"
    },
    {
      "author": "nicole",
      "body": "<blockquote><cite>Posted By: evilvet</cite>I think Dan and Nicole's much more accessible and much more mainstream<strong>blog portion</strong>should aspire to a higher standard  when comments are made.</blockquote><br/><br/>What did I say, kids? What did I say? I think I said, keep it clean on the blog posts.<br/><br/>Thanks.",
      "created_at": "2007-07-12T03:27:51.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "good point... perhaps some of you should at least edit with F*#@^$!  or some such thing",
      "created_at": "2007-07-12T03:33:55.000Z"
    },
    {
      "author": "Ian",
      "body": "Hey, guys, tonight we're having a f*&% fry down at my apartment!  Come on down for some fried catf*$#.<br/><br/>(ps i'm lying)",
      "created_at": "2007-07-12T05:20:05.000Z"
    },
    {
      "author": "drm00se",
      "body": "Firstly, RJ... Dude, I work at the Moxie. You've been there when I was working on more than one occasion and seen me standing back there. I've sold you stuff, man. That you seem to think you've never seen me before really hurts my feelings. Gosh, you really know how to make a girl feel special, don't you? *Hmph!*<br/><br/>Secondly, I like that someone made an attempt to stand up for the moral fiber (fibre?... yeah, let's go with that one) or whatever around here, and I like even more that they're being supported. I've had my difficulties with keeping my words PG (PC?... yeah, let's go with that one) in the past, and I've had to learn some discretion-type stuff the hard way, so I can understand why some people get riled up and can't hold back and still others ( I'll <b><i>R</b></i>efrain from naming <b><i>J</b></i>ust one person) are simply clueless about the very concept of tact. Still, I'm glad there are still some voices out there who speak for restraint. Bravo!",
      "created_at": "2007-07-12T07:29:53.000Z"
    },
    {
      "author": "Master RJ",
      "body": "You do? I thought that was Justin.",
      "created_at": "2007-07-12T08:00:11.000Z"
    },
    {
      "author": "nate",
      "body": "I'm going to point out that Dan told a dirty joke on this thread.",
      "created_at": "2007-07-12T10:00:12.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "<strong>P</strong>0wn3nd",
      "created_at": "2007-07-12T12:51:54.000Z"
    },
    {
      "author": "evilvet",
      "body": "Get a haircut, Nate!<br/><br/>There ain't no moral fiber here, it's just business.  And since The Moxie Cinema was recently chosen as a finalist as Best Entrepreneur for Springfield Business Journal’s 2007 Economic Impact Awards, I trust they know what they're doing.  I don't think it would take a high priced consultant to tell them what we already know.  That the movie review posts and the front page blogs penned by the owner reach and are designed to reach a different audience than those found in the forum section.  The point of Dan's above blog entry is that this was a record month for The Moxie.  I don't think that Chalk is necessarily a better movie than An Inconvenient Truth or Pan's Labyrinth.  I believe it is because The Moxie is succeeding in reaching a wider audience, and their business plan is succeeding.  That growth will continue, and I wager the growth will be faster if the posts for the <strong>front page owner blog </strong>and <strong>movie reviews </strong>are a smidge more enlightened and educational, and reserve the free form  stuff for the forum.  Their loyal community can encourage or not encourage this to happen. <em>\" Anything you set your mind to can be achieved. Anything at all.\"</em>",
      "created_at": "2007-07-12T18:09:17.000Z"
    },
    {
      "author": "nate",
      "body": "\"With great power comes great responsibility.\"<br/><br/>\"Even the smallest person can change the world.\"<br/><br/><br/>\"Whoever wins - we lose.\"",
      "created_at": "2007-07-12T19:05:15.000Z"
    },
    {
      "author": "justin",
      "body": "I think the Moxie should stop playing movies with curse words in them too.  You know, just in case it offends someone.",
      "created_at": "2007-07-12T19:07:33.000Z"
    },
    {
      "author": "risk2",
      "body": "Before I saw the movie last day last show, I was skeptical on how this movie was doing so good and then 85 mins and a bizzare popcorn packet with wayyyyy too many flavorings later, I had figured out what I was missing out on.<br/>Personally being a graduate assistant I understand what teachers have to go thru in the classroom, especially when ur close to their age there is a lack of respect.",
      "created_at": "2007-07-12T19:30:43.000Z"
    },
    {
      "author": "nicole",
      "body": "I loved it. I think a huge portion of its success stems from the local connections and relevance to all the teachers in town (how many are there? 3 billion probably?). Plus it's a cute, light-hearted film.<br/><br/>Oh, and Evil Vet - you can totally hang out with me all the time and be my personal self-esteem builder! Thanks for all the nice things you said!",
      "created_at": "2007-07-12T20:19:21.000Z"
    },
    {
      "author": "mscottart",
      "body": "<del>I thought CHALK was great.  One of my favorite films of all time (DROP DEAD GORGEOUS) is a mockumentary.  I find some mockumentaries annoying but this one I enjoyed.  I am so glad to hear it was successful.  <br/><br/>I am looking forward to everything that is listed on the calendar right now.  Some more than others, but either way I plan on being down there at least once a week.  LOL<br/><br/>One side note:  Dan I want to see more MOXIE TVs  PPPLLEEAASSEEEEE",
      "created_at": "2007-07-12T23:24:47.000Z"
    },
    {
      "author": "mscottart",
      "body": "<del>I thought CHALK was great.  One of my favorite films of all time (DROP DEAD GORGEOUS) is a mockumentary.  I find some mockumentaries annoying but this one I enjoyed.  I am so glad to hear it was successful.  <br/><br/>I am looking forward to everything that is listed on the calendar right now.  Some more than others, but either way I plan on being down there at least once a week.  LOL<br/><br/>One side note:  Dan I want to see more MOXIE TVs  PPPLLEEAASSEEEEE</del></del>",
      "created_at": "2007-07-12T23:26:05.000Z"
    },
    {
      "author": "mscottart",
      "body": "I thought CHALK was great.  One of my favorite films of all time (DROP DEAD GORGEOUS) is a mockumentary.  I find some mockumentaries annoying but this one I enjoyed.  I am so glad to hear it was successful.  <br/><br/>I am looking forward to everything that is listed on the calendar right now.  Some more than others, but either way I plan on being down there at least once a week.  LOL<br/><br/>One side note:  Dan I want to see more MOXIE TVs  PPPLLEEAASSEEEEE",
      "created_at": "2007-07-12T23:26:15.000Z"
    },
    {
      "author": "mscottart",
      "body": "I am so embarassed.  I didn't mean to post that 3 times.  I am on someone else's computer and I screwed up.  Now I can't find a place to delete 2 of them.  I suck.  LOL  <br/>HELP!",
      "created_at": "2007-07-12T23:33:42.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "yeah... there isnt really a button for deleting<br/>though you can 'edit' them.... hmm.. but what to edit them to say? so many choices",
      "created_at": "2007-07-12T23:45:41.000Z"
    },
    {
      "author": "Master RJ",
      "body": "<blockquote><cite>Posted By: justin</cite>I think the Moxie should stop playing movies with curse words in them too. You know, just in case it offends someone.</blockquote><br/><br/>Play more films with curse words! And more grindhouse films!",
      "created_at": "2007-07-13T00:38:21.000Z"
    },
    {
      "author": "drm00se",
      "body": "<blockquote><cite>Posted By: evilvet</cite>There ain't no moral fiber here, it's just business.</em></blockquote><br/><br/>That's why I said \"...or whatever.\"",
      "created_at": "2007-07-13T01:05:50.000Z"
    },
    {
      "author": "ariananana",
      "body": "yay!",
      "created_at": "2007-07-13T08:34:11.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
