{
  "id": 501,
  "title": "Attention all Civil War buffs!!!",
  "body": "Anyone who knows anything about the Civil War knows that one of the largest and most significant battles to be fought West of the Mississippi happened in our own backyard, near Wilson's Creek. This August marks the 146th anniversary of the battle, and to mark the occasion, Wide Awake Films, an Emmy award-winning documentary group out of Kansas City, will be converging on the battlefield to film a new documentary about the battle of Wilson's Creek.\r\n\r\nWe're happy to be joining forces with Wilson's Creek Battlefield to bring you not one, not two, but three FREE Civil War documentaries!\r\n\r\n<b>Sunday July 22 at noon, @ Moxie Cinema</b>\r\n\r\n<i>Spotsylvania Courthouse</i> – A stunningly beautiful documentary about the violent clash between General Ulysses S. Grant and Robert E. Lee at the crossroads of Spotsylvania Courthouse in Virginia. The film is 45 minutes. Following the documentary, Robert Pollard from Wilson's Creek National Battlefield will be on hand for a Q&A.\r\n\r\n<b>Sunday, July 29 at noon, @ Moxie Cinema</b>\r\n\r\n<i>The Battle of Franklin: Five Hours in the Valley of Death</i> – An Emmy award-winning documentary about the fateful campaign to regain control of Tennessee from Federal forces. The film is 65 minutes. Following the documentary, Jeff Patrick from Wilson's Creek National Battlefield will be on hand for a Q&A.\r\n\r\n<b>Saturday, August 4 at 8:00 pm, @ Wilson's Creek Battlefield Visitor Center</b>\r\n\r\n<i>Bad Blood</i> – The newest film from Wide Awake Films, which focuses on the border wars between Kansas and Missouri that sparked the Civil War. Guest speaker Dr. Bill Piston from the Missouri State University Department of History will host a presentation after the film. 90 minutes.\r\n\r\n<b>Sunday, August 5 at 2:00 pm, @ Moxie Cinema</b>\r\n\r\n<i>Bad Blood</i> – The newest film from Wide Awake Films, which focuses on the border wars between Kansas and Missouri that sparked the Civil War. Guest speaker Dr. Bill Piston from the Missouri State University Department of History will host a presentation after the film. 90 minutes.\r\n\r\nAnd that's not all! If you'd like to see the filming of the Wilson's Creek battle for their newest documentary, feel free to swing by the battlefield on August 9 through 12th. As stated earlier, all film screenings will be FREE, so make sure to swing by and catch a great educational flick.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-07-19T07:31:03.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Ole",
      "body": "<a href=\"http://www.nps.gov/wicr/\">Wilson's Creek National Battlefield</a>",
      "created_at": "2007-07-19T19:00:17.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
