{
  "id": 502,
  "title": "Rough clip from the upcoming Moxie documentary",
  "body": "Remember when I mentioned the documentary that was being made about the Moxie a couple months ago? No? <a href=\"/posts/499\">Click here</a> and read the second paragraph. Anyway, David just sent me a very rough cut of the first few minutes of the film. I asked him if it would be okay to post it on the blog for all to see, and he said it would be... as long as I printed this director's statement:\r\n\r\n<quote>The film's probably going to change a lot as I get further into it, but this is what it looks like so far. It looks kinda crappy and blurry in this compressed format, but believe me, it looks gorgeous in full res! Sound of course has not been mixed, and the title I tried out here looks really cheesy so that's definitely going to change.</quote>\r\n\r\nI also have to mention that the version you see here is a compressed version of a compressed version, but either way, I think you get the idea -- this is not an accurate representation of how awesome and gorgeous the final product will look. We're soooooooooooooo excited for this film (for obvious reasons), and I can't believe how incredible these first few minutes look. If it's any indicator of what the final documentary will look like, which it pretty much is, this may possibly be the greatest movie of ALL TIME.\r\n\r\nEnjoy.\r\n\r\n<object type=\"application/x-shockwave-flash\" width=\"450\" height=\"300\" data=\"http://vimeo.com/moogaloop.swf?clip_id=246446&server=vimeo.com&fullscreen=1\"><param name=\"quality\" value=\"best\" /><param name=\"allowfullscreen\" value=\"true\" /><param name=\"scale\" value=\"showAll\" /><param name=\"movie\" value=\"http://vimeo.com/moogaloop.swf?clip_id=246446&server=vimeo.com&fullscreen=1\" /></object>\r\n\r\nIf the video won't load, you can also see it <a href=\"http://www.vimeo.com/246446\">here</a>.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-07-21T02:15:30.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "El Brian de Moore",
      "body": "ahhhh!!!!!!!!! its not loading!!!  im freaking out here!! looadd i want to seeee!!",
      "created_at": "2007-07-21T02:29:45.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "no seriously.. i have to be at work in 30 minutes.... \r\nsure.. those spinning colors are mesmerizing... but i want to see the video!!",
      "created_at": "2007-07-21T02:33:29.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "hmm.. going <a href=\"http://www.vimeo.com/246446\">here</a> seemed to work much better for me\r\nperhaps it might help others as well",
      "created_at": "2007-07-21T02:42:00.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "and yay!! i saw it.. and it looks awesome.... thats friggin exciting",
      "created_at": "2007-07-21T02:50:08.000Z"
    },
    {
      "author": "dan",
      "body": "Weird. It was working earlier. Either way, I added the link to the actual video on the blog post too.",
      "created_at": "2007-07-21T03:09:03.000Z"
    },
    {
      "author": "nate",
      "body": "That was fantastic.  Dan's never looked manlier, Nicole's never looked prettier, and the Moxie's never been suffused in such gauzy goodness.",
      "created_at": "2007-07-21T03:17:24.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Excellent. In the Bill and Ted tone.",
      "created_at": "2007-07-21T04:27:44.000Z"
    },
    {
      "author": "brad",
      "body": "nice! i hope we get the five minute section of dan and i waxing intellectual on the merits of taco bell in there somewhere..\r\n\r\nlooks amazing, as expected.",
      "created_at": "2007-07-21T15:08:53.000Z"
    },
    {
      "author": "Master RJ",
      "body": "I was offered a chance to be in this when they where filming on May 18th, in which they would have asked me about \"Inland Empire\". I turned it down, because I didn't know what to say. The director kind of looked like Howie Mandel.",
      "created_at": "2007-07-21T16:20:49.000Z"
    },
    {
      "author": "HonkeyHero",
      "body": "COOL!  The HVX is an amazing cam and I know those were scaled down a bit for compression, but the HD image with the HVX is going to be beautiful.  Dan will be projected in all of his perfect Billings skin Glory.  But seriously, that guy shot some sweet images and this will be a lot of fun.  Too bad there wasn't someone to document all the butterbeer sales / riot bonanza.  Cassie and I had a blast watching all the people.",
      "created_at": "2007-07-21T18:09:38.000Z"
    },
    {
      "author": "erin",
      "body": "it looks absolutly amazing.\r\ni cant wait to see it at the moxie....?\r\ndavid lowry film fest?!\r\namazing stuff.",
      "created_at": "2007-07-22T05:43:25.000Z"
    },
    {
      "author": "sherbomb",
      "body": "that really does look pretty friggin awesome! the one shot of the bus pulling onto the street looks so gorgeous, i'm proud to live here in springmeadow.",
      "created_at": "2007-07-22T13:36:48.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "gomz!?  its erin!\r\n\r\nseriously though.. ive watched that clip like 5 times now... im sooo ready for the final version\r\ni can only assume that it will be premiering here.... ?   i await that day",
      "created_at": "2007-07-22T22:38:03.000Z"
    },
    {
      "author": "tim",
      "body": "yeah, that is really striking imagery, however i think the timing, and pacing is a little over indulgent given the subject matter, this in no way is an insult, and i know its rough, it just seems like the pacing and imagery without other content (V.O, music) makes the topic seem allot heavier then it seems to be. \r\n\r\nalso,\r\n\r\nHOLY CRAP IT'S ERIN!!!!! hi!",
      "created_at": "2007-07-23T00:00:09.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Well said, Tim.",
      "created_at": "2007-07-23T03:50:58.000Z"
    },
    {
      "author": "ariananana",
      "body": "i really liked it. i hope i get to see it.",
      "created_at": "2007-07-23T03:54:40.000Z"
    },
    {
      "author": "Caleb",
      "body": "Looks awesome.",
      "created_at": "2007-07-23T19:08:15.000Z"
    },
    {
      "author": "drm00se",
      "body": "I hope they don't use any of that interview (or other) footage they took of me in my first couple of shifts.",
      "created_at": "2007-07-26T05:43:40.000Z"
    },
    {
      "author": "erin",
      "body": "hi tim.\r\n(whisper. because... you know. i dont want to go all off topic. and of course.... because we cant let anyone know im here.... again.)\r\n: )",
      "created_at": "2007-07-27T05:44:31.000Z"
    },
    {
      "author": "tim",
      "body": "YOU! how are you?! how is school, and art, and the springpatch?! its weird, i don't post much here anymore because it feels different, (if that makes any sense) but it would be nice to hear how you are doing!",
      "created_at": "2007-07-27T07:22:14.000Z"
    },
    {
      "author": "erin",
      "body": "me- good. worn thin. ive taken too much on for the summer. but i am good.\r\nschool- seemingly pointless. im not sure ive learned anything in the past three and a half years. one year left. leaving little time to put together a good portfolio for grad school applications. but hopefully enough time for a good senior show.\r\nart- havent drawn (for real) in almost a year. but! last night (literally) i figured out what i want to do for my bfa show. so.... things are looking up!\r\nspringpatch- sometimes i fear there is no one in this town that i relate to. not that there are in other towns. or that i would ever meet them. but i need out of here. i find myself starring off into space when im haning out with the people i know. it just doesnt seem i have much to say anymore. everything is always familiar. sometimes i like it,sometimes i hate it. oh. its the the good ol' twenty-something beginnings. yeppie!\r\n\r\nthe above all sounds so depressing, but in all actuality... i am doing well.\r\n\r\nim not going to make it up to chicago this summer. but hopefully over fall break. then again ... i might just take a long weekend here soon. come up on my own. go to the museums. etc.\r\n\r\nhow are YOU tim?\r\n\r\ni still havent seen any of your print stuff. or any of your artwork period. SHOW?!\r\n\r\nwhats your email?",
      "created_at": "2007-07-28T03:45:52.000Z"
    },
    {
      "author": "erin",
      "body": "oh man. that was totally up for everyone to see for a good 5 seconds! scary.",
      "created_at": "2007-07-28T03:47:01.000Z"
    },
    {
      "author": "tim",
      "body": "you! \r\nsorry about the lack of talking back. I don't print that much, i just help run the press, im not really into printing, i do allot more photography and video work, all work that im pretty shy about. I don't care much for the end product, so i don't show it.... so yeah. However, I'll grab some pictures, but i started my own movie theater in my neighborhood. It was part of a big gallery walk here in town, anyway, its a small peephole theater that shows short silent films every week. (soon to be outfitted with mono audio!)\r\n I really love the idea of making 'art' available to people who would not seek it out, im a big fan of the idea of public art, but i tend to despise most public art, and i don't like the exclusiveness or the need to have art in a gallery, so i'm kind of this total hater when it comes to contrivances of the art world. ANYWAY!!! I inagurated my peep hole theater with parts of Guy Maddin's Cowards Bend the Knee, and now im doing a series on the history of film animation 1890-1920; this week is the super adorable Emile Cohl, you should see some of his work.... so goooood!!!! anyway. Yeah, i suck at \"ART\" sorry i can't share something you'd be more into. yeah... im kind of weird about showing stuff, it really sucks when you are your own worst critic. \r\n\r\nsorry if this sounds inhibited... or offensive... \r\n\r\nyeah... anyway, if you or friends are ever in chicago, we have space and a tent to sleep in so feel free to use my place as a hub if you need, you can make that open to all the other nice moxie people.... \r\n\r\nalso, my house just got super crazy, we have this paper here called \"The Reader\" it's pretty much a weekly paper that lists all the crazy chicago stuff for the week, and has a bunch of local news in it, somewhat counter cultural, anyway, My GF got the write up along with our space, and now we have people printing all the time, and taking classes, and its just so nice and crazy... if in town, or have any ideas you should totally come up and use the presses. It's so nice, it's this mix of older neighborhood people, like, soccer moms and old hippie ladies, and then younger hipsters and random 9-5 people who want to make birthday cards, its such a weird dynamic! i love it. Were going to have a show sometime with a bunch of work printed in the space. there is some good stuff. \r\n\r\nALSO! \r\nmine email is: tweidelman@gmail.com \r\n\r\nsorry, im drinking a bunch of coffee... i apologize about the randomness, and lack of coherent structure.\r\n\r\ntake care!",
      "created_at": "2007-08-04T22:35:18.000Z"
    },
    {
      "author": "Duke1974",
      "body": "So, that's how they put the letters on the cinema signs.\r\n\r\nM",
      "created_at": "2007-08-06T03:14:26.000Z"
    },
    {
      "author": "theNord",
      "body": "Greetings -- I was wondering what ever happened to this docu?",
      "created_at": "2007-10-15T23:48:54.000Z"
    },
    {
      "author": "dan",
      "body": "David just finished post production on it, and will be submitting it to SXSW and T/F. He'll be in Springfield in early November, so we'll probably see the finished product then.",
      "created_at": "2007-10-16T00:02:49.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "More, quiero ver mas!\r\n\r\nhi Erin!",
      "created_at": "2007-10-16T23:08:57.000Z"
    },
    {
      "author": "erin",
      "body": "hi jordan...?",
      "created_at": "2007-10-17T03:02:00.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "Looks around Forum . . . the world . . . the world is gone! Oh wait **looks out window** there it is",
      "created_at": "2007-10-17T03:03:08.000Z"
    },
    {
      "author": "Girl #2",
      "body": "what does this mean for the rpg thread???",
      "created_at": "2007-10-17T03:23:30.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "I have no idea...i will start a blog version if I have to...It will not die!!!!",
      "created_at": "2007-10-17T03:28:12.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
