{
  "id": 503,
  "title": "Dan & Nicole: Entrepreneurs of the Year",
  "body": "As some of you may know, last night Nicole and I were named Entrepreneurs of the Year by the Springfield Business Journal. It's a huge honor, and something we've yet to come to grips with. What does this mean for us, our future, and, most importantly, The Moxie? Only time will tell, I suppose, but in the meantime, winning this award has lit a fire under our collective butts, and we're ready to get things rolling again.\r\n\r\nWe're half way through our lease (yes, we rent our building), which means it's high time to start negotiating and firming up where The Moxie is going to be in the next two and a half years. Will we still be in our current location in 2010? I hope so, but you never know. There's a lot going on right now that will have direct consequences for the future of The Moxie. Nothing drastic, of course, but stuff that will determine the shape, size, and location of our business in the years to come.\r\n\r\nAnd, as I've always done, I'll gladly share it with you when the time comes.\r\n\r\nBut, if you'll indulge me, I'd like to talk about last night's awards ceremony. It was held in the White River Room at Bass Pro (near the pontoon boats), and despite what you might assume from the surroundings, it was a very swank ordeal. Over 300 people showed up, which was much more than I had anticipated. Nicole's dad bought an entire table for The Moxie, which sat Nicole and I, my parents, Nicole's dad and his friend, and Justin and Kelley (our two original employees).\r\n\r\nI was expecting more award categories, but there were only six: Lifetime Achievement, Excellence in Banking, Excellence in Architecture, Best Charitable Organization, Innovator of the Year, and, the final category, Entrepreneur of the Year. It was crazy hearing our name mentioned along with all the other winners. When you're working seven days a week, and barely making the salary of a first-year high school teacher, it seems a little odd to have your name associated with banks and architecture firms that are grossing millions and millions of dollars.\r\n\r\nThe biggest surprise, however, was that everyone in the categories before us were giving speeches. I had no idea we'd be doing that, or else I would've prepared something... actually, no I wouldn't, because I hear that's bad luck. When we were called up front to await the name of the winning business, the only thing I was thinking was, \"ok, what kind of face should I make when they call one of these people beside me? I'll smile and nod, give them a congratulatory handshake, and then make a beeline back to our table. That seems like the appropri-- did they just say our name? Uh oh. Think fast! Think fast!\" I really don't remember what I said once I made my way to the podium. I've become accustomed to addressing crowds (I do it two or three times a day, after all), but I was having such a difficult time connecting my thoughts, and not saying \"uh\" or \"um.\"\r\n\r\nIf you're morbidly curious, I've included the audio from my acceptance speech. My dad used his digital camera to video it, but the visuals didn't turn out at all, so this is just the audio. Also, some parts of it are a bit muddled, so I took the liberty of transcribing every single utterance. And if that still doesn't sate your appetite for awards ceremony goodness, I've added a few photos (and captions) after the video.\r\n\r\nThanks again to all of our loyal supporters out there (you know who you are). If we didn't have such great customers, we wouldn't have a business, and if we didn't have a business, we wouldn't have won the award, so in a round-about way, all of you are the root of our success, and for that, I sincerely thank you. All of you. *gets choked up* I'm sorry... it must be the salmon again.\r\n\r\nThanks a million, guys.\r\n\r\n<object width=\"425\" height=\"350\"><param name=\"movie\" value=\"http://www.youtube.com/v/7YmJEeJT6H0\"></param><param name=\"wmode\" value=\"transparent\"></param><embed src=\"http://www.youtube.com/v/7YmJEeJT6H0\" type=\"application/x-shockwave-flash\" wmode=\"transparent\" width=\"425\" height=\"350\"></embed></object>\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/072707/1.jpg\" width=\"425\" />\r\n\r\nDon't we look thrilled? This picture was taken just a few minutes after we won the award. I'm still a bit confused, as you can see.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/072707/2.jpg\" width=\"425\" />\r\n\r\nHere I am sending out a mass text message, letting everyone know we won. Nicole is showing off her cleavage, Justin is being prodded in the butt, and Kelley is just happy to be there.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/072707/3.jpg\" width=\"425\" />\r\n\r\nAnd here's everyone at our table! Nicole is holding our cool glass trophy, which has a couple envelopes stuffed inside. At first glance, it sort of looks like a part of her dress... no, not really.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/072707/4.jpg\" width=\"425\" />\r\n\r\nI'm not sure what's going on in this picture, but I certainly don't look too happy about it. Nicole is though, so that's all that really matters.\r\n\r\nAnd here's some initial coverage from the SBJ: <a href=\"http://sbj.net/article.asp?aID=65611861.5359053.1016886.9263839.9985395.488&aID2=78213\" target=\"_blank\" class=\"broken\">here</a> and <a href=\"http://www.sbj.net/article.asp?aID=78093\" target=\"_blank\" class=\"broken\">here</a>.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-07-28T08:50:52.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Master RJ",
      "body": "Your pictures aren't showing up.",
      "created_at": "2007-07-28T09:07:59.000Z"
    },
    {
      "author": "dan",
      "body": "Try the blog instead of the forum.",
      "created_at": "2007-07-28T09:15:12.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "oh yay!! that was fun!... you kids look great\r\nand at first glance.. i really did think that was part of her dress\r\nsecond glance... i knew better.. and hit myself in the head.. for being so stupid.... STUPID!!!\r\n\r\ner... ahem... anyway great speech... very good for on the fly\r\n\r\ni would have been more \"gomz!?  award?  hi... uh... thatz awesomz... thanks-bye..\"\r\n\r\nlease up!?  oh noz!!  does this mean they might try and charge a lot more this go around... due to 'hey they won an award.. surely they are rich now.. and can pay me much more' ?   that would be <em>un</em>-cool",
      "created_at": "2007-07-28T09:30:22.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "I really did think that the envelopes were part of her dress 'til I read the caption. But then again, I didn't know who Pig Pen was, so y'know... I'm a fool.",
      "created_at": "2007-07-28T09:36:51.000Z"
    },
    {
      "author": "dan",
      "body": "It's actually Pig-Pen. He has a hyphen in there. Show the man some respect!\r\n\r\nAnd let's take your ignorance of important cultural figures to the fastest thread to 100 pages, shall we.",
      "created_at": "2007-07-28T09:39:28.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "You spelled it Pigpen in that thread. No hyphen. \r\n\r\nYeah yeah, I'm leaving.",
      "created_at": "2007-07-28T09:45:14.000Z"
    },
    {
      "author": "nate",
      "body": "Justin shaved and everything.  You all clean up real nice like.",
      "created_at": "2007-07-28T10:20:32.000Z"
    },
    {
      "author": "HonkeyHero",
      "body": "Wow, that is uber awesome... Congrats!  Great on the fly speech as well... Ya clean up well for a Billings Breed....",
      "created_at": "2007-07-28T17:39:29.000Z"
    },
    {
      "author": "evilvet",
      "body": "The energy radiating from out of your cranium on that last photo is just plain freaky, Dan.  It's weird how phenomena like that are imperceptible by the naked eye but somehow show up on film.",
      "created_at": "2007-07-28T17:53:07.000Z"
    },
    {
      "author": "justin",
      "body": "my butt hurts.",
      "created_at": "2007-07-28T20:03:37.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "<blockquote><cite>Posted By: justin</cite>my butt hurts.</blockquote>sounds like i missed one hell of an after party",
      "created_at": "2007-07-28T22:49:43.000Z"
    },
    {
      "author": "drm00se",
      "body": "You said, \"our employees.\" I know I'm new, but I still fall under that category, and you can't take it back! You mentioned me in your speech! Ha! I'm awesome!",
      "created_at": "2007-07-29T00:02:00.000Z"
    },
    {
      "author": "erin",
      "body": "i forgot to say congrats when i saw you two today.\r\ncongrats!",
      "created_at": "2007-07-29T08:46:54.000Z"
    },
    {
      "author": "ariananana",
      "body": "y'all look dapper n' happy, which is what I would expect....",
      "created_at": "2007-07-29T22:19:01.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Dapper Dan. I don't want Fop goddammit! I'm a Dapper Dan man!",
      "created_at": "2007-07-29T23:50:06.000Z"
    },
    {
      "author": "Caleb",
      "body": "CONGRATS!!!!",
      "created_at": "2007-07-30T05:14:33.000Z"
    },
    {
      "author": "colin",
      "body": "i say congrats, and i'll say so again tonight at 7!",
      "created_at": "2007-07-30T18:41:12.000Z"
    },
    {
      "author": "Ian",
      "body": "I'll be in tonight to say congratulations, too, although I'm a kind of bad at expressing stuff like that.  So when I buy my ticket and glare at you, know that that's my Hurrah.",
      "created_at": "2007-07-31T02:36:00.000Z"
    },
    {
      "author": "tim",
      "body": "nicole looks like famous.... dan, sadly, like amos.... either way delicious cookies all around! \r\n\r\n(i think i was trying to say congrats, and it couldn't have happened to nicer people... i think.)",
      "created_at": "2007-07-31T09:19:11.000Z"
    },
    {
      "author": "Duke1974",
      "body": "Congrats on winning the award and 3-years of Moxie Goodness (a little late I know, sorry).\r\n\r\nM\r\n\r\np.s. Did you ever do anything with that Bullet Boy poster?\r\n\r\np.p.s. Long live the Moxie!",
      "created_at": "2007-08-06T03:19:57.000Z"
    },
    {
      "author": "nicole",
      "body": "I still have the poster! And all the programs you sent!",
      "created_at": "2007-08-06T03:44:21.000Z"
    },
    {
      "author": "dan",
      "body": "Yay! Hello again Mark!\r\n\r\nFor those of you who don't know, Mark is one half of our UK contingent. He's been reading the Moxie Blog since early 2004, when Max was just learning to crawl.",
      "created_at": "2007-08-06T04:24:09.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Yeah, that was a rough year for me. But I'm sure it was rough for Dan too, what with the arthritis and osteoporosis and weird smells and prunes and usage of the word \"britches\" and all that old people stuff. Old.",
      "created_at": "2007-08-06T06:04:08.000Z"
    },
    {
      "author": "drm00se",
      "body": "Max, the only old people around here are Brian and Nate.",
      "created_at": "2007-08-06T06:49:34.000Z"
    },
    {
      "author": "Girl #2",
      "body": "shhhh...he's doesn't know",
      "created_at": "2007-08-06T07:42:01.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "ahem... lanie is older than I\r\nhow old is jeff hawkser.. i forget",
      "created_at": "2007-08-06T09:16:24.000Z"
    },
    {
      "author": "Cosmik",
      "body": "I must have missed the mass text.  :)\r\n\r\nAnd don't you guys look all spiffed out in your fancy dress and tuxedo!  (Yeah, the first thing I thought was that Nicole's dress had a white bodice.)  :)\r\n\r\nSincerest congrats on an honor well-deserved!!!",
      "created_at": "2007-08-06T09:38:19.000Z"
    },
    {
      "author": "jhawk",
      "body": "<blockquote><cite>Posted By: El Brian de Moore</cite>how old is jeff hawkser.. i forget</blockquote>\r\nI'm probably the oldest at 34... \r\n\r\n<font size=\"-2\">Where are my teeth??!!</font>",
      "created_at": "2007-08-06T17:01:55.000Z"
    },
    {
      "author": "Girl #2",
      "body": "dammit brian! I said shhhhhh!",
      "created_at": "2007-08-07T04:06:31.000Z"
    },
    {
      "author": "Duke1974",
      "body": "Thanks Nicole & Dan\r\n\r\nI'll drop you some more programs in the post soon. In the mean-time check your email, I've got something else for you...\r\n\r\nM\r\n\r\np.s. Who's the other half of Moxie UK?",
      "created_at": "2007-08-07T04:13:42.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "<blockquote><cite>Posted By: Girl #2</cite>dammit brian! I said shhhhhh!</blockquote>i just didnt want you living a lie... ive seen those lies pile up on people... until they dont even know who they are anymore... and then one day the deck of cards buries them alive....\r\n\r\ni do it for you lanie... i do it <em>for</em> you",
      "created_at": "2007-08-07T04:20:16.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "<blockquote><cite>Posted By: Duke1974</cite>\r\np.s. Who's the other half of Moxie UK?</blockquote>brad moved to switzerland... thats in the neighborhood",
      "created_at": "2007-08-07T04:21:00.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "<a href=\"http://www.moxiecinema.com/forum/comments.php?DiscussionID=1001&page=60#Item_14\">semi-related (to my last comment) note... </a>",
      "created_at": "2007-08-07T04:32:25.000Z"
    },
    {
      "author": "dan",
      "body": "Fyse is the other half of our UK contingent. Do you remember him?",
      "created_at": "2007-08-07T04:36:44.000Z"
    },
    {
      "author": "nate",
      "body": "What about that Oz character?",
      "created_at": "2007-08-07T04:54:13.000Z"
    },
    {
      "author": "dan",
      "body": "She was from Philly.",
      "created_at": "2007-08-07T04:54:55.000Z"
    },
    {
      "author": "drm00se",
      "body": "Lanie, I know how old you are. Age doesn't make you an old person. Brian and Nate are old people because of how they act.",
      "created_at": "2007-08-07T06:08:42.000Z"
    },
    {
      "author": "Girl #2",
      "body": "this is why we shall be grand friends (that...and your close contact with a bonified sexpert)",
      "created_at": "2007-08-07T09:44:48.000Z"
    },
    {
      "author": "nate",
      "body": "A bone-i-fied sexpert.",
      "created_at": "2007-08-07T14:02:35.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "<blockquote><cite>Posted By: drm00se</cite>Lanie, I know how old you are. Age doesn't make you an old person. Brian and Nate are old people because of how they act.</blockquote>now... now... now you listen here sonny... i reckon youre gettin a might big fur your britches... and i do mean big",
      "created_at": "2007-08-07T14:10:20.000Z"
    },
    {
      "author": "nate",
      "body": "I have lived in this forest for thousands of years, since the First Age.",
      "created_at": "2007-08-07T15:24:13.000Z"
    },
    {
      "author": "drm00se",
      "body": "Hahahahaha... I wish I was an old man. You guys are awesome.",
      "created_at": "2007-08-07T17:26:23.000Z"
    },
    {
      "author": "Segundo Paso And The Fun Facts",
      "body": "before i get caught up in the \"debate of the <em>ages</em>\"(FART YES! sweet pun!)...i would like to sincerely congratulate Dan and Nicole on their award, personally, whenever I hear there's an award in Springfield I think of you two. if i see GO's top 20 ________ or whatever, it's YOU. \r\n\r\nas for Brian and Nate....(sigh)... Brian will stand outside a party with me, smoke a cigarette, and talk about dreams... i still believe in him. However, if I tried that with Nate he would use a word like 'ubiquitous' and make me feel like shit. at the same time, i respect him the way I'd respect my older brother who loathed being my brother and i envy his vocabulary",
      "created_at": "2007-08-08T06:40:41.000Z"
    },
    {
      "author": "nate",
      "body": "ur mom's ubiquitous",
      "created_at": "2007-08-08T06:42:10.000Z"
    },
    {
      "author": "nate",
      "body": "and you've never been at a party with me.\r\n\r\n(I don't go to parties.  I go to geneaology club meetings.)",
      "created_at": "2007-08-08T06:46:08.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "<blockquote><cite>Posted By: Segundo Paso And The Fun Facts</cite>as for Brian and Nate....(sigh)... Brian will stand outside a party with me, smoke a cigarette, and talk about dreams... i still believe in him. However, if I tried that with Nate he would use a word like 'ubiquitous' and make me feel like shit. at the same time, i respect him the way I'd respect my older brother who loathed being my brother and i envy his vocabulary</blockquote>\r\n\r\ni win!\r\nps: you might want to edit the curse word out of the blog thread before nicole throws the smack down\r\npps: do i still win.. for pointing that out?  come on... tell me your dreams",
      "created_at": "2007-08-08T12:32:39.000Z"
    },
    {
      "author": "Megster",
      "body": "<blockquote><cite>Posted By: nate</cite>and you've never been at a party with me.</blockquote>\r\n\r\ni can think of at least two parties you have both been at...\r\n\r\nand yes ryan's thing about seeing awards and assuming it is dan and nicole winning them holds true for me as well...",
      "created_at": "2007-08-08T20:16:13.000Z"
    },
    {
      "author": "drm00se",
      "body": "<blockquote><cite>Posted By: Segundo Paso And The Fun Facts</cite>I respect Nate the way I'd respect my older brother who loathed being my brother, and I envy his vocabulary.</blockquote>\r\nYes... and he has stood outside a party with me and been super nice and cool, too.",
      "created_at": "2007-08-08T21:20:04.000Z"
    },
    {
      "author": "nate",
      "body": "aw, thanks big guy.",
      "created_at": "2007-08-08T21:54:08.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "<blockquote><cite>Posted By: drm00se</cite><blockquote><cite>Posted By: Segundo Paso And The Fun Facts</cite>I respect Nate the way I'd respect my older brother who loathed being my brother, and I envy his vocabulary.</blockquote>\r\nYes... and he has stood outside a party with me and been super nice and cool, too.</blockquote>yeah... im pretty sure i was standing out there too derek... *and* i gave both you *and* nate a cigarette...\r\n\r\n... wait.. thats not really a good thing\r\nim kidding everyone.. i didnt really give derek a cigarette\r\n(in case evangel reads these forums)",
      "created_at": "2007-08-09T03:27:24.000Z"
    },
    {
      "author": "drm00se",
      "body": "Lol, yeah, but he was out there first.\r\n\r\nSeriously, people, I make fun of them for being ODB's because they're really two of the people around here I respect the most. Being a kid whose older sister is his only sibling, I collect big brother figures like trading cards, hahaha.\r\n\r\nDan's still my penultimate hero, though... right after William Shatner and before Craig Ferguson.",
      "created_at": "2007-08-09T03:57:28.000Z"
    },
    {
      "author": "nate",
      "body": "Now I'm uncomfortable.\r\n\r\n*avoids eye contact*",
      "created_at": "2007-08-09T03:59:22.000Z"
    },
    {
      "author": "nate",
      "body": "which is easy because Derek's eyes are about yay high\r\n*stretches arm up as high it will go*",
      "created_at": "2007-08-09T03:59:59.000Z"
    },
    {
      "author": "dan",
      "body": "Bring it back around, folks.",
      "created_at": "2007-08-09T04:02:46.000Z"
    },
    {
      "author": "nate",
      "body": "Dan and Nicole are Entrepreneurs of the Year!!",
      "created_at": "2007-08-09T04:03:59.000Z"
    },
    {
      "author": "drm00se",
      "body": "Congratulation!",
      "created_at": "2007-08-09T04:14:12.000Z"
    },
    {
      "author": "Segundo Paso And The Fun Facts",
      "body": "i feel a little responsible for turning the Dan And Nicole entrepreneur of the year thread into the Nate and Brian awkward appreciation thread... yet part of me wanted to post a picture of the pole vaulter and ruin everything even more...\r\n\r\ninstead i'll say \"congratulations\" and note that i revised my language from earlier into a pretty harmless exclamation as Brian suggested",
      "created_at": "2007-08-12T11:58:11.000Z"
    },
    {
      "author": "Duke1974",
      "body": "Fyse, yes it's all coming back now.\r\n\r\nM",
      "created_at": "2007-08-13T00:41:41.000Z"
    },
    {
      "author": "EdMo",
      "body": "KC sucks...\r\n\r\nmove the Mox to Blue Springs.  For serious.\r\n\r\nCONGRATS!",
      "created_at": "2007-08-22T05:46:07.000Z"
    },
    {
      "author": "Girl #2",
      "body": "wait. Ed. you aren't coming back?!?!?! I thought you were only gone for the summer!!! WTF??!!",
      "created_at": "2007-08-23T04:26:09.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "hmm?  i thought he was staying in kc for a while.. then going to look for gold in the californy hills\r\nand then later caleb would move into a cottage with him ... out there\r\ni can see it now...  ed and caleb on the front porch...\r\nhands around eachothers shoulders... waving goodbye to some visitors\r\ned has on some sort of pink pastel sweater... (not too thick... its californy after all)\r\n..... i havnt worked out the rest of the details in my head yet... \r\nbut its looking pretty sweet so far",
      "created_at": "2007-08-23T12:41:04.000Z"
    },
    {
      "author": "Girl #2",
      "body": "oh yeah...i guess that does sound about right.\r\n\r\nthen caleb sighs and turns to Ed and says, \"well, those dishes sure aren't going to clean themselves\" \r\nthey both chuckle and Ed says, \"no, i guess not. tell ya what, you wash and I'll dry. by the way, those quesadillas you made tonight were divine. seriously, you have a real knack for those things.\" \r\n\"Aww. Thanks, Ed,\" Caleb replies as he ties his apron strings around his waist. \r\n\r\nEd leads Caleb through the front door with his hand at the small of his back. The sun setting in the background. Cue music. Roll credits.",
      "created_at": "2007-08-23T17:04:26.000Z"
    },
    {
      "author": "Caleb",
      "body": "Ok ok, you all can have your laughs. We'll just see whose happier in 10 years...err....",
      "created_at": "2007-08-23T17:57:46.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "<blockquote><cite>Posted By: Caleb</cite>Ok ok, you all can have your laughs. We'll just see whose happier in 10 years...err....</blockquote> Wrong <em>who's</em>. Caleb loses.",
      "created_at": "2007-08-23T19:16:46.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "or does he.....?  \r\n\r\nYAY DAN AND NICOLE!! CONGRATUZLAALZJXEAZA:LKSZ",
      "created_at": "2007-08-23T22:59:37.000Z"
    },
    {
      "author": "nate",
      "body": "It could be <em>my </em>happier.  Or Brian's.",
      "created_at": "2007-08-23T23:08:04.000Z"
    },
    {
      "author": "drm00se",
      "body": "I think it's Danicole's happier. Why? Because CONGRATULATIONS!!!",
      "created_at": "2007-08-24T00:16:42.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
