{
  "id": 504,
  "title": "ROCKY HORROR 2007",
  "body": "<img src=\"http://moxie.danchilton.com/pix/grum/080607/rhps07.jpg\" width=\"425\" />\r\n\r\nThe Moxie and the Landers will be teaming up again this year to present the region's largest ROCKY HORROR PICTURE SHOW celebration. We had over 1,600 people last Halloween, and we hope to double that number this year. To help us fit in 3,000+ people over two shows, we've decided to host the event at the Shrine Mosque, which is freaking HUGE!\r\n\r\nIf you missed out on last year's screenings, don't make the same mistake twice. Here's what you can expect from this Halloween:\r\n\r\n<ul><li><b>The movie</b> - Duh.</li>\r\n<li><b>Live shadow cast</b> - This was one of the best parts of the event last year. A live shadow cast re-enacts the entire movie, and interacts with the audience throughout the show.</li>\r\n<li><b>The audience</b> - I've never seen as much audience participation as we had last year, but I'm sure we'll top it this Halloween. RHPS-pros came equipped with scripts and props, which brings me to our next point...</li>\r\n<li><b>The props</b> - RHPS prop kits will be available for purchase at both shows.</li>\r\n<li><b>Costume contests</b> - We'll be holding costume contests (with a ton of awesome prizes) for best dressed audience members before both shows.</li>\r\n<li><b>Two showtimes</b> - Early show starts at 9:00 pm, late show at midnight.</li>\r\n<li><b>$10 tickets</b> - Even though we're moving to a much larger venue, and adding all kinds of cool new features, we're not raising the cost of the tickets.</li></ul>\r\nIf we can hit our attendance goal, this might wind up being the biggest RHPS showing in the entire state! People were scalping tickets last year, but hopefully everyone who wants to get will be able to fit inside the Shrine. Check back for more information (i.e. when tickets go on sale).",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-08-06T21:56:29.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Megster",
      "body": "yay!  i hope i can go to this this year... i was out of town last year...",
      "created_at": "2007-08-07T01:35:16.000Z"
    },
    {
      "author": "Director_of_Fear",
      "body": "OMG!!!!!!!!!!!!!!!!",
      "created_at": "2007-08-07T05:24:13.000Z"
    },
    {
      "author": "drm00se",
      "body": "So freaking awesome!",
      "created_at": "2007-08-07T06:14:51.000Z"
    },
    {
      "author": "Carson",
      "body": "I might have to do this.  It's probably been 10 years since I've gone to RHPS live.  I'm sure my yell backs are extremely outdated and probably include references to Mike Tyson ear biting and the final episode of Married With Children",
      "created_at": "2007-08-07T07:47:13.000Z"
    },
    {
      "author": "CinemaUntapped",
      "body": "I think winning that costume contest would be the hardest.  You would have to get extremely creative. Everyone always does such a good job.  There was a show on comedy central a while back ago called beat the geeks.  I always wanted to be the RHPS geek.  I know an insane amount about this film.",
      "created_at": "2007-08-07T09:48:10.000Z"
    },
    {
      "author": "Master RJ",
      "body": "<blockquote><cite>Posted By: CinemaUntapped</cite>I think winning that costume contest would be the hardest. You would have to get extremely creative. Everyone always does such a good job. There was a show on comedy central a while back ago called beat the geeks. I always wanted to be the RHPS geek. I know an insane amount about this film.</blockquote>\r\n\r\nBeat The Geeks, I loved that show.\r\n\r\nI hope to attend this Halloween, if I can make the 9:00 show. I remember last year had three showtimes.",
      "created_at": "2007-08-07T16:16:28.000Z"
    },
    {
      "author": "Becca",
      "body": "I can't WAIT!  Last year was sodamnfun.  Srsly.  I had a blast.  When can I get in line to make sure I get a good spot?",
      "created_at": "2007-08-10T19:13:05.000Z"
    },
    {
      "author": "Duke1974",
      "body": "I love the RHPS. Richard O'Brien is an evil genius - in the good way of course.\r\n\r\nM",
      "created_at": "2007-08-13T00:58:18.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
