{
  "id": 505,
  "title": "Hot time, Summer in the city",
  "body": "<img src=\"http://moxie.danchilton.com/pix/grum/081507/summer.jpg\" width=\"425\" />\r\n\r\nIt might not feel like it outside, but Summer is finally drawing to a close. For us, Summer ends when college students roll back into town, which is going on as you read this. Monday marks the beginning of the 2007-2008 school year, and we couldn't be happier. <b>WELCOME BACK STUDENTS!</b>\r\n\r\nSummers are typically slower for small indie theater like the Moxie, not only because students are gone, but because the multiplexes are filled with a-list blockbusters, and the warmer weather lures people into doing stuff that usually doesn't include seeing a movie (i.e. camping, swimming, going on vacation). We were well aware of this when last Summer (our first) rolled around, but it didn't end up being nearly as bad as we were expecting. Summer 2006 was a smidgen below average, but none of the four months landed in our bottom five. In fact, last August was one of our biggest months on record.\r\n\r\nSo far this year, we've outpaced last Summer in May, June, and July, and with RESCUE DAWN, SICKO, and THE TEN coming up in August, it looks like we might just beat that month too! Summer 2007 has been better than 2006, and that's a very good thing. And that's really all I had to say. I'm just a wee bit excited.\r\n\r\nOh yeah, our lamphouse wimped out on us today, forcing us to cancel our 4:15 show at the last minute. Luckily I isolated the problem quickly (broken momentary switch on the manual strike button), and had everything up and running again by 5:00. That's the third time we've had to cancel a show when people were already in the auditorium. Three misfires out of 1,984 shows. I'm not sure what that works out to percentage-wise, but despite how low it might be, I'd still rather have it at 0%. Damn projector!\r\n\r\nAnd for those of you who are curious, our 2,000th show will be the 9:00 pm TAXI TO THE DARK SIDE this Sunday. AWESOME! And next Wednesday will also be our 700th day of operation. DOUBLE AWESOME!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-08-16T08:00:23.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "The Four Finger Soc Em",
      "body": "Yes, awesome indeed. If I woulda been running that puppy it wouldn't have broke down. I have the hands of a skilled angel.",
      "created_at": "2007-08-16T12:01:00.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "horaay!y!\r\ni cant wait to come back here in 50 years.. when we will all be nearing 80 (cept for nicole)\r\nand ill walk in.. and some pimply young kid (max) will try and charge me full price\r\nand ill say... NO LADDY!... im a founding member!!.. i get matinée price!\r\nand he will say \"what?  i charged you senior citizen price.. which is the same as matinée\"\r\nand ill say... \"whatsit? .. no i wont be needing my free popcorn today\"\r\nand he will say \"... uh... okay.. sir.. just put on this helmet and step into the holographic chamber\"\r\n\"yes .. my boy.. very astute... this is a fitz Co. hover chair... they make the best in the business you know\r\ni remember when they just made sodas... but anyway.. stop bothering me.. i gotta go watch this here movie\"",
      "created_at": "2007-08-16T14:55:45.000Z"
    },
    {
      "author": "nate",
      "body": "I will be long dead.",
      "created_at": "2007-08-16T17:04:48.000Z"
    },
    {
      "author": "justin",
      "body": "I knew that momentary switch was bad!  Sometimes you gotta press it down too hard to get the lamp to fire up.  Just the other night, Nate was having problems, so I told him to use a hammer to depress the switch.  It worked great!",
      "created_at": "2007-08-16T18:41:12.000Z"
    },
    {
      "author": "nate",
      "body": "I knew it.",
      "created_at": "2007-08-16T18:47:59.000Z"
    },
    {
      "author": "drm00se",
      "body": "Yes! I feel vindicated for my problems with that switch the other night!... Unless, of course, I caused the problem... Oh, man. I knew it. I broke the Moxie.\r\n\r\nYou told me the projector was <i>supposed</i> to be on fire! What makes you lie, Dan?!",
      "created_at": "2007-08-16T19:25:04.000Z"
    },
    {
      "author": "nate",
      "body": "Did I tell you that in Max's last post to me, he said what really set him off is when I accused him of lying?  <a href=\"http://www.moxiecinema.com/forum/comments.php?DiscussionID=673&page=65#Item_22\">Here</a>.\r\n\r\nI was stunned.  It's like people were already primed to misread things.\r\n\r\nI'm wondering if anybody will get mad at Derek ^there^ for doing the same thing.  He's also told people to \"Go fuck themselves\", and the day is still young.  You'd have to be blind to know he's not joking, but people were plenty blind before.\r\n\r\nGah.  Still pisses me off.\r\n\r\nOkay, I'm dropping it.",
      "created_at": "2007-08-16T19:41:26.000Z"
    },
    {
      "author": "Girl #2",
      "body": "yes. that's just silly (I say stuff like \"silly\" a lot now). nothing about what you said seemed \"seriously\" accusatory. yeah, you said \"so you lied last night\"  but before he responded, you corrected yourself. I didn't read it as combative. but merely light-hearted and converstional. \r\n\r\nand though I agree that you could keep bringing up examples as people post, i wouldn't do this on the actual forum (which you're not...your whispering it, which is fine. anyways,  you know what I'm saying.\r\n\r\n I gotta go to the fair. \r\n\r\nI'm sooooo sleepy. bleh.",
      "created_at": "2007-08-16T20:31:31.000Z"
    },
    {
      "author": "nate",
      "body": "Yeah, I know how petty it would be to post examples on the forums, that's why I am venting this particular steam kettle onto you.  Sorry.\r\n\r\nEnjoy the fair!",
      "created_at": "2007-08-16T20:35:45.000Z"
    },
    {
      "author": "Caleb",
      "body": "ICARUS, SET PROJECTOR LAMP TO 100%!!!!\r\n\r\nI'm sorry Moxie, your screen can only handle 4%.",
      "created_at": "2007-08-16T21:04:56.000Z"
    },
    {
      "author": "drm00se",
      "body": "Hahahahaha.",
      "created_at": "2007-08-16T21:10:25.000Z"
    },
    {
      "author": "nate",
      "body": "\"Moxie Computer, please calculate how long we can survive with the popcorn that is left.\"\r\n\r\n*soothing feminine voice*\r\n\"WITH REMAINING POPCORN LEVELS, EIGHT EMPLOYEES CAN SURVIVE FOR ONE WEEK.\"\r\n\r\n\"Eight?  No Moxie, Dan died in the incinerating glare of the exposed lamphouse.  There is Nicole and her six employees.  Please update your files.\"\r\n\r\n\"NEGATIVE.  THERE ARE EIGHT PERSONS.\"\r\n\r\n*long pause*\r\n\r\n\"Moxie.  Tell me where the eighth employee is.\"\r\n\r\n\"IN THE STORE ROOM.  STEALING POSTERS.\"\r\n\r\n*nate runs back to store room.  The music builds*\r\n\r\n\r\n\"Dammit RJ.  We <em>told </em>you that you can't sell those on Ebay.\"\r\n\r\n\r\n\r\nThat didn't turn out as funny as I hoped.  And Dan might delete this.",
      "created_at": "2007-08-16T21:13:21.000Z"
    },
    {
      "author": "drm00se",
      "body": "I thought it was pretty funny...",
      "created_at": "2007-08-16T21:21:25.000Z"
    },
    {
      "author": "Girl #2",
      "body": "sure, baby, steam away. the fair was good. i can barely hold my head up. trinity and I have been chatting...she is so expressive, i almost want to record her when she tells stories.",
      "created_at": "2007-08-16T23:01:41.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "it was alright... the ending punchline was funny... just not the usual excellence.. i expect from nate\r\n\r\n.... caleb's however... did make me LOL",
      "created_at": "2007-08-17T03:59:37.000Z"
    },
    {
      "author": "drm00se",
      "body": "<blockquote><cite>Posted By: nate</cite>Dan died in the incinerating glare of the exposed lamphouse.</blockquote>\r\nI thought this was the funniest part. As if Dan could actually die like one of us mortals, lol. Silly Nate.\r\n\r\nBesides, if any of us even suspected the slightest bit of danger, Max would be the one sent in.",
      "created_at": "2007-08-17T04:42:57.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "I say a +1 to Nate and Caleb. But they have to share, and Caleb would get the slightly bigger portion of that point, but he made <em>(shifting into soothing, computerized female voice)</em> one fatal error in his joke calculations. The Moxie's screen can only handle <em>3.1%</em>. 4% would result in irreversible damage to its screen.",
      "created_at": "2007-08-17T06:58:37.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "<blockquote><cite>Posted By: drm00se</cite>Besides, if any of us even suspected the slightest bit of danger, Max would be the one sent in.</blockquote> (says in a sweaty, panicky state) Oh, I see! I know what you're thinking! It's me, I have to go, right??",
      "created_at": "2007-08-17T07:00:58.000Z"
    },
    {
      "author": "drm00se",
      "body": "I bet we can double the number of Sunshine references in the comments on this thread before midnight. Ready... Set... Go!",
      "created_at": "2007-08-17T07:06:47.000Z"
    },
    {
      "author": "nate",
      "body": "<img src=\"http://farm1.static.flickr.com/117/269253728_7a2cbef047.jpg\" alt=\"rose!\" />",
      "created_at": "2007-08-17T07:59:09.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "wrong thread...\r\noh wait...",
      "created_at": "2007-08-17T08:03:04.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Oh man, she looks as if she needs to be kissed to prevent her from starting to cry. Somebody should. Do that.",
      "created_at": "2007-08-17T20:02:14.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "stand back... i got this",
      "created_at": "2007-08-17T20:28:29.000Z"
    },
    {
      "author": "drm00se",
      "body": "*Shoves Brian out of the way*\r\n\r\n:-)",
      "created_at": "2007-08-18T02:12:33.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
