{
  "id": 506,
  "title": "Eat My (Moxie) Shorts!",
  "body": "It's been about a year since our last Moxie Short Film Celebration, and if you were thinking we forgot about doing it again this year, well, you're wrong. Combining our love for both short and locally-made films, Moxie Shorts gives regional filmmakers a chance to show off their latest masterpiece in front of a receptive audience that has grown to love the medium. The submission window, and showcase weekend have both been pushed back to allow returning students a chance to enter their films.<br/><br/>So calling all regional filmmakers! You have until October 20, 2007 to turn in your short film to be considered for this year's lineup. Our rules and guidelines are simple:<br/><br/><ol><li>Film length should be somewhere between 1 second and 20 minutes. If your film is longer than 20 minutes, it won't be considered. Likewise, if your film is shorter than 1 second it will not be considered, because it will most likely be too quick for us to watch. Seriously.</li><br/><li>No copyrighted material can be used, unless you have written permission from the copyright holder (this includes music). Release forms should be included with your submission.</li><br/><li>To keep the films local, either the filmmaker and/or the shooting location should be within the Springfield metro area, which can be loosely defined as about an hour's drive from The Moxie.</li><br/><li>Please, no porn. Enough people already think we're \"that kind of theater\"... don't make it any worse.</li><br/><li>No animal abuse (duh!).</li><br/><li>Submitted films must have been created between September 2006 and October 2007 to be eligible for prizes.</li><br/><li><b>SATO 48 addendum</b> - We will not accept films that were entered into the SATO 48 Hour Film Challenge, unless they have been significantly altered from the original submission.</li><br/><li>Deadline for film submissions is October 20, 2007 (no exceptions!). Putting your film in the mail on the 20th does not count. Your film must be in our possession, at the Moxie, by no later than the close of business on October 20th.</li><br/><li>Each short must be accompanied with an entry form and application fee of $20, which will go towards promotion, prizes, and operating expenses.</li><br/><li>Films should be submitted on TWO autoplay DVDs (no menus), along with your application and release forms (if required).</li></ol><br/>We even have a fancy website if you have any further questions. Please visit <a href=\"http://www.moxieshorts.com\" class=\"broken\">www.MoxieShorts.com</a> to check out everything you need to know (including registration forms, contact info, etc.).<br/><br/>Last year's winners (<i>People in Motion</i> and <i>The Big Idea</i>) had their short films shown before occasional films, plus received some cool Moxie schwag. This year we're concocting some new fabulous prizes. But prizes aren't the real incentive, are they?<br/><br/>We look forward to seeing what you creative film junkies can produce this year!<br/><br/>",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2007-08-26T20:46:13.000Z",
  "author": "Nicole",
  "comments": [],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
