{
  "id": 507,
  "title": "Perks of the job",
  "body": "I'm not going to lie to you... running your own theater does has a few perks, and today I got to cash in on one: the free trade screening. Before a studio releases certain buzz-worthy movies, they'll sometimes invite the film industry's most powerful players to a complimentary screening of the new flick, which typically takes place weeks, if not months, before the film is actually opened to the public. I, however, did not receive such an invitation, but I know someone who did, and they were kind enough to pass it on to me. Long story short, I watched Wes Anderson's new film, THE DARJEELING LIMITED, in Kansas City at 10:00 AM this morning.<br/><br/>Justin and I left Springfield at 7:00 AM in a rented 2007 Cadillac CTS (sweet!) and arrived at the theater at 9:50. \"Why didn't Nicole go,\" you ask? She was in Memphis visiting her mom. \"Why did you rent a car,\" you question? Because my old 1992 Corolla would've exploded somewhere between here and Bolivar. \"But why a Cadillac? I mean, wasn't that expensive,\" you query? Actually, the standard rental car fee was $35, while the luxury rental car was only $48. I mean... come on! Of course I'm going to upgrade to the luxury car! It was a no-brainer.<br/><br/>\"And finally, what did you think of the movie?\" Well, that's a tough one... I'm still letting it seep into my brain right now. There were parts I enjoyed, and parts I didn't. I'll probably see it again when it comes out in late October, since Nicole didn't get a chance to see it, and YES we are still actively campaigning to show it at The Gillioz and The Moxie.<br/><br/>Ok, I'm tired. I'm not used to waking up at 6:30 in the morning. Good night.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-09-06T08:14:36.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "hoopy",
      "body": "Die :[",
      "created_at": "2007-09-06T08:18:10.000Z"
    },
    {
      "author": "stevie_g",
      "body": "<em> <blockquote>... I'm still letting it seep into my brain right now.</blockquote> </em><br/><br/>Often when I see Dan as I am walking out of the auditorium after watching a movie, he will ask \"So Steve, what did you thinK?\" And I'm always like \"I'm...urrrr...aaa...duhhh...\". The above portion of Dan's reaction to THE DARJEELING LIMITED pretty much translates my<br/>\"I'm...ur...aaa...duhhh...\" reaction to most Moxie films; I need time to savor, digest & think them over. Let's face it, most indie/foreign films shown there are a little headier than HALLOWEEN or BALLS OF FURY. So Dan, next time you ask we what I think, and my eyes roll back in my head and I begin to drool out of the corner of my mouth, just remember what I am really meaning to say.<br/><br/>Sounds like a cool trip. I'm sure you will be enjoying more as time passes.",
      "created_at": "2007-09-06T22:09:01.000Z"
    },
    {
      "author": "Master RJ",
      "body": "No one in St. Louis or Kansas City is showing Hatchet, but at least 8 theatres in Texas suburbs are. What the hell?",
      "created_at": "2007-09-06T23:17:21.000Z"
    },
    {
      "author": "drm00se",
      "body": "What does that have to do with anything, RJ?",
      "created_at": "2007-09-06T23:25:26.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Stevie compared The Darjeeling Limited to Halloween, so I made a rant about the poor release structure of Hatchet (every theatre showing it seems to be in 20+ screen megaplexes in suburbs instead of arthouses and college area theatres).",
      "created_at": "2007-09-06T23:43:30.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Here, RJ, I took out some of the wordiness of your response to better answer Derek's question. <blockquote><cite>Posted By: Master RJ</cite>Nothing.</blockquote>",
      "created_at": "2007-09-06T23:45:40.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "hey Dan, here's something for your query. <a href=\"http://www.imdb.com/title/tt1094249/\">Natalie Portman, ay?</a>",
      "created_at": "2007-09-09T08:30:07.000Z"
    },
    {
      "author": "Master RJ",
      "body": "I want to see Mr. Magorium's Wonder Emporium.",
      "created_at": "2007-09-09T08:46:51.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "RJ!!! Nothing to do with this blog post. Don't use \"Well, it stars Natalie Portman\" as an excuse.",
      "created_at": "2007-09-09T10:24:03.000Z"
    },
    {
      "author": "nicole",
      "body": "Apparently Wes Anderson was going to play that short film before the movie, but decided to pull it? I'm not sure.",
      "created_at": "2007-09-09T21:28:26.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Sounds like a mess.",
      "created_at": "2007-09-10T01:52:35.000Z"
    },
    {
      "author": "Ian",
      "body": "Hey, I too have a '92 Corolla!  Yikes!",
      "created_at": "2007-09-11T03:05:54.000Z"
    },
    {
      "author": "mrmusler",
      "body": "Here's the only image that has appeared on the internet from Hotel Chevalier:<br/><a href=\"http://theplaylist.blogspot.com/2007/08/first-hotel-chevalier-image-appears.html\"><br/>Did I do that link right?",
      "created_at": "2007-09-11T08:24:47.000Z"
    },
    {
      "author": "erin",
      "body": "jealous.",
      "created_at": "2007-09-12T09:19:20.000Z"
    },
    {
      "author": "brad",
      "body": "i'm jealous of the '92 Corolla.",
      "created_at": "2007-09-15T01:12:30.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
