{
  "id": 508,
  "title": "Moxie Cinema: Two years strong today",
  "body": "Two years ago today, on September 21, 2005, The Moxie officially opened its doors to the public after nearly a year's worth of start-up delays. Now, two year's on, I find myself sitting in the waiting room of St. John's urgent care center, painstakingly typing this blog post into my new web-enabled phone with what seems to be the world's smallest keypad. I suppose that's the price you pay for new technology.\r\n\r\n<i>EDIT: Now I'm in the patient room, waiting for the doctor. I'm here to get an allergy shot (hopefully), although they just informed me that my blood pressure was alarmingly high (145/93). I don't know... probably a side effect from one of the five over-the-counter allergy medicines coursing through my veins. Now they have me worried though... damn nurses and their paranoia-inducing bedside manner. I hear them laughing outside the door -- probably joking about how my heart is going to explode any minute now. It's getting increasingly difficult to type as my hands are becoming more and more sweaty.</i>\r\n\r\nNow, where was I? Ah yes, ye olde Moxie and the momentous day. We went all out last year, with a week's worth of activities to celebrate our big one year. The reason being the fact that the majority of small businesses fail within their first 12 months, so we felt we owed it to ourselves, and our supportive customers, to mark the occasion appropriately. That last sentence sounds terribly labored, but it's too hard to erase it all on this little keypad!\r\n\r\n<i>EDIT: Doctor says my high blood pressure was caused by all the Sudafed I took today. No worries... and no allergy shot either. :(  I did, however, get some Allegra and steroid nasal spray. Hopefully it will start working soon.</i>\r\n\r\nSo, the second year is important as well, but we didn't feel any real pressing need to celebrate as lavishly as last year. We did, however, offer $0.50 popcorn to everyone on our e-mail list, so that's something. I like that... saying \"however\" all the time... it's something I do a lot when I talk too.... but that's neither here nor there... and I'm getting off topic.\r\n\r\nAfter having successfully weathered out another year of working seven days a week, and spending nearly every waking hour with each other, which isn't as easy or pleasant as it may seem, Nicole and I are taking a mini-vacation starting tomorrow. We'll be heading up to St. Louis for a day (Nic's in a crafts show, and we'll be visiting and staying with friends), and then on Sunday we'll be flying to the BIG APPLE (our first time) to see a Bjork concert on Monday night! Also, while we're in New York, we're going to meet with several of our distributors who have offices in Manhattan (Fox, Sony, Magnolia, etc.). So it's half business / half fun -- although the fun will outweigh the business... as it should. It's a much-needed break, and the sole reason I went to the urgent care center tonight. No one wants to have an allergy attack during their first trip to the big city.\r\n\r\nAnd that's it. I have a lot of stuff that I need to get ready for our fateful employees, who will be captaining the USS Moxie while we're on shore-leave, so I best get to work. If you guys have any tips on where we should go while we're in NYC, feel free to leave them in the comments.\r\n\r\nThanks for a great two years, and we look forward to bringing you many more fantastic cinematic experiences in the years to come.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-09-22T07:15:05.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "drm00se",
      "body": "Yay! Happy birthday, Moxie!",
      "created_at": "2007-09-22T07:23:16.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Hope you get to meet with Teeth's distributor for a December/January showing.",
      "created_at": "2007-09-22T07:27:08.000Z"
    },
    {
      "author": "justin",
      "body": "hey world, i'm rapping to you, all you people are in my crew\r\n\r\nSKATE PUNCH RAP",
      "created_at": "2007-09-22T09:26:31.000Z"
    },
    {
      "author": "PullTheString",
      "body": "Congrats Dan & Nicole!\r\n\r\nTwo New York suggestions:\r\n\r\nYankee Stadium -- I know quite well your affinity lies with a different team, but the atmosphere on game night is unmatched in the Midwest (we think we know what it means to be a rabid fan until we visit an East Coast team).\r\n\r\nAnd after all the jeers of my fellow posters (c'mon... the Yankees! That's like cheering for Microsoft), more realistically...\r\n\r\nLes Paul plays every Monday night at the Iridium Jazz Club... the man in person for a rather lengthy show.\r\n\r\nHave fun... you deserve it.\r\n\r\nM\r\n\r\nPS My grandpa was a Yankee scout, so the pinstripes were bred into me early....",
      "created_at": "2007-09-22T18:37:39.000Z"
    },
    {
      "author": "jhawk",
      "body": "Happy Second Birthday! \r\n\r\nAre mood swings, temper tantrums, and higher language development far behind?",
      "created_at": "2007-09-22T18:51:16.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "Happy birthday guys! Congrats on making such risky business venture an integral part of the Springfield scene. My hat is doffed to the work ethic and business acumen!\r\n\r\nAnd I likez de moviez!\r\n\r\nWhat craft stuff is Nicole entering?",
      "created_at": "2007-09-22T19:26:59.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "i can only mention the usual places that i attended when i went... time square... virgin records in time square, park central, tons of art museums, top of empire state, perhaps that skate park.. where they always light up the HUGE christmas tree.. which is really close to the place where they film the late show with david letterman... GO SEE DAVID LETTERMAN! ?  hmm.. or at least get some food from that Rupert's deli.. right by there...\r\nwhere is bjork playing.... madison square gardens?  good.. i went there too\r\nchina town!... bring me back exotic pocky flavors!\r\ni didnt go *to* the statue of liberty... but i did go look at it from afar... \r\nit was smaller than i had imagined",
      "created_at": "2007-09-22T20:44:55.000Z"
    },
    {
      "author": "brad",
      "body": "Original Sandwich Shoppe at 58 Greenwich Ave. best freaking deli EVER. \r\n\r\nChelsea Market is cool.. on 9th Ave (corner of 15th)\r\n\r\nif you're going for movies I suggest one of the Angelika's, the Pioneer Theater..and maybe the Quad Cinema.\r\n\r\noh! and go eat at the Zen Palate in Union Square! it's my favorite restaurant in the city, hands-down. all vegetarian, it will blow your freaking mind.\r\n\r\nalso the Strand bookstore on Broadway and 12th. biggest and bestest bookstore known to man..\r\n\r\ni probably have a million other things too..just can't think of stuff...\r\n\r\nif you're looking for a bar, go the lower east side, walk down avenue a and prepare for crazyness...",
      "created_at": "2007-09-22T23:04:44.000Z"
    },
    {
      "author": "Master RJ",
      "body": "I've read the Angelika's not all that great, due to it being near a train depot.",
      "created_at": "2007-09-23T02:01:13.000Z"
    },
    {
      "author": "brad",
      "body": "yeah you can hear the subway going by every 10-15 minutes...but they have great rooms and show great films. it's a trade-off, but it's worth it...",
      "created_at": "2007-09-23T03:37:30.000Z"
    },
    {
      "author": "tim",
      "body": "Happy Birthday!!! \r\n\r\nalso: it's not all healthy like brad suggestion (which is pretty good imho), but, Pommes Frites on 2nd AVE, i think by 6th street, is amazing, huge cone of french fries, and like 20 wonderful dipping sauces to choose from.... While in the area you should stop at Kims for you movie and music needs.\r\n\r\nalso, i know its a chain... but Beard Pappa is pretty delicious\r\n\r\n\r\nHAVE FUN!",
      "created_at": "2007-09-23T05:33:38.000Z"
    },
    {
      "author": "tim",
      "body": "Brad, i thought the strand closed?",
      "created_at": "2007-09-23T05:34:13.000Z"
    },
    {
      "author": "erin",
      "body": "<blockquote><cite>Posted By: brad</cite>\r\noh! and go eat at the Zen Palate in Union Square! it's my favorite restaurant in the city, hands-down. all vegetarian, it will blow your freaking mind.\r\n</blockquote>\r\n\r\noh man.",
      "created_at": "2007-09-24T09:05:38.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Good desserts?",
      "created_at": "2007-09-24T09:41:31.000Z"
    },
    {
      "author": "dan",
      "body": "We saw THE ASSASSINATION OF JESSE JAMES BY THE COWARD ROBERT FORD at the Angelika, and the subway going by every 15 minutes was noticeable, but easy to filter out. Sometimes the rumbling of the subway would hit at just the right moment, like when someone was getting mad or there was a close-up on someone's face as they're having an epiphany. All in all, I liked the experience.",
      "created_at": "2007-09-26T21:54:00.000Z"
    },
    {
      "author": "brad",
      "body": "nice! the angelika is by far my favorite theater in nyc. the subway becomes a charming addition after awhile... and the location is PERFECT.\r\n\r\nwhere else did you guys go? what else did you see?",
      "created_at": "2007-09-27T01:23:37.000Z"
    },
    {
      "author": "dan",
      "body": "Gosh. We did a lot...\r\n\r\n<strong>Sunday:</strong>\r\nHotel in Chelsea\r\nAte at a Thai place called Spice on 8th and 20th\r\nGround Zero\r\nBattery Park\r\n(looked at the Statue of Liberty from afar)\r\nTribeca Film Festival Shorts Film Celebration (didn't stay to watch a film though)\r\nWall Street, and the financial district\r\nSoHo\r\nShake Shack\r\nAngelika to see TAoJJBtCRF\r\n\r\n<strong>Monday:</strong>\r\nDunkin Donuts\r\nThe Dakota\r\nStrawberry Fields\r\nCentral Park\r\nPark Avenue\r\nTimes Square (yuck!)\r\nShake Shack\r\nBjork @ MSG\r\n\r\n<strong>Tuesday:</strong>\r\nTrain to Brooklyn\r\nWalked back to the city across the Brooklyn Bridge\r\nRockefeller Plaza\r\nLunch at Cosi's\r\nNBC Experience store\r\nVisited Fox's film offices\r\nVisited Magnolia's film offices\r\nVisited ThinkFilm's offices\r\nCab ride from Chelsea to LaGuardia at 5:00 pm via the Tri-Burrough, since the midtown was jammed\r\n\r\n*phew*\r\n\r\nAnd that's it. We also went to the City Museum on Saturday night, but that was in St. Louis, not NYC. It was a blast. Not nearly as dirty, scary, or pretentious as I thought it would be.",
      "created_at": "2007-09-27T01:44:22.000Z"
    },
    {
      "author": "brad",
      "body": "sans Bjork, I'm guessing the Bridge was the highlight. that was my favorite thing to do on nice sunny Sundays when I lived there...",
      "created_at": "2007-09-27T01:46:16.000Z"
    },
    {
      "author": "nicole",
      "body": "And I threw up in the airport because of a migraine!\r\n\r\nThe Brooklyn Bridge was really neat, but I wish we had done it sooner in our trip, during the evening. Oh well - next time!",
      "created_at": "2007-09-27T02:07:09.000Z"
    },
    {
      "author": "ariananana",
      "body": "happy birthday, and glad you guys had a good time in the city. :)\r\n\r\n(i walked through harlem by myself last night. i have never felt like a bigger JAP in my life.)",
      "created_at": "2007-09-27T03:08:25.000Z"
    },
    {
      "author": "nate",
      "body": "This is as appropriate a thread as any to post:  today, at my day job, I got a call from The Kabuki Theatre, a Japanese themed indie movie theatre in San Francisco who wants to sell our product.  I get calls from other little Moxies!  It's very cool.  The girl I talked to had just got hired, and we had a sort of \"me too!  Isn't this cool!\" moment.\r\n\r\nDanicole - your NY trip was great.  Brooklyn Bridge was also my favorite part.  Both daytime and nighttime have their own pleasures.\r\n\r\nI just realized that I've been working at the Moxie for 2 years...",
      "created_at": "2007-09-27T04:48:37.000Z"
    },
    {
      "author": "Master RJ",
      "body": "You should have asked Lionsgate (Roadside Attractions is a speciality division) about Teeth.",
      "created_at": "2007-09-27T05:01:05.000Z"
    },
    {
      "author": "dan",
      "body": "Distribution companies have a department called \"acquisitions,\" and the sole purpose of said department is to watch every movie they can get their hands on, and help the company decide which ones are worth buying. A typical person who works in acquisitions can watch upwards of 25 movies per week.\r\n\r\nRJ, your goal in life should be to become an acquisitions employee. Granted, you might have to cut back on your typical weekly movie intake, but I think you might enjoy it. I hear they fast forward through most of them too... so you've got that going for you as well.",
      "created_at": "2007-09-27T06:06:21.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "You guys did a lot. Congratulations. You forgot to mention Peter Dinklage.",
      "created_at": "2007-09-27T06:54:28.000Z"
    },
    {
      "author": "drm00se",
      "body": "Yeah, but they didn't <i>do</i> him... Did they???",
      "created_at": "2007-09-27T08:08:40.000Z"
    },
    {
      "author": "Master RJ",
      "body": "I only fast-forward if it's a bad movie.",
      "created_at": "2007-09-27T08:08:44.000Z"
    },
    {
      "author": "dan",
      "body": "^ right.",
      "created_at": "2007-09-27T09:18:53.000Z"
    },
    {
      "author": "Cosmik",
      "body": "Did I miss a post?  Who won the naming rights to the Cinebar this year?",
      "created_at": "2007-10-17T05:48:41.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
