{
  "id": 509,
  "title": "The \"Most Movies at The Moxie\" Award",
  "body": "<img src=\"http://img227.imageshack.us/img227/4530/collagepz2.jpg\">\r\n\r\nHere at The Moxie we like to keep a running tally on which actor or actress has appeared in the most Moxie movies. We thought maybe one day we'd create an actual trophy, and the winner of this illustrious award would be so excited that they're the pinnacle of indie acting in Springfield, that they would rush from Hollywood or New York or Ireland or wherever, and claim their prize. We'd hang out and reminisce about the good ol' days when we showed their films, and then when they won their next Independent Spirit Award, Golden Globe or Oscar, guess who would be the first mentioned? That's right. The Moxie. \r\n\r\nWe can dream, right?\r\n\r\nSo, after two years of showing films, here's how it stacks up so far:\r\n\r\nTHE FOUR FILM CLUB:\r\n<ul><li><b>Zach Stephens</b> with FOUR films (all local)! DUCK DUCK GOOSE, THE DRAWING ROOM DEBACLE, DEATH HAIR, and THE LAST ROMANTIC. This kid is going to go places, I tell you.</li>\r\n<li>And technically, Daniel Auteuil with THE CLOSET, CACHE, THE VALET, and MY BEST FRIEND, but one was a Moxie-A-Go-Go Event, so we're not sure if we've decided that counts yet or not. What do you think?</li></ul>\r\nThe THREE TIMERS include:\r\n\r\n<ul><li><b>Hope Davis</b>: Duma, The Matador, Proof</li>\r\n<li><b>Juliet Binoche</b>: Cache, Paris Je T'aime, Breaking and Entering</li>\r\n<li><b>Judie Dench</b>: Mrs. Henderson Presents, Notes on a Scandal, Ladies in Lavendar</li>\r\n<li><b>Laura Dern</b>: Inland Empire, Happy Endings, Year of the Dog</li>\r\n<li><b>Patrick Wilson</b>: Hard Candy, Little Children, Running with Scissors</li>\r\n<li><b>Daniel Auteuil</b>: The Closet (shown at a Moxie-a-Go-Go event)*, Cache, The Valet, My Best Friend</li>\r\n<li><b>Evan Rachel Wood</b>: Down in the Valley, Running with Scissors, King of California</li></ul>\r\nAnd a plethora of actors have appeared in two, including (but in no particular order):\r\n\r\n<ul><li><b>Cillian Murphy</b> (sigh): Breakfast on Pluto, The Wind that Shakes the Barley</li>\r\n<li><b>Gerard Depardieu</b>: The Closet (shown at Moxie-A-Go-Go Event)*, Paris Je T'aime, La Vie en Rose; he also directed a segment in Paris Je T'aime</li>\r\n<li><b>Margot Martindale</b>: Rocket Science, Paris Je T'aime</li>\r\n<li><b>Elijah Wood</b>: Everything is Illuminated, Paris Je T'aime</li>\r\n<li><b>Maggie Gyllenhaal</b>: Happy Endings, Paris Je T'aime</li>\r\n<li><b>Lieve Schrieber</b>: The Ten, The Painted Veil</li>\r\n<li><b>Edward Norton</b>: The Painted Veil, Down in the Valley</li>\r\n<li><b>Steve Buscemi</b>: Paris Je T'aime, Interview</li>\r\n<li><b>Miranda Richardson</b>: Paris Je T'aime, The Wah-Wah</li>\r\n<li><b>Bob Hoskins</b>: Paris Je T'aime, Mrs. Henderson Presents</li>\r\n<li><b>Emily Watson</b>: Wah-Wah, The Proposition</li>\r\n<li><b>Martin Freeman</b>: Breaking and Entering, Confetti</li>\r\n<li><b>Ray Winstone</b>: The Proposition, Breaking and Entering</li>\r\n<li><b>Richard Griffiths</b>: Venus, The History Boys, Harry Potter* (special event)</li>\r\n<li><b>Steve Coogan</b>: Tristram Shandy, Happy Endings</li>\r\n<li><b>Gillian Anderson</b>: Tristram Shandy, The Last King of Scotland</li>\r\n<li><b>Robert Downey, Jr.</b>: Kiss Kiss Bang Bang, Fur</li>\r\n<li><b>Ty Burrell</b>: Fur, Down in the Valley</li>\r\n<li><b>Joseph Cross</b>: Strangers with Candy, Running with Scissors</li>\r\n<li><b>Gwyneth Paltrow</b>: Proof, Running with Scissors</li>\r\n<li><b>Guillermo Toledo</b>: The Perfect Crime, Only Human</li></ul>\r\nOnly time will tell who will break out of the THREE TIMER CLUB, and into the four (or even five!) film realm. That Evan Rachel Woods looks like she might take the lead, since she's so young and seems to be the go-to girl of choice right now, but my bet is on Dame Judi Dench. She's got spunk.",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2007-09-29T02:24:15.000Z",
  "author": "Nicole",
  "comments": [
    {
      "author": "Master RJ",
      "body": "Can Evan Rachel Wood join the four time club with Across The Universe? Or are the reviews not up to snuff?",
      "created_at": "2007-09-29T04:12:12.000Z"
    },
    {
      "author": "drm00se",
      "body": "Hope Davis should join the club with Charlie Bartlett.\r\n\r\nI'm just sayin'...",
      "created_at": "2007-09-29T04:24:37.000Z"
    },
    {
      "author": "dan",
      "body": "This post was written by Nicole, btw.\r\n\r\n(I don't sigh at the very mention of Cillian Murphy's name)",
      "created_at": "2007-09-29T04:28:08.000Z"
    },
    {
      "author": "drm00se",
      "body": "Why did she write it under your account?",
      "created_at": "2007-09-29T04:34:01.000Z"
    },
    {
      "author": "nicole",
      "body": "(yes he does...but it's an exasperated sigh)\r\n\r\nBecause Dan set it up where the blog posts automatically go under his name.",
      "created_at": "2007-09-29T04:35:53.000Z"
    },
    {
      "author": "drm00se",
      "body": "What an overbearing jerk.\r\n\r\nI'm kidding. Please don't hit me again.",
      "created_at": "2007-09-29T04:51:23.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Poke.",
      "created_at": "2007-09-29T05:17:10.000Z"
    },
    {
      "author": "Ian",
      "body": "Laura Dern was in HAPPY ENDINGS?  Hmm.  I bet you're thinking of Tom Arnold.",
      "created_at": "2007-09-29T07:05:14.000Z"
    },
    {
      "author": "Master RJ",
      "body": "What is in October's calendar?",
      "created_at": "2007-09-29T07:16:31.000Z"
    },
    {
      "author": "brad",
      "body": "repeating rj's question",
      "created_at": "2007-09-29T08:33:48.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "i kind of assumed it was nicole by that point\r\nalso the fact that it says 'in no particular order'.. and cillian was up at the top.. heh...",
      "created_at": "2007-09-29T13:28:49.000Z"
    },
    {
      "author": "Master RJ",
      "body": "It's not Lieve, it's Liiiiiiieeeeeeeeevvvvvvvvvvvvv.",
      "created_at": "2007-09-29T13:34:06.000Z"
    },
    {
      "author": "drm00se",
      "body": "Yeah, I thought it was obvious that it was Nicole simply from the graphic (or at least obvious that she made the graphic).\r\n\r\nA Daniel Auteuil movie that looks interesting: Dialogue avec mon jardinier (Conversations with My Gardener). In typical Daniel Auteuil fashion, he plays a successful artist, weary of Parisian life and on the verge of divorce. Of course, my biggest reason for wanting to see it is because Élodie Navarre is in it :-)",
      "created_at": "2007-09-29T18:51:29.000Z"
    },
    {
      "author": "mackattic",
      "body": "colin firth! where is he? when will he be in a moxie movie?\r\nwah!\r\n\r\nedit. i guess this should have gone in the crushes category.",
      "created_at": "2007-09-29T19:14:13.000Z"
    },
    {
      "author": "Carson",
      "body": "Hmm, I think a couple other locals may have been in quite a few.  I know Rebecca Holopter was in both American Truth and Fiction and People in Motion, probably some others as well.  Nathan Shelton was in a few including People in Motion and Lucky Day for SATO.  I was in People in Motion, Death Hair, and I think something else that played at The Moxie.  Did Nine Grounds ever play here?",
      "created_at": "2007-09-30T22:01:42.000Z"
    },
    {
      "author": "drm00se",
      "body": "Yeah, but nobody actually saw any of those movies, Carson... Pfft. Loser.",
      "created_at": "2007-09-30T22:04:16.000Z"
    },
    {
      "author": "Carson",
      "body": "How hurtful...\r\n\r\nOh yeah, Dave Williams was the leading male in both Death Hair and American Truth and Fiction",
      "created_at": "2007-09-30T22:13:02.000Z"
    },
    {
      "author": "dan",
      "body": "That's true Carson; we have had many locals appear two, or even three times at The Moxie, but Zach is the current record holder. Luckily for other local actors, he just moved out to L.A., leaving the record wide open.",
      "created_at": "2007-09-30T22:14:54.000Z"
    },
    {
      "author": "nicole",
      "body": "I should probably make another category for local films...",
      "created_at": "2007-09-30T22:31:29.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Has Laura Linney really only been in <em>one</em> Moxie movie? She's like an indie queen.\r\n\r\nPatrick Wilson was in Running With Scissors? What was he?",
      "created_at": "2007-09-30T23:34:51.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "UPDATE: Justin Theroux has been in two: THE TEN and INLAND EMPIRE.",
      "created_at": "2007-09-30T23:36:16.000Z"
    },
    {
      "author": "Ian",
      "body": "<blockquote><cite>Posted By: dan</cite>That's true Carson; we have had many locals appear two, or even three times at The Moxie, but Zach is the current record holder. Luckily for other local actors, he just moved out to L.A., leaving the record wide open.</blockquote>\r\n\r\n...because he'll...never be in a movie big enough to play at the Moxie!  Snap!  Straight Cold Killah!",
      "created_at": "2007-10-01T02:47:22.000Z"
    },
    {
      "author": "drm00se",
      "body": "Ouch. Take that, Zach.",
      "created_at": "2007-10-01T03:35:09.000Z"
    },
    {
      "author": "ZombieKiller",
      "body": "Woah.  Not to be vain... but, I did appear in Lucky Day, Motor Home from Hell, People in Motion, Duck Duck Goose, and I don't know if it played at the Moxie or not... but I was in Pretend as well.  So even if it didn't play, I at least tied with the amazing Mr. Stevens... and I'm still here to do more.  AAAAHHAAAAmmmmuuuaaaHHHHHHH...  sorry again abou the vanity... I have been meaning to get on this for a while and this seemed as good a topic as any to start.",
      "created_at": "2007-11-11T08:34:53.000Z"
    },
    {
      "author": "nicole",
      "body": "We didn't show Pretend, but now we'll have to make sure you are up there on the list!\r\n\r\nI forgot to factor in SATO48 films and Moxie Shorts!",
      "created_at": "2007-11-11T09:32:41.000Z"
    },
    {
      "author": "Zachary Stevens",
      "body": "I agree with Ian! Zach Stephens is a stoopid n00b. Who cares that he was also in Motor-home from Hell, Flying Tiger, wrote and appeared in People in Motion. I'm glad he is in L.A. with the rest of those failing wannabe actors. Zack Stevens however is totally r0xx0r tho   ...also wasn't that loser in a few shorts that went to the moxie...? >:-P\r\n   ZombieKiller just wants his money to be left on the dresser, chocolate.",
      "created_at": "2007-11-15T03:36:51.000Z"
    },
    {
      "author": "nicole",
      "body": "Oh dear. Did I spell someone's name wrong?",
      "created_at": "2007-11-15T04:43:10.000Z"
    },
    {
      "author": "Zachary Stevens",
      "body": "Everyone misspells it. No big deal to me :) How are things in Springfield?",
      "created_at": "2007-11-15T06:11:16.000Z"
    },
    {
      "author": "dan",
      "body": "Zach! Now that you're out in LA you have a chance to kill Shia LaBeouf and take his place in INDY 4!!! Don't fail us now... all of Springfield is counting on you!",
      "created_at": "2007-11-15T23:14:43.000Z"
    },
    {
      "author": "Zachary Stevens",
      "body": "I'll get him!!! ;)  I've been confused for him twice in the two weeks that I've been here.",
      "created_at": "2007-11-17T15:59:30.000Z"
    },
    {
      "author": "drm00se",
      "body": "That's a good sign, right?",
      "created_at": "2007-11-17T20:22:07.000Z"
    },
    {
      "author": "EdMo",
      "body": "WTG Zachary!!!!!!!!!!!!!!!!!\r\n\r\nThat's one 7331 dude.",
      "created_at": "2007-11-19T04:03:43.000Z"
    },
    {
      "author": "Zachary Stevens",
      "body": "Professor Henry Jones: They're trying to kill us.\r\nIndiana: I KNOW DAD!\r\nProfessor Henry Jones: Well, it's a new experience for me.\r\nIndiana: Happens to me all the time.",
      "created_at": "2007-11-20T02:25:59.000Z"
    },
    {
      "author": "Ian",
      "body": "I wasn't calling you a nub, Zach, but pointing out that Dan was subtly calling you one.\r\n\r\nThe difference is academic, though, I suppose, when Dan and I share a million of our DNA.",
      "created_at": "2007-11-20T10:29:29.000Z"
    },
    {
      "author": "dan",
      "body": "That's all well and good Ian, except for the fact that Nicole wrote this post, thus being the one to subtly imply that Zach was a n00b.",
      "created_at": "2007-11-20T13:36:33.000Z"
    },
    {
      "author": "nicole",
      "body": "I don't even know what a n00b is.",
      "created_at": "2007-11-20T22:39:01.000Z"
    },
    {
      "author": "Zachary Stevens",
      "body": "I am a n00b!  I have nooooo idea what I am doing out here, or even how to get started.  Although I hope to one day grace the screens of the Moxie again!  We'll see, I have a few tricks up my sleeve ;)",
      "created_at": "2007-11-21T06:12:20.000Z"
    },
    {
      "author": "Master RJ",
      "body": "A n00b I'm pretty sure is like a boob: a big, dumb idiot with screws and nuts for brains.",
      "created_at": "2007-11-21T06:43:26.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "<blockquote><cite>Posted By: Master RJ</cite>A n00b I'm pretty sure is like a boob: a big, dumb idiot with screws and nuts for brains.</blockquote> Yeah, RJ's right. I'm pretty sure only girls have girls have noobs. On their chests!",
      "created_at": "2007-11-21T07:40:52.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 7,
      "name": "Lists"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
