{
  "id": 51,
  "title": "What the fork?!",
  "body": "I have some good news and some bad news. The bad news is that the world's largest fork - the very same fork that single-handedly pulled Springfield from the murky depths of obscurity and thrust it into the international spotlight as the world's foremost leader in the exhibition of enormous pieces of silverware - is gone. I know, I can't believe it either. Somewhere someone has their hands on a giant fork, and I want it back. So what's the good news, you ask? The goods news is that I just saved a bunch of money by switching my car insurance to Geico. Ha ha ha ha! Seriously though, I use Geico and I save money. The <i>real</i> good news is that I have a picture of Springfield's famous fork for everyone to look at! Before you view the picture, please take the following into consideration:<br/><br/><ul><li>This isn't a <i>real</i> picture of the world's largest fork, in the sense that it's not really the same gigantic fork, it's not located in the same area where the world's largest fork once stood, and the gold medal winner of the women's all-around in gymnastics, Ms. Carly Patterson, has (or had) never jumped around the fork when it was still standing... at least to my knowledge.</li><br/><li>I tried to find an actual picture of the fork, but no one in the whole entire world of Google's image search has one.</li><br/><li>I also couldn't find a picture of the location where the fork used to stand, so I decided to use a picture of one of the 14,000 hospitals in Springfield. The little lake in front of the hospital has ducks in it... ducks that I've fed... and given names.</li><br/><li>The only factual, well-researched part of the photo is that the fork is most likely the height of 7 of Carly Patterson's leg splits.</li></ul><br/>So, with that being said, here's a <a href=\"http://moxie.danchilton.com/pix/grum/75_fork.jpg\" target=\"_blank\">picture of the world's largest fork</a>, which during a simplier, more peaceful era, graced Springfield's skyline. If any of the Springfield readership happens to have a <i>real</i> picture of the world's largest fork, or knows what happened it, please let me know. I'd like to buy the fork and live beneath it. Just me, Nicole, Bogey and the fork.<br/><br/>So, I read the <a href=\"http://www.boingboing.net/2004/08/22/movie_theater_repurp.html\" target=\"_blank\">article</a> that was suggested to me by <b>Anon</b> in the comments of Friday's post. What a great idea! Not so much for X-Box or PS2 games, but definitely for old school Nintendo games. For those of you who didn't get a chance to read the article, here's the gist of it:<br/><br/><i>Theater managers took four video projectors, set one up in each of four theaters with a Microsoft XBox video game system connected to it, and then let the fun begin for more than 60 people.<br/><br/>\"Tonight blew our minds,\" theater co-owner Calvin Timothy said afterward. \"We're definitely going to keep doing this.\"<br/><br/>The game Friday night: \"Halo\" -- a first-person shoot-em-up game in which four people can play on a team against four others. The evening was set up in a tournament format where 16 teams battled each other until the wee hours of Saturday morning to find out who the kings of gaming are in the valley.</i><br/><br/>I can vision it now: Moxie Mario Madness, Tetris tournaments, Dr. Mario double elimination brackets! The list could go on and on. The problem with modern games is that they tend to be too male-centric, but original NES games harken back to a more gender neutral time when girls and boys alike played video games like they were going out of style. Truth be told, I still play my original NES several times a week, which keeps my Tetris skills honed to a fine point. I am, by the way, the world's greatest NES Tetris player... and I've given names to a couple ducks that I fed once.<br/><br/>Uh oh, time keeps on slippin', slippin', slippin' into the future. Until we meet again, keep it real, keep it fresh, and keep it... something similarly related to coolness.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-08-24T00:22:06.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "whitty",
      "body": "You did go look for the fork at Chesterfild Village and NOT on Glenstone, right?.  'Cause the moved it to C.V. a while back.  The Fork is owned by the same people who own C.V.  I called the library to confirm the forks location and as far as they know, it is still there.  Maybe I will go see a $1 movie in the craptastic Palace and take a pic for you.",
      "created_at": "2004-08-24T01:41:57.000Z"
    },
    {
      "author": "Oz",
      "body": "Really big tetris?  Sounds scary.  But I guess the real question is how do you make money off of it?  In the article, they had 16 teams competing.  How much would you have to charge each team if they were going to take over your theater during a prime dating/go to the movies night like Friday?",
      "created_at": "2004-08-24T02:20:47.000Z"
    },
    {
      "author": "bjork24",
      "body": "Whit, we went to Chesterfield Village, and it's gone. Unless they've moved it yet again, I have no idea where it went.<br/><br/>Oz, it wouldn't be really \"prime\" time, most likely it would take the place for a Friday or Saturday late night showing. I suppose we could charge people to play  or require that they buy a beverage once every 10 minutes... just like a strip club!",
      "created_at": "2004-08-24T03:21:13.000Z"
    },
    {
      "author": "Newell",
      "body": "You should get that one NES game where you have the pad that people step on in order build a hamburger. It was like a predecessor to all these modern dance games. And to me, hamburger construction is a far nobler endeavor than just dancing in tune to a bunch of arrows on the screen. But that's just me...",
      "created_at": "2004-08-24T04:06:27.000Z"
    },
    {
      "author": "whitty",
      "body": "I can't believe the library failed me.  I'll call the firm that owns the piece tomorrow - they are a nationwide group so The Fork may have gone out of town - gasp!",
      "created_at": "2004-08-24T04:18:46.000Z"
    },
    {
      "author": "bjork24",
      "body": "Newell, I haven't the slightest idea what game you're talking about, but if it's even 1/8 as cool as it sounds... we're getting it.<br/><br/>Whit, you must find out what happened to the fork... whatever the cost.",
      "created_at": "2004-08-24T05:03:08.000Z"
    },
    {
      "author": "Newell",
      "body": "Dan, I've done some research to aid my feeble brain. The game I was thinking of is called Short Order! It was part of a two-in-one game cartridge for the NES. The second game was called Eggsplode.<br/><br/>In Short Order, you played the part of a short order cook. Various animals come into your restaurant and order burgers with certain ingredients (meat, cheese, lettuce, tomato). You have to build the burgers by stepping on certain combinations of buttons on the NES Power Pad. <br/><br/>Basically you'd start out building a burger with just meat and cheese. Then one with meat, cheese, lettuce. Then meat, cheese, lettuce, meat. Ingredients would keep getting added on and you had to remember the order they came in and step accordingly. It was actually kind of fun. Gotta' have the Power Pad though.",
      "created_at": "2004-08-24T08:36:48.000Z"
    },
    {
      "author": "James",
      "body": "We do that at the Fleur in Des Moines every once in a while.  Basically, anytime we rent an LCD projector for a special event, we bring in the X-Box and play some Halo or some Tiger Woods golf.",
      "created_at": "2004-08-24T12:08:24.000Z"
    },
    {
      "author": "bjork24",
      "body": "Newell, it might be tough to use the power pad in a tiny auditorium, but who knows... it's a dream.<br/><br/>James, how do you guys charge when you have X-Box nights?",
      "created_at": "2004-08-24T17:20:38.000Z"
    },
    {
      "author": "whitty",
      "body": "The Fork was put in storage LAST WEEK for undisclosed reasons.  The owners claim that it will be returned shortly to nearby its C.V. location.  Apparently, even The Fork went out of town last weekend, too.",
      "created_at": "2004-08-24T17:32:18.000Z"
    },
    {
      "author": "bjork24",
      "body": "Whitty, I can't believe they'd take the fork down! Why would they do such a thing? Perhaps they're adding a spoon to go along with it. That would be cool.",
      "created_at": "2004-08-24T17:43:07.000Z"
    },
    {
      "author": "einahpets",
      "body": "What the fork?! Just last December it was in Chesterfield. Very peculiar. Did you look inside McGuffy's? They may have needed additional silverware.",
      "created_at": "2004-08-24T19:05:45.000Z"
    },
    {
      "author": "whitty",
      "body": "hey, you said you might have pics of the Moxie for us.  Gimme! Gimme!",
      "created_at": "2004-08-25T00:28:01.000Z"
    },
    {
      "author": "bjork24",
      "body": "Eina, I'm going to fork you if you're not careful.<br/><br/>Whit, yes, indeed I did say I \"might\" have pictures. Hmm, I'll post them in an hour or three.",
      "created_at": "2004-08-25T00:34:52.000Z"
    },
    {
      "author": "Tim",
      "body": "Huh.  I read Newell's post and immediately thought of BurgerTime:<br/><br/>http://www.violetshivers.com/John/Burgertime/history/btarcade.html<br/><br/>And Dan, which version of Tetris do you have?  The traditional Nintendo one:<br/><br/>http://www.vgmuseum.com/pics/tetris.html<br/><br/>or the uber-rare and much-loved \"Tengen's Tetris\" version?<br/><br/>http://ryangenno.tripod.com/sub_pages/VGCS-Tetris.htm",
      "created_at": "2004-08-25T02:05:10.000Z"
    },
    {
      "author": "Newell",
      "body": "Dan, yes, making room for the Power Pad might be difficult. But damn if jumping around like a spaz to make burgers isn't fun!<br/><br/>Tim, I was thinking it was Burger Time at first too but it turned out that I had my burger games confused.",
      "created_at": "2004-08-25T03:42:18.000Z"
    },
    {
      "author": "Trinity",
      "body": "There is a bar here in D.C. that has old skool Atari set up with tons of games (I suspect donated).  It's tons of fun.  Bring on the River Raid!",
      "created_at": "2004-08-28T22:28:10.000Z"
    },
    {
      "author": "C.",
      "body": "there is a pic of the fork that can be found here.<br/>http://www.roadsideamerica.com/roger/QueryTips.php3?offset=140&tip_State=MO",
      "created_at": "2006-01-05T22:52:52.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
