{
  "id": 510,
  "title": "Moxie Shorts are due on <strike>Friday</strike> Saturday!",
  "body": "Hey guys and gals... sorry I haven't posted in awhile. I promise I'll write a nice juicy post in the near future, but in the meantime, this strictly informational one will have to do.<br/><br/>If you're working on a short film for Moxie Shorts 2007, the deadline is this <strike>Friday</strike> Saturday! Our last movie will end at 11:00 pm, so that will be the absolute latest we will accept entries. Good luck everyone!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-10-16T07:53:30.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "drm00se",
      "body": "Guess I'm not participating this year.",
      "created_at": "2007-10-17T06:37:20.000Z"
    },
    {
      "author": "CinemaUntapped",
      "body": "I am so excited about this.  I can't wait to see all the projects, even if nobody seems to want to talk about them here.",
      "created_at": "2007-10-18T03:37:12.000Z"
    },
    {
      "author": "dan",
      "body": "The entries are starting to trickle in, but I imagine if it's anything like last year, we'll get the vast majority of them on Friday.",
      "created_at": "2007-10-18T03:47:43.000Z"
    },
    {
      "author": "Caleb",
      "body": "Well it turns out the one I was going to submit (Aline's Holiday) is a few minutes too long. Plus I don't have it on a DVD without a menu, and don't have time to burn it! DAMN! Oh well, it's already played at the Moxie, so it's all good.",
      "created_at": "2007-10-18T04:11:49.000Z"
    },
    {
      "author": "nicole",
      "body": "I heard we have a few music videos coming in, which I'm excited about.",
      "created_at": "2007-10-18T04:57:33.000Z"
    },
    {
      "author": "Cosmik",
      "body": "I hope the best of these shorts are youtubed (is that a verb?) so I can see them here too.  I greatly enjoyed the shorts I saw last year.<br/><br/>(Yes, Brian, I've left that one wide open for you.  HAH.  That one too.)  :)",
      "created_at": "2007-10-18T08:46:32.000Z"
    },
    {
      "author": "HonkeyHero",
      "body": "I hope to have a trailer done by then... (before they show, not by friday...)",
      "created_at": "2007-10-18T17:50:22.000Z"
    },
    {
      "author": "drm00se",
      "body": "<blockquote><cite>Posted By: Cosmik</cite>I hope the best of these shorts are youtubed (is that a verb?)</blockquote><br/>It is now.",
      "created_at": "2007-10-18T20:58:55.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "Yeah i know for sure that one of the movies is an \"official\" MuteMath video",
      "created_at": "2007-10-18T21:06:33.000Z"
    },
    {
      "author": "nicole",
      "body": "Woohooooooooooo!",
      "created_at": "2007-10-18T22:52:59.000Z"
    },
    {
      "author": "nicole",
      "body": "Mute Math was on Conan last night.",
      "created_at": "2007-10-18T22:53:13.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "Yeah it's Nate Black and Brandon Goodwin's entry, it has  . . . wait . . . maybe they want it to be  surprise . . . never mind",
      "created_at": "2007-10-18T23:10:05.000Z"
    },
    {
      "author": "HonkeyHero",
      "body": "yep, it's awesome... Talented fellows for sure",
      "created_at": "2007-10-19T01:30:12.000Z"
    },
    {
      "author": "Caleb",
      "body": "<blockquote><cite>Posted By: thewayofthedinosaur</cite>Yeah i know for sure that one of the movies is an \"official\" MuteMath video</blockquote>That is flipping cool.",
      "created_at": "2007-10-19T05:14:59.000Z"
    },
    {
      "author": "CinemaUntapped",
      "body": "So any word yet on schedule or show times?",
      "created_at": "2007-10-30T04:26:05.000Z"
    },
    {
      "author": "nicole",
      "body": "We'll be posting them later tonight. Almost finished!<br/><br/>And we watched them all this weekend. Wooowwweeee, they're good this year!",
      "created_at": "2007-10-30T04:38:27.000Z"
    },
    {
      "author": "CinemaUntapped",
      "body": "I'm peeing my pants with excitement!",
      "created_at": "2007-10-30T04:39:43.000Z"
    },
    {
      "author": "dan",
      "body": "Ok, all the selected shorts fit into a perfect two hour slot, which means you can see all the shorts by coming to just one showing. And here they are:<br/><br/>Friday, November 16th @ 7:00 pm<br/>Saturday, November 17th @ 4:30 pm<br/>Sunday, November 18th @ 2:00 pm<br/><br/>There will be at least one (possibly more) audience awards.",
      "created_at": "2007-10-30T04:42:41.000Z"
    },
    {
      "author": "CinemaUntapped",
      "body": "did I get in?",
      "created_at": "2007-10-30T05:09:25.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Do you want me to judge this year?",
      "created_at": "2007-10-30T05:50:54.000Z"
    },
    {
      "author": "dan",
      "body": "Yeah you did. Your film was really well done too! There were only two documentaries this year (yours and another guy's), but we're still thinking of having a separate category for best doc, which means you'd have a 50/50 shot of winning that one. We'll have to discuss it a bit more. We'll announce all the categories later in the month.",
      "created_at": "2007-10-30T05:57:49.000Z"
    },
    {
      "author": "dan",
      "body": "I think we might just do audience awards this year. If not, we'll let you know.",
      "created_at": "2007-10-30T05:59:21.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "YAy! I was hoping I wasn't going to miss out if I couldn't come on sunday!!! Now I know! Knowledge! owls!",
      "created_at": "2007-11-03T19:11:16.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
