{
  "id": 512,
  "title": "A big boring post about my new tattoo... and stuff",
  "body": "Hello. Allow me to reintroduce myself: my name is Dan, and I run The Moxie alongside my beautiful wife Nicole. I also write posts for this blog, which is something I used to do with a lot more frequency and sincerity. Over the years, my post output has waned, and the articles I found time to write began to devolve into strictly Moxie-related fare, which helped Nicole sleep a little better at night (and throughout the day). Apparently, in the heady days of our budding business, I divulged too much information, such as my bowel movements and our attendance records. I quickly learned that most readers didn't need to know about such things, so I clammed up, causing the blog to lose a bit of its innate humanity, mainly in the form of my colonic health.<br/><br/>Today I'm here to reconnect with our readers. If you have no interest in the lives of the people behind The Moxie, feel free to skip this one and wait for the next Moxie-related post. If, however, you're the slightest bit curious about how Nicole and I have been doing over the last year, this post is for you. Is anyone still with me? No one? Ok, good... on to my bowel movements.<br/><br/><b>Side jobs</b><br/><br/>Nicole and I both have side jobs that keep us busy in our free time. Now, don't read into that too much. The Moxie pays the bills, 100%, but we quickly found that if we spent some of idle work doing something lucrative, we'd have more money to waste on Taco Bell and new shoes. Nicole freelances for our old company in St. Louis, performing pretty much the same job she did when we were mere cogs in the corporate machine. She's good at her job, and it makes her enough money to splurge on fancy winter coats and the occasional trip to Andy's. I didn't leave on as good of terms as Nicole did, so I've had to look elsewhere for additional work.<br/><br/>At first I dabbled in web development, which is something I still enjoy a great deal, and consider myself more skilled than the average joe. I'm not, however, particularly enamored with the idea of keeping a growing list of needy clients happy. I still help out friends from time to time, but for the most part my web development has been focused on Moxie ventures (<a href=\"http://www.moxieshorts.com\" class=\"broken\">moxieshorts.com</a>, <a href=\"http://www.ozarksairguitar.com\" class=\"broken\">ozarksairguitar.com</a>, <a href=\"http://www.rhpsmo.com\" class=\"broken\">rhpsmo.com</a>, Moxie mobile, etc.). Instead of working on other people's websites, I decided to try something else I enjoy: writing.<br/><br/>Several months ago, I was hired on as a freelance writer for <a href=\"http://www.diylife.com\">DIY Life</a>, which is part of Weblogs Inc., which is owned by AOL, which Google owns a 5% share in... so, in a round-about way, I'm working for Google (AOL) (Weblogs Inc.). I wrote about various DIY projects, from mixing your own weed killer to recycling used electronics, until I was eventually promoted to co-editor along with the guy who founded the site. Now I spend more time editing than I do writing, but I still find this a great deal more enjoyable than spending all night playing Pinch Hitter 2, and the extra income allows me to blow money on Taco Bell and tattoos, which my mom is none too happy about.<br/><br/>Long story short, these side jobs allow Nicole and I to take off our Moxie hats on occasion, which keeps us from being totally burned out. When you work as much as we do, you have to find ways to take your mind off the endless monotony of your day-to-day existence, and since we don't have the luxury of what most people refer to as \"weekends,\" we find other ways to give our brains a break. We've also been trying to get away from the theater whenever our time and budget allows, which is infrequently at best. That might sound like I'm throwing myself a pity parade, but that's not the case. Nicole and I love working at The Moxie -- if we didn't, I don't think we would've lasted this long -- and we can't imagine ourselves doing anything else.<br/><br/>Blah, blah, blah. Work. Money. That's enough of that talk.<br/><br/><b>My tattoo</b><br/><br/>I'm going to be a bit vain for a moment, and talk about my tattoo. Several people have expressed surprise at my getting a tattoo, claiming they \"didn't think I was the type,\" so I'm going to lay out all the reasons I decided to adorn my skin, and then, when people ask me in the future, I'll just tell them to read this post. This is about as non-Moxie-related as you can get, so I hope you enjoy. Ok, why in the world would I want a tattoo?<br/><br/><ol><li>I've always thought tattoos were cool, especially when they're meaningful and/or incorporated into a unique feature on the person on which they're adorned.</li><br/><li>Tattoos create an incongruity between perception and reality, which is something that I think encapsulates a lot about my own personality. Honestly, I don't think many people would peg me as a business owner at first glance -- my wardrobe is almost exclusively made up of t-shirts, jeans, and a colorful array of Cardinals hats; I don't shave any closer than Don Johnson stubble; and I drive a beat-up car that can barely make it from the theater to Taco Bell three times a week. But as the old saying goes, the clothes don't make the man... or maybe it's the other way around. I'm sure you're familiar with the old tattoo misperception from movies: where the big, burly, tattooed guy ends up being a total softie. Good or bad, I like that tattoos make people think a certain way about the wearer. When Ian (a Moxie regular) saw my tattoo, he asked if it made me feel tougher. \"Not really,\" I said. \"I don't think tattoos make you look tough.\" \"But your opponents will,\" Ian quipped. Indeed.</li><br/><li>For reasons unknown, but most likely subconscious, the idea of having a permanent mark(s) on my skin is appealing. Maybe it's because I grew up with a big scar on the back of my head.</li></ol><br/>So that's the \"why\" behind my new tattoo, and although I'm destined to get more in the future, I do have personal limitations on where they'll end up (arms and chest only). My first tattoo is an <a href=\"http://www.ffkatmff.com/comments.php?DiscussionID=1172&page=1#Item_28\" class=\"broken\">upside down OK on my right arm</a>, which you can plainly see when I'm wearing a short-sleeved shirt. Significance:<br/><br/><ol><li>I've always been attracted to words (thus the English major / Linguistics minor), and on a smaller scale, letters. OK is nice because it's both optimistic and affirmative. When I look down at my arm, it says \"OK.\" When I look in the mirror, it says \"OK.\" When everyone else sees it... it's an upside down OK.</li><br/><li>Thanks to a cluster of moles that form a near perfect equalateral triangle on my arm, the tattoo resembles a little stick person when you tilt your head.</li></ol><br/>So that's tattoo number one. I have four more planned, and possibly more... though I haven't thought of them yet.<br/><br/><b>Other news?</b><br/><br/>Not much. This post has really zapped me. It took me nearly two days to write, mainly because I keep getting distracted or had to deal with a more pressing matter (i.e. bowel movement).  In the end, this ended up being more about my tattoo than our life outside The Mox, but... oh well. You know how those things go sometimes. Thanks for sticking with me, if you've read this far. I'll check back in with other non-Moxie-related events as they happen. Until then, adios!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-10-25T08:29:24.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "The Four Finger Soc Em",
      "body": "So tell us about these bowel movements, Dan. You're a real tease. So many hints and cliffhangers. We talkin' about Type 2, 3, 8?? What's goin' on in there, eh?",
      "created_at": "2007-10-25T09:30:52.000Z"
    },
    {
      "author": "dan",
      "body": "You're disgusting!",
      "created_at": "2007-10-25T09:33:29.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Any interested Moxie patron would want to know about your health. I'm just a loyal fan checking in on your bum goods.",
      "created_at": "2007-10-25T10:25:46.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Where's the November schedule?!",
      "created_at": "2007-10-25T12:59:07.000Z"
    },
    {
      "author": "nate",
      "body": "DAN HOW DID YOU GET THAT SCAR ON YOUR HEAD DO TELL US",
      "created_at": "2007-10-25T16:31:10.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Dan's next tattoo: meat.",
      "created_at": "2007-10-25T16:44:31.000Z"
    },
    {
      "author": "Ole",
      "body": "Now that your unblocked (I assume) I'd love to see a new phlog.  How about a RHPS phlog!",
      "created_at": "2007-10-25T18:56:44.000Z"
    },
    {
      "author": "dan",
      "body": "<blockquote><cite>Posted By: Ole</cite>Now that your unblocked (I assume) I'd love to see a new phlog.  How about a RHPS phlog!</blockquote><br/>Not a bad idea.",
      "created_at": "2007-10-25T20:43:29.000Z"
    },
    {
      "author": "Ian",
      "body": "\"Heh heh, bum goods,\" I quip.",
      "created_at": "2007-10-25T21:16:35.000Z"
    },
    {
      "author": "mackattic",
      "body": "inspiring!<br/>except for the poop thing.",
      "created_at": "2007-10-25T23:35:06.000Z"
    },
    {
      "author": "cshuntley",
      "body": "Ever gonna announce \"Kurt Cobain About A Son\" for November 2? Thats still happening, right?",
      "created_at": "2007-10-26T06:34:55.000Z"
    },
    {
      "author": "Cosmik",
      "body": "I like the OK.  It's whimsical.  No one here remembers Scott Sauer and Mike Mayhew's \"Lethargic Boy\" comic, but Ned and I have both appeared in it.  Someday I'll get a tatt that incorporates our comic avatars.",
      "created_at": "2007-10-26T06:36:31.000Z"
    },
    {
      "author": "Master RJ",
      "body": "I would love to see a film that makes fun of Cobain, Lynyrd Skynyrd, Jimi Hendrix, Janis Joplin, Mama Cass and other dead musicians by parodying their legacies and their legions of poser fans.",
      "created_at": "2007-10-26T08:26:41.000Z"
    },
    {
      "author": "Caleb",
      "body": "Oh, RJ.",
      "created_at": "2007-10-26T09:42:13.000Z"
    },
    {
      "author": "drm00se",
      "body": "This is probably my favorite blog post yet.",
      "created_at": "2007-10-27T10:16:48.000Z"
    },
    {
      "author": "Cosmik",
      "body": "Back when I worked at Radio 2000, there was a Z104.1 intern whose name escapes me, but he volunteered to be the butt of every joke on the morning show (I think they decided if he kept doing stupid stuff, they'd give him a vacation somewhere.  I don't know if he ever got his trip.)  One of the things he had to do was get \"Spankmeister\" (one half of the morning team) tattooed on his left arm, which he did, in hot pink script, with a little heart dotting the i.  Seriously.  What's he gonna tell his kids?",
      "created_at": "2007-10-27T21:21:14.000Z"
    },
    {
      "author": "Jonny Greenwood vs The Ebola Virus",
      "body": "Dan, I'm gonna pretend you got a Radiohead tattoo! Olive you!",
      "created_at": "2007-10-27T21:36:40.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
