{
  "id": 515,
  "title": "Moxie Shorts 2007 winner announcement",
  "body": "For those of you who didn't know, we screened ten local short films for Moxie Shorts 2007 last weekend. The films ranged from campy comedy to risque documentary and everything in between. We were incredibly pleased with the turnout this year, both for film submissions and overall audience, and are already looking forward to another successful event next year. We'd also like to thank our panel of judges: Missy Shelton (KSMU news producer), Steve Olson (Missouri Film Alliance of Springfield President), and James Owen (KY3 film critic). Together, their valuable input determined the Best Student Film and the Best Overall Film among the ten entries.\r\n\r\nI felt that this year's group of films offered proportionate competition among several of the shorts, but the judging ballots and audience polls told a different story. DUCK DUCK GOOSE swept all three awards this year -- Best Student Film, Audience Favorite Award, and Best Overall Film! Congratulations to Nathan Springer and the entire cast and crew of DUCK DUCK GOOSE! Other shorts that were mentioned highly by the judges, and voted on by the audience were (in no particular order): WAKE IT UP, PAPER DARREN, CARPE DIEM, and FETISH SHOW.\r\n\r\nFor winning the awards, DUCK DUCK GOOSE will receive a free Moxie bulk pass, as well as this incredibly expensive solid gold statuette:\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/112007/trophy.jpg\" width=\"425\" />\r\n\r\nCongratulations again to the winner, and a huge THANK YOU to all of this year's participants and audiences. We'll see you all again in 2008!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-11-21T09:06:37.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Master RJ",
      "body": "Was the head based from my head? I do like the body and pants though.",
      "created_at": "2007-11-21T09:42:22.000Z"
    },
    {
      "author": "nate",
      "body": "I can't stop laughing at the statue.  The statue itself is comedy, uh, <em>gold </em>(good job nicole) but the exquisitely framed photo with the gleam of light puts it well over the top.  (good job... dan?)\r\n\r\nOr was it photoshopped?",
      "created_at": "2007-11-21T10:10:55.000Z"
    },
    {
      "author": "nicole",
      "body": "First of all, those are shorts. For Moxie Shorts.\r\n\r\nSecond of all, the winning film also gets shown before a feature sometime during the upcoming year.\r\n\r\nCongrats to everyone for a successful showing!",
      "created_at": "2007-11-21T11:24:06.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Is that a Conan doll?",
      "created_at": "2007-11-21T12:44:26.000Z"
    },
    {
      "author": "drm00se",
      "body": "Fantastic! Great job Danicole! Great job Moxie Shorts partici(pants)! This was such a great show. I'm so glad I made it this year.",
      "created_at": "2007-11-21T13:11:06.000Z"
    },
    {
      "author": "Master RJ",
      "body": "<blockquote><cite>Posted By: nicole</cite>First of all, those are shorts. For Moxie Shorts.\r\n\r\nSecond of all, the winning film also gets shown before a feature sometime during the upcoming year.\r\n\r\nCongrats to everyone for a successful showing!</blockquote>\r\n\r\nSelect shows or all shows?",
      "created_at": "2007-11-21T13:13:31.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "<blockquote><cite>Posted By: nicole</cite>First of all, those are shorts. For Moxie Shorts.</blockquote>i got this right away.. and *loved* it",
      "created_at": "2007-11-21T13:52:35.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "Yay! Yay Ryan! yay Nate Black! Yay person who actually won although i didn't actually get to see all the shorts! **grumbling fading off into the distance**",
      "created_at": "2007-11-21T21:59:20.000Z"
    },
    {
      "author": "nicole",
      "body": "<blockquote><cite>Posted By: The Four Finger Soc Em</cite>Is that a Conan doll?</blockquote>\r\n\r\nI wish. It's Surfer Ken.",
      "created_at": "2007-11-21T23:42:33.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Oh yeah, I remember you telling me that. But someone should get a hold of Conan and let him know that they are basing surfer Ken dolls on his likeness.",
      "created_at": "2007-11-22T00:04:29.000Z"
    },
    {
      "author": "EdMo",
      "body": "Congrats to Duck Duck!",
      "created_at": "2007-11-30T01:03:58.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
