{
  "id": 518,
  "title": "Wehrenberg Theatres announces imminent buyout",
  "body": "<a href=\"http://sbj.net/article.asp?aID=19756172.2403659.1036451.4697403.8982554.700&aID2=79718\" class=\"broken\">Word on</a> <a href=\"http://www.stltoday.com/stltoday/business/stories.nsf/story/8FBB72FA622B43F4862573AE000B5867?OpenDocument\" class=\"broken\">the street</a> is that Wehrenberg Theatres is looking for a buyer, which means the Campbell 16 will have a new name in the near future. Wehrenberg is the oldest theater chain in the country, and basically owns the St. Louis exhibition market, so this announcement came as quite a shock. It does, however, afford me the opportunity to relate the theater industry to one of my favorite hobbies, baseball, and treat their imminent sale like a key offseason free agent signing. So, without any further ado, let the prognosticating begin!\r\n\r\nBefore we discuss who might buy Wehrenberg, we need to examine what they have to offer that would make them an attractive purchase for another chain. First, and most important, is the fact that s/he who owns Wehrenberg, owns St. Louis's cinematic market share. Being able to hand deliver a major market like St. Louis is a big deal in the exhibition industry, and would be a huge advantage to a chain that's looking to solidify their holdings. Secondly, Wehrenberg isn't small potatoes -- they currently have over 200 screens situated in 17 theaters (11 of which are in the greater St. Louis area) spread out over four states (Missouri, Illinois, Iowa, Minnesota). On top of that, they also have the Midwest's largest screen, as well as a brand new IMAX, both of which are in St. Louis. That's a tasty chunk of cinematic property!\r\n\r\nNow, let's look at Wehrenberg's warts -- what are some of the factors that might keep it from attracting a top-dollar bid. First, it's firmly rooted in the Midwest. I'm not saying there's anything wrong with that (I live here too!), but some of the bigger chains might be looking for more traditionally cinematic saavy markets. Secondly, typical Wehrenberg decor is the epitome of what the movie theater industry is trying to distance itself from: bright neon colors, gaudy design aesthetic, large, loud arcade areas that are progressively taking up more and more lobby space. I'm sure there are other smaller problems, but I don't want to get nit-picky. Also, hidden internal problems could affect the sale as well, but those are beyond our realm of knowledge, as they should be, so we won't waste any time imagining if they exist or not.\r\n\r\nSo, who might be interested in this fair queen of Midwest cinematic integrity? Let's take a look (in alphabetical order).\r\n\r\n<b>AMC Theatres</b> - AMC is to theaters, as the Red Sox are to baseball. They're the second largest movie theater chain in the US, and are based a stone's throw away (albeit a strong throw) in Kansas City. AMC has been aggressive with their mergers and acquisitions, recently merging with Loews and holding interests in over 350 additional theaters in the United States and abroad. Their purchase of Wehrenberg would give them a virtual lock on the Missouri market, and make it increasingly difficult for other theaters (including yours truly) to get a foothold. AMC has recently initiated the \"<a href=\"http://www.amctheatres.com/amctheatres/user-controller/select\" class=\"broken\">AMC Select</a>\" program, where they've been devoting one or two screens per multiplex to the sole purpose of playing crossover films (films that are big enough to draw attention, but are catered toward arthouse crowds -- also fondly referred to as \"the films that pay The Moxie's bills\"). Obviously, having an AMC Select theater set up shop in Springfield would be disastrous for our business. It might not kill us completely, but it would probably put us on our death bed. AMC theaters are known for their classy, subdued interior design, which would mean they'd have to invest a lot of money bringing Wehrenberg's properties up to standards. Even still, that's the only obstacle I can think of that might give AMC pause over the acquisition. Smart money's on AMC, unfortunately.\r\n\r\n<b>B&B Theatres</b> - This would be the dark horse, as up to this point B&B has only been placing theaters in small towns across Missouri, Oklahoma, and Kansas. The addition of Wehrenberg's screens would be a major coup for them. Unfortunately, I don't think they could afford the asking price.\r\n\r\n<b>Carmike Cinemas</b> - The fourth largest theater chain in the US doesn't seem to be in a buying mood -- they've closed nearly 150 of their theaters in the last seven years -- but I wouldn't count them out. Missouri is one of the few states where Carmike doesn't have a commanding presence, so they might consider the purchase as a strategic maneuver.\r\n\r\n<b>Cinemark Theatres</b> - The third largest chain in the country recently bought out Century Theatres, adding an incredible 1,000 additional screens to their already impressive theater count. Even more impressive is that in a little over 20 years, Cinemark has moved from a handful of theaters in and around Plano, Texas to being the third largest chain in the country, as well as moving into the largely untapped markets of Central and South America. Wehrenberg's screen count would be a drip in the bucket for Cinemark, but it would give them control over St. Louis, and like I said before, that might be the determining factor.\r\n\r\n<b>Dickinson Theatres</b> - Another dark horse, but wouldn't it be sweet for Dickinson to buy out the company that forced them to bail out of the Springfield market?! If this sale went through, Dickinson could scrap their plan of building a new IMAX between Springfield and Nixa, and just incorporate a new screen onto (or into) the current Campbell 16 location. This acquisition would nearly double Dickinson's screen count.\r\n\r\n<b>Goodrich Quality Theaters</b> - As much as I'd love to see Goodrich buy out Wehrenberg, I can't foresee it happening. If it did go through, they'd have a near monopoly on the Springfield market, for whatever that's worth. Unfortunately, I think they're in the same \"unlikely\" boat with Dickinson and B&B.\r\n\r\n<b>Kerasotes Theatres</b> - Again, another Midwest theater chain that could bolster its standings by adding Wehrenberg's markets. Also of note, Kerasotes started just a few miles down the road from Wehrenberg in Springfield, IL, and is only four years younger (opening its first theater in 1909).\r\n\r\n<b>Malco Theatres</b> - This one's more wishful thinking on my part, although Wehrenberg's turf would mesh nicely with Malco's current holdings in Arkansas, Kentucky, Mississippi, Tennessee, and one ugly one in Sikeston, Missouri. The Malco Theatre I went to in Memphis earlier this year was amazingly plush -- it had a full service bar in the lobby, with adjoining seating area; leather coaches; an internet cafe; full-featured concession area; and the pre-show ads were produced by E! Entertainment TV (it was more like watching a show than a series of ads). All in all, a very nice chain that's cashing in on the current trend of making theaters more adult-friendly. Here's hoping!\r\n\r\n<b>Marcus Theatres</b> - Marcus is primarily based in the Northern states, but I included them for their proclivity of buying up theaters in major markets (i.e. Milwaukee and Madison, Wisconsin, Minneapolis / St. Paul, Chicago, Fargo, North Dakota, and Columbus, Ohio, among others). Purchasing Wehrenberg would allow Marcus to add St. Louis to that list, as well as incorporate their holdings in Minnesota, Iowa, and Illinois. Not a bad move, but it would be unlikely for them to want theaters as far south as Springfield.\r\n\r\n<b>Regal Entertainment Group</b> - The New York Yankees of the cinema world. Regal is as big as it gets, which is the only reason I'm including them. The vast majority of their theaters are located along the East and West coasts, so a small acquisition in the Midwest seems unlikely... or does it? If Regal could get to Wehrenberg before AMC, they would prevent their biggest competitor from forming a major state-wide monopoly in the heart of the country. Never underestimate the driving motivation of fierce competition. I've never been to a Regal-owned theater, so I don't have much to add in the way of movie-going experience. I guess they'd be better than AMC though.\r\n\r\nSo there you have it: Dan's Top 10 Choices for Likely (and not so likely) Wehrenberg Successors. As much as I hate to say it, AMC is the front-runner in this acquisition, but only time will tell what the new sign will say outside Campbell 16 next December.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-12-14T04:10:45.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Master RJ",
      "body": "It's AMC's take. They are always hungry.\r\n\r\nAMC Select is usually a crapshoot. Most of the titles are already wide releases (they actually considered the crapfest September Dawn art) and they rarely touch the truly artistic films. But, their weekday matinees and morning shows are usually a good price.\r\n\r\nAlso, a new owner would make Springfield more viable for titles. Wehrenberg was doing little with the Campbell 16 as is.",
      "created_at": "2007-12-14T04:42:06.000Z"
    },
    {
      "author": "Master RJ",
      "body": "I've read Regal is not very good as an owner of theatres.\r\n\r\nAnother good owner: Muvico Theatres. They build megaplexes but also design them like the old movie palaces. Muvico is a good name in cinema.",
      "created_at": "2007-12-14T04:44:09.000Z"
    },
    {
      "author": "dan",
      "body": "Muvico is based in Florida though. Wehrenberg's market would be out of their reach, and who knows the untold millions they'd have to spend to make old Wehr. theaters look classy!",
      "created_at": "2007-12-14T04:47:08.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Muvico is expanding though.\r\n\r\nThe worst chain to buy Wehrenberg would be Rave. I'd read their megaplexes are a dime-a-dozen with no reedeeming features at all. They are quick on DLP though.\r\n\r\nGoodrich Quality is getting really good in Springfield now, adding National CineMedia's (they do AMC's preshows, not Screenvision and that awful Bradford Howell) One Night Only events (concert documentaries, film reissues and operas). Too bad the first non-Metropolitan Opera show is Celine Dion.",
      "created_at": "2007-12-14T04:52:43.000Z"
    },
    {
      "author": "TheFoshe",
      "body": "Hmm, this is interesting.  I work at Cambell 16 and havnt even heard about this.  I just hope whoever gets it doesnt go on a firing spree, we have some very good managers.  Then again by next December I probally wont be working there.  Well thanks Moxie this is some interesting news. \r\n\r\nNick",
      "created_at": "2007-12-15T12:15:15.000Z"
    },
    {
      "author": "drm00se",
      "body": "What are the odds that one of the above will buy Wehrenberg and then sell off what they don't want (i.e. Campbell 16, if it's too far South or something of the sort)?",
      "created_at": "2007-12-19T06:58:39.000Z"
    },
    {
      "author": "Master RJ",
      "body": "Though it happens (look at the AMC/Lowe's merger two years back), I'd say slim to none. Especially if it's Campbell 16.",
      "created_at": "2007-12-19T10:52:50.000Z"
    },
    {
      "author": "moviekid21",
      "body": "We had AMC and Regal back in Vegas, and I think  either of those taking up space here would be great. Both offer a lot more than Wherenberg when it comes to theater technology. It just kills me that the nearest digital screen theater is in St Joseph, and St Louis, and the nearest IMAX doesn't show mainstream movies (Batman Begins, Harry Potter) in their IMAX versions. Just the regular 35mm print blown up. \r\nThose two here could bring those things to the area. Cinemark would be another decent one. I went to one of theirs in KC a month ago and was pleasantly surprised how nice it was. They even had a lounge bar area to wait in until the theater started seating. After going to the Moxie, it's hard going to theaters and not being able to have a beer or wine with it.",
      "created_at": "2007-12-25T15:49:19.000Z"
    },
    {
      "author": "tim",
      "body": "the AMC flagship theater in chicago has a bowling alley... and alcohol... and horrid paintings of famous films from the past 20 years lining all 21 theaters... it would be interesting if somehow life ended this very moment, and some advanced beings 3000 years into the future uncovered an AMC, what the hell would they think of us, all the crazy paintings of giant heads, and guns, large auditoriums with big blank walls.... I'm thinking something like the very end of A.I except the alien robot things would just shake their heads and say: \"assholes\"",
      "created_at": "2007-12-26T00:46:19.000Z"
    },
    {
      "author": "nate",
      "body": "PLUS ONE.",
      "created_at": "2007-12-27T06:37:37.000Z"
    },
    {
      "author": "zombi",
      "body": "I used to live outside of Nashville, and I would go to a mall Regal theatre to see Sideways, Little Children, Year of the Dog, Pan's Labrynth, and Pallindromes.  They seem to have a similar policy toward independent films as AMC Select.  I remember the decor was pastel and subdued.  Hopefully if they or AMC buy it out it won't be too damaging to the Moxie.  I also used to go to some Carmike theatres and they were pretty unremarkable.",
      "created_at": "2008-02-03T01:40:07.000Z"
    },
    {
      "author": "EdMo",
      "body": "My bet's on AMC.  That $9.00 a ticket price is just too good to pass up.",
      "created_at": "2008-02-03T07:38:23.000Z"
    },
    {
      "author": "zombi",
      "body": "moviekid, I totally agree about Branson's Imax.  Why the hell don't they play Imax Experience movies?  Are they afraid too many customers will overwhelm that tourist trap?  Just another of the many things Nashville had that here doesn't.  Why'd I move back here again?",
      "created_at": "2008-02-08T02:20:03.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 12,
      "name": "Thoughts"
    }
  ]
}
