{
  "id": 519,
  "title": "Crazy January booking shenanigans",
  "body": "It's difficult to schedule films for January when the distribution bookers are on vacation until January. ARGH! Sorry about the wait, folks... I know you're chomping at the bit for our new calendar, as we are too. We do, however, have the first week set in stone. <b>MARGOT AT THE WEDDING</b> and <b>MY KID COULD PAINT THAT</b> will both start one week from tonight on January 2nd. <b>MARGOT</b> will be staying with us for two weeks, but <b>MY KID</b> will only be here for half that time.<br/><br/>Also, <b>THE SAVAGES</b> will definitely be here for two weeks starting on the 16th. Other than that... we're still waiting to hear. We have our bids in for several more fantastic films, we're just waiting to hear back from the studios. As always, we'll let you know as soon as we learn more!<br/><br/>UPDATE: <b>I'M NOT THERE</b> will be starting on January 9th.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2007-12-27T05:40:32.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "drm00se",
      "body": "And we'll all wait with bated breath.",
      "created_at": "2007-12-27T08:01:39.000Z"
    },
    {
      "author": "nate",
      "body": "<blockquote><cite>Posted By: drm00se</cite>And we'll all wait with bad breath.</blockquote><br/><br/>Gross, moose!  Brush your teeth!",
      "created_at": "2007-12-27T11:36:47.000Z"
    },
    {
      "author": "Master RJ",
      "body": "That kid in My Kid Could Paint That isn't a very good painter.",
      "created_at": "2007-12-28T05:34:31.000Z"
    },
    {
      "author": "nicole",
      "body": "That's the whole argument about abstract and modern art...people always say, \"Look at that. My kid could paint it!\"",
      "created_at": "2007-12-28T06:55:51.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "January looks huge. More like Giantuary. I'm giving myself +1 for that, I'm just too clever!",
      "created_at": "2007-12-28T07:00:06.000Z"
    },
    {
      "author": "Master RJ",
      "body": "<blockquote><cite>Posted By: nicole</cite>That's the whole argument about abstract and modern art...people always say, \"Look at that. My kid could paint it!\"</blockquote><br/><br/>The paintings are bad Jackson Pollock clones.",
      "created_at": "2007-12-28T11:23:24.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "RJ, you're really bad at understanding what things are about.",
      "created_at": "2007-12-28T11:55:07.000Z"
    },
    {
      "author": "Master RJ",
      "body": "I've heard the expressions, but I wanted to mention why I don't think the paintings are very good.<br/><br/>Back to the calendar:<br/>Starting Out In The Evening and The Walker would really top things off. I've read Frank Langella's supposed to be really good (he's won lots of acclaim and a few critics' awards for it) in the former and Paul Schrader usually delivers with the latter being no exception, according to critics.",
      "created_at": "2007-12-28T15:11:59.000Z"
    },
    {
      "author": "Andy Karr",
      "body": "It's quite a relief to finally see I'm Not There on the list.  Been exclusively listening to the soundtrack for weeks.  I was preparing plans for a drive to Branson upon my return the fine city of Springfield.",
      "created_at": "2007-12-28T21:26:25.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
