{
  "id": 52,
  "title": "Moxie pix, part I",
  "body": "As promised, here are some pictures of the building where the Moxie will be housed. These were taken back in April of this year, but not much has changed. The interior walls have been removed, but we're still waiting for the rest of the construction to begin. All of the interior shots are of the western-most 2/3 of the building. Unfortunately, the eastern section was too dark to photograph. So, let's get started:<br/><br/><center><img src=\"http://moxie.danchilton.com/pix/grum/63_front_real.jpg\" width=\"420\"></center><br/>This is the front of the building as it looks now. The telephone pole will eventually come down and the sidewalk will be redone to match the existing downtown streetscape. The new facade will look very similar to this, but with a lot more windows and with bricks that are less likely to pop out and bonk our clientele on the head... or throat.<br/><br/><center><img src=\"http://moxie.danchilton.com/pix/grum/64_front_fake.jpg\" width=\"420\"></center><br/>This is the proposed elevation for the new facade. As you can see, the original design is maintained throughout, while the stucco sections have been replaced with plenty of large windows and a nice tile sidewalk border.<br/><br/><center><img src=\"http://moxie.danchilton.com/pix/grum/65_lobby1.jpg\" width=\"420\"></center><br/><center><img src=\"http://moxie.danchilton.com/pix/grum/66_lobby4.jpg\" width=\"420\"></center><br/><center><img src=\"http://moxie.danchilton.com/pix/grum/67_lobby5.jpg\" width=\"420\"></center><br/>These three shots are of the front 1/3 of the western-most 2/3 of the building (if that makes any sense). Before Andrew and Doug purchased the building, bands used it for a place to practice... you know, like practicing how to hang carpet on walls, litter indiscriminately, and (as you'll see in the next batch of pictures) create some really crappy graffiti.<br/><br/><center><img src=\"http://moxie.danchilton.com/pix/grum/68_back25.jpg\" width=\"420\"></center><br/><center><img src=\"http://moxie.danchilton.com/pix/grum/69_back26.jpg\" width=\"420\"></center><br/><center><img src=\"http://moxie.danchilton.com/pix/grum/70_back27.jpg\" width=\"420\"></center><br/>This is where the bands, or maybe just the band's groupies, practiced their chair tipping form and expressed themselves through the subtle art of graffiti skulls and middle fingers (see below for detail).<br/><br/><center><img src=\"http://moxie.danchilton.com/pix/grum/71_grafitti1.jpg\" width=\"420\"></center><br/><center><img src=\"http://moxie.danchilton.com/pix/grum/72_grafitti2.jpg\" width=\"420\"></center><br/>I'm not sure what the text says to the left of the skull, but I bet it's something along the lines of: \"WHY DID DAN, I MEAN, WHY IS DAN SO AWESOME? TOLD IT TO BITCH.\" Oh, and don't forget, \"Letter from WAR rules your ASS.\" Got that?<br/><br/><center><img src=\"http://moxie.danchilton.com/pix/grum/73_roof.jpg\" width=\"420\"></center><br/>Here's a nice shot of the roof. We were thinking about keeping this skylight, so, on special occasions, I could fall through it and inevitably land on something soft... just like Michael Douglas in <i>The Game</i>. Cool.<br/><br/>Hmm, it seems as though we're out of pictures... or are we? Here's a picture of me that shows up when you do a Google search of my name. I don't remember when this was taken, but judging by the color of my hair I'd say it was roughly 4 or 5 years ago. I'd just like to point out that I'm drinking one of the best pops in the entire world, Dr. A+, which <i>was</i> a worthy Albertson's brand imitation of Dr. Pepper... until it vanished from the face of the earth. I used to smoke too, isn't that sad?<br/><br/><center><img src=\"http://moxie.danchilton.com/pix/grum/74_danthinks.jpg\" width=\"274\"></center>",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-08-25T03:51:19.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "reniew lehcar",
      "body": "I think those cigarettes make you look sophisticated.",
      "created_at": "2004-08-25T05:47:38.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yeah? Which pack?",
      "created_at": "2004-08-25T05:48:09.000Z"
    },
    {
      "author": "Nicole",
      "body": "I think your shiny white shirt makes you look sophisticated.",
      "created_at": "2004-08-25T05:52:04.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yeah? Which shirt?",
      "created_at": "2004-08-25T07:04:51.000Z"
    },
    {
      "author": "justin",
      "body": "I think your frosty-tipped hair makes you look like that pack of cigarettes.",
      "created_at": "2004-08-25T07:34:54.000Z"
    },
    {
      "author": "einahpets",
      "body": "Need a landscape architect for that building? I guess I could do it as a favor...that's all I can offer at this point, or I could draw some bitchin' graffiti. I saw some really neat ones down at an abandoned quarry.",
      "created_at": "2004-08-25T16:18:38.000Z"
    },
    {
      "author": "bjork24",
      "body": "Justin, that's exactly the look I was striving for.<br/><br/>Enia, unless you know of a way to plant trees into concrete, we don't have much room for landscaping.",
      "created_at": "2004-08-25T17:38:52.000Z"
    },
    {
      "author": "whitty",
      "body": "I used to go to really, really, really hot (and cold in winter) punk shows there and the Moxie will be a vast improvement if you have air conditioning and a toilet.  And, hopefully it has been eradicated, but some of that extremely bad graffiti might be mine.  Ah, youth.",
      "created_at": "2004-08-25T18:08:06.000Z"
    },
    {
      "author": "John",
      "body": "First, a question: Where's the box office gonna be?<br/><br/>Second, a statement: I love how the Dr. A+ has to make sure you know they're A+ by printing it twice on the can.<br/><br/>Third, another statement: I think the watch makes you look like a tip-frosted cigarrette wearing a shiny shirt.",
      "created_at": "2004-08-25T20:50:33.000Z"
    },
    {
      "author": "bjork24",
      "body": "John, 1) the box office will most likely be located in the Cinebar (our concession area), that way we can always keep two or three employees behind the bar at all times. 2) That's because it's doubly good. 3) Thank you.",
      "created_at": "2004-08-25T20:56:52.000Z"
    },
    {
      "author": "Tim",
      "body": "Damn, your blog is looking great.<br/><br/>Y'know, I've always dug the various Dr. Pepper ripoff names.  Here we have a supermarket chain called Shaw's and they call it \"Dr. Shaw's.\"  Creative, no?  Here's a good list.  Dr. A+ is on there:<br/><br/>http://members.tripod.com/lchristensen/drs/<br/><br/>And you're one shiny A+ cigarette, my frosty-shirted friend.",
      "created_at": "2004-08-25T23:06:24.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks, Tim!",
      "created_at": "2004-08-25T23:09:37.000Z"
    },
    {
      "author": "Stefan",
      "body": "Yikes!  Looks like I'd better update my website's look using your template.<br/><br/>Kidding.  (Looks sweet.  The template and the proposed facade.)",
      "created_at": "2004-08-26T00:13:13.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yep, I can't wait to see how many people steal this layout.",
      "created_at": "2004-08-26T00:38:53.000Z"
    },
    {
      "author": "Allison",
      "body": "Dude -- That theatre-seats image at the top of the page is Hot. Also, does your theatre have plenty of free parking?",
      "created_at": "2004-08-26T00:57:48.000Z"
    },
    {
      "author": "bjork24",
      "body": "Allison, there's currently a healthy spattering of free parking all around the theater. Aslo, Springfield is in the course of adding a brand new multi-level parking garage that would only be one block from us, so that's good.",
      "created_at": "2004-08-26T01:08:00.000Z"
    },
    {
      "author": "Aaron",
      "body": "Yeah, and it's right across the street from my apartment, so that means jackhammers at six in the morning for the next several months. And they're tearing down the Book Rack, one of my most favorite places on earth!<br/><br/>What episode of the Office is the current quote from? I've seen everything except the Christmas specials, I think. Amazing. \"Different frogs, different times.\"<br/><br/>Oh, and nice redesign, BTW. Reminds me of how badly I need to teach myself all that standards crap.",
      "created_at": "2004-08-26T01:13:29.000Z"
    },
    {
      "author": "bjork24",
      "body": "Aaron, I think that quote is from the Christmas special, but I have no idea whatsoever. It's listed at IMDB in the memorable quotes section.",
      "created_at": "2004-08-26T01:22:38.000Z"
    },
    {
      "author": "Matt",
      "body": "Nice redesign.  I thought this blog was good for the content.  Then Aaron's post made me check out the quotes section.  Izzard is awesome!<br/><br/>\"Yes, before there was stonehenge there were strawhenge and woodhenge, but the big bad wolf came and blew them down and three little piggies were relocated to the projects.\"<br/><br/>Now if only they would make his DVD's region 1 compatible I'd be even happier.<br/><br/>Back to the theater, I give you guys all the credit for going for this, cuz I'm just not seeing it from the pics.  It seems really tiny.  Hope it works out.",
      "created_at": "2004-08-26T01:33:06.000Z"
    },
    {
      "author": "bjork24",
      "body": "Matt, I have good news, Dress to Kill is available as a region 1 DVD on Amazon. Don't be fooled, the theater will be small, but that just adds to the unique atmosphere... small and AWESOME!",
      "created_at": "2004-08-26T01:38:23.000Z"
    },
    {
      "author": "Matt",
      "body": "Sweet!  I just checked it out and Circle is also available as region 1.  I'm really interested on how development will progress.  Any targeted date for when construction will begin?",
      "created_at": "2004-08-26T02:36:28.000Z"
    },
    {
      "author": "bjork24",
      "body": "Matt, facade work should begin in the next couple of weeks, with the interior renovation beginning soon thereafter.",
      "created_at": "2004-08-26T03:32:06.000Z"
    },
    {
      "author": "Newell",
      "body": "Wow, nifty keen pictures! I love the way the front of the building looks now, but the design looks even better. I might have to find time to come visit when you open this joint up!<br/><br/>Also, the redesign of the site is wonderful. Your web design skills are pretty sharp. Just out of curiosity, are you self-taught, or what?",
      "created_at": "2004-08-26T10:29:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "Newell, hope you can make it down sometime, and yes, I'm completely self-taught. I was an English major in college... never taken a computer class in my life, but yet I work as a database engineer. Sigh.",
      "created_at": "2004-08-26T16:38:36.000Z"
    },
    {
      "author": "Aaron",
      "body": "Oh man, I haven't seen the Christmas specials yet. I'm considering spending the rest of that Amazon gift certificate on the series one + series two + Christmas specials = the Office package. The Eggers book hasn't shipped yet. Or I just would have spent it on an inflatable penis.",
      "created_at": "2004-08-26T17:49:17.000Z"
    },
    {
      "author": "bjork24",
      "body": "Aaron - wait, wait, wait... you're actually considering NOT buying the inflatable penis?!",
      "created_at": "2004-08-26T17:53:17.000Z"
    },
    {
      "author": "Chuck",
      "body": "While I love the new site design, I have a feeling Mike is going to be writing code when I get home.<br/><br/>I guess Caliblog could use an update too.<br/><br/>Great work, man.",
      "created_at": "2004-08-26T22:51:37.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Chuck! Have fun in Michigan!",
      "created_at": "2004-08-26T23:18:24.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
