{
  "id": 525,
  "title": "February: Love is in the Air",
  "body": "I think that February is a turning point in Dan's and my marriage, and I owe it all to The Moxie.\r\n\r\nUh-oh! That sounds bad. Like I could say, \"We've had just enough working together 24/7 and have decided to call it quits.\" But don't worry. That's not where I'm going with this rare entry into the Moxie blogosphere. Sure we have our blow outs, but no fears - Danicole are still going strong (we even have that blasted nickname that someone came up with...cute, right?).\r\n\r\nNo, the reason is this: For as long as I can remember, I wanted a spouse/partner/bff to share my passion of books. Dan was an English major in college, and although he didn't really read much (besides what his attractive professor recommended - <i>\"Midnight's Children\"</i> by Salman Rushdie and <i>\"A Heartbreaking Work of Staggering Genius\"</i> by Dave Eggers), I figured if he liked writing, he liked reading! Right? So I accepted his engagement proposal, imagining romantic evenings of us curled up together, reading the latest Harry Potter, voices and everything. Well, if it's not baseball books or <a href=\"http://ask.metafilter.com/\">Ask MetaFilter</a>, he's really not all that interested. So my dreams have been shattered.\r\n\r\nEvery once in a while I'll beg him, thinking my luck has turned. \"Oh Dan. Why don't we read this book together? I'm sure you'll love it!\" He'll pretend to express interest, taking my book from my hand, examining the back cover copy, flipping through the pages, then snort and hurl it across the room. \"I don't like the lack of punctuation,\" he'll say. And each time I'm crushed.\r\n\r\nSo you'll imagine my surprise the other day when he was lying in bed with PERSEPOLIS in hand, reading away. Sure, it's a graphic novel, but it's a book I recently read and thought he would like. I mean, it tells the tale of a plucky girl who makes the most of her surroundings in war-torn Iran, while family members and friends are disappearing without a trace. What's not to love? And he finished it! Then, he said he's going to read part two of PERSEPOLIS, because he wants to find out what happens to her, and read it before the movie begins (ahem, Feb. 13). And wait! There's more! Next, he's planning on reading THE DIVING BELL AND THE BUTTERFLY! Which I just read! Oh glory day. I really am a lucky girl.\r\n\r\nBaby steps, right? My plan of attack for all movies we show is now this: if it's based on a graphic novel or is less than 200 pages, I'll book it. I'm not sure where that leaves us. <a href=\"http://imdb.com/title/tt0386117/\">WHERE THE WILD THINGS ARE</a>* (adapted by Danicole's favorite, Dave Eggers)? So you better start listing your highly-anticipated literary adaptations.\r\n\r\nAnd maybe next he'll join me at the next Well Fed Head Book Club discussion! But I'm not holding my breath...\r\n\r\n\r\n* This is not a confirmed booking.",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2008-02-09T07:01:25.000Z",
  "author": "Nicole",
  "comments": [
    {
      "author": "thewayofthedinosaur",
      "body": "LOL I was all set to bah-humbug a February love blog post but ...awww...cute-ums! Danicole reading together, now you just have to practice your married couple vocal cadence so you can read the passages out loud together and then sigh at the end of each paragraph . . . . like ....oh! BAH HUMBUG!",
      "created_at": "2008-02-09T22:21:19.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "Also, funny blog I liked",
      "created_at": "2008-02-09T22:21:36.000Z"
    },
    {
      "author": "drm00se",
      "body": "Danicole = Super!",
      "created_at": "2008-02-10T06:44:33.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "<blockquote><cite>Posted By: nicole</cite><a href=\"http://imdb.com/title/tt0386117/\">WHERE THE WILD THINGS ARE</a>* (adapted by Danicole's favorite, Dave Eggers)</blockquote> They got a kid named max to play Max? I don't trust that. They should've gotten me. \r\n\r\n^Contradiction woo!",
      "created_at": "2008-02-10T10:11:11.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 12,
      "name": "Thoughts"
    }
  ]
}
