{
  "id": 528,
  "title": "Oscars and half calendars: a play in two parts",
  "body": "Lots of odds and ends to cover, so let's get down to it:<br/><br/>First, and most importantly, the March calendar is out -- or at least half of it is. You'll notice there's a lot of showings for THE KITE RUNNER... and I mean a LOT. The overwhelming demand for the film called for a solid two weeks, and I have no doubt in my mind that it will attract a lot of new faces to The Moxie. It's also nice to play something fairly tame and inspiring (save for the child rape) before we dive headlong into <a href=\"http://www.apple.com/trailers/independent/teeth/\" target=\"_blank\" class=\"broken\">TEETH</a> and <a href=\"http://www.apple.com/trailers/warner_independent_pictures/funnygames/\" target=\"_blank\" class=\"broken\">FUNNY GAMES</a>, which promise to be two of the most bizarre and disturbing films we've shown in quite some time.<br/><br/>We're also bringing back Alex Gibney's documentary, <a href=\"http://www.apple.com/trailers/thinkfilm/taxitothedarkside/\" target=\"_blank\" class=\"broken\">TAXI TO THE DARK SIDE</a>, which won the Oscar for Best Documentary last Sunday night. We originally showed it in October of last year, before its theatrical release, as part of the Oscar qualifying circuit, but it was only here for three days and the showtimes were awful, so we felt it deserved a second shot (especially after being named the best documentary in the WORLD!). Beyond those four films (THE KITE RUNNER, TEETH, FUNNY GAME, TAXI TO THE DARK SIDE), things start to get a little muddled later in the month. We have two big films tentatively booked for the second half of March, but they won't tell us for sure when we can start them until Friday, or possibly even next week, which means we were faced with the prospect of printing a full calendar with two movies that might not come, or a half calendar with movies that were 100% booked. We decided to play it safe, so I hope you understand.<br/><br/>Also, please be advised that if you picked up one of the green March calendars at the theater today, it's wrong. The times for THE KITE RUNNER have changed on the 5th, 6th, 10th, and 11th. The corrected version will be out tomorrow, or you can view them <a href=\"http://www.moxiecinema.com/calendar\" class=\"broken\">online</a> right now. We're stupid, and sorry. The rest of the calendar will be out (and 110% correct) as soon as we can reel in those last two films. I promise.<br/><br/>And speaking of the Oscars, we went to the big party at the Gillioz on Sunday night, and it was a blast! Here are a couple pictures of us looking pretty awful.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/022708/danicoleC.jpg\" width=\"425\" /><br/><br/>The suit I'm wearing belongs to my friend Doug. I've gone the last 5 years without owning a suit or tux, but I may have to cave in and buy one soon, since my comparably-sized friend is moving to St. Louis next week. How inconsiderate of him!<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/022708/danicoleD.jpg\" width=\"425\" /><br/><br/>Despite our looks of constipation, we had a very nice evening.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/022708/danicoleF.jpg\" width=\"425\" /><br/><br/>We're also looking forward to a very nice weekend, as we'll be up in our old college stomping grounds for the fifth annual True/False Documentary Film Festival! Nicole and I look forward to this weekend more than any other during the year. We get to visit all our old Columbia haunts, watch a ton of fantastic documentaries, meet with cool filmmakers, and gorge ourselves on food (we're staying in a bed and breakfast this year, so the food will truly be nonstop). I'm particularly excited to see Alex Gibney less than a week after watching him accept an Oscar for Best Documentary. He'll be debuting his new film GONZO, which is about Hunter S. Thompson. I think we're going to end up seeing about 10 or 11 films over the span of three days, several of which will eventually make their way to The Moxie later in the year (once they're released theatrically). We'll have a full report when we get back Monday evening, for those of you who might be interested in such things.<br/><br/>And that about does it for me. There was something else I was going to write about, but I forgot. Oh well.<br/><br/>The photos from Oscar night, by the way, were snapped by longtime Moxie-goer Steve Croxton. Thanks for sending them to us, Steve! We'll try to look less corpse-like next time.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-02-28T10:40:51.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "The Four Finger Soc Em",
      "body": "That was a good post. Funny. You forgot on the S on FUNNY GAMES the second time you mentioned it. <br/><br/>The last picture of you guys is good. Well, good Nicole. You look like you just became a father unintentionally.<br/><br/>Check out Meganne's face in that 2nd picture!",
      "created_at": "2008-02-28T11:23:12.000Z"
    },
    {
      "author": "drm00se",
      "body": "Excitement!",
      "created_at": "2008-02-28T11:42:09.000Z"
    },
    {
      "author": "DanerKebab",
      "body": "Lovely photos.  Films I'm excited to see.  Very cool about the doc festival.  Three cheers for Blog #534!",
      "created_at": "2008-02-28T20:17:24.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "Haha in the second to last picture it looks like Dan is giggling to himself over one of his jokes (as usual) and Nicole is mortified over its crudeness (as usual) <br/><br/>:P",
      "created_at": "2008-02-28T21:12:25.000Z"
    },
    {
      "author": "nate",
      "body": "That's a good picture of a happy O'Neal.  He usually makes faces, as I am led to understand.",
      "created_at": "2008-02-29T09:46:24.000Z"
    },
    {
      "author": "nicole",
      "body": "I'm not one to be down on myself (ha ha), but man. In that last picture, I look like I've had one too many Cookie Casanova's from Andy's.<br/><br/>Oh wait...",
      "created_at": "2008-02-29T10:36:15.000Z"
    },
    {
      "author": "nicole",
      "body": "<blockquote><cite>Posted By: The Four Finger Soc Em</cite>You look like you just became a father unintentionally.</blockquote><br/><br/>I don't get this?",
      "created_at": "2008-02-29T10:37:43.000Z"
    },
    {
      "author": "dan",
      "body": "Me neither!<br/><br/>*looks around nervously*<br/><br/>heh heh",
      "created_at": "2008-02-29T12:29:02.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "<blockquote><cite>Posted By: nicole</cite><blockquote><cite>Posted By: The Four Finger Soc Em</cite>You look like you just became a father unintentionally.</blockquote><br/><br/>I don't get this?</blockquote> He looks like he just found out he's gonna be a father. But isn't ready for it. Whatever, I said that like two years ago, it's not relevant now.",
      "created_at": "2008-02-29T12:31:38.000Z"
    },
    {
      "author": "nicole",
      "body": "Gahhhhhh! I've had TWO people ask me if I was pregnant lately (Mark Biggs was one of them!) - I don't think it was related to this blog post, but I don't think this helps any...but now if I delete it, then they might think something is up.<br/><br/>Silly Max.<br/><br/>I'll just always have a vodka tonic in one hand, and a cigarette in the other. That should quell any doubts!",
      "created_at": "2008-03-03T09:37:55.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Whoa, I was not talking about you at all, Nicole. I don't think you look pregnant! I wasn't even referencing you in maternal sense! I just thought the look on Dan's face was that of a nervous new dad...<br/><br/>I'm really sorry that upset you. That would've been a terribly rude and untrue thing to say.",
      "created_at": "2008-03-03T11:45:24.000Z"
    },
    {
      "author": "nicole",
      "body": "No, no, you didn't upset me, I promise! But typically being a new dad means the lady is having a baby. And the general public are stupid.",
      "created_at": "2008-03-04T02:11:16.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
