{
  "id": 529,
  "title": "2008 True/False Documentary Film Festival",
  "body": "<img src=\"http://moxie.danchilton.com/pix/grum/030408/header.jpg\" width=\"425\" /><br/><br/>Since there's eight feet of snow on the ground, and I'm stuck in the theater waiting for a delivery from UPS, I thought I'd take a moment to report on our amazing weekend at the True/False Documentary Film Festival in Columbia. This year marked the festival's fifth anniversary, and set record attendance despite the beautiful weather (which tends to keep people out of dark auditoriums) and the fact that the Missouri Theater, traditionally the festival's largest venue, was out of commission due to extensive remodeling. I heard estimates ranging well above 15,000, which didn't include the 450+ person volunteer staff, or the army of filmmakers that T/F had flown in from across the world.<br/><br/>On top of the overall festival excitement, many people (ourselves included) were looking forward to getting their first glimpse inside the Ragtag's brand new two-screen duo-plex, which was, as expected, totally awesome. All in all, it was a splendidly relaxing weekend filled with fantastic films and good company. We hope to bring several of the documentaries to Springfield once they become available on the theatrical market, which could be as early as this Summer, or as late as next year. Here's a quick rundown of the films I watched:<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/030408/bigger-stronger-faster.jpg\" width=\"425\" /><br/><br/><b>BIGGER, STRONGER, FASTER</b> - An in-depth, yet humorous look at anabolic steroid use and the degrading self-image of the American male. If you enjoyed SUPER SIZE ME or UP FOR GRABS, you'll definitely get a kick out of this one. The director mentioned a possible release date in early Summer, which will coincide nicely with America's favorite steroid-scandal-riddled sport.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/030408/forbidden-lies.jpg\" width=\"425\" /><br/><br/><b>FORBIDDEN LIES</b> - A fantastic, over-the-top documentary about Norma Khouri, a bestselling author who had her memoir recalled by Random House after an investigative report questioned its authenticity. Norma swears by her story and tries to use the documentary as a vehicle to prove her innocence, only to get further entangled in her make-believe world. This was truly a fascinating story, and probably my favorite film of the festival. During her Q&A session, the Australian director mentioned that she'd only been in America for a few hours and had already acquired a taste for \"Flat Tire\" beer. I thought that was cute... just like her accent.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/030408/carney.jpg\" width=\"425\" /><br/><br/><b>CARNEY</b> - This one focused on the lives of several Midway workers, also known as \"carneys\" (small hands, smell like cabbage). I was hoping for a more extensive look at the underpinnings of carney culture, but it wound up being more a slice of life vignette that left something to be desired. The film was visually interesting, perhaps due to the director being a photographer by trade, but other than that it was fairly light in content.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/030408/oscar-docs.jpg\" width=\"425\" /><br/><br/><b>OSCAR NOMINATED DOCUMENTARY SHORT FILMS</b> - I have a hard time talking about these four remarkable films, as two of them were the most heart-rending stories I've seen in a long, long time. I've never heard a sold out auditorium blubbering like that (myself included) in all my life. Nicole even started crying, and she didn't even watch them with me!<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/030408/audience-of-one.jpg\" width=\"425\" /><br/><br/><b>AUDIENCE OF ONE</b> - A wacky film about a preacher from San Francisco who gets a message from God to start a filmmaking company and produce a 100 million dollar sci-fi Christian epic. Similar in scope to 2002's LOST IN LA MANCHA, this film is a hilarious and harrowing look at blind faith and terrible filmmaking. Very enjoyable.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/030408/gonzo.jpg\" width=\"425\" /><br/><br/><b>GONZO</b> - This was probably the most highly-anticipated showing of the festival, due to the fact that director Alex Gibney would be in attendance less than a week after winning an Oscar for Best Documentary for TAXI TO THE DARK SIDE. The film is a fairly straightforward biography about Hunter S. Thompson, who I've never been overly enamoured with, and is narrated by Johnny Depp (good casting choice). I imagine the film will fair well once it's released later this year, due in part to Gibney's newfound fame, as well as the annoying glamorization of Thompson's excess drug use (see FEAR AND LOATHING if you don't believe me). Hearing Gibney speak before and after the film was enlightening, despite some of the pointless questions posed by the audience.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/030408/52.jpg\" width=\"425\" /><br/><br/><b>52 ALTERNATIVES TO SLITTING YOUR WRIST</b> - The story of a guy who wakes up in a mental ward after attempting suicide, and decides to create a list of 52 things he's going to do over the next year to distract himself from his own suicidal tendencies. The film was painfully self-aware and gave too much credence to the supposed \"quarter-life crisis,\" which I think is a bunch of crap. I would've left the screening thinking very little of the entire experience had the filmmaker / star not been so infectiously charismatic in real life. Damn his likability!<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/030408/stranded.jpg\" width=\"425\" /><br/><br/><b>STRANDED</b> - Remember the movie ALIVE from 1993 with Ethan Hawke -- the one about those rugby players who crashed in the Andes and had to survive by eating the dead? Well, this is their story, told by the actual survivors as they take a trip back to the desolate mountain they were trapped on for over 70 days. As you can imagine, it's an incredible film, and one I'm positive we'll be showing at The Moxie as soon as it becomes available.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/030408/man-on-wire.jpg\" width=\"425\" /><br/><br/><b>MAN ON WIRE</b> - This was the closing night film, and played to a capacity crowd of over 1,000 people. The documentary tells the story of Philippe Petit, the man who illegally set up a tightrope between the two towers of the World Trade Center and walked across them in 1974. Called the \"artistic crime of the century,\" the stunt took Petit six years to plan, and was documented with the suspense and cunning of a classic heist film. The film won the Grand Jury Prize: World Cinema Documentary and the World Cinema Audience Award: Documentary at this year's Sundance film festival, and the director (who looked just like Desmond from LOST) was incredibly insightful.<br/><br/>Nicole and I didn't attend all the same movies together, so she saw a couple that I didn't. I think our favorites, however, are pretty much the same: BIGGER, STRONGER, FASTER; FORBIDDEN LIES; STRANDED; and MAN ON WIRE. You can expect to see those, along with some of the others like GONZO and AUDIENCE OF ONE, to show up at our theater at some point in the future. Also, if you're looking for more T/F festival coverage, check out A.J. Schnack's <a href=\"http://edendale.typepad.com/weblog/2008/03/truefalse-2008.html\">latest post</a>.<br/><br/>Now, I better go shovel the sidewalk. Damn snow.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-03-05T02:41:04.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "drm00se",
      "body": "I reeeaaally want to see STRANDED, MAN ON WIRE, and AUDIENCE OF ONE.",
      "created_at": "2008-03-05T07:47:38.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Those all sound so good! Except for the lame ones.<br/><br/>^Insightful.",
      "created_at": "2008-03-05T08:33:30.000Z"
    },
    {
      "author": "nate",
      "body": "I think I want to see every one of this here wild bunch, seriously.",
      "created_at": "2008-03-05T09:05:35.000Z"
    },
    {
      "author": "brad",
      "body": "all of these look and sound fantastic. but i would LOVE to see Gonzo.",
      "created_at": "2008-03-05T23:53:55.000Z"
    },
    {
      "author": "nicole",
      "body": "In addition, I also saw:<br/><br/><a href=\"http://www.mymothersgardenmovie.com/\">MY MOTHER'S GARDEN</a>, a sympathetic look at a women's hoarding illness. The film was directed by the woman's daughter, so it was a very personal story for her to tell. Hording illnesses (where you refuse to throw anything away) has always been a morbid fascination of mine.<br/><br/><a href=\"http://www.pbs.org/independentlens/pleasevoteforme/\">PLEASE VOTE FOR ME</a>, which followed a Chinese elementary school, and their democratic election for Class Monitor. I thought it was really funny. The parents were so involved, writing their speeches and telling them to use words like fascist and dictator. It's going to be on Independent Lens, so I highly recommend watching!",
      "created_at": "2008-03-06T02:01:52.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "My jealousy . . . truly . . . knows no bounds.",
      "created_at": "2008-03-06T22:15:56.000Z"
    },
    {
      "author": "twin33",
      "body": "My faves were Stranded and Audience of One--- Gonzo was very good too, I just like rooting for the little guys. When I got home Sunday night I had to go running-- first of all it was actually warm outside, and second of all, I had seen 9 movies in two days. Quite a feat. I really liked An Alternative... that guy was very likeable indeed.",
      "created_at": "2008-03-10T06:21:58.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 7,
      "name": "Lists"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    },
    {
      "id": 10,
      "name": "Reviews"
    }
  ]
}
