{
  "id": 53,
  "title": "Tidbits",
  "body": "<b>Blog Redesign</b>\r\n\r\nIf you haven't already noticed, the blog had an extreme makeover yesterday. The new design is what will be used on <b>the Moxie's</b> website, so I thought I'd give it a test run on the blog before I the big reveal. The design is 100% CSS-P, which means very little to a great many of you. I'm too lazy to change all the ancillary pages, which, by the way, have all moved to the top of the page. Also, the comments link has moved to the top of the post, instead of down at the bottom. That's about it. As always, please let me know if you find any browser-specific bugs.\r\n\r\n<b>Business Plan</b>\r\n\r\nStill chugging away at it. Do you remember when I wrote that <a href=\"13\">one post</a> about how much I hated writing the business plan? Those were the days, eh? As I was going through and changing all the instances of <i>Criterion</i> to <b>Moxie</b>, I decided that the best way to present the plan would be to separate it into three sections: a business plan, marketing plan, and financial plan. It seems to me that three 13 to 15 page sections would be a little easier to swallow than one 40 page monster. I've learned so much since the last draft. Sometimes, as I'm reading through, I think to myself, \"that has to be the worst sentence you've ever written in your whole entire life. You should be ashamed of yourself. Completely and utterly ashamed. Go over to the couch and cry. No, NO! Don't look at me... just go. GO!\" It's terrible the way I treat myself sometimes.\r\n\r\n<b>Jumping the Gun</b>\r\n\r\n<b>The Moxie</b> has already been listed as Springfield's only independent movie theater by <a href=\"http://www.drury.edu/cinema/index.html\" target=\"_blank\">Drury's Cinema Club</a>. For those of you who don't already know, <a href=\"http://www.drury.edu\" target=\"_blank\">Drury</a> is Springfield's premiere private university. It has a student body of roughly 5,000 and is the alma mater of both my dad and my sister. I'm not sure how the webmaster found out about our theater, but I can only assume it was from reading this blog. Here's <a href=\"http://www.drury.edu/cinema/links.html\" target=\"_blank\">the page</a> where we're listed. I'm not mad or anything, just mildly bemused. I wasn't aware that this blog was read by anyone from <a href=\"http://www.drury.edu/cinema/index.html\" target=\"_blank\">Drury's Cinema Club</a>, but now that I know... hello, Drury student(s)! Welcome! If you need more information, please feel free to leave a comment... Yippee!\r\n\r\n<b>Beer, Beer, Beer</b>\r\n\r\nI've set up a preliminary relationship with the good people at <a href=\"http://www.wilfischer.com\" target=\"_blank\">Wil Fischer Distributing</a> in Springfield to supply us with beer from Anheuser-Busch, which is a small regional brewery located in St. Louis. In our initial discussions, I informed our representative that we had every intention of offering as wide a variety of beers as possible, not just Bud, Bud Light, and a rotating selection of specialty Michelobs. To my complete and total surprise the representative told me that that wouldn't be a problem at all, in fact, he recommended we try and carry some of Anheuser-Busch's competitors, like Coors and Miller, to help increase sales. That statement completely threw me for a loop, because I was expecting them to have an exclusive contract like with Coke or Pepsi, where if you sign up with one, you can't even look at the other. So, three cheers for having more than three beers! Pabst Blue Ribbon, here we come!\r\n\r\n<b>It's Hot!</b>\r\n\r\nThe heat index outside is currently 106 degrees. It was 78 degrees this time last week. Damn you, Missouri weather! Why can't you just pick a season and stick with it? I'm going to go cry on the couch.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-08-26T23:32:39.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Aaron",
      "body": "The person who probably linked this blog up from the DU Cinema Club is probably my good friend that I told you about, the one that was just as excited as I am about the Moxie. I'm pretty sure she does the design for the cinema club. As for beverages, you know my priorities. Some cider would be nice, though.",
      "created_at": "2004-08-27T00:01:52.000Z"
    },
    {
      "author": "bjork24",
      "body": "Aaron, loose lips sink ships, so keep sinkin' 'em!",
      "created_at": "2004-08-27T00:04:25.000Z"
    },
    {
      "author": "Aaron",
      "body": "...and are you going to have Sprees? For some reason Sprees sound really really good right now. And not the ones in the rolls, those suck. The smaller ones, in the boxes.",
      "created_at": "2004-08-27T00:04:39.000Z"
    },
    {
      "author": "Aaron",
      "body": "...and I once dropped a whole box of Gobstoppers in the middle of a movie once. And I was sitting pretty far back. And they tic tic tic bounced and rolled all the way to the screen. Reeeediculous.",
      "created_at": "2004-08-27T00:05:45.000Z"
    },
    {
      "author": "bjork24",
      "body": "I did the same thing once during a play at the Landers. How embarassing!",
      "created_at": "2004-08-27T00:07:13.000Z"
    },
    {
      "author": "Aaron",
      "body": "Oh man, I think my favorite movie memory is going to see \"Great Expectations\" with a bunch of my friends at the theatre in Osage Beach. We thought it would be a good opportunity to hook up with a bunch of chicks (we were juniors in high school, I think). So, here we are, eight or nine or ten of us, all piling into the row and we look around us, and the youngest woman in there is over thirty. They asked if we had to watch it for homework. I think I was the only one who enjoyed it—the rest of the guys were bummed out their chances of scoring had been quickly diminished.",
      "created_at": "2004-08-27T00:13:59.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ha ha. Camdenton... woops, I meant: ha ha. Osage Beach.",
      "created_at": "2004-08-27T00:22:37.000Z"
    },
    {
      "author": "Aaron",
      "body": "Well, I think they're about equally make-fun-able, but not as much as Brumley. Oh man. Camdenton & Osage Beach is to Brumley what Abercrombie & Fitch (or Ohio) is to West Virginia.",
      "created_at": "2004-08-27T00:31:33.000Z"
    },
    {
      "author": "Ben",
      "body": "I like the new design, although the white links are a little difficult to read on the tan background. The one apparent bug is that the content div overlaps the container in Opera 7.5\r\n\r\nAnyway, it's great to see that things are in full swing for your theater.",
      "created_at": "2004-08-27T01:14:40.000Z"
    },
    {
      "author": "bjork24",
      "body": "Hmm, it looks bad in Opera, eh? Well, you can't make all the browsers happy all the time. It's been tested in IE, Firefox, and Netscape, so that should cover 98% of the population.",
      "created_at": "2004-08-27T01:22:59.000Z"
    },
    {
      "author": "Nicole",
      "body": "Mmmm. Cider. Good suggestion, Aaron.",
      "created_at": "2004-08-27T02:25:59.000Z"
    },
    {
      "author": "Rachel",
      "body": "I like the new layout, BUT I want more variety in the 'quote' section.  Perhaps something from Bring It On?",
      "created_at": "2004-08-27T02:30:00.000Z"
    },
    {
      "author": "bjork24",
      "body": "Nicole will drink anything.\r\n\r\nRachel, any suggestions?",
      "created_at": "2004-08-27T03:47:42.000Z"
    },
    {
      "author": "Rachel",
      "body": "What about \"You're having cheer-sex with him!\"\r\n\r\nOR the ever memorable\r\n\r\n\"Courtney, this is not a democracy, it's a cheerocracy. I'm overruling you.\"\r\n\r\nI actually just looked up those quotes on imdb.com...a valuable quote resource.",
      "created_at": "2004-08-27T05:39:35.000Z"
    },
    {
      "author": "bjork24",
      "body": "Rachel, the quote has been added... so you better bring it!",
      "created_at": "2004-08-27T06:08:14.000Z"
    },
    {
      "author": "Ben",
      "body": "The site really doesn't look bad in Opera. Just a few bugs. It's really hit and miss with CSS I guess. If you try to please one browser, another screws everything up. Anyway, I'll just use Firefox to view the site because you can almost always count on it to display correctly. \r\n\r\nBy the way, if you're adding some quotes: \"I don't want to sell anything, buy anything, or process anything as a career. I don't want to sell anything bought or processed, or buy anything sold or processed, or process anything sold, bought, or processed, or repair anything sold, bought, or processed. You know, as a career, I don't want to do that.\" -Lloyd Dobler from Say Anything\r\n\r\nor\r\n\r\n\"These walls are kind of funny. First you hate 'em, then you get used to 'em. Enough time passes, gets so you depend on them. That's institutionalized. They send you here for life, that's exactly what they take. The part that counts, anyways.\" - Red from The Shawshank Redemption (there are too many good ones in that movie)\r\n\r\nor \r\n\r\n\"People who talk in metaphors oughta shampoo my crotch.\" - Melvin Udall from As Good As It Gets\r\n\r\nThere are too many great quotes that you could use I guess. I'd better stop now.",
      "created_at": "2004-08-27T06:52:45.000Z"
    },
    {
      "author": "Brandon",
      "body": "Myself and a few other high-school friends will road-trip it to Missouri from Ohio when you're up and running.  Maybe I'll get a group of college friends involved too, if after next fall.  Bored Harvard undergrads (influenced by me) will hopefully be one of your top markets in a few years.  Good luck once again, whatever luck is...",
      "created_at": "2004-08-27T07:39:13.000Z"
    },
    {
      "author": "mohammad",
      "body": "what the hell happend on template!!.ok ok im sorry.you picked up very good template dear.good luck my friend.[you didnt change comment template]",
      "created_at": "2004-08-27T14:36:34.000Z"
    },
    {
      "author": "einahpets",
      "body": "Ohio? I can join that road trip. And as far as the beer goes, are you going to sell funnels with those as well? \r\n\r\nAnd for Bring it On, ah, remember those days Dan, when your wife was working in Columbia and we sat in the basement and watched it? Yeah, we brought it on...",
      "created_at": "2004-08-27T16:17:21.000Z"
    },
    {
      "author": "Oz",
      "body": "Very patriotic masthead, what with the red, white and blue.\r\n\r\nAlso, are you sure that was the worst sentence you've ever written in your \"whole entire life\"?  Maybe it was just the worst sentence you had written in your partial entire life.  Or maybe it was the worst sentence you had written in your whole segmented life.\r\n\r\nAlso, are you open for quote suggestions?  I could suggest a few.  Let's not overlook the classics, like, \"Nobody puts Baby in a corner.\"  I don't think I need to cite the reference.",
      "created_at": "2004-08-27T16:45:50.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ben, I'll put your quotes up later today.\r\n\r\nBrandon, come on down. The more the merrier, especially if you all buy beer! But be warned, Springfield isn't Boston.\r\n\r\nMohammed, are you going to steal this design as well?\r\n\r\nEina, shhhh. Nicole doesn't know about all those hot, steamy nights in your basement... nor does she need to.\r\n\r\nOz, I'm quite certain the sentence I was referring to was the worst in all my 24 years. Quite certain indeed. Perhaps I'll make a post today requesting everyone's favorite quotes for the quote machine. Ah yes, \"Nobody puts Baby in a corner.\" I love Citizen Kane.",
      "created_at": "2004-08-27T17:12:11.000Z"
    },
    {
      "author": "Nicole",
      "body": "Whhhhaaaaattttt??? I worked in Columbia?",
      "created_at": "2004-08-27T17:26:12.000Z"
    },
    {
      "author": "bjork24",
      "body": "Uh oh. She knows!",
      "created_at": "2004-08-27T17:37:22.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "The new design looks great! No problems in Safari.\r\n\r\nWe also hope to make the road trip to Missouri for the grand opening, assuming you give us enough notice to secure the babysitter, Dan.",
      "created_at": "2004-08-27T20:21:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "Whimsy, I'm glad to hear that a) the design looks good in Safari and b) you're coming down for the grand opening... which may be in January. I hope you're not snowed in by then!",
      "created_at": "2004-08-27T20:34:59.000Z"
    },
    {
      "author": "Village Idiot",
      "body": "One more little thing about the new template. On the individual post pages, the guestbook and quote archive links at the top are not displayed correctly. From the \"Tidbits\" post page the guestbook link is incorrectly displayed as \"www.urlblue.com/2004/08/guestbook.php?view\". The quote archive link is \"urlblue.com/2004/08/quote_archive.php\". Those are the only two links affected though. I would have to say it is use of those little quotation marks. (\"guestbook.php\", rather than \"http://www.urlblue.com/guestbook.php\"). Just a tiny thing that can be fixed.",
      "created_at": "2004-08-28T19:21:01.000Z"
    },
    {
      "author": "Village Idiot",
      "body": "By the way, I'm using IE6 on Win XP Home SP1. (Dumb automatic update won't download SP2)",
      "created_at": "2004-08-28T19:22:53.000Z"
    },
    {
      "author": "Sandra",
      "body": "I go on vacation for one week and so much has changed.  The new site looks great!",
      "created_at": "2004-08-29T22:56:08.000Z"
    },
    {
      "author": "eden project",
      "body": "you should serve dos equis, just a personal favorite, and get shiner light. it's a texas beer, im not even sure if it is big around the country, but it's huge down here, it's a great dark beer!",
      "created_at": "2004-08-31T14:27:14.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
