{
  "id": 530,
  "title": "Week 0: Big news",
  "body": "The Moxie has big news -- bigger than big news! News so immense it will change nearly every aspect of our tiny little movie theater in one fell swoop. Several people have approached us over the last two months asking if we had \"big news,\" and I'd always assuage their curiosity with a simple dismissal, \"Nicole's not pregnant, so I don't know what other big news you're talking about.\" But I'm here today to tell you that the rumors of us having \"big news\" are, indeed, true.<br/><br/>We have big news.<br/><br/>Now, I bet you're saying to yourself, \"spit it out already, you frackin' blog tease!!!\" All in good time, my friend. All in good time. You see, I had every intention of making the announcement today, but then my inner public relationsliaison (Jim) piped up and questioned why I would want to write about such important news on a Friday, one of the least trafficked days on the blog? \"You're right,\" I said to Jim. \"I'll just post a teaser.\" And so here we are... in the middle of a tease post.<br/><br/>What I will tell you is this: if you notice the title of today's post, you'll see a numbered week attached to it. That number signifies that (a) something big is going to happen at a predetermined time in the future, as predicated through the weekly numbers, and (b) the Moxie Blog is about to kick its own ass into high gear again. The changes we're about to undertake are significant enough to force me to resign from my freelance editing job, and interesting enough to warrant plenty of blog posts, which means you'll be seeing a lot more of me around these here parts, and I couldn't be more excited.<br/><br/>That's enough teasing for today. Let your mind speculate over the weekend, and I'll be back on Monday afternoon to either deny or confirm your wildest Moxie fantasies. Until then, you stay classy, Springfield!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-03-07T22:35:06.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "thewayofthedinosaur",
      "body": "I will sell you this secret for . . . one burrito from Chipotle.",
      "created_at": "2008-03-07T22:57:41.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Nicole is really not going to like that pregnant thing, Dan. You better take that part off.",
      "created_at": "2008-03-07T23:08:27.000Z"
    },
    {
      "author": "dan",
      "body": "No she won't. She's the one who said it in the first place.",
      "created_at": "2008-03-07T23:31:45.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Your butthole.",
      "created_at": "2008-03-07T23:36:31.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "Or the ruination of Dan's fun . . . I will also take that in payment.",
      "created_at": "2008-03-07T23:55:47.000Z"
    },
    {
      "author": "stevie_g",
      "body": "Can we play \"Twenty Questions\" to try to figure this out? <br/><br/>If so, that didn't count as a question, BTW...",
      "created_at": "2008-03-07T23:56:55.000Z"
    },
    {
      "author": "stevie_g",
      "body": "And why is there a GOP banner on your website, dude? Dan, I thought I knew ye. I'm <em>stunned</em>.<br/><br/>That doesn't count as a question either.<br/><br/>And now there's an Ann Coulter banner...and these Conservative links on the left of the page. I'm feeling very disillusioned. Wow.",
      "created_at": "2008-03-08T00:06:25.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "Maybe all the uses of \"tease\" or \"ass\" in the post prompted it<br/><br/>:D",
      "created_at": "2008-03-08T00:22:14.000Z"
    },
    {
      "author": "drm00se",
      "body": "You're pregnant! Oh wait. We've been over that. Nevermind.",
      "created_at": "2008-03-08T01:34:28.000Z"
    },
    {
      "author": "PullTheString",
      "body": "The Moxie's been bought out by AMC?!?!  (First the GOP and now this?)",
      "created_at": "2008-03-09T03:46:58.000Z"
    },
    {
      "author": "stevie_g",
      "body": "I was actually thinking that they are are going to knock out the wall to the adjoining store, add a new auditorium, and thus fulfill Dan's original vision of a twin-plex...<br/><br/>Or the St. Louis Cardinals are going to take in a flick while in town...<br/><br/>Or maybe they're gonna finally add the Moxie brand to their soft drink selection...<br/><br/>Or they're going to put up the 3D marquee...<br/><br/>Or the restrooms are going to become individually segregated: one Men's one Women's...<br/><br/>I figure the more wild guesses I make, the better my chances, kinda like the lottery.",
      "created_at": "2008-03-09T22:58:03.000Z"
    },
    {
      "author": "drm00se",
      "body": "<blockquote><cite>Posted By: stevie_g</cite>Or the restrooms are going to become individually segregated: one Men's one Women's...</blockquote><br/>Never!",
      "created_at": "2008-03-10T05:52:16.000Z"
    },
    {
      "author": "drm00se",
      "body": "TODAY'S THE DAY! Last chance for crackpot theories!",
      "created_at": "2008-03-10T17:27:36.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "Who needs THEORIES?! I know the TRUTH!*<br/><br/><br/>*Dan will finally share from his ginger ale hoard",
      "created_at": "2008-03-10T18:38:45.000Z"
    },
    {
      "author": "drm00se",
      "body": "Gomz! I knew it!<br/><br/>My theory: For the next fifty weeks, one customer per day gets a free punch in the face. Hence the count, and why Dan had to quit his second job to devote more time to litigation.<br/><br/>OR<br/><br/>In exactly three months, we will begin selling our own home-brewed MOXIE BEER!<br/><br/>OR<br/><br/>In exactly three months, we will begin selling our own home-brewed MOXIE METH!<br/><br/>OR<br/><br/>Not.",
      "created_at": "2008-03-10T19:20:57.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "Ou own home-brewed Moxie Floozies*!<br/><br/><br/><br/><br/><br/>*Derek",
      "created_at": "2008-03-10T19:21:59.000Z"
    },
    {
      "author": "drm00se",
      "body": "Yes! I'm in!<br/><br/>Except I won't be here in three months.",
      "created_at": "2008-03-10T19:23:00.000Z"
    },
    {
      "author": "Megster",
      "body": "did you read this one?  jordan is worse here than in the more recent one... ugh.",
      "created_at": "2008-03-10T23:48:10.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
