{
  "id": 531,
  "title": "Week 1: The Moxie is moving",
  "body": "That's right, folks... we're moving! By the time our three year anniversary rolls around on September 21st, we hope to be completely set up at our new location in the Wilhoit Plaza, just to the East of Ophelia's. If you're not sure where that is, check out the interactive map below:\r\n\r\n<iframe width=\"447\" height=\"200\" style=\"border: 1px solid #000;\" frameborder=\"0\" scrolling=\"no\" marginheight=\"0\" marginwidth=\"0\" src=\"http://maps.google.com/maps?f=d&amp;hl=en&amp;geocode=17163278502898557826,37.207162,-93.294547%3B15577100547680852838,37.206250,-93.290255&amp;saddr=37.207166,-93.294557&amp;daddr=E+Pershing+St+%4037.206250,+-93.290255&amp;mra=dme&amp;mrcr=0&amp;mrsp=0&amp;sz=17&amp;sll=37.20609,-93.291703&amp;sspn=0.004367,0.010042&amp;ie=UTF8&amp;s=AARTsJpy7uWgypo4wWbSDk-eTWqlHPfCyw&amp;ll=37.206765,-93.292551&amp;spn=0.003418,0.00912&amp;z=16&amp;output=embed\"></iframe>\r\n\r\nThat's a mere 0.2722 miles, or roughly four football fields, to the East -- you can easily walk from door to door in less than five minutes. Now, I'm sure you're all curious as to the when, and why, and what for, which I'll cover in due time, but for now I just want to highlight a few of the added benefits of our new space.\r\n\r\n<table cellpadding=\"0\" cellspacing=\"2\" style=\"width: 447px; border: 1px solid #000;\"><tr><td style=\"background-color: #DDD; border: 1px solid #222; padding: 4px;\" align=\"center\"><b>OLD MOXIE</b></td><td style=\"background-color: #DDD; border: 1px solid #222; padding: 4px;\" align=\"center\"><b>NEW MOXIE</b></td></tr><tr><td style=\"border: 1px solid #222; padding: 4px;\">One screen</td><td style=\"border: 1px solid #222; padding: 4px;\">Two screens</td></tr><tr><td style=\"border: 1px solid #222; padding: 4px;\">75 seats</td><td style=\"border: 1px solid #222; padding: 4px;\">140+ seats</td></tr><tr><td style=\"border: 1px solid #222; padding: 4px;\">No discernible lobby, five folding chairs</td><td style=\"border: 1px solid #222; padding: 4px;\">A real lobby, with tables, chairs, sofas, etc..</td></tr><tr><td style=\"border: 1px solid #222; padding: 4px;\">Bottled beverages, no ice, limited menu</td><td style=\"border: 1px solid #222; padding: 4px;\">Bottled beverages, beer on tap, fountain soda, ice, and an expanded menu</td></tr><tr><td style=\"border: 1px solid #222; padding: 4px;\">Two unisex restrooms with one stall each</td><td style=\"border: 1px solid #222; padding: 4px;\">Separate men's and women's restrooms with at LEAST three stalls each</td></tr><tr><td style=\"border: 1px solid #222; padding: 4px;\">Reel-to-reel projection</td><td style=\"border: 1px solid #222; padding: 4px;\">Dual platter system</td></tr></table>\r\nAnd those are just the immediately obvious improvements! There are many more less-apparent benefits like increased foot traffic, programming flexibility, closer proximity to MSU, and the ability to ramp up our community outreach programs that I'll talk about over the course of the next few months.\r\n\r\nOur soft opening is tentatively scheduled for September 1st, with our full grand opening on the 5th, which means we only have 25 weeks to get everything done... as well as keep the Old Moxie up and running the entire time. It's going to be a stressful and exciting Summer, but if everything goes as planned, we'll all be able to enjoy a new and improved Moxie by Fall 2008.\r\n\r\nI'll be back in a day or two with more (hopefully some pictures too).",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-03-10T21:56:21.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brad",
      "body": "that is the radness. congrats you two!",
      "created_at": "2008-03-10T21:21:06.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "What? **waits a few breaths** No way. This . .  is . . . such a surprise. **appears to be reading off of a cue card**\r\n\r\nIf you guys need free labor I'll come pitch a hand . . . until the end of August . . . because I won't be here then  . . .\r\n\r\n\r\nB33r and grilled cheese sandwiches during the flicks! PERFECTION!!!",
      "created_at": "2008-03-10T22:19:02.000Z"
    },
    {
      "author": "Megster",
      "body": "exciting!  this is great news!  let me know if you need any help...though i drive a volkswagon...and am not good at lifting heavy things... hmm... let me know if you need kelly's help!",
      "created_at": "2008-03-10T23:42:54.000Z"
    },
    {
      "author": "drm00se",
      "body": "I'm so sad I'm leaving. I really wish I could be here for all of this :-(",
      "created_at": "2008-03-11T00:44:27.000Z"
    },
    {
      "author": "alegnar",
      "body": "So does that mean there wouldn't be an intermission anymore?  I kind of like that, it's a different flavor... :)",
      "created_at": "2008-03-11T02:58:03.000Z"
    },
    {
      "author": "dan",
      "body": "Well, we're still at odds with the intermission. The forecast is favorable that they will migrate with us to our new space, despite our transition to platters.",
      "created_at": "2008-03-11T03:32:02.000Z"
    },
    {
      "author": "brad",
      "body": "i say keep them, i luvz them. \r\n\r\nyou serving beer = more pee breaks needed by your patrons.\r\n\r\nor at least have a rule that if a movie is over 90 minutes you have an intermission, and not if its under. or something like that..",
      "created_at": "2008-03-11T03:54:18.000Z"
    },
    {
      "author": "tim",
      "body": "HOLY F@CK!!  \r\n\r\ncongrats, i know im not a regular! (so what's my opinion, right?)  but i really loved the old space, allot, it feels handmade and just really authentic and warm, yeah. about 88% of me is super happy for you guys! 10% of me is kind of sad about the loss of the old digs, and 2% feels gross for eating so many raviolis. gross....\r\n\r\nany way congrats!",
      "created_at": "2008-03-11T04:18:06.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "I love the intermission, everyone I've talked to loves them! They are part of the \"Moxie Feel\" that special touch*\r\n\r\n\r\n\r\n\r\n*lawsuit pending",
      "created_at": "2008-03-11T04:23:08.000Z"
    },
    {
      "author": "dan",
      "body": "<blockquote><cite>Posted By: brad</cite>or at least have a rule that if a movie is over 90 minutes you have an intermission, and not if its under. or something like that..</blockquote>\r\nThis may be the road we take, but we still have a long way to go before we make any final decisions about that particular aspect of the business.\r\n\r\n<blockquote><cite>Posted By: tim</cite>congrats, i know im not a regular! (so what's my opinion, right?)  but i really loved the old space, allot, it feels handmade and just really authentic and warm, yeah.</blockquote>\r\nDon't you worry... we're going to work hard to make sure the new place continues the same hand-built, Moxie vibe as our current place. We'll be pouring just as much blood, sweat, and tears into this opening (yuck) as we did the last... that's how we got the paint to turn that special hue of red.",
      "created_at": "2008-03-11T04:29:35.000Z"
    },
    {
      "author": "Fyse",
      "body": "Come off it Dan. We all know the real reason for the switch is so that you have lots of AWESOME stories to tell of the trials and tribulations you encounter along the way. It'll be just like old times! I look forward to sharing in your triumphs/pain...",
      "created_at": "2008-03-11T05:19:54.000Z"
    },
    {
      "author": "Girl #2",
      "body": "I am *super* excited about this. moving is always bittersweet (and the present Moxie will be missed). but I think this move is going to be great. I love the idea of have a place to sit and chill out and drink a beer if you accidentally (or intentionally) get to the theater too early; or if you want to stick around after to discuss the movie over a beer (granted that it isn't the late show you're staying after)...anyways, it's all awesome. \r\n\r\nI'm definitely available to help with the whole moving process.",
      "created_at": "2008-03-11T06:21:17.000Z"
    },
    {
      "author": "nate",
      "body": "This will define 2008.",
      "created_at": "2008-03-11T06:59:32.000Z"
    },
    {
      "author": "EdMo",
      "body": "Greatness for great people.  Awesome!",
      "created_at": "2008-03-11T07:00:48.000Z"
    },
    {
      "author": "Finy",
      "body": "awesome",
      "created_at": "2008-03-11T07:34:04.000Z"
    },
    {
      "author": "moviekid21",
      "body": "I love this news! But I'm gonna chime in too with the rest of the folks that are FOR the intermissions. It definetely adds to the art house/independent vibe of the Moxie.",
      "created_at": "2008-03-11T09:36:49.000Z"
    },
    {
      "author": "Sting",
      "body": "I love the intermissions too!",
      "created_at": "2008-03-11T17:56:37.000Z"
    },
    {
      "author": "evilvet",
      "body": "When I am at the corporate googleplex, I have no reservations about tripping over an aisle of bodies to refill my vat of popcorn and empty my bladder, chatting on the cellphone and screaming at my kids all the while.  The Moxie is an entirely different experience.  I will hold my water, shut my mouth, and smash my cell phone if it so much dares to vibrate so as not to disturb my Moxie compatriots.  The Moxie crowd is sophisticated.  Therefore an intermission serves as a dedicated time where one can take care of business both personal and professional, talk about the movie so far, and get refills without interrupting fellow movie goers.  If you lose the intermission, the experience may be compromised as these abhorrent behaviors bleed into the auditorium.  Keep the intermission, please.",
      "created_at": "2008-03-11T18:50:26.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Well said, vet.",
      "created_at": "2008-03-11T19:01:11.000Z"
    },
    {
      "author": "evilvet",
      "body": "Thanks; but the best argument for intermissions?  BEER ON TAP!!!",
      "created_at": "2008-03-11T19:07:58.000Z"
    },
    {
      "author": "DanerKebab",
      "body": "Very exciting!  I'm available to help in any way needed, neighbor!\r\n\r\nOh, and I vote in favor of intermissions, too.  And I like the way Jordan thinks:  beer and grilled cheeses all around!!",
      "created_at": "2008-03-11T19:14:44.000Z"
    },
    {
      "author": "stevie_g",
      "body": "ALL RIGHT DANO! Congrats, Dude! Just a couple questions:\r\n\r\n1). Any chance I can document the process photographically\r\n\r\n2). Since I was closest on my guess about what the big news was (I guessed you were knocking down the walls to the adjoining property and fulfill your original vision a a twin-plex), do I at least get a cookie?\r\n\r\nCoolawsomeexcellentness!",
      "created_at": "2008-03-11T20:35:54.000Z"
    },
    {
      "author": "dan",
      "body": "Steve:\r\n\r\n1) Sure\r\n2) How about a bag of popcorn",
      "created_at": "2008-03-11T20:49:30.000Z"
    },
    {
      "author": "mitsya",
      "body": "Yippee skippee!  Congratulations on the growth-- it's apparent that you're filling the formerly empty niche of decent movie house in Springfield quite nicely!  Here's to three more years of great movies at a great theater!",
      "created_at": "2008-03-11T21:20:21.000Z"
    },
    {
      "author": "nate",
      "body": "I know you're not really doing market surveys for it, and it's not exactly what this particular blog post is about, but my vote is for intermission as well, for what it's worth.  I love intermissions.",
      "created_at": "2008-03-11T22:43:45.000Z"
    },
    {
      "author": "Oscar",
      "body": "Intermissions make my bladder and tummy happy!",
      "created_at": "2008-03-12T00:42:33.000Z"
    },
    {
      "author": "stevie_g",
      "body": "Dan,\r\n\r\n1). Thanks!\r\nActually, I'd like to \"attempt\" some good pics of the old place, inside and out,  at some point too. Is it too early to register it for landmark status?\r\n\r\n2). I may take you up on that one of these days when I'm destitute.\r\n\r\nGlad to hear you plan to maintain the \"handmade\" intimacy. That is absolutely one of the things that makes it so special. You can actually feel the love and sweat you & Nicole, your family & friends put into it. I'd even vote to maintain a similar decorating plan, right down to the color scheme. Here's hoping you run into fewer headaces and delays this time around. \r\n\r\nSo from what you said (140+ total seats), you will have two auditoriums of roughtly the same size each as the current place, or will one be larger for 'bigger'/newer films and one smaller for 'littler' films or films that hace been there a while ? I guess you'll be answering/anticipating all our questions in the blog in due time.\r\n\r\nWhat ever you do, for the love of God, NO GAME ROOM!",
      "created_at": "2008-03-12T01:39:48.000Z"
    },
    {
      "author": "nicole",
      "body": "Oh, I might jazz up the color scheme slightly - but you can still expect to see lots of red.",
      "created_at": "2008-03-12T01:55:23.000Z"
    },
    {
      "author": "Duke1974",
      "body": "WOW!\r\n\r\n<stunned silence>\r\n\r\nWOW!\r\n\r\nM",
      "created_at": "2008-03-12T03:01:09.000Z"
    },
    {
      "author": "seedavework",
      "body": "I see that parking has not yet been discussed. Will Moxie 2.0 feature reserved parking for patrons?",
      "created_at": "2008-03-12T07:20:25.000Z"
    },
    {
      "author": "nicole",
      "body": "I have actually received two emails about this today! Yes, there will be plenty of free parking available.",
      "created_at": "2008-03-12T09:40:47.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "i was wondering about that as well... \r\ni deliver to the apartments on the second floor of that building a lot\r\nseems that a large portion of the parking (on the south side of the building) is always used up\r\nthe far west side of the parking lot tends to have less cars... but still yet...\r\nbut yeah.. eh\r\n\r\nso i didnt read any definitive news about grilled sandwhiches\r\nbut i was wearing one of my (many) moxie tshirts today.. when i stopped by O'Connell's deli\r\nthe nice owner lady mentioned that she heard something about you guys serving sandwhiches\r\ni told her thats been in the works for quite some time.. \r\nbut she seemed pretty supportive of the idea.. \r\nand suggested that it would be pretty simple and pointed back at some small grill thing she had\r\n\r\nSO HOP TO IT!!",
      "created_at": "2008-03-12T12:56:27.000Z"
    },
    {
      "author": "stevie_g",
      "body": "SO...is the the location in question...units 108 and 110?\r\n\r\n<img src=\"http://www.croxton.net/images/newmoxie_front.jpg\" alt=\"\" />\r\n\r\nI peaked through the window. Though it is a gutted mess now, I can definitely envision it's awesome future.\r\n\r\n<img src=\"http://www.croxton.net/images/moxie_concept_1_sm.jpg\" alt=\"\" />\r\n\r\nI couldn't resist. The Cinema Two marquee is a personal fantasy...\r\n\r\n<img src=\"http://www.croxton.net/images/moxie_concept_2_sm.jpg\" alt=\"\" />\r\n\r\nOr maybe a 3D marquee...",
      "created_at": "2008-03-15T05:32:22.000Z"
    },
    {
      "author": "dan",
      "body": "That's the space, Steve, but don't get your hopes up about the signage. There are historic tax credit rules that we have to work around, but I'll cover all of that in due time.",
      "created_at": "2008-03-15T05:37:07.000Z"
    },
    {
      "author": "CinemaUntapped",
      "body": "Congratulations all around! Let me know if there is anything I can do to help. I should be returning right around your re-opening date.",
      "created_at": "2008-03-16T17:34:42.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
