{
  "id": 533,
  "title": "2008 Ozarks Regional Air Guitar Championship",
  "body": "Just because we're moving later this Summer doesn't mean we're going to be pussy-footin' around with our alternative programming over the next few months. We have some huge events coming up, and one of the most anticipated is the <b>2008 Ozarks Air Guitar Championship</b>. If you missed out on the festivities last year... well, you really missed out. What started off as a rowdy no-holds-barred preliminary, culminated in a wet and wild finale that featured five grown men ripping off their clothes and spraying the audience (at the Landers, no less) with beer. I think they played a little air guitar as well.<br/><br/>There's going to be quite a few changes this year, which we're hoping will help lure in even more air guitar god/dess wanna-be's. First off, we're doing away with the two night event -- this year's competition, both prelims and finale, will happen on the same night (Friday, April 18th) under the same roof (upstairs at The Outland). Also, the event is going to be 18 and over -- and we're still going to have a full bar (for those of you 21 and over). We felt bad about shunning younger air guitarists last year, so this time around we're lowering the age requirement.<br/><br/>And finally, there was some bad blood last year about the order in which the air guitarists preformed. The people who signed up early ended up taking the stage first, giving an advantage to the late-comers who wrapped up the set. This year, if you pre-register at The Moxie, you'll be guaranteed a later slot in the line-up... AND you'll get in free to the event. Late-comers will have to pay cover at the door, and will be slotted at the beginning of the pack. Fair enough? We think so.<br/><br/>Keep your eye on <a href=\"http://www.ozarksairguitar.com\" target=\"_blank\" class=\"broken\">the official Ozarks Air Guitar website</a>, as it will be updated with new information over the weekend. Until then, start searching for your perfect 30 second riff, practicing your mid-air guitar kicks, and growing out your hair... because this year's gonna ROCK!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-03-14T03:42:06.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "The Four Finger Soc Em",
      "body": "<blockquote><cite>Posted By: dan</cite>five grown men ripping off their clothes and spraying the audience</blockquote> Filthy.",
      "created_at": "2008-03-14T08:05:12.000Z"
    },
    {
      "author": "drm00se",
      "body": "<blockquote><cite>Posted By: dan</cite>Just because we're moving later this Summer doesn't mean we're going to be pussy-footin' around with our alternative programming over the next few months.</blockquote><br/>You designed this entire sentence around putting the word \"pussy\" in your post, didn't you?",
      "created_at": "2008-03-14T20:34:57.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "Poor Dan and his mutinous employees.",
      "created_at": "2008-03-14T21:01:46.000Z"
    },
    {
      "author": "Grizzled Bill",
      "body": "<strong>Being crowned \"Champion Air Guitarist\" is like being deemed the smartest downs patient. Not my cup of tea. I'll pass.</strong>",
      "created_at": "2008-03-17T07:34:49.000Z"
    },
    {
      "author": "drm00se",
      "body": "<blockquote><cite>Posted By: Grizzled Bill</cite><strong>Being crowned \"Champion Air Guitarist\" is like being deemed the smartest downs patient. Not my cup of tea. I'll pass.</strong></blockquote><br/><b><i><u>HERESY!</b></i></u>",
      "created_at": "2008-03-17T19:10:56.000Z"
    },
    {
      "author": "nicole",
      "body": "Don't judge before you watch the competition - it's so much fun! And you don't have to actually participate to watch.",
      "created_at": "2008-03-17T21:19:10.000Z"
    },
    {
      "author": "SpringfieldMofo",
      "body": "Bold statements invigorate me.",
      "created_at": "2008-03-17T22:04:40.000Z"
    },
    {
      "author": "nate",
      "body": "Shouldn't the \"smartest downs\" patient be offended?",
      "created_at": "2008-03-17T23:15:01.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Okay, the site says 60 second pieces of song, and this post says 30 second pieces. Which is it? I really hope 60 second.",
      "created_at": "2008-04-04T09:13:58.000Z"
    },
    {
      "author": "nicole",
      "body": "It's 60 seconds!",
      "created_at": "2008-04-04T15:00:18.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Woo!",
      "created_at": "2008-04-04T18:21:18.000Z"
    },
    {
      "author": "nicole",
      "body": "Are you going to compete?",
      "created_at": "2008-04-05T00:10:42.000Z"
    },
    {
      "author": "drm00se",
      "body": "I thought we weren't allowed to compete?",
      "created_at": "2008-04-05T00:41:22.000Z"
    },
    {
      "author": "nicole",
      "body": "I don't see why you can't...we're having impartial judges, and if you come in costume with a stage name, who's to say anyone would even recognize?",
      "created_at": "2008-04-05T04:03:23.000Z"
    },
    {
      "author": "drm00se",
      "body": "Rekanaaahhhzzz!!!<br/><br/>Fair enough.",
      "created_at": "2008-04-05T10:36:17.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "Derek has to do this.",
      "created_at": "2008-04-05T18:35:04.000Z"
    },
    {
      "author": "Megster",
      "body": "i think i am going to do this... <br/><br/>does anyone own black leather chaps i could borrow?<br/><br/>just kidding... kind of...",
      "created_at": "2008-04-07T20:04:09.000Z"
    },
    {
      "author": "drm00se",
      "body": "Dooooo iiiiit Meeeeegsterrrrrr.<br/><br/>I'm not doing it, ftr.",
      "created_at": "2008-04-07T20:49:40.000Z"
    },
    {
      "author": "Megster",
      "body": "oh no... i am doing it... i was kind of kidding about the leather pants...",
      "created_at": "2008-04-07T21:19:29.000Z"
    },
    {
      "author": "brad",
      "body": "everyone should do it!!!!!<br/><br/>(so i can watch and laugh)",
      "created_at": "2008-04-07T22:08:14.000Z"
    },
    {
      "author": "Megster",
      "body": "when you register at the moxie do you have to have your songs ready?",
      "created_at": "2008-04-07T22:11:25.000Z"
    },
    {
      "author": "dan",
      "body": "No. Just have a stage name and your $5.00. You'll bring your songs on the night of the event.",
      "created_at": "2008-04-08T03:25:14.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
