{
  "id": 534,
  "title": "Week 2: Predicting the future",
  "body": "Before I begin today's post, I wanted to explain why, exactly, I've been starting titles with \"Week #:\". When I announced we were moving last Monday, we were exactly 25 weeks away from opening in our new space, which means today we're a mere 24 (my favorite number) weeks out. That's only 168 days away! Yikes. So that explains the numerical titles.<br/><br/>Last week was a productive one. We had a long sit-down meeting with our project manager, designer/architect, and engineer and tried to nail down as many details as we could before we put the project out to bid. Most of the details were easy, like what kind of floor finishing we wanted, how many colors of paint we were going to need, what type of finish we wanted on the doors, etc., etc.. When it came time to discuss the new Cinebar, however, that's when things got tricky. In order for the engineer to properly gauge electrical load, drain placement, and HVAC requirements, he needed to know what equipment we were planning on including in the bar... and, of course, we had no idea.<br/><br/>When we opened the original Moxie, there was never a pressing need (nor available capital) to worry about such things. Once we had the Cinebar built, we simply went to Sears and bought whatever we could afford: refrigerators, plastic shelving, popcorn scoops, etc.. This time around, it's a totally different story. We actually have to plan ahead!<br/><br/>So, late last week we ventured out in search of bar \"stuff\" (bar sink, under-counter cooler, display refrigerator, kegerator, etc.), and were immediately bowled over by the prices on what seems to be, at least in my naive little mind, a simple piece of equipment. It was like a mental calculator was slowly assessing the financial damage : $1500 for that, $2000 for that, $1200 for that. After seeing the cost of this stuff, it's obvious that we're in the wrong business. I need to start selling bar equipment! Those Feller's fellers must be making a killing! I can't wait to start pricing the bathroom fixtures (ugh!).<br/><br/>I've also been scoping out available used equipment that shows up on CraigsList from Springfield, St. Louis, KC, Tulsa, OKC, and Memphis. If there's a deal to be found, I'm sure it will show up on CL sooner or later. Our goal is to wrangle all our development, consulting, and construction costs to around $40 per square foot (hopefully lower), which means we'll need to lay out a hefty chunk of change for all the bar equipment AND new theater stuff (new chairs, second projector, etc.). It's going to be tough, but I think we can swing it.<br/><br/>In the meantime, if one of our faithful readers has a lead on some good used, or highly discounted new, bar equipment, please let us know. I have a hard time paying more for a display cooler than a new projector head.<br/><br/>Uh oh. Intermission time!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-03-18T07:00:36.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "brad",
      "body": "i'll ask the fam, they work in the food service business, as you know. they'll know of places that house used equipment, and/or some places that might be selling stuff at the moment.",
      "created_at": "2008-03-18T08:24:14.000Z"
    },
    {
      "author": "dan",
      "body": "Sweet! Thanks Brad!",
      "created_at": "2008-03-18T09:27:27.000Z"
    },
    {
      "author": "drm00se",
      "body": "Pimped out cinebar! Sweet!",
      "created_at": "2008-03-18T23:33:44.000Z"
    },
    {
      "author": "brad",
      "body": "dan, my mom said this place in springfield called Fellers Fixtures has both new and used restaurant and bar equipment. <br/><br/>other than that, she said things are being put up for sale on craigslist constantly, from places going out of business. so checking here, stl, kc, columbia craigslists will probably turn up something. good luck! i'll let you know if she finds anything else.",
      "created_at": "2008-03-19T04:23:08.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
