{
  "id": 535,
  "title": "Week 2: The Why",
  "body": "<i>Ed. note: This is a long one, so get comfortable.</i><br/><br/>Now that we've discussed where and when we're moving, I think it's time to talk about why we're taking the plunge... again. Several people have told us that they're disappointed with our decision to move (for various reasons), and expressed concern that the new Moxie won't have the same feel as the old one. Hopefully this post will help allay people's misgivings and/or misinterpretations over the intent of our migration East.<br/><br/>So, why are you moving The Moxie? Three reasons: space, profitability, and flexibility; all of which are intertwined and equally responsible for the continuing success of our little cinema. Adding a second screen is the single most important thing we can do to increase the probability that we'll still be around five years from now, and here's why:<br/><br/>Our current business model -- a single screen calendar house -- is a difficult one to maintain, mainly because it opens itself up to unique weaknesses in regards to our income generating potential. Over the last two and a half years we've discovered several scenarios where these financial pitfalls come into play:<br/><br/><b>1. Sold out shows</b> - This is an enviable problem to have, and I'm certainly not claiming we're moving because we have sold out shows seven days a week. Anyone who's come to a movie on either a Tuesday, Wednesday, or Thursday night knows that's not the case. When we do have sold out shows, however, we find that we're turning away more and more people, which is something we absolutely hate doing.<br/><br/><b>2. Strong showings</b> - Being a single screen calendar house theater poses two distinct challenges: (a) we have to predict, with varying degrees of success, how popular a certain movie will be, long before we actually show it, so we can determine how long it will play on our screen; and (b) if we want to keep our calendar as fresh and topical as possible, we're forced to keep continually rotating through new titles, often releasing movies well before we've satisfied their demand.<br/><br/>Take, for instance, LARS AND THE REAL GIRL -- the film was a huge success; audiences loved the story, and it brought in gigantic crowds from the first to the last screening, but since we only had it scheduled for two weeks, we had to send it on its way. The film that replaced it only brought in half the audience that LARS did. Had we been able to keep it for a third, or maybe even a fourth week, who knows how many more tickets we could've sold. Throwing away your hottest product when it's still selling like hotcakes defies business logic, but it's something we've had to do for nearly three years.<br/><br/>Also, the studios are never happy when they see you're doing excellent business for two solid weeks, and you suddenly drop their film. They've called us before, asking if we'd consider carrying high-grossing films for a couple more weeks, and it's hard to tell them that we can't. The last thing you want to do in this business is piss off the studios, so we've had to really brush up on our apologizing skills.<br/><br/><b>3. Prime slot swapping</b> - When you have two movies playing on the same screen (also known as \"splitting\"), and one of them is bringing in two to three times as many people as the other, it doesn't make a lot of sense to give prime slots to the under-preforming film. Since we want to give all our films an equal chance, and provide decent showtimes throughout the week, this is something we're often forced to do.<br/><br/>A good example would be the three weeks we screened the AQUA TEEN movie, during which time nearly every showing sold out. The films that were split with AQUA TEEN held their own, but the crowds were more like 20 or 30 people per show, compared to AQUA's 70+. Had we had two screens at that time, we could've played both films three or four times a day, resulting in a significant increase in attendance.<br/><br/><b>4. Strategic positioning</b> - Over the years, we've lobbied and begged for many, MANY movies that the studios have deemed \"too big\" for for our little screen. Despite our claims of being able to produce larger audiences, most of these titles end up being given to the multiplexes, where they receive a lowly-attended two week run and then disappear into the night, never to be seen or heard from again.<br/><br/>Occasionally we'll bring one of these films back if we believe the movie was better suited for Moxie audiences in the first place, or it wasn't given a fair chance due to poor marketing efforts at the larger theaters. Out of the 240+ different movies we've shown since we opened, only 10 have been picked up under these circumstances, and, believe it or not, we ended up doing better than the multiplexes with more than half of those.<br/><br/>Now don't get me wrong, just because we're getting a second screen doesn't mean we're going to start picking up more films from the multiplexes. More often than not, we get all the movies we ask for, so we rarely have to play second fiddle. An additional screen does, however, give us the flexibility to pick up more of the multiplex's seconds IF they were to suddenly start poaching titles from us. This added flexibility would allow us to pick up the film within a few days of its final showing at the multiplex (similar to how Springfield 8 picks up films that Campbell opens first), which would essentially level the playing field and give our audience the freedom to choose where they want to see that particular movie.<br/><br/># # # #<br/><br/>Wow, I've been going on for longer than I had expected. Long story short, if we plan on keeping The Moxie running as a viable art house cinema in the face of increasing competition and growing demand, we have to expand, and, unfortunately, there's no room to do that in our current building. This is a good thing -- for us (hopefully), for you (expectedly), and for all the other people who haven't even heard of The Moxie yet.<br/><br/>And as for the new Moxie lacking the same laid-back, home-spun feel of the original -- that's nonsense. We're still the one's in charge of building and running it, and I'm sure we're going to be just as strapped for cash as we were when we originally opened, so you can expect plenty of the same DIY details that make our current space seem so... so... Moxie-y. Just imagine the current Moxie, but with a second screen and a bigger lobby. We're not turning into a corporate multiplex, I promise.<br/><br/>PS - Speaking of corporate multiplexes, <a href=\"http://www.news-leader.com/apps/pbcs.dll/article?AID=/20080321/BUSINESS/803210358/0/RSS\" target=\"_blank\" class=\"broken\">Wehrenberg is no longer for sale</a>, which points to either a weak market or an inflated asking price... or probably a bit of both.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-03-22T08:06:01.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "drm00se",
      "body": "Well said, Mr. Moxie Dan Man.<br/><br/>Excitement abounds in Moxieland!",
      "created_at": "2008-03-22T08:52:52.000Z"
    },
    {
      "author": "nate",
      "body": "Hopefully the old place will become something cool yet again.",
      "created_at": "2008-03-22T20:20:37.000Z"
    },
    {
      "author": "alegnar",
      "body": "Turning away people is no good, especially if they're new.  They might decide to go elsewhere if they think that's the norm.  The new Moxie will be awesome. :)",
      "created_at": "2008-03-22T21:05:05.000Z"
    },
    {
      "author": "stevie_g",
      "body": "I know this was you original intent, but money and logistics bore their ugly heads. Now you have proven yourselves; I would think that financial backing would be easier to obtain this time, but then again we are in a recession. Great timing, Dan! lol.<br/><br/>I would like to get into the new location at some point while it is still in it's raw state, and get some pictures before much is done. Anyway, let me know a time (Fridays are best for me) when I might be able to get in and snap away. Thanks, Dan.",
      "created_at": "2008-03-22T21:36:00.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
