{
  "id": 538,
  "title": "Week 5 - Time to buckle down",
  "body": "Now that we're bearing down on our third year of business, we're finally starting to get a handle on the ups and downs of the cinematic tide. Traditionally, the first quarter of the year is our strongest, followed by the third, fourth, and second. Each quarter is unique in that it offers up various challenges for us to overcome. For instance:\r\n\r\nQuarter 1: The weather is typically cold, which is good for business, but can often take a turn for the worse and suddenly dump several inches of snow and ice, sometimes to the point where we have to close for a day or two. Other advantages: many of our customers are flush with holiday gift certificates, students are still in town, and the awards season is in full swing, pushing national coverage for many of our smaller films\r\n\r\nQuarter 2: Very few advantages here –- the onset of beautiful Spring weather lures audiences into the out of doors, leaving the majority of our showings sparsely attended. Of course, this seasonal dip isn't exclusive to us, it's the case with theaters big and small all across the nation. We take an additional hit when finals roll around in May and the students make a mass exodus for the Summer, as well as when the Springfield Cardinals begin their season.\r\n\r\nQuarter 3: Ah, the dog days of Summer. Sweltering heat tempts audiences back into the dark air-conditioned coolness of movie theaters across the country. We typically see an increase in wide-appeal releases around this time as well, usually coinciding with the big Summer blockbusters. Students start trickling back towards the beginning of August, and our anniversary caps off a traditionally solid quarter.\r\n\r\nQuarter 4: This would be a much stronger quarter if it weren't for those pesky holidays! Many people during this time of the year are choosing holiday sales over cinema seats, which is a good and bad thing. It's good because we see a large increase in gift certificate sales, but bad because our attendance numbers drop. We also experience a mini-dip when students have winter finals and head home for the holidays.\r\n\r\nTo survive in this feast or famine environment, we've quickly learned that you have to store up your nuts in the Summer so you won't starve to death during the cold months. The difficult part, however, will be living off our savings while simultaneously funding our not-so-cheap move to the Wilhoit, and pay our glorious taxes. In anticipation of this double draining on our savings, we're making several cut-backs to some of our expendable expenditures, which should hopefully carry us through Q2.\r\n\r\nAs was the case when we originally opened The Moxie back in 2005, it's going to be a financial photo finish on opening day at the new location -- which one's going to cross the line first: our bank account or our sanity? There's nothing quite as stressful or financially taxing as upgrading your entire business model... except, maybe, going out of business altogether. I'm sure that's pretty stressful as well, but hopefully we won't have to experience that scenario.\r\n\r\nBleh. Writing this post sucked. It's been just as exhausting as it has been cathartic. I just wanted to set the stage for what's lining up to be the single most exciting, terrifying, and demanding Summer of my life. Nothing more, nothing less. Instead, I think I sound sort of whiney, but that wasn't my intent. In fact, I'm fired up! I'm pumped and ready to either get the new place open in triumphant fashion, or go down in a glorious blaze of credit card bills and beer bottles! Yee ha!!!\r\n\r\nMore exciting stuff to come, I promise.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-04-13T07:17:06.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "thewayofthedinosaur",
      "body": "So bottom line is you're letting Derek go right?",
      "created_at": "2008-04-13T21:34:04.000Z"
    },
    {
      "author": "drm00se",
      "body": "**Wishes he could post a crying vanillacon**",
      "created_at": "2008-04-13T23:47:36.000Z"
    },
    {
      "author": "suzy",
      "body": "um what's a vanillacon?",
      "created_at": "2008-04-25T22:06:23.000Z"
    },
    {
      "author": "brad",
      "body": "<img src=\"http://www.ffkatmff.com/extensions/Vanillacons/smilies/standard/gomz.gif\" alt=\"\" />",
      "created_at": "2008-04-25T23:14:19.000Z"
    },
    {
      "author": "thewayofthedinosaur",
      "body": "He's a witch! Burn him!",
      "created_at": "2008-04-26T20:01:34.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
