{
  "id": 539,
  "title": "Week 6,7,8: What the crap?!",
  "body": "What happened? Where're all the posts for weeks six, seven, and eight?! Oh... that's right... I didn't write them! Shame on me. If this blog were a plant, and my writing the equivalent of life-sustaining water, this portion of the website would be as dried up and dead as all those brown plants in our lobby! What can I say... my thumb's about as green as it is awesome*.\r\n\r\n*obvious lie; all parts of my body are AWESOME!\r\n\r\nSeriously though, where has the time gone these last few weeks? I meant to sit down and bang out a post or two, but honestly there wasn't much to write about. We've been busy with the mundane minutiae and red tape that goes along with moving a business from one location to another: re-filing permits, transferring licenses, etc.. Not the most compelling subject to write about, I can assure you.\r\n\r\nThings started to liven up a bit on Friday, however, when we had a meeting with the four contractors who will be bidding on construction for the new theater. They all seemed like nice enough guys, but as far as they're concerned I'm just a bag of money with arms and legs (and an awesome thumb). Their bids are due by May 14th, at which point we'll get to decide which one will build the theater of our dreams (and hopefully yours too). I'm really, REALLY hoping the real estate / development downturn has them hungry for a project, because our budget is tighter than two elephants taking a bath in one of those little plastic cups that come attached to a new bottle of Pepto-Bismol.\r\n\r\nIn other news, my body has been slowing breaking down over the last five months, and I have a sneaking suspicion that an increased amount of stress is to blame. <a href=\"http://i29.tinypic.com/5d2t1j.jpg\">The empty box at my feet</a> that says \"TACO BELL BIG BOX MEAL,\" however, is completely innocent. Do you know what a great deal those things are?! Five dollars for a chicken gordita, crunchy taco, bean burrito, cinnamon twists, and a large Dr. Pepper! Un. Be. Leivable. And at only 475% of my daily suggested intake of sodium!!!\r\n\r\nAnyways, I've had non-stop abdominal cramps since mid-December, coupled with a headache that lasted from April 1 through the 28th. Naturally, being prone to hypochondria, I diagnosed the first as stomach cancer and the second as either a brain tumor or an incredibly slow aneurism. The headache mercifully receded after a sweet massage from a Moxie regular who also happens to be a licensed massage therapist, but has yet to completely dissipate.\r\n\r\nThe abdominal pains, however, are chronic. I've had them checked out by two different doctors, and they can't seem to figure it out -- one of my doctors said it was one of five things: constipation, constipation, constipation, stress, or cancer. He told me this AFTER I explained to him that I wasn't, nor have I ever been, constipated. I EAT TACO BELL FOUR TIMES A WEEK, FOR CRYING OUT LOUD!!! So it's either stress or cancer... great. Seeing as how the pain has yet to kill me, or keep me from lifting 40 pound reels over my head several times a day, I'm going to ride it out until we get settled in at the new place. If it's not gone soon thereafter, I'll have to figure something else out.\r\n\r\nAnd that concludes tonight's episode of \"Too Much Information About Dan.\" I'll be back later next week with a more worthwhile post, I promise. Adios!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-05-04T07:56:43.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "stevie_g",
      "body": "<blockquote>We've been busy with the mundane minutiae and red tape that goes along with moving a business from one location to another: re-filing permits, transferring licenses, etc.. Not the most compelling subject to write about, I can assure you.</blockquote>\r\nBut Danno, it's exactly this kind of \"mundane minutia and red tape\" that kept us so riveted from blog-to-blog during the realization of Moxie I.0. Plus the fatalistic vibe of the previous post had me kinda spooked the last three weeks. My god, man! We're living vicariously through you; don't deny us our regular blog fix, no matter how mundane!",
      "created_at": "2008-05-04T10:48:15.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "<blockquote><cite>Posted By: dan</cite>Where're all the posts</blockquote>Where's your grammar now, college boy??\r\n\r\n<blockquote><cite>Posted By: dan</cite>minutiae</blockquote>Some would spell it (more correctly) \"minutia.\"\r\n\r\n<blockquote><cite>Posted By: dan</cite>Their bids are due by May 14th, at which point we'll get to decide which one will build the theater of our dreams (and hopefully yours too).</blockquote> Just like American Idol. You should tape this. And make them sing.",
      "created_at": "2008-05-04T12:23:53.000Z"
    },
    {
      "author": "dan",
      "body": "Max is high.",
      "created_at": "2008-05-04T21:59:47.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Oh man, you swapped my \"minutiae\" for your \"minutia\". You're a corrupt boss.",
      "created_at": "2008-05-05T00:58:45.000Z"
    },
    {
      "author": "drm00se",
      "body": "I have a feeling this scandal goes all the way up to the very top layers of the Moxie bureaucracy. We should investigate, Max.",
      "created_at": "2008-05-06T22:42:12.000Z"
    },
    {
      "author": "bmozer",
      "body": "Regardless of piddly typo's, great post.  I laughed out loud.  I've been having chronic chest pains lately, maybe I have congestive heart failure.  I think theaters are inherently bad for one's health.",
      "created_at": "2008-05-07T20:46:34.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
