{
  "id": 54,
  "title": "Open Quotation Call",
  "body": "A couple of people have been suggesting movie quotes for me to add to the quotation pool, of which one random quote is pulled each and every time this page loads. Well, now's your chance to flood, overwhelm, and/or inunduate me with all your favorite quotes. Come one, come all... well, not quite <i>all</i>. Here's a few rules:\r\n\r\n<ol><li>Each quote should be accompanied with the name of the character who spoke it and the movie in which it appeared.</li>\r\n<li>No quotes from Jerry Bruckheimer movies, please. Ok, ok... no, post <i>Con Air</i> quotes. Pre-<i>The Rock</i> quotes are okay, but still looked upon with more than a little bit of reluctance.</li>\r\n<li>Please don't send me any naked quotes of yourself.</li>\r\n<li>Pleese make shure their speel-checked pleese.</li></ol>\r\nThat's it. Give me what you got!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-08-28T02:35:39.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Fyse",
      "body": "I'm first! I'm first! Quick, think of a quote...\r\n\r\n\"He's not the Messiah, he's a very naughty boy. Now piss off!\"\r\n - Brian's Mum, Life of Brian\r\n\r\nWait, that makes me seem like a Python geek. I can think of something cooler, hold on...",
      "created_at": "2004-08-28T03:34:34.000Z"
    },
    {
      "author": "Fyse",
      "body": "Brian's Mum's name is Mandy, by the way. Not that I know that, you understand...",
      "created_at": "2004-08-28T03:37:20.000Z"
    },
    {
      "author": "Newell",
      "body": "Damn! Someone beat me to the obligatory Python quote! Oh well... how about...\r\n\r\n\"Good shooting... shitty shooting.\"\r\n            - Special Agent Paul Smecker\r\n                   'The Boondock Saints'",
      "created_at": "2004-08-28T08:01:38.000Z"
    },
    {
      "author": "Brandon",
      "body": "\"And on this day our hero hath slain 30 men.  ...32, if you count the zombies.\"\r\n\r\n~Narrator, ending \"Madness Combat,\" the classic cartoon seen on madnesscombat.com   ...wait, that isn't a feature film!\r\n\r\nby the way, if my under-21 high-school or college friends and i bought beer @ The Moxie, we would personally be responsible for its demise.  take this as a compliment that our biggest concern is your business, and not our good times, b/c most people think nothing of the sort.  good times and good alcohol come in second, just to let you know that we're normal.",
      "created_at": "2004-08-28T09:28:05.000Z"
    },
    {
      "author": "John",
      "body": "Bert: It'll happen Max. It's just... You're like one of those Clipper Ship captains; you're married to the sea.\r\n\r\nMax: Yes, that's true, but I've been out to sea for a long time.",
      "created_at": "2004-08-28T12:36:51.000Z"
    },
    {
      "author": "John",
      "body": "Oh, sorry. I didn't follow the rules. The previous quote was from Rushmore.",
      "created_at": "2004-08-28T12:40:42.000Z"
    },
    {
      "author": "Trinity",
      "body": "\"Laugh it up, fuzzball.\"  \r\nIf you don't know...\r\nIt's the very handsome Han Solo in the very original Star Wars.",
      "created_at": "2004-08-28T22:35:18.000Z"
    },
    {
      "author": "mod",
      "body": "\"you'd better take care of me, Lord...because if you don't you're going to have me on your hands.\" \r\n\r\nRaoul Duke (Depp) in Fear and Loathing in Las Vegas.",
      "created_at": "2004-08-29T00:50:55.000Z"
    },
    {
      "author": "Oz",
      "body": "\"As many of you all know by now, we lost another employee yesterday.  Holden was a thief and a disturbed young man, and what happened as a sad thing.  Perhaps we can learn a lesson from this tragedy, like don't steal and don't be disturbed.\"  --Jack Fields, *The Good Girl*",
      "created_at": "2004-08-29T04:14:16.000Z"
    },
    {
      "author": "Oz",
      "body": "\"Well yeah, Tammy liked to drive her dad's thresher.  She said the heavy vibration helped her think.  But I know for a fact Tammy only smoked after a good drive.\"  --Amber Atkins, *Drop Dead Gorgeous*",
      "created_at": "2004-08-29T04:53:21.000Z"
    },
    {
      "author": "Chuck",
      "body": "\"I gave her my heart and she gave me a pen.\"\r\n\r\n-Lloyd Dobler \"Say Anything\"",
      "created_at": "2004-08-29T06:02:36.000Z"
    },
    {
      "author": "Oz",
      "body": "typo alert:  Jack Fields said, \"...and what happened WAS a sad thing.\"",
      "created_at": "2004-08-29T06:50:08.000Z"
    },
    {
      "author": "squeak",
      "body": "Where did they teach you to talk like this? At some Panama City sailor-wanna-hump-hump bar, or is this getaway day and your last shot at his whiskey? Sell crazy someplace else...we're all stocked up here.\r\n\r\nJack Nisholson, As Good As It Gets\r\n\r\nonly one I could think of, maybe because I saw it recently and I suck at movie trivia? ;)",
      "created_at": "2004-08-29T14:28:11.000Z"
    },
    {
      "author": "Sandra",
      "body": "\"I will not be ignored.\" - Sandra\r\n\r\nno, no, no Alex Forrest (Glen Close) in Fatal Attraction.",
      "created_at": "2004-08-29T22:53:31.000Z"
    },
    {
      "author": "Nicole",
      "body": "\"Got anything besides Mexican food?\" -- Dusty Bottoms, Three Amigos",
      "created_at": "2004-08-30T01:28:49.000Z"
    },
    {
      "author": "Newell",
      "body": "\"From now own I'll lube my own damn crank shaft!\" -Elvis\r\n\r\nBubba Ho-Tep",
      "created_at": "2004-08-30T05:24:25.000Z"
    },
    {
      "author": "Anon",
      "body": "These are some of the worst quotes ever. Here's another:\r\n\r\n\"No matter where you go, there you are.\"\r\n\r\nBuckaroo Banzai",
      "created_at": "2004-08-30T07:49:20.000Z"
    },
    {
      "author": "girl with a movie camera",
      "body": "does it count if the quote is from your own, yet to be released (let alone edited) film? probably not, huh? ;-)\r\n\r\nso, here's a quote from an \"actual\" film:\r\n\r\nmovie theatre patron: \"Do you serve beer or any alcohol?\"\r\n\r\nEnid: \"I wish. Actually *you* wish... After about five minutes of this movie, you're gonna wish you had ten beers.\"\r\n\r\nfrom Terry Zwigoff's  \"Ghost World\" (2000)",
      "created_at": "2004-08-30T16:53:02.000Z"
    },
    {
      "author": "einahpets",
      "body": "\"No, not Janey Briggs. She's got glasses. And a ponytail. Ugh, she's got paint on her overalls. What is that?\"\r\n-Jake, from Not Another Teen Movie\r\n\r\n\r\n(I tried to find the shit bomb quote, but couldn't...)",
      "created_at": "2004-08-30T17:10:24.000Z"
    },
    {
      "author": "bjork24",
      "body": "Woo wee, look at all those quotes! I'll insert them into the rotation when I get a free moment today. Lots of \"As Good As It Gets\" quotes...",
      "created_at": "2004-08-30T17:38:07.000Z"
    },
    {
      "author": "einahpets",
      "body": "\"Make mine sarsparilly!\"\r\n-Calamity Jane",
      "created_at": "2004-08-30T18:06:14.000Z"
    },
    {
      "author": "dave",
      "body": "\"No man, a goocher. That's really bad. You remember when Clint Bracken and those guys got wiped out on Weed Hill in Durham? Billy told me they were flipping for beers. An' they came up a goocher just before they got into the car. And bang! They all got totalled! I don't like this. Sincerely.\"\r\n\r\n- Vern, \"Stand By Me\"",
      "created_at": "2004-08-30T18:35:11.000Z"
    },
    {
      "author": "bjork24",
      "body": "Okay, all the quotes up to this point have been added. Thanks everyone!",
      "created_at": "2004-08-30T19:01:56.000Z"
    },
    {
      "author": "Donald Melanson",
      "body": "\"New York Herald Tribune!\"\r\n\r\n- Patricia, \"Breathless\"",
      "created_at": "2004-08-30T21:49:55.000Z"
    },
    {
      "author": "Tim",
      "body": "\"Hello.\"  -Citizen Kane\r\n\r\n\"Wow!\" - Honey I Shrunk the Kids\r\n\r\n\"I love you.\" - Paper Moon",
      "created_at": "2004-08-31T00:57:16.000Z"
    },
    {
      "author": "Lor",
      "body": "My favourite right now is:\r\n\r\n\"Who died and made you king of the zombies?\"\r\n\r\nEd, Shaun of the Dead.",
      "created_at": "2004-08-31T01:05:13.000Z"
    },
    {
      "author": "vadergrrrl",
      "body": "All I need are some cool waves, some tasty buds, and Im fine.\r\n\r\n-Do I need to say who said that, or should we all know?\r\n\r\nJeff Spicolli",
      "created_at": "2004-08-31T02:42:25.000Z"
    },
    {
      "author": "Newell",
      "body": "\"Don't you teach 'em knife fighting. You teach 'em to kill. That way they meet some son of a bitch studied knife fighting, they send his soul to Hell.\" \r\n- Scott\r\n\r\nSpartan",
      "created_at": "2004-08-31T04:39:49.000Z"
    },
    {
      "author": "Eden Project",
      "body": "\"Yeah I want some burgers, some fur burgers\" - Sean Patrick Harris (Doogie Howser) 'Harold & Kumar Go To White Castle'\r\n\r\n\"You're my boy Blue\"\r\n- Frank Ricard (sp?) 'Old School'",
      "created_at": "2004-08-31T14:22:05.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Well, for obvious reasons, I like:\r\n\r\n\"I'm going crazy.  I'm standing here solidly on my own two hands and going crazy.\" Tracy Lord, The Philadelphia Story\r\n\r\nand\r\n\r\nC.K. Dexter Haven: Sometimes for your own sake, Red, I think you should have stuck to me longer.\r\nTracy Lord: I thought it was for life but the nice judge gave me a full pardon.\r\nPhiladelphia Story",
      "created_at": "2004-08-31T22:20:49.000Z"
    },
    {
      "author": "ARON",
      "body": "\"Dont Bogart the can....man.\" Janene Garaffalo",
      "created_at": "2004-09-04T01:03:27.000Z"
    },
    {
      "author": "dave",
      "body": "\"I'm Enzo... the baker.\"\r\n-Enzo The Baker, The Godfather",
      "created_at": "2004-09-05T04:04:56.000Z"
    },
    {
      "author": "Crystal",
      "body": "\"I'm not a witch, I'm your wife. But after what you just said, I'm not even sure I want to be that anymore!\"\r\n-Miracle Max's wife The Princess Bride\r\n\r\n\"You've been mostly dead all day.\" Fezzic The Princess Bride\r\n\r\n\"You're right, you're right. I know you're right.\" Marie When Harry Met Sally",
      "created_at": "2004-09-06T08:26:36.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
