{
  "id": 540,
  "title": "Week 8: The one about rising prices",
  "body": "*I know this post is a bit long-winded, but there's lots of important goodies in here so don't skip it!\r\n\r\nWhen we opened The Moxie back in 2005, we did a lot of research regarding ticket and concession prices. On opening day our adult evening ticket ($8.00) was the same price as Campbell 16, and $0.50 more expensive than Springfield 8. Within a matter of months, however, Springfield 8 bumped up their adult evening shows to match ours and Campbell's, and over the next two years both theaters would raise ticket prices again to $8.50, while ours remained at $8.00, making us the cheapest first-run theater in Springfield.\r\n\r\nThe new downtown Hollywood Theater that will be opening later this Summer has yet to release their ticket prices, but I wouldn't be surprised if they're $9.00 or higher. Again, that's not a confirmed fact, it's just a guesstimate based on the prices of competitors and the perceived need for Hollywood to recoup money after spending an untold amount on new construction. If that's the case, Campbell 16 and Springfield 8 may very well follow suit, or they might choose to keep their current price structure in hopes of leveraging themselves against their newest competitor. Now, I bet you're thinking to yourself, \"all this talk about rising ticket prices must mean The Moxie is going to raise theirs too.\" Well, you're kind of right, but also sort of wrong.\r\n\r\nNow that we're entering into our fourth year of operation, it's time to start thinking about our ticket prices again. Our current three tier structure is as follows: adults are $8.00, seniors and students are $6.50, and matinees (as well as all shows on Monday) are $5.00. Once we move into our new location in September, matinee tickets will jump up $1.00, senior/student prices will nudge up $0.50, but our standard adult admission will remain unchanged, leaving us with the following ticket matrix:\r\n\r\n$8.00 Adults\r\n$7.00 Senior / Students\r\n$6.00 Matinee\r\n\r\nSix, seven, eight. Clean, simple, necessary. At these prices, we're still the cheapest ticket in town for adult evening shows and matinees, which I think is important when we have a brand new theater opening a couple blocks away. As far as concession prices go, don't expect much of a hike, if any at all. We've always been good at finding the best deals on our concession inventory and passing the savings on to the customer. The new items (i.e. tap beer, fountain soda, gourmet grilled cheese sandwiches) will be priced a bit differently, obviously, but everything else should remain about the same.\r\n\r\nSo, some prices will be going up slightly; that's the bad news. The good news, however, is that we're going to be offering three unique packages that will help YOU save lots of money, as well as help US raise additional funds for our upcoming move. By showing your support for The Moxie, you'll be helping insure that Springfield has a viable venue for quality film for years to come.\r\n\r\nTake a look at the following packages and see if one of them tickles your fancy:\r\n\r\n<b>SUPER BULK PASS</b>\r\n\r\nOur bulk passes have been incredibly popular since we unveiled them nearly two years ago, and we have every intention to continue selling them at our new location (although the price will jump from $50 to $60 to reflect the new ticket prices). The five dollar ticket, however, refuses to disappear quietly into the night. Starting on June 1st we will begin selling a limited amount of SUPER BULK PASSES, which contain 60 (that's right, SIXTY!) $5.00 passes for $300.\r\n\r\nIf you use all 60 passes during evening shows, that's a total savings of $180 for adults or $120 for seniors and students. Now, If you were to subtract the amount you save from the initial cost ($300 minus $180), that means you only paid $120 for 60 movies, which works out to $2.00 per show -- making it the cheapest ticket in Springfield... bar NONE! Pretty sweet deal if you ask me.\r\n\r\n<b>BUSINESS PRE-SHOW SALE</b>\r\n\r\nDespite having talked about it a great deal <a href=\"/posts/15\">on this very blog</a>, we've never really approached businesses about advertising on our screen during the pre-show slides. The ads that we do run (or ran in the past) have been from businesses or organizations that approached us. Since our new space will have two screens, that means we'll have twice the advertising opportunities for local businesses, and that's something we definitely want to explore as we move forward.\r\n\r\nIn hopes of kick-starting this trend, we're going to be offering a one-time deal for Springfield businesses: a full year of advertising on BOTH screens, PLUS one free weekday auditorium rental that you can use for whatever you like (meeting, team-building, holiday party, watching a movie completely by yourself, etc..) for $1,500. That's a savings of $750 off the usual price. Like our SUPER BULK PASS, we'll start selling this package on June 1st and will discontinue the sale when we close our original location in mid-August.\r\n\r\n<b>FRIENDS OF THE MOXIE</b>\r\n\r\nRemember when we ran out of money during our start-up phase, and we started the Founding Member Program to help financially bolster us to opening day? Well, here we are again. The situation isn't quite as dire this time around, but the end result is still the same: building a bigger, better Moxie.\r\n\r\nBack in 2005 when we started the Founding Member Program, there was no guarantee that The Moxie would be a viable business. We had a concept, a half-finished building, and a drive to succeed, but very little else to back up our harebrained scheme. Even still, a brave group of supporters stepped forward and donated their hard-earned money to the idea of a small local cinema bringing quality film to Springfield. We are eternally grateful to our Founding Members, and in no way want to undermine the importance of their initial vote of confidence for our little theater. Without them, there would be no Moxie.\r\n\r\nWhereas our first round of members made it possible for us to open, this second group of supporters will enable us to further cement The Moxie into the cultural patchwork of downtown Springfield, and insure the viability of the business for years to come. As was the case for our Founding Members, \"Friends of The Moxie\" Members will receive an incredible incentive package to make their donation even more worthwhile. Each FoTM Member will receive:\r\n\r\n<ul><li>A year's worth of free movies, beginning on opening day at our new location</li>\r\n<li>A year's worth of free popcorn, to go along with the free movies</li>\r\n<li>Inclusion on our \"Friends of The Moxie\" plaque, which will be proudly displayed in our lobby next to the original Founding Members plaque</li>\r\n<li>An invitation to our exclusive member party, held before our grand opening</li>\r\n<li>Invitations to all of our special press screenings throughout the first year</li></ul>\r\nI wish we could make your donation tax-deductible as well, but we're not a nonprofit organization... yet. We have plans to switch over in the future, but I'll save that for another post. Since taxable dollars have yet to enter into the equation, this will be the last time you'll ever see a list of incentives this great for such a deeply discounted rate. A \"Friends of The Moxie\" Membership is $600 for an individual, or $1,000 for a couple. What better way to spend your Economic Stimulus Refund than by lending a helping hand to your favorite local cinema, and getting some super sweet perks in return?! If you're a Founding Member and would like to become a FoTM Member as well, talk to Nicole or I about a special discounted price.\r\n\r\n# # #\r\n\r\nThis post has gotten irreparably long, so I'll be back later to explain more. I just wanted to get all the information out there as soon as possible so people could start thinking about the various packages, and whether they'd like to take advantage of any of them. Drop me an e-mail (look under the contact link in the menu) if you have any specific questions I can answer, otherwise, I'll be back in a couple days!\r\n\r\nOur construction bids are due on Wednesday!!! :O",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-05-11T07:15:55.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "drm00se",
      "body": "A-Mazing! Now <i>this</i> is some stuff to get excited about.",
      "created_at": "2008-05-11T08:08:46.000Z"
    },
    {
      "author": "paladin1787",
      "body": "I liked this post.  It may seem boring to lots of people, but this kind of business idea description and nitty-gritty business stuff was the beginning of this blog, and I'd like to see that continue.  There may not seem like there's incentive to post it, (in fact, there's probably some incentive to NOT to post intricate business stuff because it can be used by your competitors), but in my opinion it really does set you apart from other entertainment experiences.  It makes patrons feel like they themselves are involved, invested, in the success of the business -- and that's a great thing to have, because they'll go out of their way to help you.  And going non-profit sounds like a sweet idea.  Do tell.  With the switch, will you get a pay cut, Dannicole?  Do you detest that label?  But with a non-profit designation, The Moxie would suddenly sound like a boon to art education in Springfield... that's a good thing, right? With the switch, you automatically get all the good associations people get when they think of NPR, the local youth orchestra, international aid organizations, etc.",
      "created_at": "2008-05-26T06:13:53.000Z"
    },
    {
      "author": "pdmgtal",
      "body": "Great post, but you might want to check your math on the $2 per show claim with the super bulk pass.",
      "created_at": "2008-06-16T04:03:35.000Z"
    },
    {
      "author": "dan",
      "body": "Hmm. Looking back.... still works for me:\r\n\r\n$300 = SBP = Cost of Super Bulk Pass\r\n60 = M = Number of passes on SBP\r\n$5 = SBP/M = Cost per show, when using SBP\r\n\r\nAs I stated above, if you're an adult and you only use the SBP during evening shows, that's a savings of $3 per showing (adult tickets are $8), which is a combined total savings of $180 over the use of the entire pass. If you take the amount you saved from the initial cost ($300-$180), you're left with a net cost after savings ($120). Divide the net cost by the number of movies you saw with the SBP (60) and you get a realized cost of $2 per pass use, after savings. Am I overlooking an obvious error? The claim, after all, is an indicator of the pass's cost saving ability, not it's actual cost.",
      "created_at": "2008-06-16T04:32:50.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
