{
  "id": 541,
  "title": "Week 10: Some <strike>good</strike> great news",
  "body": "Our construction bids came in at the end of last week, and I'm happy to announce that we found a contractor who will complete our project within our allotted budget. That's great news, obviously, but we're not out of the woods yet. While the majority of the construction is theoretically taken care of, we're still on the hook for our entire bar build-out, all our bar equipment, 35mm projection equipment for the second screen, theater chairs, lobby furniture, and finishing the floors. Even still, knowing that 95% of the build-out is taken care of, without us having to use any of our own money up front, is a huge weight off our shoulders. Hopefully we can cover the rest with our super bulk passes and \"Friends of the Moxie\" memberships (hint hint).\r\n\r\nIf all goes well, construction could start as early as next week! That's both incredibly excitingly and unbelievably frightening. Nothing puts a project in perspective quite like hammers and nails... that makes no sense, and I can't figure out why I wrote it. Oh well. I'd like to get some pictures of the inside of the building before walls start going up, but access has been tight up to this point. I'll try to get in on Wednesday and snap a few for the blog.\r\n\r\n<b>ALERT: THE MOXIE IS STILL OPEN!!!!</b>\r\n\r\nThere seems to be a persistent rumor circulating around Springfield that we are either:\r\n\r\n1. Closed until we open at our new space\r\n2. Already moved into our new space\r\n\r\nObviously if you read this blog you know that neither of those scenarios are true, yet not a day goes by that we don't hear at least one of them. I think some of the confusion might stem from us announcing our move so far ahead of it actually taking place. By breaking the news in March, we thought it would give us plenty of time to educate our audiences about the move, as well as little things like available parking and nearby restaurants, but it's apparently ended up backfiring on us. I'm sure things will straighten out once we get into the new place, but I'm beginning to wonder how it's going to affect our attendance until we move.\r\n\r\nPlease help us stop the spread of this misinformation. From now until September, if you hear someone say we're closed or already in our new location, take them by the shoulders, give them a good shake, and yell, \"NO! THE MOXIE IS STILL OPEN AT THEIR ORIGINAL LOCATION, AND WILL CONTINUE TO BE OPEN UNTIL LATE SUMMER! IN FACT, I REALLY WANT TO SEE THE MOVIE THEY'RE CURRENTLY SHOWING! LET'S GO RIGHT NOW!\" Maybe with the help of our loyal supporters we can set the record straight, once and for all.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-05-20T08:25:03.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "The Four Finger Soc Em",
      "body": "Good post. Call me a Nancy Higgins, but the hammers and nails thing made sense to <em>me</em>.",
      "created_at": "2008-05-20T11:03:31.000Z"
    },
    {
      "author": "brad",
      "body": "i can see the early announcement creating problems. that sucks. maybe put a huge banner in the windows of the new location saying that you're still open for business at the regular place?",
      "created_at": "2008-05-20T17:18:05.000Z"
    },
    {
      "author": "drm00se",
      "body": "Maybe put a sign at the new location that says, \"There are puppies at the old location! Go now!\" Then when they get there to see the puppies, they'll find an open Moxie and give you all their moneys. It's the perfect plan.",
      "created_at": "2008-05-24T02:37:39.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
