{
  "id": 544,
  "title": "Week 12: Pictures and poll results",
  "body": "I apologize for the length between updates, but it's been crazy for the last few weeks... with today being no exception. Busy or not, it was high time for me to login and give you guys an update.\r\n\r\nPrimary construction started last week—mainly trenching for the plumbing, pulling up old floor tiles, etc.—and we plan on sneaking over tomorrow to get video footage for our next Moxie Update short. In the meantime, our official Moxie photographer, Mr. Steve Croxton, found time to sneak over and grab a few shots of the space while it's still in its roughest form. \r\n\r\n<a href=\"/phlogs/40\">Check out the first pictures of the new space in our phlog.</a>\r\n\r\nAnd a big thanks to Steve for taking the time to snap them for us. He's an alright guy, for a Cub's fan, and I'm sure we'll be seeing more of his terrific photos as construction continues.\r\n\r\nWhile I'm in the mood to thank people, I'd like to extend a big THANK YOU to the 291 people who filled out the poll we proctored (sounds gross) last week. The results were quite enlightening.\r\n\r\n<b>How do you get your Moxie showtimes?</b>\r\n\r\n85.6% use The Moxie's online calendar\r\n57.0% use The Moxie's weekly e-mail newsletter\r\n28.5% use The Moxie's print calendar\r\n23.0% use The Moxie's ad in the News-Leader's Weekend section\r\n6.9% use The Moxie's anytime movie hotline (429-0800)\r\n\r\nA handful of respondents mentioned using Springfield.net, Yahoo! movies, and Google to find our showtimes as well, but I'd like to point out that they're not always correct. I've seen them mess up our movie times on numerous occasions, so if you have the internet available, please check <a href=\"http://www.moxiecinema.com/calendar\" class=\"broken\">our official online calendar</a> for times first. It's always 110% correct... usually.\r\n\r\nAfter examining the results, it's obvious that we need to put a stronger effort into marketing our movie hotline (something many of you didn't even know existed). I'm not surprised that the online calendar and email newsletter were the top answers—after all, this was an online-only survey announced exclusively on our website and in our newsletter—but it's still nice to know that our two cheapest forms of marketing are also our most effective.\r\n\r\nLess than a quarter of the respondents use the News-Leader ad, which alarmed me at first. We pay a pretty penny for that little piece of real estate in the Weekend Section, so I was hoping it would've landed higher on the list. But again, the people who are most likely to use the Weekend ad probably weren't the ones who were filling out the survey. That point was made extremely clear when the most recent Weekend Section gave MY BLUEBERRY NIGHTS an \"A\" and included a giant picture of Jude Law and Norah Jones. Since that issue hit the stands, we've had three sold out shows for that particular film, which is as clear a metric as any that our little ad is still worth running.\r\n\r\nI'm sure we'll have more polls and surveys in the weeks to come, so thank you again for taking the time to give us your thoughts and opinions.\r\n\r\nNow it's time to for me run. More later!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-06-09T04:57:18.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Paul Reynolds",
      "body": "Hey Dan! Why don't you swap out your weekly showtime print ad for a smaller/cheaper/simpler ad that just advertises the Hotline number and place it on the movietimes page of the paper. So then you don't have the hassle or expense of a weekly changing ad and you can beef up awareness of the hotline. In the ad, I'd recommend mentioning that people should add it to their cell phone speed dial so they can get movie local times quickly from anywhere.",
      "created_at": "2008-06-09T15:32:39.000Z"
    },
    {
      "author": "dan",
      "body": "That's a good suggestion, Paul! Thanks!",
      "created_at": "2008-06-10T05:35:32.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
