{
  "id": 545,
  "title": "Week 14-15: A logistical conundrum",
  "body": "Hello everyone. Work is progressing on the new space at quite a clip—one of the walls is going up as I type this—which means it's time for us to start lining up all our equipment needs. All I have to say about that is... :O<br/><br/>I hate to admit it, but, contrary to popular belief, spending large amounts of money is not one of my favorite hobbies. I can spend small amounts of cash with little trouble (just ask Taco Bell), but once the bill gets over $20... my palms start to sweat. Oh well. I'm sure we'll pull through okay.<br/><br/>In other news, the layout of our new theater poses a particular problem regarding entrances into the building. If you didn't already know, our new building, Wilhoit Plaza, has a gigantic, well-lit parking lot directly to the South, but the majority of the businesses have their entrances on the North side of the building, requiring customers to walk around to the front. <br/><br/>Now, this isn't much of an issue in my mind, but I'd absolutely LOVE to have entrances on both the South (facing the parking lot) and the North (facing the YMCA) sides of our business. Doing this, however, would theoretically allow someone to come in through the South entrance and walk straight into either of our auditoriums without ever buying a ticket. It would be like Springfield 8 or Campbell 16 opening up their exit-only doors on the hallways that lead to the auditoriums. Theaters have to guard their ticket sales, and the most logical way to do that is by having all customers pass through a single point of entry, where you can easily post a ticket-tearer.<br/><br/>Check out our layout:<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/062308/moxie_layout.jpg\" width=\"425\" /><br/><br/>The red arrows are exit points, while the green ones are for entrances. The orange star is where you'll buy tickets, and the blue one is where the ticket-tearer will stand during busy nights.<br/><br/>Now, you might be thinking \"why don't you put the ticket-tearer directly in front of the entrance that leads to both auditoriums, instead of at the entrance to the hallway?\" The problem with that scenario is that it always calls for a third employee, and one of our goals when designing the layout (and the business) is that it can be run, successfully, by only two people. That way, if times ever get really, really, REALLY bad, we can scale back on our payroll and Nicole and I can run the ship ourselves until we get our heads back above water. This simple, pared-back design has saved us several times in the past, and I have no doubt we'll have to rely on it from time to time in our new place as well.<br/><br/>Another option would be to open the back door during weekends, when we'd always have at least one or two additional employees to tear tickets in front of the auditoriums. This scenario, however, would inevitably lead to confusion when someone shows up on a weekday and can't figure out how to get into The Moxie (\"I swear this door was open last weekend. Hmm. Maybe they're closed.\").<br/><br/>I've pretty much given up on the idea of having entrances on both sides, but before we give up the ghost I wanted to lay out the problem here on the blog and see if any of our loyal readers could come up with an ingenious solution.<br/><br/>Finally, Ophelia has officially closed its doors, which is a bit of a bummer. They would've made for a perfect dinner and movie combo once we opened our new location, but I suppose it wasn't meant to be. Either way, their space is one of the most unique and beautiful in all of downtown, and is now primed and ready for someone to swoop in and take advantage of all the restoration work that's already been done. Hopefully we'll see a new restaurant in their space by the time we open in September.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-06-24T00:17:54.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "joel.carter",
      "body": "Just a rough idea, but you've probably already thought of it...<br/><br/>...make the auditorium exit doors swing-out only with no handle on the exterior so they can't be opened from the hallway. And then place your ticket-tearer at the intersection of the two auditorium entrances. But, I wonder if there are building restrictions against this?<br/><br/>For what it's worth.",
      "created_at": "2008-07-01T09:13:10.000Z"
    },
    {
      "author": "dan",
      "body": "Joel: that's how the exit doors will be set-up (i.e. no handle on the outside). Having the ticket-tearer stand at the entrance of each theater would be ideal, but, again, would require at least 3 people working at all times.",
      "created_at": "2008-07-03T00:26:10.000Z"
    },
    {
      "author": "Sue and Larry",
      "body": "Congratulations on the upcoming move! I am so happy for the Moxie. <br/><br/>My personal preference for the entrance at the new location would be the south side where the parking lot is located. For the folks who might want to visit other downtown locations after seeing a movie they could exit out the north side do all the wandering they want and then walk back to their car on the south side. For the folks who don't or can't walk much the entrance on the south side would be much more convenient (especially when the weather is bad).",
      "created_at": "2008-07-03T18:13:11.000Z"
    },
    {
      "author": "bmozer1",
      "body": "We faced all kinds of these problems at The Lyric, and when it came down to it, it was either complicate our life severely or inconvenience the customer slightly, or not open at all.  We don't even have a parking lot near us, but there is nothing we can do about it.  People learn to deal if they value the business, I guess.",
      "created_at": "2008-07-07T23:15:22.000Z"
    },
    {
      "author": "nicole",
      "body": "We actually think we came up with a solution! Wowzaas! But we'll have to see the space before we decide.",
      "created_at": "2008-07-08T20:49:51.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    },
    {
      "id": 16,
      "name": "Customers"
    }
  ]
}
