{
  "id": 546,
  "title": "Week 17: Things are going swimmingly",
  "body": "It's been awhile since my last update, but don't go thinking that means there hasn't been plenty to write about, because there has been... I'm just a slacker when it comes to making new blog posts. Lazy or not, I figured it was time to set aside a few minutes and catch everyone up on our progress. So, let's jump write in, shall we?!\r\n\r\nFirst, the construction progress is moving along at quite a clip. Walls are framed, sheetrock is halfway up, and the floorplan is really starting to take shape. We hit a small snag regarding a set of pipes that was hanging too low (ceiling height is at a premium when you retrofit a building that wasn't meant to be a theater), but that should be rectified soon. Hopefully we can sneak in soon and shoot another Moxie short before Justin, our director/cinematographer, moves off to Chicago (that jerk!).\r\n\r\nNicole has been pulling her hair out trying to whittle her stellar five color paint palette down to just two, which is all we're allowed to use through our contractor. Of course, we can always go in after they've finished with the two main colors and paint all the accent walls we want, which we most definitely will. We're actually a bit curious about why we're being limited to two colors. To our untrained minds, if it takes 100 gallons of paint to cover all the walls in the theater, what difference does it make if that 100 gallons is broken into two, three, or even four colors? Theoretically it's the same amount of paint, not counting extra coats for the darker colors, and I'm sure there's extra time and cost involved in prepping each separate color, but it surely can't be THAT much. Either way, whether we end up painting it ourselves or having it done for us, the finished product will have more than two colors.\r\n\r\nBack on the home front, things are staying incredibly busy at the original Moxie. Last week THE FALL set a record for our highest attended July movie, but is already being threatened by this week's THEN SHE FOUND ME. Both movies were only scheduled for one week, and seriously highlight our need for a second screen. I can't even imagine how busy we'd be if we were playing THE FALL and THEN SHE FOUND ME at the same time. Patience, Dan. Patience. The second screen will be here before you know.\r\n\r\nI've also been keeping myself busy redesigning the Moxie website. I can't say much, as I want to keep it a secret, but what I can tell you is this: it's going to be AWESOME. I've been pouring over three year's worth of stats on moxiecinema.com to determine the most visited parts of our website, which will help me make the new design much more efficient. I sometimes forget how much I enjoy doing web design when it's not for someone else.\r\n\r\nLet's see... what else? Our fundraising programs are going quite well, despite being unveiled two weeks later than we'd anticipated. I've been meaning to make a webpage for the three programs, but I keep getting sidetracked with other projects. We still have plenty of information brochures at the theater, so, if you're curious, feel free to stop in and grab one. Hopefully I can get a webpage up sometime this week.\r\n\r\nThat's it for now. I'll try to be more diligent about posting to the blog in the future... I promise.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-07-14T05:02:43.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "twin33",
      "body": "two colors! nightmare of a decision. If I could walk I'd come out and help paint. Are you going to have a painting party or have someone professionally do it? \r\n\r\n-Michelle H",
      "created_at": "2008-07-15T02:54:24.000Z"
    },
    {
      "author": "dan",
      "body": "Probably have a professional do it. We still have nightmares about painting the walls of the original Moxie.",
      "created_at": "2008-07-15T18:45:34.000Z"
    },
    {
      "author": "nate",
      "body": "Was it that bad?  I don't ever remember hearing you talk about it.\r\n\r\n\r\n<em>Another </em>site redesign?  You do this every year, don't you?  Is this, like, the 4th one?\r\n\r\nProgress sounds great!",
      "created_at": "2008-07-16T00:39:12.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
