{
  "id": 549,
  "title": "The Ultimate Guide to a Moving Moxie",
  "body": "If you haven't seen the <a href=\"http://www.moxiecinema.com\" class=\"broken\">front page</a> or the <a href=\"http://www.moxiecinema.com/calendar\" class=\"broken\">calendar</a> lately, you're missing out on some really awesome, quickly-designed, poorly-colored ads I made for two new pages on The Moxie site: one for <a href=\"http://www.moxiecinema.com/moving\" class=\"broken\">our move</a> and one for <a href=\"http://www.moxiecinema.com/fundraiser\" class=\"broken\">our fundraiser</a>. Make sure to check out our fourth and final installment in the \"Moxie is moving\" educational short film series (it's on the moving page). We haven't even premiered it at the theater yet, so consider it a SNEAK PEAK!!!!!!\r\n\r\nIn other news, we've nailed down our closing and reopening dates. Our last day at the original Moxie will be September 2nd, and our grand opening at the new space will be September 19th. That means we have exactly two weeks and two days to get everything set up, tested, and running smoothly before we open the doors to the public. It's going to be hectic, but I think we can pull it off.\r\n\r\nAlso, as a head's up, there's a very good chance that whoever rents out our old space will tear down the auditorium walls, which means once the original Moxie is gone... it will really be gone for good. That's a little heartbreaking, to tell you the truth, but it also takes some weight off my shoulders, knowing that no one can move back in and start up their own theater without going through the same hellish start-up that we did. Either way, if you want to see the ol' Mox one last time, you only have 29 days left.\r\n\r\nWah waaaaah.\r\n\r\n<img src=\"http://img379.imageshack.us/img379/333/racheldratchdebbiezh2.jpg\" alt=\"Debbie Downer\"/>\r\n\r\nDebbie Downer, ladies and gentleman.\r\n\r\nIn all seriousness, we have a great August lined up for you, so make plans to drop in one (or several) last time(s) to sit in the stinky little auditorium that started it all. I have to go now... my eyeballs are starting to sweat!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-08-05T07:18:19.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "LifeOfJason",
      "body": "I can't wait to do a feature story on my blog about your move.  It's such a great success story regarding downtown.  After losing folks like Well Fed Head, it's needed.",
      "created_at": "2008-08-06T17:24:32.000Z"
    },
    {
      "author": "dan",
      "body": "Thanks Jason! We appreciate the support!",
      "created_at": "2008-08-06T22:08:33.000Z"
    },
    {
      "author": "EdMo",
      "body": "1) I'm happy and sad that you're all moving to a grand new location.  Happy for the new opportunity.  Sad for the fact that I worked there for a brief time...had some good memories.\r\n\r\n2)  Well Fed Head?  What happened?  I've been out of the Springfield loop...",
      "created_at": "2008-08-07T09:22:56.000Z"
    },
    {
      "author": "nicole",
      "body": "Well Fed Head moved to Battlefield.",
      "created_at": "2008-08-07T21:52:41.000Z"
    },
    {
      "author": "stevie_g",
      "body": "Battlefield...the intellectual epicenter of the Ozarks... \r\n\r\nBattlefield??? I <em>live</em> in Battlefield and haven't even noticed this. Is it actually opened yet? Guess I have some explorin' to do tomorrow, not to mention the extraction of my head from my personal nether regions. Only thing I've paid attention to is the new McDonalds (woo-hoo).\r\n\r\nFYI, I've updated my Moxie 2.0 flickr page:\r\n\r\n<a href=\"http://www.flickr.com/photos/87104832@N00/sets/72157606446460571/\">http://www.flickr.com/photos/87104832@N00/sets/72157606446460571/</a>\r\n\r\nAnd if you haven't seen it yet, there was a story about the new Moxie in last week's <em>Communtity Free Press</em>:\r\n\r\n<a href=\"http://www.cfpmidweek.com/weeks/IssuePDFs/vo6i16web.pdf\">http://www.cfpmidweek.com/weeks/IssuePDFs/vo6i16web.pdf</a>",
      "created_at": "2008-08-10T12:04:56.000Z"
    },
    {
      "author": "nicole",
      "body": "Oops, I meant the street Battlefield. As in, The Fremont Center on Battlefield and National.",
      "created_at": "2008-08-10T23:04:58.000Z"
    },
    {
      "author": "stevie_g",
      "body": "Ohhhh...that makes more sense. Thanks for clearing that up, Nicole. I thought I was going crazy. Now I can stop running around Battlefield (the town) like a chicken with it's head cut off...",
      "created_at": "2008-08-11T00:57:11.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
