{
  "id": 55,
  "title": "100 days strong",
  "body": "100 days ago today, I sat down and decided to write a blog. Now, roughly 2,400 hours later, I find myself fighting back tears as I reminisce about the good ol' days... back when I thought saying \"Mimosas for everyone!\" was funny... back when I knew where my hat was... back when the summer was young and I was all of 23 years old. Sigh.<br/><br/>Those days are gone.<br/><br/>I'd like to think I've matured a little over the last 144,000 minutes. Sure, I still let my hair down and act like an 8 day-old once in awhile , but after all the joshin' and pussy-footin' is through, I settle back into my 8,640,000 second-old blog body and hit the sack. I've got blog kids to feed, you know. I can't be thinking only of myself.<br/><br/>Even though I rarely write on the weekends, I've still managed to think of a new post every 1.75 days. Over the last 8,640,000,000 milliseconds, I've served up nearly 30,000 incredibly funny words, including, but not limited to: mimosas, hat, the, fork, five deck platterpus, wizz, and weenus. On average, this blog has seen 504 readers per day, which isn't too bad considering my frequent use of the word weenus.<br/><br/>It certainly has been a long, strange journey for us all. I can remember my first comment like it was yesterday....<br/><br/><i><a href=\"http://www.blogger.com/profile/2785021\" target=\"_blank\">Dan</a> says...<br/>Testing the comments. I'm testing. I am Dan and I am testing. Blah blah blah blah. Testing the <b>bold</b> tags. Blah. Blah blah. Weenus.</i><br/><br/>Those were the days.<br/><br/><b>It's Was a Very Good Blog</b><br/><br/>When the blog was seventeen (days old)<br/>It was a very good blog<br/>It was a very good blog for me, <a href=\"http://jglow.blogspot.com\" target=\"_blank\" class=\"broken\">Justin</a>, and <a href=\"http://tapioca.urlblue.com\" target=\"_blank\" class=\"broken\">Nicole</a><br/>And a warm buttered roll<br/>My posts were silly and pithy<br/>Nothing ryhmes with pithy<br/>When the blog was seventeen<br/><br/>When the blog was twenty-one (days old)<br/>It was a very good blog<br/>It was a very good blog for blogger's \"Blogs of Note\"<br/>Which I hadn't heard of before<br/>Cause I'm an intellectual bore<br/>I once ran into a door<br/>When the blog was twenty-four (\"one\" doesn't rhyme as well as \"four\")<br/><br/>When the blog was thirty-five (days old)<br/>It was a very good blog<br/>It was a very good blog for talking about theater names<br/>And singing karaoke with British dames<br/>While watching the Cardinals games<br/>And wishing I was Corey Haim(s)<br/>When the blog was thirty-five<br/><br/>But now the days grow short<br/>The blog is in the autumn of the day<br/>Which equates to being roughly 6:43 PM<br/>But the blog will go on<br/>Because my name is actually Don<br/>And my wife's named Shafon<br/>Those last two lines are wrong<br/><br/>It was a mess of good days<br/>Weenus.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-09-01T02:09:06.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Oz",
      "body": "You are a very strange boy indeed.<br/><br/>That's why I love ya.<br/><br/>Jesus H Christ, I still can't believe you're only 24.",
      "created_at": "2004-09-01T02:39:28.000Z"
    },
    {
      "author": "bjork24",
      "body": "Aw, Oz. Ya so ni ce.",
      "created_at": "2004-09-01T02:53:25.000Z"
    },
    {
      "author": "mike",
      "body": "[I tried to send you this via email... but it apparently is longer than 300 characters... so]<br/><br/>Hey Dan, this is mike, from caliblog. I was wondering what service you used for your cool \"stats\" bar on the left. <br/><br/>That's pretty much it, your new site design kicks ass... I'm jealous. And I can't wait to go see a movie at the Moxie -- and I'm serious, I think all of us would love to fly to [where-ever your art-house is...] just to see a film at your theatre. Keep it up. We're rooting for ya'!",
      "created_at": "2004-09-01T03:12:08.000Z"
    },
    {
      "author": "bjork24",
      "body": "Mike, I rolled the stats bar myself... I'll reply more on your blog.",
      "created_at": "2004-09-01T03:16:50.000Z"
    },
    {
      "author": "whittler",
      "body": "I like the word weenus. Especially with a \"pissman\" chaser. <br/><br/>e.g. Gus is a weenus pissman.<br/><br/>\"spiffy\" almost rhymes with pithy. Apathy also nearly gets you there. Apathy is my shtick.",
      "created_at": "2004-09-01T03:39:06.000Z"
    },
    {
      "author": "bjork24",
      "body": "Whittler, walk lightly and carry a big shtick.",
      "created_at": "2004-09-01T03:40:34.000Z"
    },
    {
      "author": "Al",
      "body": "100 x 24 hours = 2400 hours, FYI.",
      "created_at": "2004-09-01T07:38:29.000Z"
    },
    {
      "author": "Newell",
      "body": "Hehe... you said weenus.<br/><br/>It's a good blog alright.",
      "created_at": "2004-09-01T07:53:35.000Z"
    },
    {
      "author": "Rachel",
      "body": "So...what was that about exactly.  Are you guys even planning on doing the movie theater still?",
      "created_at": "2004-09-01T08:18:56.000Z"
    },
    {
      "author": "Janet",
      "body": "Does this mean you are hanging up your blogging hat or just waxing nostalgic?<br/><br/>Janet",
      "created_at": "2004-09-01T15:01:19.000Z"
    },
    {
      "author": "Sybille",
      "body": "Hi, <br/>happy 100 days. I read your RSS regularly. I enjoy your reports about The Moxie and how it develops. Sybille from SybAmbLog",
      "created_at": "2004-09-01T15:48:53.000Z"
    },
    {
      "author": "einahpets",
      "body": "ha. you said pussy-foot and weenus.",
      "created_at": "2004-09-01T16:22:45.000Z"
    },
    {
      "author": "bjork24",
      "body": "Al, you mean to tell me that there AREN'T 60 hours in a day? Damn you, public education!<br/><br/>Newell, thanks! And just for you, I'll say it again... weenus.<br/><br/>Rachel, you're still fairly new to this blog, but if you go back through the archives, you'll see that I have a healthy mix of theater-related posts AND posts that reflect the sincere love I have for seeing my own voice.<br/><br/>Janet, just waxing nostalgic and goofing off. I'll probably be around for at least another 15,000 days.<br/><br/>Sybille, thanks for reading.<br/><br/>Eina, don't put your weenus too close to the pussy-foot or else Google will have a cow!",
      "created_at": "2004-09-01T17:35:44.000Z"
    },
    {
      "author": "Aaron",
      "body": "BTW, Dan, the display of the site in IE5.1 for Mac is quite lacking.",
      "created_at": "2004-09-02T00:27:52.000Z"
    },
    {
      "author": "bjork24",
      "body": "Oh good lord. IE on Mac is the metaphorical thorn in my CSS-P side. I like Macs, I really do, but they completely slaughter web design.",
      "created_at": "2004-09-02T00:30:22.000Z"
    },
    {
      "author": "Newell",
      "body": "Woo! I got extra weenus!",
      "created_at": "2004-09-02T01:29:40.000Z"
    },
    {
      "author": "Tim",
      "body": "Congrats and happy centennial blogday.",
      "created_at": "2004-09-02T03:58:12.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "I should point out that it was on a 9 (though it looks the same in IE5.2 on OSX). But beeyooteeful in Safari.",
      "created_at": "2004-09-02T20:53:31.000Z"
    },
    {
      "author": "bjork24",
      "body": "Can't make all the browsers happy all the time.",
      "created_at": "2004-09-02T22:37:40.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
