{
  "id": 550,
  "title": "T-Minus 30 Days: Here we go again!",
  "body": "<b>Probability of us opening on September 19th?</b> 50%<br/><br/>Our move is nigh upon us, and things are going to get crazy (read: unbearably stressful) over the next month, so I thought I'd reactivate the blog for a good, ol' fashioned 30 day post marathon... <a href=\"/posts/250\">like we did all those many years ago</a>. If everything goes according to schedule, the last post of the 30 day spree will happen on September 18th, the eve of our new opening. Can we do it? I sure hope so, but it's going to take a gargantuan amount of effort, along with a heaping potato sack full of luck, for us to pull it off.<br/><br/>Either way, here we are. I'm keeping myself on a strict deadline with these posts — no longer than 15 minutes each day — which means they're going to be short, concise, and probably riddled with typos. I'm hoping this blogging binge will keep me on track, allow me to destress, and, at the same time, keep our loyal readers abreast with our progress.<br/><br/>And speaking of progress, things are really starting to slooooooooooow down, thanks to the series of incremental inspections our contractor has to go through. At this point, I believe they're waiting on the framing inspection to pass, after which time they can pull the rest of the electrical wires, but then they'll have to stop again to wait for the electrical inspection to pass, and then the rough-in inspection after that, and then the final inspection, followed by the occupancy permit inspection, health inspection, and on and on and on.<br/><br/>Unhindered from the red tape, I have no doubt in my mind we could be open by September 19th, but that, unfortunately, is not the way things work. Oh well. We'll solider through, I'm sure. And that does it for today's post. Nic and I are taking advantage of our early night off to go see TROPIC THUNDER (also known as \"competitive analysis of regional theaters\").<br/><br/>See you tomorrow!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-08-19T06:08:46.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "LifeOfJason",
      "body": "Are you going to need volunteers to help you move stuff?",
      "created_at": "2008-08-21T01:56:37.000Z"
    },
    {
      "author": "dan",
      "body": "I think we've got it covered, Jason, but thanks for the offer!",
      "created_at": "2008-08-21T08:22:08.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
