{
  "id": 551,
  "title": "T-Minus 29 Days: Still chugging along",
  "body": "Not much in the way of progress today at the new place, but I spoke with our electrician and he's 90% finished with his work, which means after our framing inspection passes, our electrical inspection can, and should, pass soon thereafter. Once those two are done, the rest of the sheetrock can go up, painting can commence, and we'll finally be dealing with something that resembles a finished space. Keep your fingers crossed!\r\n\r\nIn other news, I have no idea where we're going to get chairs. My Springfield contact for theater chairs has dried up, and our old equipment dealer in St. Louis only has chairs for sloped floors. That's not good. I've put a call out looking for chairs on several theater-owner / operator forums, but haven't heard anything back yet. If any of our loyal readers know where we might get our hands on 110+ good, used chairs (preferably with cupholders), please let us know. We'd be eternally grateful for your assistance. In the meantime, I'm going to stress over it until my kidney explodes.\r\n\r\nLet's see... what else did we do today? We finalized details for tomorrow's sold out showing of ROMAN POLANSKI: WANTED AND DESIRED, which is going to be a blast. We met with The Gillioz to sketch out the rest of our classic movies for 2008... lots of of good stuff on the horizon. We talked to Czar Graphics about working on a new design for this year's RHPS posters and shirts (I can't believe it's already almost that time of the year again).\r\n\r\nWe also met with a bank to get a good faith estimate on how much Nic and I can afford when we look for a house (hint: it's not much). We're not planning on buying a house in the immediate future, especially with the theater move right around the corner, but we wanted to know what we could afford when we do start looking. People keep saying it's a great time to buy a house, but that hasn't really been the case for us. The ultra-buyer's market seems to be keeping the prime houses off the selling block while seller's wait for the real estate situation to correct itself. In the meantime, the market is left looking pretty shallow... and I doubt it will get any better during the fall and winter. Oh well, we're not in any hurry.\r\n\r\nIn other news, I bought a new portable radio on Sunday, and it should get here tomorrow. Here it is:\r\n\r\n<img src=\"http://img179.imageshack.us/img179/8104/51h0tdsw1jlsl500aa280lf3.jpg\" />\r\n\r\nPretty sweet, eh?! I only paid $10 for it too! Now I can stick the radio in my back pocket, run a headphone cord up my shirt, and listen the Cardinal's game all day long! Woo hoo! Obviously I'm more excited about this than I should be, and I doubt any of you care, but I had a few more minutes to kill, so there you go. Ok, time's up... more tomorrow!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-08-20T05:32:57.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nate",
      "body": "Cool.  Any chance you'll let slip any of the classic movies scheduled at the Gillioz?",
      "created_at": "2008-08-20T19:14:27.000Z"
    },
    {
      "author": "gillenstien",
      "body": "you should by the house next door to me\r\n\r\nit's big and for sale and we could be like\r\n\r\n\"hey\" in the morning",
      "created_at": "2008-08-20T22:08:14.000Z"
    },
    {
      "author": "dan",
      "body": "I'm not 100% convinced that the housing market has stabilized yet. I'd hate to buy something in the next six months and have it be worth 75% of what I paid by 2010. We may just rent a house for the next year... I don't know.",
      "created_at": "2008-08-21T01:43:38.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
