{
  "id": 552,
  "title": "T-Minus 28 Days: Time to set back the date",
  "body": "<b>Probability of us opening on September 19th?</b> 5%\r\n\r\nWell, that was quick. I spoke to our contractor today and apparently our sprinkler system is what's holding us up at this point. We'll find out later this week, or possibly early next week, when they plan on installing the new system, which will give us a much more definite ETA. Until then, the projected date of our grand opening is... sometime after September 19th. It's frustrating, but, as I'm sure many of you who have dealt with large scale construction projects can attest to, shit happens. We're not the first people who have had to set back opening dates, and I doubt we'll be the last. Either way, I still plan on blogging continuously up until the eve of our opening (gross), which means this 30 day writing experiment just bumped itself up to a 40+ day binge. Hooray!\r\n\r\nA big THANK YOU to all the people who contacted me with used chair leads yesterday. I plan on following up on each and every one of them tomorrow, and hopefully get a bite or two that I can report back on tomorrow's post. I also made a new audio equipment contact today from Kansas City. Cheap prices + relatively close driving distance = awesome town USA! The guy on the phone was a bit on the cranky curmudgeon side, but aren't they all?!\r\n\r\nOn the home front, my allergies have been killing me for the last few days. I guess they're bad enough that my face has started to swell up, as pointed out by Bogey's favorite veterinarian, Dr. Tedd Hamaker. When a vet tells you that your face looks like a palpably swollen horse liver, that's really saying something! He didn't really say that, folks. I think he said I looked like Martin Short from 1991's hilarious slapstick comedy PURE LUCK. You remember the one... where he gets stung by a bee and his face swells up! Hilarious! I don't remember what Dr. Tedd said.\r\n\r\nWhat was I saying? These silly allergy pills make me loopy. I can't remember much else about today, other than the fact that we had a sold out show of ROMAN POLANSKI: WANTED AND DESIRED tonight, thanks in large part to Mr. Randy Wooten, the executive producer, who stopped by for the showing. It was a great time had by all! And now I'm going to go lay my head down on my giant pillow. HEAD! SHOES! NOW!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-08-21T07:57:25.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "I thought Martin Short's face swelled up in INNERSPACE?",
      "created_at": "2008-08-21T16:54:17.000Z"
    },
    {
      "author": "dan",
      "body": "His face swells up in both films, but in PURE LUCK it was HUGE! Face swelling is apparently Martin Short's thing.",
      "created_at": "2008-08-21T19:37:15.000Z"
    },
    {
      "author": "nate",
      "body": "I used to love INNERSPACE.",
      "created_at": "2008-08-21T21:16:19.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
