{
  "id": 553,
  "title": "T-Minus 27 Days: Not much today",
  "body": "Today was pretty boring. I went over to the new space with my dad to make sure our measurements were correct for the bar. Not much in the way of progress at Moxie 2.0. I followed up on several of the chair leads from a couple days ago, and I think we may have found some sweet seats. I won't confirm them as THE seats until I hear back from a couple other dealers, so... that's about it.\r\n\r\nI've spent the last three hours tinkering around with the new website design. The sidebar is giving me fits because it has a tendency to not want to blend in with overall design of the rest of the site. Oh well. I'm sure I'll figure it out. Tonight's my night off, so that's terrific. Nothing makes me feel better than taking a couple hours away from the theater to hang out with my friends, drink beer, and talk about the Cardinals, even if my nose is expelling snot at 38 mpg (mucus's pretty gross).\r\n\r\nI've been listening to a lot of talk radio recently (NPR podcasts and AM shows), and see a definite need for an unbiased topical show devoted to Springfield. Nothing special, just an hour long segment where someone opens up the local paper, talks about a couple of the leading stories, fields a few calls regarding said stories, and then maybe has a quick interview with a notable local. There's really nothing like that in Springfield, and that's sad.\r\n\r\nSure, most morning DJs <i>TRY</i> to have topical discussions, but they can't seem to keep the dialogue going without being interrupted by music or a zany sound clip. The other local talk show(s)... well, let's just say I can only take so much downtown bashing. At least that's my opinion, for what it's worth. If I could wake up early enough in the morning, or didn't have this whole \"move thing\" on my plate, I'd offer my services for free. I'm just thinking aloud, really. Maybe I should start a podcast.\r\n\r\nYeah, that's the ticket!\r\n\r\nNo. I'm ending this post now. See you tomato.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-08-22T02:45:33.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "RyanH",
      "body": "you should do a podcast once the new Moxie opens up. It could be a little like the Moxie TV if you do a video podcast. You could also interview local directors that are premiering their movie at the Moxie.",
      "created_at": "2008-08-22T17:51:49.000Z"
    },
    {
      "author": "dan",
      "body": "That's an idea.",
      "created_at": "2008-08-22T20:01:35.000Z"
    },
    {
      "author": "nate",
      "body": "I have wanted the exact same kind of local radio show.",
      "created_at": "2008-08-24T23:51:47.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
