{
  "id": 555,
  "title": "T-Minus 25 Days: I know my numbers are off",
  "body": "We should really be on \"T-Minus 23 Days,\" but since we're not counting the weekends for the time being, and we all know we won't be open when the countdown gets to zero, I thought I'd only subtract a day whenever I write a new post. Hopefully that won't confuse anyone.\r\n\r\nWe pumped out two more weeks of showtimes today, which you can now see online (well, at least some of them). We also have a half-calendar you can pick up at the theater, which is what I spent the majority of my day working on and printing. Other than that, it's been pretty administrative today. The big money has yet to be spent, but it will soon... very soon.\r\n\r\nWhile I'm here, and have a few minutes to spare, I thought I might highlight two upgrades we're making on our current projection system. Had we had the money back in 2005, these \"upgrades\" would simply be the status quo, but since we were short on cash when we originally opened, our projection system wasn't as robust and full-featured as I would have liked. We're not rolling in money the second time around, but I realize that it's time to invest some additional funds in our theater's sound and automation systems. Now, let me explain what that means to you.\r\n\r\nFor three years we've been sputtering by with a four channel, center-surround speaker arrangement, which is passable, but just barely so. I reconciled this cost-cutting effort by telling myself that the majority of our films were largely vocal-driven, and wouldn't rely heavily on explosion-laden soundtracks. While that proved true for the most part, our standard \"talkie\" movies still suffered from not having the clarity and resonance you'd expect from nicer theaters. Over the years I upgraded our processor, which helped a little, but couldn't find the money to add extra channels to our current configuration. I'm happy to announce, however, that that's all about to change at the new location. We decided to make a serious investment in our sound presentation, and I think it will be immediately apparent when you hear how nice everything will sound once we get open.\r\n\r\nThe second upgrade will be far less evident to our audiences, but will make a huge difference to our projectionist. For the last three years, we've been timing our films with a crude kitchen timer... and that's it. We don't have automatic light dimmers, film-starters, film-stoppers, intermission-makers, lense-changers, or anything else. Everything that happens when you sit down to watch a movie at our theater is done by hand, which is why several of you have probably been present when we missed an intermission cue and the film makes a loud popping nose before it bathes the auditorium in a blinding, seizure-inducing white light. Long story short, we're going to have a lot more automation at the new place, which should mean a better all-around movie-going experience for everyone involved.\r\n\r\nAnd now my time's up! See you tomorrow!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-08-26T08:19:50.000Z",
  "author": "Dan",
  "comments": [],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
