{
  "id": 558,
  "title": "T-Minus 21 Days: What the heck happened to T-Minus 22?",
  "body": "Seriously now. Who deleted the post I wrote last night in a fog of tiredness? I spent a good 10 minutes crafting a Pulitzer-worthy post, and now it's nowhere to be found. What gives?! Oh well. Not much went on yesterday anyhow.<br/><br/>Today, however, was different. We finally got the keys to our new space (woo hoo!), we locked up our bid on audio equipment ($$$$$ = XO~ [that's me puking]), and we're nearing a decision on the chairs. If you don't mind, I think I'm going to hold out a little while longer before I announce which chairs we've selected. Hell, I might just wait right up to the eve of the MNC (Moxie National Convention) and then surprise everyone with chairs from Canada. Only time will tell.<br/><br/>The new space is coming along swimmingly, which is exactly what I was hoping for leading up to the long holiday weekend. My uncle - the same one who helped us install our screen and speakers back in 2005 - is supposed to be coming up this weekend to take a look at the new spot, but I haven't heard from him yet. Isn't that exiting?! Aren't these update posts riveting to read?! It's like you're right there in the trenches with us!<br/><br/>Sorry. I'm just embarrassed that these posts don't have more meat on them. Also, it's really hot in the vault, which is where I'm typing this from, and that's making me cranky. I better call it a night. Have a great holiday weekend everyone, and we'll see you again on Monday!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-08-30T08:10:22.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "stevie_g",
      "body": "Howdy-ho everybody. I've updated my <a href=\"http://www.flickr.com/photos/87104832@N00/sets/72157606446460571/\" target=\"_blank\">Moxie 2.0 photo page</a> on flickr for those who might be interested:<br/><br/><a href=\"http://www.flickr.com/photos/87104832@N00/sets/72157606446460571/\" target=\"_blank\">http://www.flickr.com/photos/87104832@N00/sets/72157606446460571/</a><br/><br/>Please. Somebody...anybody...*SOB*",
      "created_at": "2008-09-01T20:39:42.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
