{
  "id": 561,
  "title": "T-Minus 18 Days: Stupid allergies",
  "body": "Today has been a long one. Spent most of the day breaking down GONZO and THE WACKNESS, building up BRIDESHEAD REVISITED, and playing phone tag with about 40 different people. I didn't even get a chance to go over to our new space today, but luckily my dad did, and he reported back that progress was minimal. Slowly but surely, folks. Slowly but surely. I'm not complaining, mind you. I'm sure there are all sorts of people out there who read these posts and think to themselves, \"if only my job were that easy!\" Not complaining, just laying out my day for all to see.<br/><br/>We started BRIDESHEAD REVISITED tonight, which had a solid first show, but the later screening was very, very quiet. Not too surprising, really; British period pieces rarely play well at night. It does, however, illuminate the vagaries of the theater business - sold out one night, empty the next. This is turning into an awfully depressing post, isn't it? I don't mean for it to be such a downer. Hmm, I better turn this ship around.<br/><br/>I only have one pair of underwear left, which means it's time to do laundry tomorrow. Also, my allergies are really acting up. As I type this, sand is literally cascading out of my left eye socket onto the keyboard. It's like a Visine commercial up in here!<br/><br/>Nicole got on to me for spilling the beans about our potential house-buying adventure. Let's keep that on the DL, shall we. Besides, nothing's been finalized yet, so I'm not sure why you got so excited in the first place. Did you really have to go and put up that billboard on Glenstone? I'm not even sure what I'm talking about at this point. The Allegra-D has fogginized my braind. I better end it here.<br/><br/>Aren't these posts exciting?!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-09-04T07:14:45.000Z",
  "author": "Dan",
  "comments": [],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
