{
  "id": 563,
  "title": "T-Minus 16 Days: Nicole's Rare Blog Post!",
  "body": "A few weeks ago, Dan and I decided it was high time for an official business meeting, where we would make a gigantic to-do list and delegate tasks for the upcoming move.\r\n\r\nSo, over martinis at The Mud Lounge, we did just that (I know...you're probably totally jealous right now that we can drink at our business meetings!).\r\n\r\nDan's to-do list is pretty hefty - getting all the projection equipment, bar equipment, theater chairs, create a new website, maintain a blog, doing the physical labor of building our new Cinebar...all kinds of stuff.\r\n\r\nMy to-do list <i>was</i> hefty, but I delegated everything to our fabulous staff. So all I've been doing these past few weeks is sitting on the couch eating candy. It's been awesome! (Don't tell our employees that doing my laundry isn't an important part of opening the theater!)\r\n\r\nOk, so I haven't given away every task...I did pick out wallpaper and paint colors. And rumor has it, very soon our boring sheet-rocked walls will be replaced with Velvet Red, Pelican Grey, French Bulldog Black, Eccentric Lime, and Majestic Violet (gotta love the Martha Stewart line of paint colors!).\r\n\r\nI've also narrowed down our lobby furniture picks, decided on a granite counter top (it wasn't much of a decision - I've been dreaming of Black Galaxy Granite since I was 10), and have started an updated version of the classic Moxie Poster Collage (like the one by our front door, with Amelie and The Big Lebowski).\r\n\r\nI'm also debating about making curtains, or just ordering some from IKEA...same with our acoustical wall paneling (although I wouldn't order those from IKEA). I did make a really tough decision recently: which fountain soda flavors we'll carry (Coke, Diet Coke, Cherry Coke, Dr. Pepper, Sprite, and Lemonade). Don't get me started on updating our wine list! Phew. That's a mess right now.\r\n\r\nBut speaking of wine, don't worry about any lapse in beer and wine sales - I took care of transferring the liquor licenses. Same with all our business licenses. And I hired some new staff members, too! Look out for their bright and shining faces in October (once they finish my laundry, of course).\r\n\r\nHmm. So maybe I've done a <i>few</i> things. But now it's 11:30pm on Friday night. Looks like it's time for another \"business meeting!\" See you later!\r\n\r\n-Nicole",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2008-09-06T08:26:58.000Z",
  "author": "Nicole",
  "comments": [],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
