{
  "id": 564,
  "title": "T-Minus 15 Days: T-Minus 14 Days",
  "body": "I forgot to write a post last night, but that's okay, because now I have twice as much to talk about today! Wee WHOO!<br/><br/>First, as you might remember from last week's post, we met with our architect and painter today to discuss the finishing process and determine our final schedule. The new calendar reflects the delays that occurred in August, and puts the finishing date right around the first week of October. If that's truly the case (you can never be sure until it actually happens), then CHOKE will be our last film at the original location. Who knows what might change between now and then, but it's presently the best estimate we have... and only a month later than we'd planned.<br/><br/>When we walked over to the new building today, we also noticed that the business directories on the back of the building are already sporting our name. Cool! We snapped a few pictures, but Nicole has her camera right now, so I'll have to wait to share those for another time.<br/><br/>Let's see... what else happened today? We met with Sheila from Springfield Granite Plus, and we're working out a deal for a beautiful granite countertop for the Cinebar. Since the bar will be the focal point of the entire lobby, we wanted it to look as amazing as possible, so when Sheila approached us about using her granite, we knew it would be a win-win situation. We still have some tinkering to do with the design, but I think it's going to be spectacular once we're finished.<br/><br/>Also, in a stroke of luck, the guy who I'd been talking to about theater chairs just bought a huge lot of chairs from a theater in Chicago, and has offered to stop in Springfield to see if we'd be interested in buying some of them. If they work out, that will save us well over $1,000 in shipping. Hooray for that! The only problem is that he's going to be here either tomorrow or Thursday and I don't have anywhere to store 120 theater chairs! I think we might go ahead and rent a small storage unit for the next couple months, since we'll also need a place to store our projection and sound equipment, but I haven't started looking yet. If you guys have any recommendations, please let us know.<br/><br/>That's it for today!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-09-10T05:13:21.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "The Four Finger Soc Em",
      "body": "If you guys need help moving those chairs, you just call the ol' Moxie muscle... which I guess would be Nate or somebody.<br/><br/>I will help though. You guys shouldn't be doin' that, let alone by yourselves.<br/><br/>I'm a swell guy!",
      "created_at": "2008-09-10T06:50:13.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "i could probably stack upwards of 40 chairs on my bed and in my bedroom<br/>i sleep on the couch anyway<br/><br/>maybe try hiding them in strategic places all over downtown... a few on top of the mud lounge.. some inside the art and design gallery<br/>a few more in the alley behind patton alley... just remember to make note of all the locations and chair amounts",
      "created_at": "2008-09-10T09:43:56.000Z"
    },
    {
      "author": "nate",
      "body": "Granite counter sounds fabulous.",
      "created_at": "2008-09-10T20:19:32.000Z"
    },
    {
      "author": "nicole",
      "body": "The granite is bee-yoot-iful! I have been daydreaming about having black galaxy granite in my house since I was probably 10.",
      "created_at": "2008-09-11T00:57:26.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
