{
  "id": 567,
  "title": "T-Minus 11 Days: It's about to get real",
  "body": "It's been a busy last few days. On Saturday we worked all day, I had to throw out a drunken bum by threatening to call the cops, and our power went out for 30 minutes in the middle of our busiest show of the day. We gave everyone passes and 5 minutes after they left, BOOM, the power comes back on. My uncle came up on Sunday, so I spent the first half of the day pulling speaker wire in both of the auditoriums, which is harder work than you'd imagine. Sunday finished on a high note, however, as we were invited to read movie-related trivia at Patton Alley Pub for their weekly Trivia Binge. That was fun.\r\n\r\nWe had our house inspection today, followed by a trip to the bank to get checks for our loan, then to Lowe's to buy pipe insulation, then back to the Moxie, which is where I've been since 2pm. We found out at 10 this morning that VICKY CRISTINA BARCELONA has been bumped back to Friday, so I sent out an emergency newsletter to alert everyone of the change. Hopefully everyone reading this post also received the update, if not... consider yourself updated now.\r\n\r\nWe have an entire class of high schoolers coming in to watch AMERICAN TEEN at 8 tomorrow morning, which is always a good time (the kids, yes; the waking up early, not so much). Then it's off to the new Moxie to insulate a set of drain pipes before they come in and start painting on Wednesday. I've been saying it for the last several months... that eventually stuff's going to come together all at once and we're going to have to go from zero to sixty just to keep up. Well, that's exactly what happened over the weekend. I'd say the ball is almost entirely in our court now, which is both scary and exciting.\r\n\r\nI'll try to snap some pictures tomorrow, since it's been awhile since I've shown off anything other than my mirrored head. See you then!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-09-16T06:33:21.000Z",
  "author": "Dan",
  "comments": [],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
