{
  "id": 57,
  "title": "Hey look, part 1",
  "body": "<b>Arts come alive as leaves fall from the trees</b><br/>By Sony Hocklander<br/><a href=\"http://www.news-leader.com\" target=\"_blank\">Springfield News-Leader</a>, September 3, 2004<br/><br/>Don't you just love September? Forget January. Forget spring. September is when new things really start happening.<br/><br/>I, for one, welcome the return each fall to planning, not winging, our weekends. To school nights when the teen goes to bed before midnight.<br/><br/>And to new seasons and shows. No. We're not talking TV here.<br/><br/>Think instead of galleries, theaters and performance groups.<br/><br/>Many launch season-opening shows this month. And ... their summer slumbers over ... university art galleries doors fling wide with a new year of exhibits. Most are open today during the First Friday Art Walk at 7 p.m.<br/><br/>Also ... surprise ... the Springfield Symphony's first concert was moved up to Sept. 25 (instead of Oct. 16). Something about a double-booking at the hall ... well, no matter. The earlier concert introduces new conductor Ron Spigelman to Springfield that much sooner.<br/><br/>What excites me most about this particular September is the revving of so many arts projects as they move from idle into drive.<br/><br/>Take the Creamery Arts Center. So much goes on there already with youth programs and adult workshops through the Springfield Regional Arts Council and the Arts Patronage Initiative.<br/><br/>This month bids are gathered to start phase I construction. By this time next year, the rest of the building should be code-worthy and activities could double, says SRAC executive director Kay Logsdon. One big change in the works: Springfield Regional Opera and Springfield Ballet organizations plan to move offices and studios to the Creamery. That's good for the arts as a whole, says Kay Osborne, the ballet's interim director.<br/><br/>\"We move the ballet and the opera to the Creamery, it's going to cause some foot traffic,\" Osborne says. \"And it will be a catalyst for more things.\"<br/><br/><i>Also on the horizon, we hope, is a new art film theater. Now don't get too excited. Yet. It's still in the exploration stage.<br/><br/>Maybe a bit farther than that, Andrew [last name ommitted by Dan] acknowledges.<br/><br/>Last spring, [Andrew], his wife, Ellen, and Doug [last name ommitted by Dan] closed on the old Electric Newsstand building at 425 W. Walnut St. with the idea of making it into a theater for art and independent films.<br/><br/>Meanwhile, a young couple in St. Louis who used to live in Springfield want to run the business, which could include a small cafe and two screens.<br/><br/>People have talked about wanting an art film theater as long as he can remember, [Andrew] says. Who knows? Others may have the same idea.<br/><br/>He doesn't say a theater is inevitable. But he's cautiously optimistic.<br/><br/>\"I think the time has never been more promising than it is right now,\" Baird says.<br/><br/>\"We're really excited about it, and we're just nervous about getting from first base to second base.\"</i><br/><br/>Oh, there's more going on, including plans among art groups to apply for another cooperative grant from the Community Foundation of the Ozarks. This one, if awarded, could create set-building and fabrication space in the Creamery.<br/><br/>The grant proposed and awarded last year creates community costume storage space, also at the Creamery. Costumes won't move in, however, until phase I construction is complete.<br/><br/>Lastly ... though it's certainly not last in importance or the last word on new changes: The Arts Patronage Initiative launches its first live theater production at Founders Park Sept. 24 and 25. (Call 869-1334.)<br/><br/>The play, \"Free Man of Color\" by Charles Smith, is a true story based on the life of John Newton Templeton who in 1824 was educated at Ohio University and groomed to become the first governor of Liberia. The play, directed by Mick Denniston, stars Tony Wheeler, Marcia Haseltine and Herman Johansen. Live music is by the Deliver<br/>ance Temple Choir. A colloquium on the play will be Sept. 25.<br/><br/>This play breaks ground on several levels, says Denniston. It's the first of, hopefully, many outdoor plays at Founders Park.<br/><br/>And, as Denniston says, \"Anytime we can tell a story in Springfield about diversity, I think that's important.\"",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-09-03T22:41:24.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "cool.",
      "created_at": "2004-09-03T22:13:57.000Z"
    },
    {
      "author": "bjork24",
      "body": "Hot.",
      "created_at": "2004-09-03T22:16:07.000Z"
    },
    {
      "author": "Einahpets",
      "body": "Pretty exciting!",
      "created_at": "2004-09-03T22:31:42.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks sis.",
      "created_at": "2004-09-03T22:33:43.000Z"
    },
    {
      "author": "Lor",
      "body": "Wow. Your becoming more and more famous. Next will be the talk show appearances! How cool!",
      "created_at": "2004-09-04T00:20:17.000Z"
    },
    {
      "author": "John",
      "body": "I was thinking I should ask for your autograph now so I can sell it on Ebay later.",
      "created_at": "2004-09-04T00:56:05.000Z"
    },
    {
      "author": "bjork24",
      "body": "We will soon be more famous than Brad and Jennifer.",
      "created_at": "2004-09-04T01:39:05.000Z"
    },
    {
      "author": "Aaron",
      "body": "Do I still get credit for leaking this?",
      "created_at": "2004-09-04T10:13:34.000Z"
    },
    {
      "author": "Rachel",
      "body": "Yay!  Buzz!",
      "created_at": "2004-09-04T18:29:51.000Z"
    },
    {
      "author": "Chuck",
      "body": "And people said we were naive!! Ha ha ha!",
      "created_at": "2004-09-06T14:59:06.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
