{
  "id": 570,
  "title": "T-Minus 8 Days: Year four, day one",
  "body": "Today is the first day of our fourth year here at The Moxie. We've successfully weathered 1,097 days without going out of business, which is a true accomplishment in the single-screen-arthouse-theater-run-by-a-husband-and-wife-team industry. Our official three year anniversary was yesterday, and we celebrated by giving away free cupcakes to everyone who bought a ticket, and free popcorn to anyone who brought us a birthday card (we're terrible, I know). While our anniversary was fun, and we enjoyed celebrating with all our customers, it capped off a rather difficult weekend.\r\n\r\nMy grandfather, who happened to be my last living grandparent, passed away over the weekend. Now, this isn't a personal blog, so I'm not going to spend time discussing the long and short of it, but it's worth noting if for no other reason than the unusual timing. My grandmother passed away five days before we opened our original location, and now, nearly three years to the day, and while we're once again in the midst of opening a new theater, my grandfather passes as well. It seems as though opening theaters is bad luck for my family. We didn't get much done over the weekend, and I doubt we'll be doing anything until after the funeral on Wednesday.\r\n\r\nAdding insult to injury, we also saw an unusually high number of rude customers this weekend. I'm not referring to the regular, run-of-the-mill, unknowing rudeness that we get on a weekly basis (i.e. \"why did you guys get this movie and the real theaters didn't?\"); we've learned to ignore those kinds of remarks. I'm talking about several people who went well out of their way to be downright disparaging. We're not sure why we had such a high amount of nastiness this weekend (maybe it was the moon), but it didn't help our slightly-higher-than-usual stress level. I'm not going to go into any further detail, because a) as I said before, this isn't a personal blog; b) I don't want to whine; c) we're big kids (we can handle it); and d) I don't want to embarrass anyone on the off chance that one of the Rudy McRudertons reads this.\r\n\r\nOther crappy things happened this weekend as well, but I think I've bitched and moaned enough.\r\n\r\nBlurg. This is a gross blog post. I feel dirty having written all that. Aren't these posts supposed to be fun and insightful?! That's what I aspire to, but sometimes it just doesn't cut it. Oh well. Tomorrow's another day, and I'm sure our luck will turn.\r\n\r\nI probably won't be writing another post for the next few days since I'll be with my family, but I'll be back as soon as possible with REAL progress updates. Thanks for sticking around, and most of all, thank you for supporting our little theater over the last three years. We really, really appreciate it, and look forward to serving you for many more years in our new location.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/092208/cards.jpg\" width=\"425\" />",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-09-23T07:32:47.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nate",
      "body": "And thank <em>you </em>for the Moxie!  I say that as a customer first, an employee second.\r\n\r\n\r\nI think if Rudy McRudertons happened to read this blog, and knew there was a good chance of having their rudeness exposed to a wide readership, they might be less quick to be so rudicious.... but then, I am not the businessman.\r\n\r\n\r\nSorry to hear about your grandfather, Dano.",
      "created_at": "2008-09-23T20:00:52.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "I am sorry about your grandpa, Dan. And that is unusual and very unfortunate about the timing.\r\n\r\nI will tolerate further rudeness only with a fist, as a fellow customer of course. When working, I will respond strictly with verbal abuse.",
      "created_at": "2008-09-24T07:19:48.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
