{
  "id": 571,
  "title": "I gave up on the countdown",
  "body": "Hello again! A lot's been accomplished at the new space since I last wrote, and this last weekend was much, MUCH better than the one before. The painters will be finished on Thursday, the drop ceilings will most likely be finished around the same time (if not earlier), and Dad and I will start piecing together the new Cinebar this weekend. Our Cubbie-loving photog Steve took some new pictures about a week and a half ago (<a href=\"http://www.flickr.com/photos/87104832@N00/sets/72157606446460571/\">see them here</a> - the new pictures start at the one with the multi-colored sign), but there's been a lot more work done since those were snapped. We'll try to grab a few pictures ourselves, assuming that 1) Nicole remembers to charge her camera's battery, and 2) Steve doesn't beat us to the punch.<br/><br/>I met with a couple flooring guys today: one who's going to refinish the concrete, and another who's going to install carpet along the aisles. Their bids came in a little higher than I would've liked, but there still might be some leveraging we can do. We'll see. Nicole is in the midst of picking out fabric for our DIY sound panels, which will make a nice phlog once we finally get around to building them.<br/><br/>CHOKE started on Friday, and will be our last official movie at our original location. That means unless you plan on seeing the movie multiple times, your next visit to our old space will most likely be your last (that sounds so ominous). It's sad and exciting at the same time. In that vein, I'm noticing we're doing a lot more \"lasts\" around here: I built up my last film on the drill system, changed the marquee for the last time, printed out our last monthly calendar, cleaned the bathroom for the last time (actually, that happened back in March of 2006), etc..<br/><br/>Hopefully everyone reading this will get a chance to sneak in one last time before we close up shop on the 9th. Don't forget: our bulk passes, super bulk passes, and Friends of the Moxie memberships are still for sale until our last day here. This will be your last chance to lock in $5 tickets that you can use at the new place. In these difficult and uncertain economic times, it's always nice to save a little coin, which is why I plucked a dime out of a puddle just before it drowned. See you tomorrow!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-09-30T04:33:08.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nate",
      "body": "Woah!  Ridge Runner's moving up there too?  Awesome!",
      "created_at": "2008-10-06T23:30:43.000Z"
    },
    {
      "author": "nicole",
      "body": "They're already open!",
      "created_at": "2008-10-07T21:09:09.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
