{
  "id": 578,
  "title": "Breaking News: Broken Window",
  "body": "One of the windows at our new space got itself good and busted in late last night. When I received the phone call this morning, I immediately assumed the worst - the speakers were stolen, our tools were gone, the cinebar had been demolished, my sunflower seeds were dashed across the floor - but luckily that wasn't the case. As soon as I saw the window, I knew no one had gone through it. Check it out:\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/102108/glass1.jpg\" width=\"425\" />\r\n\r\nMy next thought was vandalism. I searched around for a brick or rock or anything that could've been thrown through the glass, but there was nothing to be found. As I continued to look at the pattern of the broken window, a probable scenario played out in my head. Since the area of stress on the glass was about back/shoulder height, it leads me to believe that someone either fell on or was pushed into the glass, causing it to crack and shatter. The pane itself had a point of weakness where it had been hit by a small rock, and was loose within the frame, so it wouldn't have taken much to create enough stress to shatter the glass.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/102108/glass2.jpg\" width=\"425\" />\r\n\r\nWe were lucky that nothing was taken, and I'm not taking this stroke of luck for granted. Our alarm system was installed this weekend, but we hadn't activated it yet due to all the workers who were still coming and going at all hours of the day. Also, we hadn't turned on our insurance at the new place either. We remedied both of those oversights today. Now everything's as snug as a bug in a rug, and we'll soon be getting a new piece of tempered glass to replace the 50-year-old piece that was broken.\r\n\r\nIn relation to the window incident, everything else that's happened over the last few days pales in comparison. Our plumbing fixtures are in, but not working yet. Our chandeliers will be hung tomorrow or the next day. The Cinebar is shimmed and level. The granite countertops have been measured and templated. The floors in the auditoriums are cleaned and sealed.\r\n\r\nPhew.\r\n\r\nThat makes me tired just writing that stuff out. More later.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-10-22T07:24:03.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "The Four Finger Soc Em",
      "body": "Are you guys having to pay for it through your own noses?",
      "created_at": "2008-10-23T02:29:54.000Z"
    },
    {
      "author": "dan",
      "body": "Nope. Our landlord is taking care of it. He's a good guy that way.",
      "created_at": "2008-10-23T20:58:07.000Z"
    },
    {
      "author": "El Brian de Moore",
      "body": "alls well it ends well...\r\n\r\nis that how the saying goes?\r\ni feel like ive been mispronouncing it all these years",
      "created_at": "2008-10-28T06:11:48.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "<blockquote><cite>Posted By: El Brian de Moore</cite>alls well it ends well...</blockquote> All is well that ends well.",
      "created_at": "2008-10-28T10:09:53.000Z"
    },
    {
      "author": "stevie_g",
      "body": "If anyone is interested, I've posted more Moxie 2.0 photos at flickr:\r\n\r\n<a href=\"http://www.flickr.com/photos/87104832@N00/sets/72157608403005423\">http://www.flickr.com/photos/87104832@N00/sets/72157608403005423</a>",
      "created_at": "2008-10-30T01:17:05.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
