{
  "id": 579,
  "title": "The Big Reveal",
  "body": "Sorry for the lack of updates lately. With everything that's been going on lately -- working on the new space, keeping the old space staffed and operating, working on our new house, preparing for ROCKY HORROR -- it's been hard for me to find much time to answer my email, let alone write a blog post. At the end of the day, I'm so physically and mentally exhausted, I can't even muster up enough motivation to type out \"Today good. More to come later.\"<br/><br/>Just know that progress is indeed progressing, and the lion's share of renovation is finished. All that remains is installing booth equipment, chairs, screens, and Cinebar stuff (half of which is still in use at our current place). Our trusty ol' Moxie photog Steve<sup>*</sup> has <a href=\"http://www.flickr.com/photos/87104832@N00/sets/72157608403005423/\">some recent pictures of the space</a>, but they may be the last you see until we open. It's kind of like that Extreme Makeover show, where they show you all the stuff leading up to the last few days, then there's a quick montage of finishing touches, and then BANG! THE BIG REVEAL! Everyone gets to see the finished product as it was meant to be seen.<br/><br/>I really think ROCKY HORROR is going to be HUGE this year. We've already presold twice as many early tickets as we did last year, and we still have two days to go. Hopefully we'll see everyone there!<br/><br/>Today good. More to come later.<br/><br/><sup>*</sup> I'm not going to bring up the fact that Steve is (was) a hardcore Cubs fan, since, honestly, it would just be bragging at this point. If you're reading this Steve, there's always room for one more Cardinal's fan.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-10-30T04:35:58.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "ihaveadinosaur",
      "body": "yay!",
      "created_at": "2008-10-31T20:06:21.000Z"
    },
    {
      "author": "stevie_g",
      "body": "Though I have disavowed the Cubs due to their recent playoff performances (9 straight postseason losses), I would convert to Islam or join the Republican party before I became a Cardinal fan. So get that idea out of yer head right now, Dano.<br/><br/>I guess in order to 'convert' I would actually have to belong to another religion first...",
      "created_at": "2008-10-31T23:24:57.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
