{
  "id": 58,
  "title": "Just like starting over",
  "body": "<i>This blog is intended to chronicle the process of developing, financing, starting, and maintaining a small, independently-owned, art-house theater. The majority of the names contained within, of both people and places, are fictitious.</i><br/><br/>Up until this point, the lion's share of my posts have been one of two varieties: informative or ridiculously useless. If you've been a loyal reader for longer than the last few hours, you should be able to easily recall prime examples of each. Beyond these two types of posts, there really hasn't been much else, but that's all about to change.<br/><br/>Prior to today, the majority of my posts had been quite superficial. They either shed light on a previously unknown or poorly understood facet of the theater business or they dealt with a certain aspect of the business (i.e. business name, logo, marketing ideas, etc.). As I read through my older posts, I notice a distinct evasiveness in my writing, along with a tendency to ignore how the entire process of starting the theater is, and has been, affecting vast portions of my life.<br/><br/>You see, on the other side of this blog - the side where the keyboard is - there's a three-quarters developed, living, breathing, semi-serious human being who occasionally does things that have nothing to do with starting <b>The Moxie</b>, which, in the big scheme of things, can be just as relevant as the things that do. Now, don't get me wrong, this isn't an excuse for me to change the entire course of this blog and start writing posts about whatever I please... no sir-e-bob.<br/><br/>From hence forth, I'm going to make a concerted effort to express more of my feelings in regards to the theater - good and bad, boring or not. Some posts may have more relevancy than others, but if you haven't come to expect that from me yet, than you haven't read enough of the archives. In all actuality, some days come and go without a single thing getting done to further our dream of opening <b>The Moxie</b>. A big part of this venture has been dealing with being 200 miles away from Springfield, and knowing how to make the best of our downtime, which are two ripe topics that I plan on discussing in greater detail as we move along.<br/><br/>So, the good news is that you'll be seeing a lot more posts from me in the near future. The bad news is the same as the good news. It's just a matter of perspective.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-09-07T00:08:05.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Oz",
      "body": "Cool.  I know you're trying to keep this blog really focused, and I applaud you on that (you know you and Retail Blog Tim are the inspiration for my new blog), but I really like your writing, and if this means I'll get to read more from you, I'm happy.  Plus, it seems like you can still remain true to your goal.  I think that expanding your previous posts to include those \"oh shit\" moments and the sinking-feeling-in-your-stomach moments that you've made a huge mistake (not that you have) will really round out what this process is like.  So full steam ahead, my friend!",
      "created_at": "2004-09-07T02:20:58.000Z"
    },
    {
      "author": "Oz",
      "body": "Dan, this is completely off topic, but I was just reading your comment over on Retail Blog, and it reminded me of a cool thing you should do for your theater.  Way down in the middle of nowhere Delaware (okay, that's most of Delawhere?), I went past this little, tiny hair salon that was located in someone's garage or something.  Anyway, they had hours posted outside, and they were all wacky.  It was like, \"Open Mondays-Fridays: 9:02am to 5:48PM.\"  I thought that was great, and I vowed then and there that if I ever had my own business, I too would have wacky hours.  But I will allow you to use the idea, considering we're 1000 miles or so apart....and it wasn't my idea in the first place--right, that.",
      "created_at": "2004-09-07T02:28:07.000Z"
    },
    {
      "author": "Rachel",
      "body": "Awesome Dan.  I think this will make your blog even greater.  Your whimsy was bound to run out sometime; I think a little soul-searching will make your readers get more excited about the theater.",
      "created_at": "2004-09-07T02:49:40.000Z"
    },
    {
      "author": "bjork24",
      "body": "Oz, thanks for the encouragement. Since our hours are dependent on when we start our movies, I'm not sure if we'll be able to use the funny hours... although, we could always start our movies at strange times, like 7:18 PM. That would probably make people mad though. We'll do it!<br/><br/>Rachel, don't underestimate my whimsy... I still have a little useless banter left in me yet!",
      "created_at": "2004-09-07T02:54:05.000Z"
    },
    {
      "author": "Newell",
      "body": "Moo... er... that is to say... you write whatever you feel like writing! If you ever feel that you are veering too far away from your main purpose, just end the post with, \"Go, Moxie! Woo!\".",
      "created_at": "2004-09-07T03:06:28.000Z"
    },
    {
      "author": "bjork24",
      "body": "Go, Moxie! Wenus! er... I mean, Woo!",
      "created_at": "2004-09-07T03:07:59.000Z"
    },
    {
      "author": "einahpets",
      "body": "All news is good news.",
      "created_at": "2004-09-07T21:26:19.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
