{
  "id": 580,
  "title": "Several quick thoughts",
  "body": "1. RHPS 2008 was a success (despite a slight technical problem during the 9pm show). Thanks to everyone who showed up this year. We hope you enjoyed yourself, and look forward to bringing you an even better experience next Halloween.\r\n\r\n2. Our floors are being finished at the new space, so if you see the front doors open... DO NOT GO INSIDE!!! We've switched gears into an incredibly aggressive finish schedule which leaves us zero room for error. If everything goes according to plans, we open before Thanksgiving; if not, we open around Halloween... 2009.\r\n\r\n3. Nicole and I are going to a sneak preview of the new Hollywood Theater tomorrow, and we're both really excited to check it out. As I predicted earlier, their adult ticket prices are starting at $9.00 a head ($11 if the film is in 3D). In fact, here's a quick and dirty ticket matrix for all the first-run movie theaters during the last quarter of 2005:\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/110408/ticket1.gif\" width=\"425\" />\r\n\r\nAnd here's what they'll look like three years later:\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/110408/ticket2.gif\" width=\"425\" />\r\n\r\nOur expansion marks the first time we've ever increased ticket prices, but as you can see, even after our price hike, we're still the most affordable first-run movie theater in Springfield. Don't forget, all of our movies on Mondays are matinee priced (thus the name, Matinee Monday), and you still have TWO DAYS LEFT to come in and buy bulk passes at $5 per ticket. Any bulk pass you buy at our old location will be honored at our new space, so come on down and pick up one or twelve before it's too late!\r\n\r\n4. I hope everyone voted today. If you didn't, you still have time to exercise your civic duty. No matter which way the election falls, tonight is going to be historic.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-11-05T04:04:55.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Andy Karr",
      "body": "Actually, C16 significantly raised their prices just last Friday.  Not sure about Adult tickets, but Matinees and Students are now $7.",
      "created_at": "2008-11-05T19:12:03.000Z"
    },
    {
      "author": "dan",
      "body": "Very interesting. Thanks for the info, Andy.",
      "created_at": "2008-11-05T22:42:22.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
