{
  "id": 582,
  "title": "A case of the Mondays",
  "body": "I was planning on writing a fantastic, uplifting blog post today about all the great things that happened this weekend. Like my uncle coming up from Arkansas and successfully installing all our speakers at the new Moxie, or how nearly every one of our employees joined together to move several thousand pounds of awkward, greasy projection equipment from one location to the next (nearly killing ourselves in the process). Instead, I'm going to tell you a cautionary tale about U-Haul, puncture wounds, and bloody spumes.\r\n\r\n<b>WARNING</b>: This gets a little gory, so... reader beware.\r\n\r\nAt roughly 8:30 this morning, Nicole and I were on a mission to return our U-Haul truck (the one we used to move all the equipment yesterday) before 9:00 AM, which was when I was due back at the new location to start installing equipment with our projection tech. I grabbed my daily Dr. Pepper, jumped into the U-Haul truck, threw the transmission into drive, and away I went. Roughly two seconds later the top of the truck slammed into a small overhang on the back of our building, grinding the vehicle to a dead stop, while simultaneously smashing my face into the top of the steering wheel. It was so abrupt and jarring that it actually took me several seconds to figure out what had happened. In fact, here's how I remember my train of thought progressing:\r\n\r\n1. WTF was that?!\r\n2. Did I forget to release the emergency brake?\r\n3. Did I hit something?\r\n4. Are my teeth still intact?\r\n5. Oh crap. I think I hit the overhang.\r\n6. I better throw it into reverse.\r\n7. Uh oh. I better spit out all this blood.\r\n8. I better stop the car first.\r\n\r\nI then proceeded to jump out of the truck and spit a startling amount of blood out of my mouth. The strangest part, however, was that the blood was coming out of my chin AND my mouth. That's when I realized I probably had a hole in my face, and that if I didn't get the U-Haul truck back soon, I'd miss my 9:00 AM appointment. I politely asked Nicole to grab me a wet rag to help stem the flow of life essence from my face, but she was passed out on the ground (she's not a fan of blood, especially when it's pouring out of someone's mouth). Realizing that I was going to be late for my meeting, I hurtled my beloved wife's prone body, grabbed a wash cloth, applied pressure to the wound, and jetted back out onto the streets of downtown Springfield.\r\n\r\nThe people at U-Haul were none to happy to see the damage. I didn't think it was THAT bad.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/111008/damage.jpg\" width=\"425\" />\r\n\r\nThe strange thing is, the truck took all the damage; the overhang only has a little ding on the flashing... other than that, it looks exactly the same. I explained to them what happened, and expressed my relief that I had taken their good advice and bought insurance for the truck. That's when they broke the news to me. Apparently U-Haul's damage insurance covers everything EXCEPT damage to the area above the cabin. I didn't believe them at first, until they showed me the contract I had signed. Sure enough; there on the bottom of the deed, the last paragraph, it reads:\r\n\r\n\"Watch for overhead objects. I understand and agree that a collision with an overhead object is one of several exclusions under the damage waiver portion of SafeMove protection.\"\r\n\r\nAwesome.\r\n\r\n\"Not the best way to start the week,\" said the guy behind the desk, who ten minutes later was trying to explain to me (with a straight face) that the damage would cost me close to $800.\r\n\r\nFast forward twenty minutes and we're back on the road, bloody rag still dangling from my face, in route to our 9:00 AM meeting. We were only fifteen minutes late, and luckily my dad was able to go unlock the door to let our projection tech inside. We (the projection tech, electrician, and I) chatted for awhile, made a few jokes about U-Haul and the general state of my face, and then Nicole decided it was time to take me to the hospital. I tried to dissuade her, as I wanted to get started working on the projection equipment, but the steady stream of blood gushing from the lower half of my melon, for whatever reason, seemed to make her uneasy. Away we went.\r\n\r\nWhen we arrived at the urgent care center, the nurse asked me what was wrong. I explained to her the situation, and told her it probably wasn't as bad as it looked. \"Did your teeth go all the way through your skin?\"\r\n\r\n<i>I don't think so. I can't stick my tongue through the wound or anything.</i>\r\n\r\n\"Close your mouth and hold your breath.\"\r\n\r\nI can't quite explain in words what it feels like to blow air through a gaping hole in your face, but I can tell you that it was one of the more unnerving experiences of my day. Even worse, when the air forcefully issued out from my face, it sputtered out a horrific spume of blood and skin from beneath my beard like the blowhole of a demonic whale. It also made a noise that sounded a lot like a little wet fart.\r\n\r\n<i>I guess it did go all the way through</i>, I said as I wiped my blood off the counter and handed the receptionist my insurance card. Three hours, seven stitches, and one tetanus shot later, I was out the door and headed back to the theater, where I happily worked until a little after nine this evening. Here's what my face looks like now:\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/111008/blood.jpg\" width=\"425\" />\r\n\r\nYou can't see the stitches very well, as they're camouflaged within my blood-encrusted-whiskers, but you get the idea. If there's a silver lining to today's crazy events, it's that I might end up with a cool Harrison-Ford-esque scar across my chin.\r\n\r\nAwesome.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-11-11T08:34:42.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "The Four Finger Soc Em",
      "body": "Good post. Bad mug. Now you definitely can't shave that beard.",
      "created_at": "2008-11-11T10:28:02.000Z"
    },
    {
      "author": "Ian",
      "body": "Whoa.  I feel sick.  Had to skip a few words and distract myself.\r\n\r\nSersly.  Woozy.",
      "created_at": "2008-11-11T10:43:17.000Z"
    },
    {
      "author": "Girl #2",
      "body": "wowzers. sorry I didn't tell you the story of me hitting the overhang just the day before. perhaps you could have learned from my mistake and saved $800 + injuries.",
      "created_at": "2008-11-11T11:17:55.000Z"
    },
    {
      "author": "nate",
      "body": "I really liked the \"<em>camouflaged within my blood-encrusted-whiskers</em>\"",
      "created_at": "2008-11-11T19:26:42.000Z"
    },
    {
      "author": "erin",
      "body": "holy crap. amazing story. but a very bad deal.\r\nhope you get that lip into tip top shape for the opening!\r\ndid nicole get hurt when she fell?",
      "created_at": "2008-11-12T09:09:31.000Z"
    },
    {
      "author": "dan",
      "body": "Nicole didn't fall so much as crumple. She has a lot of experience fainting, so she came out without a scratch.",
      "created_at": "2008-11-12T20:50:55.000Z"
    },
    {
      "author": "evilvet",
      "body": "Post a calendar!  I need something to look forward to.",
      "created_at": "2008-11-14T03:54:09.000Z"
    },
    {
      "author": "nicole",
      "body": "(it's on my to-do list tomorrow!!)",
      "created_at": "2008-11-14T05:50:53.000Z"
    },
    {
      "author": "stevie_g",
      "body": "Ya know, it seems to me they should explain these little exemptions, and give a person the choice to pay a bit more to cover overhangs. What a crock of crap...\r\n\r\nDan, how are you doin', three days later?\r\n\r\nHope you guys are around tomorrow (Friday). I wanna stop by for some pictures.",
      "created_at": "2008-11-14T10:47:19.000Z"
    },
    {
      "author": "dan",
      "body": "We'll be around, Steve.",
      "created_at": "2008-11-14T19:45:05.000Z"
    },
    {
      "author": "stevie_g",
      "body": "I've updated the 2.0 photos. Same url as last time:\r\n\r\n<a href=\"http://www.flickr.com/photos/87104832@N00/sets/72157608403005423/\">http://www.flickr.com/photos/87104832@N00/sets/72157608403005423/</a>",
      "created_at": "2008-11-15T02:13:09.000Z"
    },
    {
      "author": "stevie_g",
      "body": "<a href=\"http://www.flickr.com/photos/87104832@N00/sets/72157608403005423/ \">Another 2.0 photo update.</a> Woo-hoo!",
      "created_at": "2008-11-21T22:57:26.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
