{
  "id": 584,
  "title": "Grand opening day!",
  "body": "It's been a hard 24 hours. Pretty much everything that could go wrong (in the booth, at least) has gone wrong. Our projectors have been smoking, flaming, hissing, crackling, freezing, burning, and farting all over the place, but believe it or not, those bad boys are still going to be showing films tonight. Such is the ways of used equipment.<br/><br/>Also, we hired a cleaning lady to come in and help make the place look presentable this morning, but she ditched us! And I don't mean that in the \"she never showed up\" sense, because she was here this morning, on the dot, at 8am. Nicole and I introduced ourselves, showed her where she could get started, then went about our other work. Thirty minutes later, when I went to go check on her, she was gone. Perhaps the scale of the clean-up job overwhelmed her, but after several mental breakdowns, we pulled together (along with some of our staff) and made the place look presentable.<br/><br/>It's been a long couple of months, amigos, but tonight, despite the staggering odds against it, The Moxie will be back open for business.<br/><br/>Now excuse me while I go vomit.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-11-27T02:05:19.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Megster",
      "body": "i love you, moxie!  hang in there!  kelly and i will be there tonight along with some friends buying concessions and complimenting you on a job well done!",
      "created_at": "2008-11-27T02:35:28.000Z"
    },
    {
      "author": "stevie_g",
      "body": "It was awesome, folks, complete with a minor glitch here and there (which was part of the charm on opening night). The Bodingtons's was cold, the popcorn fresh and salty, admission and soft drink refills free, the film excellent and Dan & Nicole were, well, <em>Dan & Nicole</em>. They and their staff care; it's a passion, and you can feel it. They love what they are doing.<br/><br/>The Chiltons are one of the rare few who have succeeded in adding tangible culture to the Springfield landscape without the help of (and with the utmost of respect to) someone who's initials are JQH. Going to the Moxie is not just going to a movie; it is an <em>event</em>.<br/><br/>And it just got even better...",
      "created_at": "2008-11-27T12:56:18.000Z"
    },
    {
      "author": "erin",
      "body": "it was absolutely amazing.<br/>so proud of you moxie!<br/>three cheers!",
      "created_at": "2008-11-27T23:03:08.000Z"
    },
    {
      "author": "PatMcRotch",
      "body": "It just clicked. The Moxie 2.0 is in the Wilhoit. I was on the crew that gutted the building in 05(?). I am pretty sure I spent some time in the bay that The Moxie is in now cutting out a crap-ton of old pipes from the ceiling. Glad to see it filled with something awesome!",
      "created_at": "2008-12-27T18:09:00.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
