{
  "id": 585,
  "title": "The seven and a half floor",
  "body": "Mark it down; this is the first blog post I've written since we've opened for business at our new location. It's been a crazy five days, but things are already starting to settle back into a sense of routine, albeit a totally new one. I wish I could've written more during the transition, but it would've been nearly impossible. Had I known how incredibly taxing—physically, emotionally, financially—this move would be beforehand, I'm not sure we would've made the jump in the first place; but we did, and I'm glad. Now, let's talk about something else.<br/><br/>I'm writing this from my new office, which is situated underneath the booth in a dark, dirty corner of what we're referring to as <a href=\"http://www.youtube.com/watch?v=G5vtT6xByVE\" target=\"_blank\">the seven and a half floor</a>. Why, you ask? Because the clearance from floor to screw-and-nail-riddled ceiling is a mere five feet. While the low overhead is novel, the exposed fiberglass is not. After being down here for five full days, I can already feel the microscopic, carcinogenic shards of man-made glass embedding themselves into the delicate lining of my lungs. Until I can get the walls covered with something (most likely roll plastic), I've been doing my best to only breathe through my nose... and I'm also wearing my scarf around my face.<br/><br/>The reason I'm forced to take up shop in this rather uninhabitable (and totally awesome) hole is due in large part to a reduced amount of storage space at our new space. The vast majority of square footage was used to make everything larger: bigger bathrooms, larger lobby, additional auditorium, huger hallway, wider walls, cooler Cinebar; which left us with little room for storage. We had the exact opposite situation at the old place, where we had more storage space than brains, causing us to collect all kinds of crud that we should've thrown out or given away. Now we have to cull our collection of crap to fit into our new, efficiently designed digs. Can it be done? You betcha!<br/><br/>This scarf is really itchy on my nose.<br/><br/>In other news, I shaved off my beard and the scar from my infamous U-Haul accident is exactly how the doctor described it: minimal. I was sort of hoping for a cool Harrison-Ford-esque line across my chin, but I guess I'm alright with it being nearly invisible as well.<br/><br/>We still have quite a few projects to finish before I'll consider the new theater 100% finished; like hanging curtains around the screens and over the speakers in both auditoriums, installing and calibrating our digital projectors, piping in music to the lobby, designing and putting up a menu, putting a light in the seven and a half floor so I'll quit banging my head against the ceiling joists, &c.. Is it just me or have I been using a lot of punctuation in this post? Look at all those semi-colons!<br/><br/>:O<br/><br/>;-)<br/><br/>I'm looking forward to booking the rest of December and getting our new calendars out, as well as starting a marketing blitz to let everyone know about our new location. 2009 is going to be a challenging year, but, as always, I think The Moxie is up for it. That's all for today. I have to go pull up lights in auditorium two. AWESOME!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-12-01T04:44:15.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "stevie_g",
      "body": "The question is, have you exhaled?",
      "created_at": "2008-12-01T07:21:33.000Z"
    },
    {
      "author": "dan",
      "body": "Not yet.",
      "created_at": "2008-12-02T01:46:57.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
