{
  "id": 586,
  "title": "Dan and Nicole on The Mystery Hour",
  "body": "Just a quick announcement: Nicole and I will be guests during this <strike>Saturday's</strike> Friday's \"Mystery Hour\" at The Skinny Improv, hosted by our good buddy Jeff Houghton (who has a dish named after him at Gailey's). It's an hour long late-night-talk-show-esque extravaganza! The show starts at 10:15 PM, and tickets are a measly $5.00. Jeff promises plenty of full facial nudity, but I still might show up without pants just to throw him off. Nude or not, it's going to be a blast, so if you're looking for something fun and different to do on <strike>Saturday</strike> Friday night (assuming you've seen both MAN ON WIRE and SYNECDOCHE, NEW YORK), swing by and catch the show.\r\n\r\nIn other news, I banged my head on a ceiling joist so violently today that I think I jarred something loose. Now the only thing I can smell is burnt ham.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-12-04T10:03:43.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nate",
      "body": "Jeeeez, Dan.  Try to go two days without causing violent harm to your person.  Steering wheel to the face, fiberglass-riddled bleeding lungs... not to mention the pistachios from way back.  It's amazing you still walk upright.  The Moxie's become your own personal <a href=\"http://www.imdb.com/title/tt0123755/\">CUBE</a>-like deathtrap.  (Just for Dan; not you, dear anonymous reader/customer).",
      "created_at": "2008-12-05T23:53:23.000Z"
    },
    {
      "author": "nicole",
      "body": "It's not on Saturday, it's TONIGHT!",
      "created_at": "2008-12-06T03:39:36.000Z"
    },
    {
      "author": "SpeedyProductions",
      "body": "Dan and Nicole, it was cool seeing you at the Mystery Hour last night.  Previous to that I only knew your names, and I had seen your faces at the Moxie, but I was not smart enough to put the two together until tonight.  Sorry you passed out Nicole :(  lol.\r\n\r\n-Speedy Gonzales",
      "created_at": "2008-12-06T20:33:42.000Z"
    },
    {
      "author": "nicole",
      "body": "Clarification: I did not pass out at The Mystery Hour!! But I did have butterflies in my stomach the whole time. I'm no good at being in front of crowds.",
      "created_at": "2008-12-08T01:15:53.000Z"
    },
    {
      "author": "SpeedyProductions",
      "body": "Oops, my bad.  I just re-read my post.  I will see you all at To: and From:",
      "created_at": "2008-12-09T22:39:03.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
