{
  "id": 587,
  "title": "For those of you who say we never show enough animated films...",
  "body": "When I was in high school, my sister and I would get extra credit for seeing foreign films, and the *only* place in Springfield that offered that service was at SMS (now, of course, Missouri State). I remember the first time we went on campus and watched LA CEREMONIE, a French psychological thriller by one of my favorite mystery authors, Ruth Rendell. We felt so cool, just little ol' high school freshmen, walking on campus in the evening, catching a flick in a small dark auditorium, sitting amongst college kids and professors. Oh how smart we thought we were!\r\n\r\nThere were always such a good selection of films on campus - I also remember watching MICROCOSMOS - that weird, very up-close and personal documentary on insects. There still are a great selection of films to watch from MSU's various film series, but there's going to be one small change: They'll now be playing at The Moxie! We're super excited to partner with Missouri State's Media, Film, and Journalism Department to help showcase their film series this upcoming semester. \r\n\r\nEach semester, the department picks a handful of films with a similar theme. In the fall, it was \"Politics in Everyday life\", and they played films such as 4 MONTHS 3 WEEKS 2 DAYS, THANK YOU FOR SMOKING, and THE LAST KING OF SCOTLAND. For this spring, they picked six animated films. But these aren't your everyday Pixar animation - these films push the boundaries on style, plot, and expectations. We can't wait to be a venue for these films!\r\n\r\nAnd naturally, the best part of the series is that they're FREE! So mark your calendars, and sweet talk your teacher for some extra credit. You'll feel so cool.\r\n\r\n+ + + + + + + + + + + + + +\r\n\r\nHere's the schedule:\r\n\r\n<b>HEAVY METAL</b> - <i>Jan. 21 @ 7pm</i>\r\nThis unique collection of six animated stories combines science fiction wih fantasy, horror, comedy, sex and rock music. The stories are all linked by sequences featuring a fiendish green meteorite that claims to be the cause of evil throughout the world.\"\r\n\r\n<b>PINK FLOYD: THE WALL</b> - <i>Feb. 11 @ 7pm</i>\r\nLoosely based on the life story of Syd Barrett, Pink Floyd's original front man, PINK FLOY: THE WALL stars Bob Geldof as Pink, a mentally damaged man who has gone from a hopeful child artist to a burned-out rock star drifting away from reality.\r\n\r\n<b>PAPRIKA</b> - <i>March 4 @ 7pm</i>\r\nThe visually striking thriller is set in the not-too-distant future, where doctors are developing a groundbreaking new psychotherapy treatment that allows them to enter the dreams of a subject and explore matters of the unconscious mind.\r\n\r\n<b>PRINCESS MONONOKE</b> - <i>March 18 @ 7pm</i>\r\nA beautifully realized tale of civilization versus nature, PRINCESS MONONOKE is a true epic by Japan's master animator, Hayao Mizyazaki.\r\n\r\n<b>PERSEPOLIS</b> - <i>April 15 @ 7pm</i>\r\nPERSEPOLIS presents a deeply personal coming-of-age tale about finding one's place in the world. Based on her bestselling graphic novel, Marjane Satrapi teamed up with underground comic book artist Vincent Paronnaud to co-direct this animated big-screen adaptation.\r\n\r\n<b>FEAR(S) OF THE DARK</b> - <i>April 29 @ 7pm</i>\r\nFEAR(S) OF THE DARK is a collaborative showcase of six different drawing and animation styles, provocative in their very mutations, the film manages to escape the seemingly inherent horror-anthology fate of adding up to an uneven tone.\r\n\r\n\r\n",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2008-12-17T01:21:38.000Z",
  "author": "Nicole",
  "comments": [
    {
      "author": "The Four Finger Soc Em",
      "body": "Cool! \r\n\r\nNicole, you wrote this post... right?",
      "created_at": "2008-12-17T07:40:57.000Z"
    },
    {
      "author": "nicole",
      "body": "yes, but I don't know how to change it on the forums portion...",
      "created_at": "2008-12-17T22:27:09.000Z"
    },
    {
      "author": "nate",
      "body": "This is very cool.",
      "created_at": "2008-12-18T00:01:00.000Z"
    },
    {
      "author": "Steph V. Horn",
      "body": "Uh, what, we weren't cool in high school?",
      "created_at": "2008-12-24T08:00:49.000Z"
    },
    {
      "author": "nicole",
      "body": "Yeah we were - because we went to MSU's film series.",
      "created_at": "2008-12-24T22:50:43.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
