{
  "id": 588,
  "title": "Exploding cows",
  "body": "Back when Nicole and I used to work at Springfield 8, on a particularly busy Friday night, I was right in the middle of tearing tickets when an older gentleman approached me and whispered in my ear: \"You might want to go clean up in the bathroom... it looks like a cow exploded in one of the stalls!\" He then turned around and began to walk away, but then stopped and decided to clear something up: \"It wasn't me!\"<br/><br/>I continued to tear tickets as I pondered what to do; luckily, a few moments later, a fellow employee walked by, broom in hand. \"Hey [past co-worker]! Go check out the men's restroom. Someone said one of the toilets is messed up.\" The poor sap (I don't remember who it was, exactly) willingly obliged, and off he trotted into the restroom. Less than a minute later, the same employee staggered out of the restroom looking like he'd just watched the first 30 minutes of SAVING PRIVATE RYAN... gurgling out of a toilet bowl.<br/><br/>He flat out refused to do anything about the mess (and rightly so), so we took the next logical step: find the next employee with less seniority and make them do it. This deflection down the chain of command continued for about an hour until we'd finally ran out of groundlings to force the job upon, and that's when the manager stepped in. Andy R. was his name, and he was a fine fellow. He went in for an inspection, came out slightly dazed but still determined, and returned with yellow gloves and cleaner. The job had fallen on his able shoulders, and he wasn't about to back down.<br/><br/>Long story short, he cleaned up the poop, and I learned an important lesson: you can make your employees do menial tasks, but when it comes to cleaning a stranger's fecal matter, the buck always floats to the top. I'd never had the opportunity to relate this story until tonight.<br/><br/>And that's all I'll say on the matter.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2008-12-27T09:58:38.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nicole",
      "body": "Remember the time at S8 when we had a kids show of Veggie Tales? All those kids got Hawaiian Punch, a Popcorn, and gummy bears. Within 15 minutes (I'm not kidding), I had to clean up no less than 20 puke piles. TWENTY. I almost quit that day. But then I realized how awesome it is to work at a movie theater.",
      "created_at": "2008-12-27T10:26:17.000Z"
    },
    {
      "author": "The Four Finger Soc Em",
      "body": "Some people have a weird way of saying merry Christmas.",
      "created_at": "2008-12-27T14:36:32.000Z"
    },
    {
      "author": "TheFoshe",
      "body": "Just so you know. Thats about the same way things work now at the movie theatre. And theres still \"cow explodings\" to clean up.",
      "created_at": "2008-12-27T21:31:17.000Z"
    },
    {
      "author": "erin",
      "body": "youre a good man, dan chilton.",
      "created_at": "2008-12-27T22:50:46.000Z"
    },
    {
      "author": "maxcue",
      "body": "Dan and Nicole are the best and I wish them the best in what's sure to be a rough year. If they wanna talk about poop, I hope they kick it out of the 14-plex. I may even go there some time (haven't yet) but am a big fan of the Moxie and how hard Dan and Nicole have worked to bring some choice and much-needed additional culture to this town. I'm really struggling with depression today and lately and this most-recent posting, which I just read (Jan 2, 09) gave me some good and much-needed laughs. Happy New Year Dan and Nicole from Dave Stone.",
      "created_at": "2009-01-02T23:42:06.000Z"
    },
    {
      "author": "mackattic",
      "body": "And that's all I'll say on the (fecal) matter.",
      "created_at": "2009-01-06T03:04:57.000Z"
    },
    {
      "author": "nate",
      "body": "Ew.",
      "created_at": "2009-01-06T19:38:13.000Z"
    },
    {
      "author": "bmozer1",
      "body": "Hahahaha.  I have had the exact same experience, and it's a hard lesson to learn.",
      "created_at": "2009-01-10T01:01:34.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
