{
  "id": 59,
  "title": "Money, money, money",
  "body": "As is evidenced by <a href=\"57\">the article</a> that ran in the <a href=\"http://www.news-leader.com\" target=\"_blank\">News-Leader</a> a few days ago, our theater is anything but a done deal. Up until roughly a week ago, we were cruising along with the hope that Andrew and Doug would cover the reconstruction / renovation costs while Nicole and I tackled the equipment / installation / fixture fees. When we last spoke with Andrew, back in June after the <a href=\"19\">film forum</a>, that was the agreed upon end result that both parties would strive towards. Andrew and Doug were going to figure up the total cost of renovating the building, while Nicole and I prepared <b>The Moxie</b> ship for her maiden voyage.<br/><br/>Unfortunately, we've encountered a bit of a snag. Andrew has informed me that the cost of rehabbing the building is going to be more than what they had originally anticipated, which means we'll either have to a) pay a substationally larger amount in our lease to cover the renovation costs, or b) come up with another way to distribute the financial responsibilities. We (Andrew, Doug, Nicole, and I) are going to have another meeting on September 24th to discuss what our next step should be. I can't fully express the levity of this meeting, or at least my own perception of its levity. It seems to me that the entire fate of the project hangs in the balance. That may or may not be the case, but if Andrew and Doug's construction loan can't cover the rehab costs, who will?<br/><br/>- - - - - - - - - - - - - -<br/><br/>Dear Mr. Pitt,<br/><br/>Allow me to introduce myself. My name is Dan C. and my wife and I are currently embarking on a new business venture in our mutual hometown of Springfield, Missouri. I realize that a thousand such requests must cross your desk on a daily basis - that is, assuming you even have a desk, and that if you do, you read your mail there - but please hear me out. Our business is different than all the rest. Seriously. It's an independent movie theater unlike any you've ever seen.<br/><br/>Being as involved in the film business as you and Jennifer are, you can surely understand Springfield's need for an eclectic theater that exhibits smaller independent and foreign films that have historically bypassed our town for the larger markets of St. Louis and Kansas City. Springfield, however, is growing quickly, especially the downtown area, thanks in part to your generous donation to the <a href=\"http://www.discoverycenter.org\" target=\"_blank\">Discovery Center</a>. Perhaps you heard that the new downtown stadium just inked a deal with the farm team for the Cardinals. It's a very exciting time to be a business in downtown Springfield, and we believe our independent theater would be a welcome addition to the newly emerging cultural community.<br/><br/>When I had cable several months ago, I happened to catch a show that was focused solely on you and your wife's fabulous lifestyle. I won't embarrass you, or myself, by repeating the audacious figures they mentioned on the telecast, but I will tell you that I've spent many a night pondering what I'd do if I found myself burdened with such a tremendous amount of wealth. The answer, of course, is a lifetime supply of Dr. Pepper and lots and lots of cereal, but judging by the healthy appearance of you and yours, it's evident that you chose the high road. You've elected to spend your hard-earned money on lengthy Mediterranean vacations and luxurious gifts for your wife, both of which, I might add, are rightly deserved. My nose is turning brown, Brad. And it smells like celebrity ca-ca.<br/><br/>Perhaps, next time you find yourself balancing the old checkbook, you might find a little something for a fledgling couple of entrepreneurs back in Springfield. If that were the case, I can promise you perpetual reservations for any movie we ever show. If the show is sold out, I'll let you sit in the projection booth, but the beer is on me, my friend. All the beer you<br/> can drink. We could sit in the projection booth and get completely shit-faced while our wives discuss apron-sewing patterns and quip, \"boys will be boys!\" Oh Brad, will you be my hero? I'll buy you any beer you want! Honest I will.<br/><br/>Perhaps I've said too much.<br/><br/>Sincerely,<br/>Dan C.<br/><br/>- - - - - - - - - - - - - <br/><br/>You see what I mean about my evasiveness? I tease you with a sincere, heart-felt feeling and then I run off and hide behind an open letter to Brad Pitt. I'm learning. I'll be more open with my feelings in the future. Honest I will! Baby steps, Dan. Baby steps.<br/><br/>[EDITORIAL NOTE] - I switched the sentence \"The answer, of course, is drugs...\" to \"The answer, of course, is a lifetime supply of Dr. Pepper and lots and lots of cereal...\" I had originally changed it prior to publishing the post but it slipped back in when I pasted an older version into the blog window. The Dr. Pepper / cereal statement is a little more true to life than the drugs statement... okay, okay, it's A LOT MORE true to life. I have a sad, sad addiction to Pepper M.D. and Cheerios. Please help me.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-09-08T02:40:41.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Scott Glow",
      "body": "Send the letter, Dan.  You have nothing to lose :)",
      "created_at": "2004-09-08T03:16:48.000Z"
    },
    {
      "author": "bjork24",
      "body": "You're right, Scott. I'm licking the envelope right this minute... of course, the letter isn't in the envelope.",
      "created_at": "2004-09-08T03:23:57.000Z"
    },
    {
      "author": "Newell",
      "body": "Perhaps this is a little juvenile, but...<br/><br/>I DARE you to send that letter!!!!",
      "created_at": "2004-09-08T03:53:27.000Z"
    },
    {
      "author": "bjork24",
      "body": "If I knew Brad's mailing address, I would. I dare someone who knows Brad's address to tell me. I DOUBLE DOG DARE you!",
      "created_at": "2004-09-08T04:23:17.000Z"
    },
    {
      "author": "Oz",
      "body": "I know how you feel--kind of.  Not in the specifics of business.  All this stuff is one of the major reasons I've decided to do wedding photography---relatively cheap start-up costs.  But I've had other things in my life happen--like trying to get pregnant for instance--where everything seems to hang in the balance, and it's someone else who is going to tip the scale one way or the other.  So good luck with your meeting.  And yeah, send the letter.  According to this website:<br/><br/>http://bradpitt.addresses.com/celebrity/bradpitt.html<br/><br/>this is Brad Pitt's mailing address:<br/><br/>c/o CAA 9830 Wilshire Blvd. <br/>Beverly Hills, CA 90212<br/><br/>Send the letter, you pussy!",
      "created_at": "2004-09-08T04:54:41.000Z"
    },
    {
      "author": "Oz",
      "body": "PS  You know I only insult you because I love you, right?",
      "created_at": "2004-09-08T04:56:09.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks, Oz. I'm going to send the letter to Brad's agency. Maybe, if I'm really, really lucky, he'll read it before my 40th birthday.",
      "created_at": "2004-09-08T05:00:35.000Z"
    },
    {
      "author": "Justin",
      "body": "Send it to his parents house.  Wrapped in a firebomb.",
      "created_at": "2004-09-08T05:53:06.000Z"
    },
    {
      "author": "bjork24",
      "body": "But that would burn up the letter!",
      "created_at": "2004-09-08T06:03:11.000Z"
    },
    {
      "author": "Rachel",
      "body": "I want to help!  I have no money!  What can I do?  Have you been to entrepreneur.com?",
      "created_at": "2004-09-08T07:34:58.000Z"
    },
    {
      "author": "einahpets",
      "body": "I think you should totally send the letter. But, I think the part about drugs won't help your cause. They won't give a one show salary to support your drug habits. We can get you help...",
      "created_at": "2004-09-08T16:36:44.000Z"
    },
    {
      "author": "bjork24",
      "body": "Rachel, as soon as you make some money, send it to us. I haven't checked out entrepreneur.com, but I will now.<br/><br/>Stephy, I need help... I'm addicted to caffiene and sugary cereal.",
      "created_at": "2004-09-08T18:40:05.000Z"
    },
    {
      "author": "Sandra",
      "body": "Ya know, most of these people get boring form letters begging, i mean, asking them for their support. The letters usually end up in the circular file.<br/><br/>This might actually catch someone's eye and get a response!",
      "created_at": "2004-09-09T22:56:08.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
