{
  "id": 590,
  "title": "Busiest. Weekend. Ever.",
  "body": "This weekend was beyond busy. Since we opened at our new location, we often wondered what it would be like when both screens were showing a huge film that everyone wanted to see (I call this mythical occurrence \"double-barreling\"). This weekend gave us a taste of that scenario, with both auditoriums straining to hold in multiple sold-out shows, and--<br/><br/>This just in, Kate Winslet just won a Golden Globe for Best Supporting Actress for THE READER, which, if I remember correctly, happens to be playing 10 feet away from me! Woo hoo!<br/><br/>Now, where was I? Oh yeah, business. Err, BUS(Y)ness. It's great, but neither myself nor my lovely wife are simple-minded enough to think our numbers are going to stay like this forever. This just happens to be the most fruitful time of the year for award films, and we happen to be double-barreling it with two of the biggest contenders on the circuit.<br/><br/>In fact, both of our films are competing against each other for Golden Globes tonight in three separate categories: Best Picture, Best Director, and Best Screenplay. That means we have a 40% chance that one of our films will be bringing home more awards tonight! And 60% of the time, news like that makes me feel good EVERY time.<br/><br/>In other news, we had our windows professionally cleaned this weekend, and it's amazing the difference it's made. Four birds, two cats, and one mail delivery person have already tried to go through our window, thinking it was just a gloriously open hole (that's what _____ said). Don't worry though, they're all okay.<br/><br/>As for me, it's intermission time!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2009-01-12T06:08:54.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nicole",
      "body": "Yippee!<br/><br/>Golden Globes: Best Picture, Best Director, Best Screenplay, Best Original Score!",
      "created_at": "2009-01-12T09:35:32.000Z"
    },
    {
      "author": "SpeedyProductions",
      "body": "Congrats Dan and Nicole!  I love to hear local small business people take the leap and succeed to an unexpected level!  Man it is inspiring to hear a story like this when everything else you hear is depressing about our economy.  Kudos!<br/><br/>-Speedy",
      "created_at": "2009-01-12T21:17:05.000Z"
    },
    {
      "author": "evilvet",
      "body": "What, no Golden Globe props to the protagonist of what I think was the Moxie Sleeper of the Year, and my personal tie for favorite Moxie Movie Deux with Slumdog?  Congratulations to Sally Hawkins for her great performance in Happy Go Lucky.  For the rest of my life I will no longer be able to check my rear view mirrors without thinking of her driving lesson. Her win softened the blow of Penelope Cruz not winning her category in another Moxie stalwart, VCBarcelona.  It was sweet, and if the Moxie can't Bring it Back! Bring it Back! make sure to watch Happy Go Lucky on DVD.",
      "created_at": "2009-01-13T08:25:30.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
