{
  "id": 591,
  "title": "More chairs! More chairs! My kingdom for more chairs!",
  "body": "Despite the nasty weather, we had another huge day today. It really is amazing how well these films are performing, and we couldn't be more grateful for having them. We came within five people of breaking our all-time attendance record tonight, which we set last Saturday. That fact is all the more impressive when you consider that we had one less show today than we did last Saturday when we set the high mark. Sold out shows are awesome, but, like many good things (Dr. Pepper, beer, Andy's frozen custard), come with a few low notes.<br/><br/>For instance, nothing hurts us more than turning away eager movie-goers, which is something we've had to do quite a bit of over the last four weeks. My dad says, \"that's a good problem to have,\" which is true in a way, but who knows what those people are thinking. Best case scenario, they're thinking, \"wow, this place is really happening! We'll have to come back again, and show up earlier, so we can see what all the fuss is about;\" but they could just as easily be thinking, \"what? I can't believe they're sold out! What a crappy little theater. I'm never coming back again!\" Either way, it sucks.<br/><br/>Also, sold out shows lead to cranky customers. People complain because they have to sit in the front row, they don't have a place to put their coat(s), it's too hot, they're bleeding, etc., etc., etc.. These are all valid complaints, and if I could fix them all I would. We're trying our hardest to please as many people as possible, and I sincerely apologize to anyone who hasn't had the best Moxie experience over the last few weeks due to us being constantly filled to capacity. We've had a lot of people (mostly new faces) say some really mean things to us, but that doesn't bother us... we're tough. *sob* *sob*<br/><br/>I just hope everyone knows we're trying our hardest, and to please bear/bare with us through this tumultuous time of being successful beyond our wildest dreams. Thank you.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2009-01-17T09:48:38.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Andy Karr",
      "body": "Probably this blog's greatest closing paragraph ever.",
      "created_at": "2009-01-18T09:20:23.000Z"
    },
    {
      "author": "gillyvanilly",
      "body": "i love the moxie, and as long as you keep Stella on draft i don't care how crowded the shows are.",
      "created_at": "2009-01-19T07:21:30.000Z"
    },
    {
      "author": "K-White",
      "body": "You guys are doing a wonderful job.  Thank you for all the options in movie viewing that you bring to our community.<br/><br/>I had an observation last week at the The Reader - not a complaint exactly but a suggestion/observation for improvement - in theater 2 the screen has a large line across it, especially noticeable on white or light backgrounds that is fairly distracting.  We were sitting about five rows back and it I either had to look above or below it in an attempt to ignore it.  Probably one of those things that if you haven't seen it yourself, you think I'm crazy, but once you have noticed it you can't quit staring at it.  Anyway, thought I would add onto your already overburdened load.  I don't think it was in the film or projection, but an actual line on the screening surface.",
      "created_at": "2009-01-19T23:00:30.000Z"
    },
    {
      "author": "dan",
      "body": "Yes. Sorry about that K-White. That's a defect in the screen, which I've pointed out to the manufacturer. They're currently fabricating us a new one, sans seam, but it's taking them awhile (they tend to drag their feet when they have to do it for free). Again, very sorry for that. It should be fixed soon.",
      "created_at": "2009-01-20T00:15:24.000Z"
    },
    {
      "author": "lindse65807",
      "body": "yea, I noticed the lines, and in the smaller theater there are little dots on the surface of the screen. maybe that's normal and because I was thisclose, lol. anyway thank you moxie for bringing these films to springfield, it's awesome the screenings are sold out, and those who dont like it can go to hollywood and see 'mall cop.'   :0",
      "created_at": "2009-01-20T08:54:19.000Z"
    },
    {
      "author": "nate",
      "body": "It just seems deeply odd to me - to be sour because the business you are patronizing is <em>busy</em>.",
      "created_at": "2009-01-20T19:46:46.000Z"
    },
    {
      "author": "dan",
      "body": "lindse65807: all movie screens have those little dots, I'm afraid. They allow sound from the speakers to pass through without vibrating the surface. You typically can't see them unless you're right up on the front row.",
      "created_at": "2009-01-21T00:39:39.000Z"
    },
    {
      "author": "cooper417",
      "body": "People complain b/c they are bleeding? I hope you made that one up & haven't actually heard that one before.",
      "created_at": "2009-01-24T01:27:35.000Z"
    },
    {
      "author": "dan",
      "body": "Indeed. Made up.",
      "created_at": "2009-01-25T01:00:29.000Z"
    },
    {
      "author": "bmozer1",
      "body": "Hey Dan,<br/><br/>We're having the exact same problem.  But, better that than trying to convince people to come in the first place....is what I'm trying to remind myself.  It's a bizarre mixture of happiness for the business' success and complete and total exhaustion.  <br/><br/>Ben",
      "created_at": "2009-01-27T03:35:23.000Z"
    },
    {
      "author": "dan",
      "body": "I hear you Ben. Gotta make hay while the sun shines... 80 hour weeks and all!",
      "created_at": "2009-01-28T01:21:19.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
