{
  "id": 595,
  "title": "The Joy of Two Screen Programming",
  "body": "Hello everyone. It's been awhile since my last post, so I thought I'd drop in and write for bit. We've only been open for two and a half months at our new location, but it feels a lot longer to me for some reason. We've finally started falling into a semi-decent routine, and all the various systems that keep the Moxie running smoothly are back on track. One thing we've been struggling with, however, is keeping people abreast of our upcoming films and showtimes without the aid of our old monthly calendar.<br/><br/>Expanding into a two screen theater has had many, MANY advantages. For instance, the length of a film's stay at the Moxie is now determined by audience numbers, instead of a set date on the calendar. This was the number one reason we needed a second screen, and it's already paid off handsomely with our eight week (and counting) run of SLUMDOG, four week run of THE READER, and three week run of LET THE RIGHT ONE IN. Our customers decide which films stay and which films go... simple as that.<br/><br/>Another perk of having a second screen is the flexibility to pick up movies from the multiplexes that were either under-played or under-marketed. We call this practice, \"second-run select.\" In the past, at our old location, if one of the big theaters dropped an art-house film after a subpar two week run, we'd have to wait until the following month to pick it up since we couldn't alter our set-in-stone print calendar. That put us at a significant disadvantage as a film's momentum and buzz are incredibly time-sensitive. Now we have the ability to pick up films within a week of their departure from the big boys (or, in the case of THE READER, the very next day). These two advantages give us the competitive edge we need to \"run with the big dogs,\" so to speak; and they're both coming into play this week.<br/><br/>We found out over the weekend that THE WRESTLER has become available after a short run at one of the multiplexes, so we immediately made the call and scheduled it to open at The Moxie this coming Friday. Everything was proceeding swimmingly until we found out that THE WRESTLER required a solid run, meaning it can't share the screen with any other film. That didn't pose a problem with I'VE LOVED YOU SO LONG, as we knew it would only be here for a week, but it did with the Oscar-nominated Short Films, which were drawing in big numbers. Now we found ourselves stuck with three popular films, and only two screens to play them on. A nice problem to have, to be sure, but it still needed solving.<br/><br/>The solution was to put the short films on ice, play THE WRESTLER by itself, and then reopen the short films immediately after The Oscars. It's a strange programming move, and one we don't plan on repeating unless absolutely necessary. Either way, we have the second screen to thank for all this added flexibility and opportunity.<br/><br/>So that's a long explanation of why the old Moxie print calendar had to fade away. We've toyed with the idea of printing a pamphlet that describes each month's films, without listing showtimes, but things change so rapidly that it's difficult to pin down what we're playing more than a week or two down the road. Fear not, there's still plenty of ways to get our most up-to-date showtimes.<br/><br/><b>Our online calendar</b> - This should be the first place you check. Always.<br/><b>Weekly newsletter</b> - Have all the upcoming week's showtimes sent to you!<br/><b>Moxie movieline</b> - 429.0800 - Moxie showtimes 24 hours a day (except when I forget to change it).<br/><b>News-Leader Weekend Section</b> - Our weekly calendar is printed in every Thursday's weekend section, which you can find free all over town.<br/><br/>So there you go! Now you have no reason for not knowing what time our movies are playing. If any of you have suggestions for additional ways we can get our showtimes out there, we'd love to hear them.<br/><br/>In other news, I have some serious heartburn.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2009-02-10T05:04:38.000Z",
  "author": "Dan",
  "comments": [],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
