{
  "id": 596,
  "title": "Breaking down",
  "body": "And I don't mean mentally (yet). The perils of buying used equipment is that it breaks down, especially equipment that gets used for 8 or 9 hours seven days a week. New equipment breaks down too, I know, but we don't have any new equipment, so I'm going to complain about our used stuff. A lot of our 35mm equipment has been breaking down recently. For instance:<br/><br/>Two weeks ago, the lamp in auditorium one went out right before we were supposed to start a show. I assumed it was a bad bulb, even though it had less than a thousand hours on it (most bulbs last two to three times that long), and switched it out. The new bulb seemed to solve the problem.<br/><br/>One week ago, the lamp went down again, forcing us to cancel another show! After further inspection with our projection tech, we found a high voltage wire that was frayed, fried, and flinging sparks all over the place. We replaced it, and now it's as good as new.<br/><br/>Then our popper went out on a busy Saturday night. Despite my earnest tinkering, we couldn't get the dumb thing running again. Then, perhaps by divine providence, it started back up. It's been working fine since the breakdown, but I know it's just waiting to break until we get really busy again. I can smell it!<br/><br/>The same night the popper pooped out, the light switch that controls the lights in the projection booth shorted out. That, however, was an easy fix.<br/><br/>We've had various other things break, and even more on the brink, but I won't mention them here for fear of people expecting catastrophe every time they visit The Moxie. Who said being a small business owner was easy?!<br/><br/>*deep breath*<br/><br/>Now that I've allowed myself to vent, let me end this post on an upbeat. The True/False Documentary Film Festival is this weekend in Columbia (my and Nic's old college stomping ground), and we'll be in attendance, as we have been every year. We're slated to see 11 documentaries over the course of three days! It's usually the only film festival Nicole and I get to attend each year, so we always try to cram in as many films as we can (a good percentage of which will show up at The Moxie throughout 2009). Here's a quick list of the films we hope to see this weekend:<br/><br/><b>Big River Man</b> - The incredible-yet-true story of a \"superhero\" endurance swimmer from Slovenia. Martin Strel aims to swim the entire Amazon River, ostensibly to raise awareness of the perils facing the rainforest. What ensues is a wine-soaked psychedelic rollercoaster a la Apocalypse Now.<br/><br/><b>Burma VJ: Reporting From a Closed Country</b> - True Life Fund selection. This spine-tingling thriller tracks a clandestine group of video activists as they use whatever means necessary to spotlight Burma's brutal military junta.<br/><br/><b>Food, Inc.</b> - The future of our food is up for grabs, and leading figures such as writer Michael Pollan and farmer Joel Salatin show us the perils and promise of what lies ahead.<br/><br/><b>Forgetting Dad</b> - Rick Minnich (Homemade Hillbilly Jam) returns to T/F with a deeply personal doc about his father, who after a car accident became \"the new Richard,\" a man with no memory of his previous life.<br/><br/><b>Loot</b> - One man obsessed with hidden treasure storms the globe seeking lost riches promised by a pair of WWII veterans.<br/><br/><b>No Impact Man, the documentary</b> - Two city dwellers go cold turkey from civilization, weaning themselves off the power grid, agribusiness and other modern conveniences, while attracting a whirlwind of publicity and an army of naysayers. <br/><br/><b>Pressure Cooker</b> - A charismatic firecracker of a teacher heats up some of the year's most entertaining scenes in this warm and thoroughly enjoyable film about a Philadelphia high school culinary arts class.<br/><br/><b>Secret Screening Blue</b> - At an Oklahoma prison, inmates put pride on the line as they compete in the nation's most famous prison rodeo. <br/><br/><b>Waltz With Bashir</b> - This animated, mind-blowing doc — one of the year's most celebrated films — is a former Israeli soldier's attempt to make sense of a massacre of Palestinian civilians, 25 years later. (OPENS THIS FRIDAY AT THE MOXIE!)<br/><br/><b>We Live in Public</b> - Ondi Timoner's splashy portrait of Josh Harris, an artist with a flair for social engineering experiments. In 1999, he spearheaded an Orwellian commune in which 100 specimens lived in a New York City basement where their lives were surveilled 24-7.<br/><br/><b>The Yes Men Fix The World</b> - The Yes Men are the culture-jamming dynamic duo of our age. Their latest adventures includes deflating Dow Chemical's stock price a few billion dollars in a matter of minutes with a well-timed apology to the people of Bhopal, India.<br/><br/>We're SUPER PUMPED! I'll make sure to report back on our favorites.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2009-02-25T09:50:35.000Z",
  "author": "Dan",
  "comments": [],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
