{
  "id": 597,
  "title": "Notes and whatnot",
  "body": "Some interesting notes:<br/><br/>1. True/False 2009 was a blast! Nicole and I saw ELEVEN films this year, and they were all spectacular. We're currently brainstorming a film series that will bring many of them down to Springfield over the course of 2009. Like our passport series, we'll give out stamps for each indie doc you see, then draw names at the end of the year for our awesome prize: passes to T/F 2010! We'll let you know more once we iron out the details.<br/><br/>2. R.I.P. Original Moxie Popper. *sniff* I'm sorry to announce that our old, beautiful, red popper has bit the dust. It was a great popper that embodied the soul and hutzpah of our operation, and it will truly be missed. We've replaced it with a new model that is designed to look like our old one. It might take a little while, but I have no doubt the new popper will find a place in our heart as well.<br/><br/>3. <a href=\"http://www.boxofficemojo.com/news/?id=2555&p=l.htm\">This February was the highest-grossing February in box office history</a>. Perhaps there's some truth to the old belief that theaters do better when the economy is down.<br/><br/>4. A few films to look forward to (coming later this month): THE CLASS, WENDY & LUCY, CHE, and TWO LOVERS. Woo hoo!<br/><br/>That's it.<br/><br/>PS - Come see WALTZ WITH BASHIR! If it's not the best, most powerful, most beautiful animated film that was nominated for a Best Foreign Film Oscar this year, I'll refund your ticket 10x over the original purchase price.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2009-03-04T08:52:33.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Girl #2",
      "body": "goodbye, old popper *sniff*<br/><br/>hello, new popper! *smooch*",
      "created_at": "2009-03-05T00:06:00.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 7,
      "name": "Lists"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
