{
  "id": 598,
  "title": "Gettin' social with The Moxie",
  "body": "Why didn't anyone tell me it had been so long since the last blog post?! Geez. You'd think that now the busy, awards season is over we'd have more time to devote to blog writing, but you'd be surprised how creative we can be when it comes to filling our spare time with non-productive tasks (e.g. sleeping). Either way, here we are.\r\n\r\n*awkward silence*\r\n\r\n*our eyes meet*\r\n\r\n*you look away, then back, then away again*\r\n\r\n*I clear my throat*\r\n\r\nUh.\r\n\r\nSo, the reason I'm writing tonight's post is to bring attention to The Moxie's various social networking groups. We've had these set up for quite awhile, but we've never taken the time to write about them on the blog, which is what I'm doing tonight. Let's dive right in, shall we:\r\n\r\n<a href=\"http://twitter.com/moxie_cinema\">Moxie's Twitter Page</a> - I love twitter, and now The Moxie does too! Not everyone is on the twitter bandwagon quite yet, but if you are, check out our page. It's just now starting to take off, but we'll be adding more Twitter-only discounts and surprises down the road.\r\n\r\n<a href=\"http://www.new.facebook.com/pages/Springfield-MO/Moxie-Cinema/18988261890\">Moxie's Facebook Page</a> - If you're on Facebook, hopefully you've already found our new fan page. The Moxie used to have a regular FB page, but then they (Facebook) decided to not let businesses have regular pages, so we had to start over with a fan page. Now you can show your support for Le Ol' Mox on Facebook!\r\n\r\n<a href=\"http://www.yelp.com/biz/moxie-cinema-springfield\">Yelp!</a> - A lot of people haven't heard of Yelp!, which is a shame because it's AWESOME! It's basically a giant, well-designed database of user reviews for local businesses, services, etc.. I find myself on there all the time, just browsing new business reviews in Springfield. It's great! So, if you'd like to leave a review for The Moxie, that would be swell.\r\n\r\n<a href=\"http://www.myspace.com/moxiecinema\">MySpace</a> - To tell you the truth, we really don't use MySpace anymore. We log on periodically (every two months or so) to approve new friends and delete spam, but other than that... It pretty much fell to the wayside once Facebook opened up to businesses.\r\n\r\nAnd that's about as far as our social networking goes. If you have no idea what any of this \"social mumbo jumbo\" is, fear not: as long as you sign up to our weekly e-mail, or check our website from time to time, you're not missing anything. Connecting with The Moxie on the above websites is just another way you can show your support; and like any honest small business owner will tell you, we need all the support we can get.\r\n\r\n*awkward silence*\r\n\r\n*I throw water in your face and bolt out the door*\r\n\r\nSO LONG SUCKERS!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2009-03-22T06:03:41.000Z",
  "author": "Dan",
  "comments": [],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 11,
      "name": "Techish talk"
    }
  ]
}
