{
  "id": 6,
  "title": "Where do you get films?",
  "body": "The first and most common question about starting a theater is, \"where do you get the films?\" It's a good question too, because I didn't know the answer back in March... and anything I don't know is considered a good question. I'm not sure where I thought films came from when I was a projectionist. All I knew was that they arrived in big, orange, hexagon-shaped, metal containers, but beyond that I was in the dark.\r\n\r\nMy first inkling about how I'd get a film was to contact the studio that made the it, but who would I need to speak to, and in what department? As it turns out, I was pretty close to being right. To show a film in a theater, you need to contact the distribution company that distributes the film, negotiate an exhibition contract, and have the print shipped to your location. Of course, if the process of getting films were actually this simple, there would be no need for booking agents, which is a person whose sole purpose is to contact distribution companies to secure prints for your theater.\r\n\r\nOnce our theater opens, we'll be working with a booking agent named Paul for at least the first year or two, upon which time Nicole will take over all the booking. Paul has been booking films for <a href=\"http://www.ragtagfilm.com\" target=\"_blank\">Ragtag Cinemacafe</a> for over 6 years, and knows quite a bit about the fine art of booking. Negotiating with distribution companies is a subtle give and take dichotomy wherein the theater is always bargaining for films that have the highest potential of being financially viable. Sometimes, in order to get a good film that has the potential of bringing in a large audience, you have to settle for a smaller film that probably won't do as good. That way, the distributing company can leverage the hard-sell films against their big money makers and get the best of both worlds.\r\n\r\nAfter you've negotiated which films you'd like from the distributor, you'll need to settle on a pre-arranged engagement period. The majority of films have an average engagement of about 2 weeks, but that time period can be lengthened if the film does spectacularly well (a.k.a. \"has legs\") or shortened if it does phenomenally bad (a.k.a. \"sucks ass\"). Once the appropriate arrangements have been made, the print is shipped to your theater... don't forget, the theater owner is responsible for all shipping costs, which can get pretty high when you're dealing with two 70 pound film canisters. Now that the print is somewhere between the distribution company and your theater, you have to watch it like a hawk, because, believe it or not, a lot of films distributors do a terrible job when it comes to assuring that their product makes it to your theater. Therefore, it's the job of the booking agent to continually call and \"track\" the print, which can mean gently reminding the distributors to send the print, tracking the actual package, and making sure the prints arrive in time for their scheduled showing.\r\n\r\nOnce the print arrives at the theater, all is well... until you start putting it together and find that the last projectionist did a terrible job taking the print apart... but that is a topic for another post.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-05-31T19:16:15.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "xander",
      "body": "Hi, \r\n\r\nThere are also some alternatives to getting films from distributors. \r\n\r\nFor instance getting work from film-maker's directly. By which I mean, with smaller, artistic or very low-budget and experimental work, you'll often find the person who ships the film out is indeed the film-maker.\r\n\r\nNow, course, this isn't gonna be your bread and butter, but its that kind of content that could make your cinema special. Cos' often you might persuade the film-makers to come along too and talk to the audience, which is always great.\r\n\r\nOf the top of my head I'm thinking about Craig Baldwin in San Francisco and Bill Morrison in New York... but of course there are tons more if you search out for the good stuff...\r\n\r\nSlightly differently you can also deal with Sales Agents for films that have yet to be released, this will usually be for one-off screenings - Special Events and festivals, and these people can sometimes charge a lot more money, because the product is exclusive. On the other hand they may just give it to you for free. If you persuade them that its great advance promotion for their product.",
      "created_at": "2004-06-14T13:13:43.000Z"
    },
    {
      "author": "Movie Brokers",
      "body": "Is there a web site or other resource to locate movie brokers?\r\n\r\nThanks,\r\n\r\nMorris\r\n",
      "created_at": "2006-05-22T17:52:41.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
