{
  "id": 60,
  "title": "Hey look, part 2",
  "body": "Thanks to <a href=\"http://whittycism.blogspot.com\" target=\"_blank\">Whitty</a> for bringing these articles to my attention. Is it a good thing? Is it a bad thing? According to the article, Andrew thinks it's a good thing... of course, he could've been misquoted or something. I e-mailed Andrew and Doug this morning to get their take on it, but I haven't heard back from them yet.\r\n\r\n*** Note: I just went to check my inbox and noticed that the e-mail I had intended to send to Andrew and Doug is still sitting in my drafts folder. Damn it! ***\r\n\r\nHopefully I hear back from them soon. In the meantime, take a gander at the article and tell me what you think.\r\n\r\n- - - - - - - - - -\r\n\r\n<b>Multiscreen movie theater, stores proposed for downtown complex</b>\r\nBy Jenny Fillmer\r\n<a href=\"http://www.news-leader.com\" target=\"_blank\">Springfield News-Leader</a>, September 8, 2004\r\n\r\n<i>City pledges to build a $5 million parking deck to accompany stores.</i>\r\n\r\nFor the first time in decades, Springfield movie lovers can look forward to catching first-run flicks in a downtown theater.\r\n\r\nDeveloper Scott Tillman and architect Tim Rosenbury unveiled plans Tuesday for a multiscreen first-run movie theater, built within a two-block retail, entertainment and parking complex just west of Park Central Square along College Street. The announcement came during the Springfield City Council's weekly luncheon meeting.\r\n\r\nTillman's $12 million proposal, dubbed College Station, is backed by the city's pledge to build a $5 million, three-story, 450-space parking deck directly above 43,000 square feet of first-floor retail space. Plans call for a second-story skywalk connecting the parking garage to the theater. Combined with plans for retail, restaurant and theater development, College Station could bring 160,000 square feet of new commercial space to downtown.\r\n\r\n\"You've got a city block downtown that's just a blank canvas,\" said Tillman, referring to the unkempt parking lots and abandoned roadways currently on the site. \"I thought, if we're going to do something, let's do something spectacular and draw people down here.\"\r\n\r\nRetail was not the city's original plan for redeveloping the land it owns between Campbell and Market avenues and McDaniel and Olive streets.\r\n\r\nA 2002 downtown redevelopment study, commissioned by the city, called for at least 300 new living units. In April 2003, the council opened bids for a new housing development on the land, and three bids were accepted ... including one from Tillman.\r\n\r\n\"One proposal was for condos, one for lofts, and one was for more retail,\" said City Manager Tom Finnie. \"... All three wanted the city to build a parking deck.\"\r\n\r\nFinnie said the city carefully considered each proposal, and considered combining them all into a single project.\r\n\r\nNow, more than a year after bids were accepted, two things have changed, Finnie said.\r\n\r\nOne is that the land in question has been appraised for retail.\r\n\r\n\"If it's appraised for housing, it's one value ... if it's appraised for retail, it's a higher value,\" said Finnie.\r\n\r\nFunds for building the parking deck would be generated by the sale of the land in the development and by other revenue generated on the property, Finnie said.\r\n\r\n\"We were having a real hard time making the housing (option) come up with the revenue to build the parking deck,\" said Finnie. \"We talked to all three developers about that problem then Scott (Tillman) came up with the idea of all retail.\"\r\n\r\nPending council approval, Tillman will purchase the block north of College Street for about $450,000 ... all of which will go toward funding the parking deck. Additional funds will be generated by special sales taxes applicable only in the development.\r\n\r\nWhen the parking deck is complete, the city will also sell retail space on the first floor to Tillman.\r\n\r\nThe second mitigating factor was the recent boom in residential develop\r\nment downtown.\r\n\r\nThe Urban Districts Alliance, a downtown redevelopment organization, reports that 200 new residential units will be started on or completed this year ... a huge increase over the 60 living units completed during the previous two years.\r\n\r\nFinnie said the housing boom was unforeseen when the city opened bidding on the project, and that new retail space is now downtown's greatest need.\r\n\r\n\"You never know for sure what the market is going to support,\" Finnie said. \"I thought retail was still a couple of years off, but we've had some very successful stores that have opened this year, and more to come.\"\r\n\r\nCollege Station will provide retail space as small as 1,500 square feet.\r\n\r\n\"Typically, most of the buildings downtown are larger,\" said Tillman. \"The goal is ... to target smaller business owners that want to come downtown.\"\r\n\r\nFinnie said College Station will also fill another void in the downtown market: movie screens.\r\n\r\n\"Clearly, one of the attractions to this plan is we are under-screened in Springfield,\" said Finnie, \"Currently, there are no movie theaters on the north side or center city ... That is a real anchor for this development.\"\r\n\r\nTillman's contract with the city calls for a first-run movie theater with at least six screens, but Rosenbury's initial designs show 10 screens.\r\n\r\nTillman is not the only one interested in bringing movies downtown.\r\n\r\nAndrew [last name omitted by Dan], a downtown property owner, is working with his wife, Ellen, and partner Doug [last name omitted by Dan] to develop their building at 425 W. Walnut St. into a theater for art and independent films.\r\n\r\nHe welcomed Tuesday's announcement.\r\n\r\n\"We would look forward to any sort of new development in that area,\" said [Andrew]. \"That would only help the whole downtown.\"\r\n\r\nThe businesses would help, rather than compete, with each other.\r\n\r\n\"I would only see more foot traffic on that side of downtown,\" he said of the new complex. \"It should help with whatever goes into our theater there.\"\r\n\r\nTillman said more than one theater company has expressed interest in his project.\r\n\r\n\"There seems to be common knowledge from theater owners that we're under-screened,\" he said.\r\n\r\nCouncil members were especially receptive to the movie theater proposal.\r\n\r\n\"Those of us on the north side really miss our theaters,\" said Mayor Tom Carlson, who lives in Midtown. \"We like to go see movies, too.\"\r\n\r\nThe council had a sneak preview of conceptual drawings and blueprints. Rosenbury said the architecture style reflects downtown's century-old brick storefronts, with a large inner courtyard lined by modern buildings.\r\n\r\n\"The perimeter of the development will relate to the character of downtown,\" said Rosenbury. \"But in the center, we wanted to have a different character ... where it's all bright and new and shiny.\"\r\n\r\nPlans for the three-story theater complex also call for a \"destination\" restaurant and retail space.\r\n\r\nRosenbury told the council the building could eventually include residential space.\r\n\r\n\"The building structure could be planned in such a way that it could be expanded upward,\" he said.\r\n\r\nRosenbury's blueprints show a 10-story residential tower on the development's north side, built on top of the theater. The conceptual drawings do not include the tower.\r\n\r\n\"The idea is to leave the options open,\" said Rosenbury. \"This isn't being contemplated for the very beginning of the project.\"\r\n\r\nThe other two developers who had submitted residential development plans last year said they understood the city's change in heart.\r\n\r\n\"We wanted to do some townhouses ... something architecturally unique down there,\" said Jeff Wells, whose former company, Pellham Phillips Hagerman, spent thousands putting together a bid. Wells said the company had not been interested in developing retail on the property.\r\n\r\nMatthew Miller, who submitted a bid through Recess Properties, said it simply didn't work out. \"When you've got a publ\r\nic-private partnership, you've got to be able to have it work for all sides,\" said Miller. \"This piece of property wasn't working for all.\"\r\n\r\n<i>News-Leader reporter Sony Hocklander contributed to this story.</i>",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-09-08T19:24:51.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "whitty",
      "body": "you should see if the city will \"pledge\" $5 million to you.\r\n\r\nI think, if it happens, it will be a good thing.  If people start thinking of downtown as more than a place to get drunk and eat it can only help.  It would great for me, as I live in Midtown and hate having to slog down to the southside to see a movie.\r\n\r\nAnd I don't think it would take away from your audience.  You will be offering a different product.",
      "created_at": "2004-09-08T20:27:30.000Z"
    },
    {
      "author": "bjork24",
      "body": "Whit, I hope you're right. Of course, this new development makes our project exponetially more risky and difficult to finance.",
      "created_at": "2004-09-08T20:30:51.000Z"
    },
    {
      "author": "whitty",
      "body": "However, they better not mess with the Calaboose.  It is one of the oldest buildings in town and you has a police museum inside.  You can see Bonnie and Clyde's tommy gun and the noose, shackles and hood from the last public hanging in Springfield.  Creepy.  I loves me the Calaboose.",
      "created_at": "2004-09-08T20:31:14.000Z"
    },
    {
      "author": "Einahpets",
      "body": "Well, take Toledo for example. We have one of those large theaters with everything from soft pretzles to ice cream. They charge $9.25 for a ticket and no discounts of any kind. It's always busy, but then there are a lot of people who keep the small theaters open too. Ann Arbor has two theater houses right next to each other. I think if you have a different type of movie than new releases, you'll be fine. Plus, it'll attract more people to walk downtown and run into The Moxie.",
      "created_at": "2004-09-08T20:37:18.000Z"
    },
    {
      "author": "bjork24",
      "body": "I just can't believe how close they're planning on putting this development. We'd basically be right outside of their parking lot.",
      "created_at": "2004-09-08T20:41:56.000Z"
    },
    {
      "author": "whity",
      "body": "try to think of it as YOUR parking lot!  Your $5 million parking lot!",
      "created_at": "2004-09-08T20:49:45.000Z"
    },
    {
      "author": "bjork24",
      "body": "Good point, Whit.",
      "created_at": "2004-09-08T20:52:35.000Z"
    },
    {
      "author": "Oz",
      "body": "I think you'll be okay.  Your theater will draw arthouse theater people to it.  Having the big multiplex there probably won't affect you TOO much.  You probably will lose some of the customers just wandering by, but most of your business will probably be based on people who specifically want to see independent film.  I have lots of friends who wouldn't set foot in a multiplex.  Those are your people.",
      "created_at": "2004-09-08T21:12:13.000Z"
    },
    {
      "author": "Aaron",
      "body": "Yeah, but that five meeelion dollar parking garage is going to be right across the street from my apartment. I can see trees now! I grew up on a farm! I only ask this much! Trees! Goddamned trees! As for the googolplex that would be across the corner, I don't know. I've had to go to the 16 twice in as many days for movies, and it made me sick. But where else will I go for fun hip movies? The Moxie, that's where! Moxie! Moxie!\r\n\r\nAlso, consider this: anytime they mention the googolplex development in the future, they'll probably plug the Moxie development, too. That's how MOrawk is getting more media coverage, because everytime they mention local music collectively, it's bound to be mentioned. Weehoo!",
      "created_at": "2004-09-09T02:28:01.000Z"
    },
    {
      "author": "elspeth",
      "body": "I reckon it will be fine. If you get the funding and can make a go of it I think the two cinemas will benefit from each other, as long as the yuckoplex keeps itself neat and tidy. But I'd go to YOUR cinema anyday....well I would if I didn't live thousands of miles away. \r\nNever fear young Dan.",
      "created_at": "2004-09-09T07:48:13.000Z"
    },
    {
      "author": "Sandra",
      "body": "paved paradise....\r\n\r\nLet's face it. Indie people like to see main stream movies too. Many of my patrons go to the, dare I say it, MALL to see things we don't carry.  Your product will be different and unique. However, you might compete with them at times when it comes to booking films like F9/11 or SuperSize Me. Hence the importance of a booking agent who has good relationships with distributors and will fight for you.\r\n\r\nI imagine that your customer service and film knowledge will be superior to theirs. And you and Nicole seem like friendly people -- get to know them and see how you can work together so that more people come to both places.\r\n\r\nAnd take advantage of the parking ;-)",
      "created_at": "2004-09-09T22:52:22.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks for all the support guys! I was going to make a nice little flash movie for today's (9.9.04) post, but I ran out of steam... and I'm sweaty. I'm going to go make tacos.",
      "created_at": "2004-09-10T02:57:24.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 15,
      "name": "Press"
    }
  ]
}
