{
  "id": 600,
  "title": "AT&T is awesome. NOT!",
  "body": "What did people do before the internet? I was 13 when my family first subscribed to AOL and I've been online ever since, so for me, at least, my pre-internet days were spent playing with Star Wars figurines and lincoln logs. Now the majority of my day is spent online: I work online, play online, store stuff online, eat online, sleep online, etc.. Needless to say, I'm an internet fiend, and I'll do anything to get my fix, which is why I'm currently writing this from my car so I can use the free downtown wifi.\r\n\r\nWhy don't we have internet at The Moxie, you might be wondering? Well, before I lay it out for you, let me give some backstory.\r\n\r\nThe Moxie used to have Mediacom cable internet, dating all the way back to August 2005, but after suffering through three and a half years of flaky connectivity, overpriced packages, awful customer support, and a downstream that usually topped out around 50% of the advertised rate, I decided it was time for a change. I'd had residential DSL in the past, and been mostly pleased with the service and low-cost packages, so I made the call to AT&T to get DSL dry-loop (that means you don't need a landline) installed at the theater.\r\n\r\nOnce the switch was finally made, we couldn't have been happier. The DSL was more stable than the cable internet, the speeds were faster, and the package cost half of what we were paying through Mediacom. It was a win-win situation all around. Then, on Tuesday night, our internet shut off. Completely.\r\n\r\nHere's what happened next:\r\n\r\nI call AT&T to tell them my internet is down, and they run me through the basic \"are all the lights on your modem on\" script. After we determine that everything is working properly, they dig deeper and see that our account has been suspended due to non-payment. That's interesting, I thought, since we've never seen a bill since the installation.\r\n\r\nThe first department transferred me over to the billing department and I explained what was going on. After some digging, they discovered that AT&T had the wrong billing address in their system, which explained why we hadn't seen any bills. They apologized, removed all the late fees, and turned our internet back on. I wish that's where the story ends... but it goes on.\r\n\r\nI come into the Moxie today to get some work done, only to find that the internet has been disconnected again. I call AT&T again to find out what the problem is, and they tell me that our service has been physically disconnected. Apparently, when they suspend your account for non-payment, they also make an order to have your phone line physically disconnected from the main switch. When I called in on Wednesday, the person who so politely helped us get back online neglected to cancel the disconnect order.\r\n\r\nAfter apologizing (they did a lot of that), they explained that to get our internet turned back on, we'd have to start over from scratch, create a whole new account, and then wait to have a service tech come hook us back up NEXT THURSDAY! I calmly explained to them that we are a business that's open seven days a week, and our credit card servers, VOIP voicemail, fax, etc. all require a working internet connection. Further more, this entire problem was 100% AT&T'S FAULT, so the least they could do is send someone here TODAY and hook our internet back up.\r\n\r\nMakes sense to me.\r\n\r\nI'd been on the phone for roughly 45 minutes at this point, and spoken to at least eight different people, which is why I became slightly enraged when they accidentally hung up on me during a transfer. I called back and managed to get put back in touch with the department, but not the same person, I had originally been speaking to, which meant I had to explain the whole story over again. After more apologizing and transferring, we finally had a new account set back up. The overly-polite woman then said, \"we'll have you scheduled for install at the first available date, which is this Thursday between 8am and 8pm.\"\r\n\r\n\"Look,\" I said to her, trying to remain calm. \"I really need to escalate this issue so we can get our internet turned back on today. This entire problem is AT&T's fault, and my business needs internet, so surely you can understand.\"\r\n\r\n\"I do understand Mr. Chilton, but we typically don't expedite service calls for non-payments.\"\r\n\r\n\"But that's the thing! This isn't a non-payment! We never even received a bill because you didn't have the correct address.\"\r\n\r\nI have to stop the dialog here, because 1) it went on for a long while, and 2) it's making me angry typing it out.\r\n\r\nIn the end, AT&T claimed full responsibility, told me they'd put an \"expedite note\" on our service call, and said I'd be receiving a call from the scheduling office within the next two to four hours. I love how specific they are with their callback and service times. I got a call three hours later and was told that the earliest date they could come out was Monday... between 8am and 8pm. I told the lady the entire story and pleaded with her to get someone out her sooner, but she said she couldn't.\r\n\r\n\"Well, ok. Just schedule it then.\" (this is me talking) \"I'll call the local AT&T office and see if I can work my way up the chain until I get someone to come out here for five minutes and set us back up.\"\r\n\r\n\"You can try, but it's impossible. The technicians get off at 4pm, so no one will be around.\"\r\n\r\n\"Well, we'll see about that. Go ahead and put it in for Monday.\"\r\n\r\nI then called the main AT&T hub on St. Louis street, hoping to get ahold of the guy who originally installed our DSL - he was this awesome dude who was super friendly and helpful, and knew all the little secrets that regular customers weren't supposed to know. Unfortunately no one picked up. I tried calling the other hubs in Springfield, but again, no answer.\r\n\r\nSo here I am. Sitting in my car, leaching free internet. I can easily say this is the most frustrated I've been in a very, very, very long time. Thank god it's baseball season and I have a working radio, otherwise I don't know what I'd do to occupy my time this weekend.\r\n\r\nMaybe I'll go break out my old Star Wars toys and lincoln logs.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2009-04-11T01:30:15.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "lara jane",
      "body": "We had a sort of similar experience with AT&T when we cancelled our \"regular\" DSL and switched to dry-loop. It took 11 days (8 of those were business days) to get it hooked up, mainly because the original dry-loop order was never processed -- twice. I think we had 3 different phone calls because they just didn't have their act together. Meanwhile, they had cancelled our regular DSL right when we played the dry-loop order, so we were without any kind of connection all that time. (You would think they would try to work it out so you don't have any kind of outage, but apparently not!) For people that \"live on the internet\" as you do, it was supremely frustrating! I can't imagine how it must be for a business -- whose internet connection is a necessity, not a luxury -- to be without that service.\r\n\r\nOn the other hand... How long from the time of installation until they shut it off? If it was a month or more, and you <em>should've</em> seen a bill by that point, I can't say that AT&T would be at fault. Bills are something that are your responsibility, particularly as a business manager, and it seems like something (the lack of a bill, when sitting down to pay said bill) that would've caught your attention. \r\n\r\nAnyway, it's a pain, dealing with things like this and feeling like you're getting nowhere. Hopefully they'll get there Monday! \r\n\r\nHave a great weekend. :)",
      "created_at": "2009-04-11T23:32:06.000Z"
    },
    {
      "author": "nate",
      "body": "I have deep-running animosity towards large telecommunications companies, Mediacom and AT&T being at the top of that list.",
      "created_at": "2009-04-13T19:31:07.000Z"
    },
    {
      "author": "nicole",
      "body": "<blockquote><cite>Posted By: lara jane</cite>On the other hand... How long from the time of installation until they shut it off? If it was a month or more, and you<em>should've</em>seen a bill by that point, I can't say that AT&T would be at fault. Bills are something that are your responsibility, particularly as a business manager, and it seems like something (the lack of a bill, when sitting down to pay said bill) that would've caught your attention.</blockquote>\r\n\r\nIt had only been two months, and in the meantime I was paying the last month's bill from Mediacom, so looking for AT&T's bill was not on my radar. I was discussing this with a friend who does billing, and we both agree that the company should be responsible for letting their clients know of late payments. They had our phone number, too, so they could have called. Every month I write about 100 checks for different bills. With that quantity, it's easier to have a written or emailed reminder from the company rather than relying on my memory (which is actually very good!). \r\n\r\nAnd I don't like automatic billing, because that keeps me out of sync with our day-to-day finances. I have a very specific filing system in place for bill paying, and it's worked for me for over three years with no late payments or missed bills!\r\n\r\nSo, there's your daily look into Nicole's administrative side. Next week: online social networking sites and their marketing potential!",
      "created_at": "2009-04-13T21:54:10.000Z"
    },
    {
      "author": "Girl #2",
      "body": "<blockquote><cite>Posted By: nicole</cite>I was discussing this with a friend who does billing, and we both agree that the company should be responsible for letting their clients know of late payments. They had our phone number, too, so they could have called</blockquote>\r\n\r\nagreed. very much agreed. You shouldn't have to hunt down your bill. It is their responsibility to inform you what you are being charged.",
      "created_at": "2009-04-18T03:38:19.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
