{
  "id": 601,
  "title": "Happy Earth Day",
  "body": "Happy Earth Day to everyone out there in Moxieland! We've been asked by a few people if we're doing anything special to mark the occasion, but for us, every day is Earth Day! We've always been proud of our recycling efforts, which have been in place since we opened way back in September 2005, and, now that we've moved into a larger space, we've taken every step to conserve energy where ever possible. It's just one more reason why we're the coolest movie theater in Springfield.<br/><br/>Now, if I can take a quick break from the self-congratulating, I'd like to point out a couple big things that are going on this weekend.<br/><br/>First, in case you missed it in last week's newsletter, we just kicked off our 2009 Independent Documentary Film Series last Friday. We'll be showcasing TEN amazing independent documentaries that have screened at Sundance, SXSW, and (our personal favorite) the True/False Documentary Film Festival in Columbia, MO. For each of the ten films you see in the series, you'll receive a stamp on our special Indie Doc Stamp Book, which you'll then turn in at the end of the year for your chance to win passes to the 2010 True/False Film Festival. The series kicked off last Friday with <a href=\"http://www.moxiecinema.com/films/388\" class=\"broken\">AUDIENCE OF ONE</a>, so make sure you catch the premiere film before it ends tomorrow and pick up your official stamp book!<br/><br/>Secondly, you may have noticed a lot of people running around with cameras this past weekend thanks to the fourth annual SATO 48 Hour Film Challenge. Nearly 70 teams competed this year, with 60 of them actually turning in a film for screening at The Moxie. So, if you're in the mood for some awesome short films, you'll be able to catch them all this weekend at the theater. We'll be posting the official line-up later this evening on our website, as well as sending it out in our newsletter. We always have a blast with SATO 48, and can't wait to see what our talented local filmmakers came up with this year.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2009-04-23T02:21:09.000Z",
  "author": "Dan",
  "comments": [],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
