{
  "id": 602,
  "title": "The Mommy Matinee",
  "body": "Earlier this week we announced that we will be starting a series called The Mommy Matinee. We're very excited, because this is a concept that's been floating around The Moxie Mind for quite some time. We've seen it done in other larger markets, but nowhere in Springfield! So what are we here for if not to bring a unique movie-going experience to our favorite city?\r\n\r\nMommy Matinees are a way for Moms, Dads, Grandparents, anyone really with a small child, to enjoy an independent, adult film (not Hannah Montana) without having to leave their baby at home, or worry about bringing their baby and disrupting other audience members. Everyone in attendance is fully aware that there may be a crying baby in their midst. But in case a Mom or Dad does get frazzled at that, we'll have the other auditorium open as a crying station, a discreet nursing area, even a place to change a diaper (but please...don't hide it under the chair!).\r\n\r\nNow, as a head's up, a Mommy Matinee is NOT necessarily a kid friendly movie. You probably won't want to bring your seven year old to an R-rated film (they'd probably be bored anyways). This is a movie that *you* as an adult would like to watch, but may not have time or extra money for a babysitter. So obviously, it works best for those who have toddlers and younger. \r\n\r\nWe're hoping this becomes a huge success, and that we can do it on a monthly basis. Our first film to test this out is SUNSHINE CLEANING, starring Amy Adams and Emily Blunt. The show is at 2:00pm on Wednesday, May 13th. Tickets will be $6 for everyone over five (we may just put your newborn to work behind the counter to make up for their free ticket)! And of course, you don't have to have a baby with you to see the movie, but please be aware that there will be babies in attendance!\r\n\r\nIf, however, you are looking for a family-friendly film for your young'uns, we're always keeping our eyes open for them. But unfortunately in the independent film world, they're few and far between. So definitely send some suggestions over if you have any!",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2009-05-02T05:03:45.000Z",
  "author": "Nicole",
  "comments": [],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
