{
  "id": 603,
  "title": "Looking Through The Independent Lens",
  "body": "<a href=\"http://www.pbs.org/independentlens/index.html\">Independent Lens on PBS</a> is possibly one of the best programs on TV right now. I mean, take a look at some of the documentaries they've aired over the past couple years:\r\n\r\n<a href=\"http://www.moxiecinema.com/films/381\" class=\"broken\">STRANDED</a>\r\n<a href=\"http://www.moxiecinema.com/films/245\" class=\"broken\">HELVETICA</a>\r\n<a href=\"http://www.moxiecinema.com/films/300\" class=\"broken\">CHICAGO 10</a>\r\n<a href=\"http://www.moxiecinema.com/films/130\" class=\"broken\">CAN MR. SMITH GET TO WASHINGTON ANYMORE?</a>\r\n<a href=\"http://www.moxiecinema.com/films/18\" class=\"broken\">ENRON: THE SMARTEST GUYS IN THE ROOM</a>\r\n<a href=\"http://www.moxiecinema.com/films/257\" class=\"broken\">NEW YEAR BABY</a>\r\n<a href=\"http://www.moxiecinema.com/films/31\" class=\"broken\">THE WILD PARROTS OF TELEGRAPH HILL</a>\r\n<a href=\"http://www.moxiecinema.com/films/115\" class=\"broken\">WORDPLAY</a>\r\n\r\nDo those look familiar? Hopefully you caught them all the first time at our little theater!\r\n\r\nWe have a special place in our heart for Independent Lens, so when they included us on their interactive <a href=\"http://www.pbs.org/independentlens/yourlens/arthousetheaters/\">Art-House Theater Map</a>, we were gushing with pride! And then we read <a href=\"http://www.pbs.org/independentlens/insideindies/infocus/arthouse/index.html\"> the accompanying article</a>, and I have to honestly say, it hit home so hard that I was a wee bit emotional by the end. So much so, I thought I'd write a blog post!\r\n\r\nThe article is about the current state of the Art House, and its struggle during the Multiplex age. It touches on how independent films have such a little marketing budget, that it's hard for small theaters like us to convince audiences to come. And when there are those bigger cross-over hits, like last year's SLUMDOG MILLIONAIRE, MILK, and REVOLUTIONARY ROAD, the multiplexes almost always get the first shot, while art-houses have to wait until the film enters its second-run phase.\r\n\r\nThis past winter we were SO fortunate at The Moxie! We had multiple award-winning hits, which helped make our new move smooth and stress free. We saw over 7000 NEW faces between December and February! But since those bigger budget films have left our auditoriums, we haven't seen even a fraction of those faces back for seconds. In fact, since mid-February, we went from having roughly 400 people per day to roughly 400 per MONTH.\r\n\r\nWe're not alone. Our friends who run theaters across the country have been lamenting the same thing. We're all actually quite worried. If we continue at this rate, we won't be around by this winter's award season. It's a devastating realization, especially when we've put so much hard work into our business and into the community to help showcase the best in independent film and documentaries.\r\n\r\nRuss Collins, owner of The Michigan Theater in Ann Arbor, says in the article, that “communities everywhere need to acknowledge and support local, community-based, mission-driven movie theaters as cultural resources, along the lines of regional playhouses, museums and libraries.”\r\n\r\nI'd like to think that The New Yorker was talking about us when they commented on Independent Lens, saying watching is “like is going into an independent bookstore – you don't always find what you're looking for, but you often find something you didn't even know you wanted.”\r\n\r\nSo do yourself a favor this Spring, and check out one of our many great films, documentaries, and local selections. It might not be that glossy action-packed sci-fi movie, but it'll definitely stay with you much longer!",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2009-05-19T04:22:46.000Z",
  "author": "Nicole",
  "comments": [],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 12,
      "name": "Thoughts"
    }
  ]
}
