{
  "id": 604,
  "title": "The 3/50 Project and why it's GENIUS",
  "body": "An exciting new campaign is hitting the <a href=\"http://twitter.com/moxie_cinema\">Twitter</a> feed, and I like it. It's called <a href=\"http://the350project.net/home.html\">The 3/50 Project</a>, and it's encouraging community members to spend $50 a month at local, independently owned, brick and mortar organizations. They prompt you by saying, \"What three independently owned businesses would you miss if they disappeared?\"<br/><br/>I know for sure that on a daily basis I miss our neighbor Carla at Pastiche. My credit card is probably thanking me, but with her unique boutique gone, I seriously felt like a bit of Springfield's pizazz left as well. And since her closure, my personal mission has been to shop, dine, and entertain as locally as possible. This has extended into a business mission as well. Our pest control, baked goods and treats, coffee, projection technician, cleaning services, and advertisers are all locally owned and operated. \"Be vocal, shop local\" is what Carla had in her window during Pastiche's final days. I loved it! And I love this new campaign, too, so I couldn't wait to share.<br/><br/>What three businesses would you miss? According to The 3/50 Project, \"if half the employed population spent $50 each month in locally owned independent businesses, it would generate $42.6 billion in revenue,\" and that \"for every $100 spent locally, $68 returns to the community through taxes, payroll, and other expenditures.\" This compares to the $43 retention from national chains, and ZERO from online spending.<br/><br/>This blog post isn't going to be a pity party for The Moxie, asking you all to think what would happen if your favorite art-house theater were to disappear (ahem...but since I said it...). I'm just wanting to constantly remind our wonderful patrons and blog readers how important it is to shop locally! To really drive home where the money goes locally, I'll use our staff members as examples. When business gets slow, like in the Spring, we have to cut payroll significantly, so our staff members only get about half of what they receive per pay period than what they do during good business. That's a big cut for their rent checks, dining, wining, etc! And trust me, all of us at The Moxie LOVE to eat and drink. So when we have to cut back on their paychecks, they have to cut back on their spending. No fun.<br/><br/>Now, we once posted a post a long time ago about the importance of local shopping, and someone anonymously commented that it was interesting seeing us at a local big box store. Well, of course I'm going to get Fruity Pebbles at a chain grocery store! And I'll probably pick up socks and magazines there too...but when it comes to the items that *really* matter, I'll check my local retailers first.<br/><br/>So, after much deliberation, I think these are the three places that I absolutely, could not live without in Springfield:<br/><br/>+ <b><a href=\"http://www.wellfedhead.com/\" class=\"broken\">Well Fed Head</a></b> - their departure from downtown was bad enough, but I do love their new space, and look forward to my monthly book club evening with Beth and the gang<br/><br/>+ The Center City Coffee Shops - Obviously I can't pick just one. I probably spend $50 per month EACH at <b><a href=\"http://www.mudhousecoffee.com/\">The Mudhouse</a></b>, <b><a href=\"http://www.thecoffeeethic.com/\">Coffee Ethicx</a></b>, and <b><a href=\"http://www.bigmommascoffee.com/\">Big Mommas</a></b>! And I just discovered Turkish Coffee at The Rendezvous, so we'll be adding them to the list of stops. I think my local coffee shops are the epitome of a \"neighborhood.\" I know the owners and baristas by name, they know my drink when I walk in, and it's such a fun way to spend 15 minutes of the day, walking down to my favorite coffee shops, saying hello, and putting a few quarters in the \"thanks a latte\" jar!<br/><br/>+ <b><a href=\"http://maps.google.com/maps?oe=utf-8&client=firefox-a&ie=UTF-8&q=springfield+massage+therapy&near=Springfield,+MO&fb=1&split=1&gl=us&view=text&latlng=10070924389322766338&dtab=3&oi=md_references&sa=X&ei=zawhSqizHIneNYiGmaoJ\">Pam Nickel at Springfield Massage Therapy</a></b> - oh my goodness, if you need the most relaxing hour of your life, please do yourself a favor and visit Pam. My last session with her ended up with me snoring! I think that's probably a compliment to any massage therapist.<br/><br/>Just because I mentioned those three doesn't mean I wouldn't die a little if any of my other local favorites were to disappear (I'll be happy to tell you in real life, too, if you're curious!). The list would probably take days to compile, and would include pretty much every restaurant and shop in town! As a favor to us, though, next time you see a movie, make note of our local advertisers, and do your best to put them in your businesses and organizations to support!<br/><br/>Springfield has SO MUCH to offer, that I hope we can all keep each other afloat, especially during this rough economic downturn (ugh, aren't you getting sick of that phrase?). Thanks for reading!<br/>",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2009-05-31T01:49:28.000Z",
  "author": "Nicole",
  "comments": [
    {
      "author": "The Four Finger Soc Em",
      "body": "Dan and Nicole are so alike. Their blog posts are totally starting to sound the same. (lame joke)<br/><br/>I did really enjoy this post, though. Good stuff, Nicole.<br/><br/>I think a lotta people would be sad if <a href=\"http://www.mamajeansmarket.net/\">Mama Jean's</a> left, too. I know I would. 'Cause a lot of my friends would be jobless. And I wouldn't be able to buy those tortilla chips with the cartoon bear on the bag.",
      "created_at": "2009-05-31T20:41:36.000Z"
    },
    {
      "author": "nicole",
      "body": "Thanks!<br/><br/>Yeah, Mama Jeans is on my extended list. I have about 65 that I typed out with reasons why I would die if they left. But then I got really tired and needed to wrap up the post.",
      "created_at": "2009-05-31T22:19:58.000Z"
    },
    {
      "author": "nate",
      "body": "Ditto that.  (and good post!)<br/><br/>I always like formulating (and adding to) the list in my head of all the local shops and services where I know people by name and they know me.  No, it's not an ego thing; it's just such an enveloping sense of community.  Maybe it's because I've had times in my life when I <em>never </em>had that, I actively seek it out now.  And lemme tell ya kids, I've tried both ways, and this way is better.",
      "created_at": "2009-06-02T19:30:56.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 12,
      "name": "Thoughts"
    }
  ]
}
