{
  "id": 605,
  "title": "In fine Moxie fashion, a Summer of International Films",
  "body": "Travel budget got you down? Never fear, Moxie is here! You can always get the best in international film all summer long at The Moxie. Here's a bit of what's to come in the \"movies with subtitles\" genre:<br/><br/>+ <a href=\"http://www.moxiecinema.com/films/407\" class=\"broken\">PARIS 36</a> is a French musical set in 1936 Paris. The film centers around a local theater, and the people who try to save it from closure. Roger Ebert from the Chicago Sun Times calls the film \"amusing and enjoyable.\" (June 5)<br/><br/>+ <a href=\"http://www.metacritic.com/film/titles/sugar\" class=\"broken\">SUGAR</a>, a film about Dominican baseball player struggling to make it in the major league (June 12)<br/> <br/>+ <a href=\"http://www.metacritic.com/film/titles/rudoycursi\" class=\"broken\">RUDO Y CURSI</a>, a Mexican comedy starring Gael Garcia Bernal and Deigo Luna as brothers who start playing professional soccer (June 12)<br/><br/>+ <a href=\"http://www.metacritic.com/film/titles/sinnombre\" class=\"broken\">SIN NOMBRE</a>, a suspensful thriller following a Latin American family en route to the United States. (June 19)<br/><br/>+ <a href=\"http://www.metacritic.com/film/titles/hunger\" class=\"broken\">HUNGER</a>, an Irish drama about the 1981 IRA Hunger Strike (June 12)<br/><br/>+ <a href=\"http://www.littleashes-themovie.com/\" class=\"broken\">LITTLE ASHES</a>, a Britsh film following the earlier days of Salvodor Dali (and starring Twilight's Robert Pattinson) (July)<br/><br/>+ <a href=\"http://www.metacritic.com/film/titles/burmavj\" class=\"broken\">BURMA VJ</a>, an intense documentary about guerilla journalists in Burma and the repurcussions their efforts have on their country. (August)<br/><br/>There will most likely be many more international films added. These are just ones we have confirmed so far! Check our website weekly for start dates, because they are subject to change!",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2009-06-02T05:22:40.000Z",
  "author": "Nicole",
  "comments": [],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
