{
  "id": 606,
  "title": "Hey look! It's a new online calendar... FINALLY!",
  "body": "One of the biggest changes we made when we moved from our old space was the discontinuation of our monthly calendars. I've talked about the reasons behind this decision <a href=\"/posts/601\">many</a>, <a href=\"/posts/541\">many</a>, <a href=\"/posts/378\">many</a>, <a href=\"/posts/16\">many</a> times, so I won't waste any more pixels explaining it again today. The only reason I bring it up is to illuminate the fact that while the mechanics of our scheduling changed, our online calendar didn't, which confused a lot of our customers.<br/><br/>Here's a little taste of the types of questions we heard in regards to our befuddling online calendar:<br/><br/><ul><li>I'm looking at June but I can see the last days of May too! WHY?!</li><br/><li>You don't have any showtimes listed for the second part of June... are you closing?</li><br/><li>When will your start showing pornography? I don't see any porns on your confusing calendar!</li></ul><br/>Well, I'm happy to announce that our online calendar now reflects our week-by-week scheduling. Check it out <a href=\"http://www.moxiecinema.com/calendar\" class=\"broken\">right here</a>. Hopefully it makes sense to you right out of the box, but in case you're a little lost, let me give you some pointers.<br/><br/><b>NOTE:</b> If the calendar doesn't look right, you need to do a hard refresh of the page, which will cause your browser to read the new design correctly. Most browsers will allow you to do this by holding down shift when you hit the refresh button.<br/><br/>1. The calendar shows all the showtimes for the current \"Moxie Week.\" Our week starts on Friday, since that's when our movies begin. Whenever you visit the calendar page, you will see all the showtimes for that particular week.<br/><br/>2. I've used colors to help differentiate between days of the week. Days that have already passed are grayed out, and the current day is accentuated with a pleasing yellow background. If you're not a fan of scrolling, I've included a handy link at the top of the calendar that will take you straight to the current showtimes for today.<br/><br/>[ MISSING IMAGE ]<br/><br/>3. Every Tuesday we'll add a link to the top of the calendar page that says \"See next week's showtimes,\" and it will remain their until the current \"Moxie Week\" is finished. If you click it, you will see next week's showtimes. Amazing.<br/><br/>4. Below the weekly calendar, you'll notice a much-requested feature: The Coming Soon list! If we know when the film is starting, it will show the opening date directly below the poster. If we don't have a specific date set, it will simply say \"COMING SOON.\" You can click on any of the posters for more information about that particular title.<br/><br/>[ MISSING IMAGE ]<br/><br/>That's it! If you have any questions or comments, please feel free to <a href=\"http://www.moxiecinema.com/contact\" class=\"broken\">drop us a line</a>.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2009-06-15T03:53:22.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "nate",
      "body": "I totally dig it.  Well done, sir.",
      "created_at": "2009-06-15T18:41:32.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    },
    {
      "id": 11,
      "name": "Techish talk"
    }
  ]
}
