{
  "id": 609,
  "title": "Ch-ch-changes",
  "body": "It's been a while since our last blog post! Oops! But before you get upset, let me explain what's been going on behind the scenes - there have been a lot of changes!<br/><br/>First, and most obviously, yours truly has been going through some bizarre physical alterations, in which a human is growing inside my belly (and yes, just one human, because many of you have asked if there were more than one inside...)! I had heard about the exhaustion that pregnant women get, but I had no idea it was going to be like having mono again! Top that off with a nasty sinus infection and a case of food poisoning, and I was out of commission for almost the entire month of June. <br/><br/>Then in July, I focused a majority of my efforts on helping plan my 10-year high school reunion. It was a success, but a lot of work! And in August, I decided that with all the stress from the past couple months, I needed a break. I enrolled in Maternity Water Aerobics, and only worked a couple days a week, and even then it was the bare minimum. Thank goodness for an awesome staff and strong summer film lineup! It was sort of a training marathon for when I take “maternity leave.” Hahaha, oh man. Maternity Leave. Like a small business owner really gets that.<br/><br/>So now we're (almost) into September. I'm feeling rested and ready to start making headway again with a new batch of films, new crop of students, and some fun Moxie ideas. In fact, September will be our FOUR-YEAR anniversary! A premature pat on the back, if I do say so myself. We weren't sure we'd ever get this far!<br/><br/>You might be curious why it's all “I” in this post. Where's Dan been hiding? I know a lot of you have been asking. Well, that's another big change here at The Moxie. After a rough Spring at the theater, and knowing a baby is on the way, Dan decided to take on a full-time job in June. He's currently working at home for a national major media conglomerate, doing their web design and programming. I'm very proud of him, because it's not an easy job, and definitely not an easy job to get! But to be completely honest, the transition has been rough. I've had a few meltdowns, which are never pretty. He's only  here at the theater maybe one or two nights a week (if that), and a lot of the extra work has fallen onto my shoulders. When you're used to seeing your business partner/spouse 24/7, the change is drastic when you only see him/her a few hours a week!<br/><br/>I feel like I've said too much about our private life, but if you really want to know more, I could go on and on about some of the gross-out things of pregnancy, or how working at home makes Dan think he doesn't ever have to get dressed. But I won't! We value and respect you too much!<br/><br/>Hope you all had a good summer, and we'll be better about blog posting in the fall!<br/><br/>",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2009-08-28T22:07:33.000Z",
  "author": "Nicole",
  "comments": [],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 12,
      "name": "Thoughts"
    }
  ]
}
