{
  "id": 61,
  "title": "I like putty",
  "body": "I'm writing this post from work, which means I have to type quickly, quietly, and qleverly. I typically don't post while I'm at work because 1) I don't want to get <a href=\"http://www.urbandictionary.com/define.php?term=dooced\" target=\"_blank\">dooced</a>, and 2) I've actually been fairly busy over the last few months, but today's a bit of a slow day and my manager's door is closed so that means I can take off my shirt and shoes, huddle beneath my desk with keyboard in tow, and type away.<br/><br/>** UH OH **<br/><br/>Just as I finished that sentence my manager's door opened. That's okay, I've got my head in the game... I'm composing this post in a blank e-mail in Outlook to make it look as though I'm composing a fairly lengthy e-mail to one of my coworkers in Philadelphia. Ha ha! I'm going to be fired, aren't I?<br/><br/>Well, since this post is already damning enough, I might as well add fuel to the fire. Here's a couple pictures of my work environment. The first one is of <a href=\"http://moxie.danchilton.com/pix/grum/58_desk7.jpg\" target=\"_blank\">my desk</a>. Isn't she lovely? It's a bit blurry, but if you look closely you can still make out my computer screen. To the right of my monitor you'll notice what looks to be a partially burned CD-R attached to a plastic knife by a paper binder clip. That, my friends, is my rear-view manager mirror. From where I'm seated, I can always keep an eye on my manager's door - be it open or closed. Here's a couple, <a href=\"http://moxie.danchilton.com/pix/grum/59_cd_detail2.jpg\" target=\"_blank\">more detailed</a> <a href=\"http://moxie.danchilton.com/pix/grum/60_cd_detail3.jpg\" target=\"_blank\">shots</a>. His door is closed in both pictures, but I think you get the idea. <a href=\"http://moxie.danchilton.com/pix/grum/61_glen.jpg\" target=\"_blank\">This</a> is the picture on my computer's desktop. It was sent to me by a coworker after I sent around an e-mail likening our current internet journal platform to a Glen Campbell song. The picture motivates me. <a href=\"http://moxie.danchilton.com/pix/grum/62_putty.jpg\" target=\"_blank\">This is a large mound</a> of <a href=\"http://www.puttyworld.com\" target=\"_blank\">Aaron's Thinking Putty</a> that I squeeze all day long. Oftentimes, without even being aware of what I'm doing, I'll squeeze the putty into a phallic shape and bounce it against my chin while people talk to me. I've got to stop doing that.<br/><br/>But enough about me and my phallic putty, let's talk about the theater!<br/><br/>As you've learned over the last few posts, there are currently two problems facing <b>The Moxie</b>. First and foremost is the money issue. We have none, and the project is quickly becoming more expensive than anyone could have guessed. Solutions to this problems include, but are not limited to: Nicole or I winning the Missouri PowerBall jackpot, Brad Pitt heaving large bags of money at us, or me finding my hat. In all seriousness, I doubt any of those situations, beyond the one about Brad Pitt or us winning the lottery, are going to happen. So what do we do? We wait, we wait, and then we wait some more. We wait until the meeting with Andrew and Doug on the 24th, then we wait until they can find suitable sub-contractors, then we wait to see if we can get our loan, then we wait for the go-ahead to move back down to Springfield, and then I work out with some weights. I suppose patience is the key here.<br/><br/>In most situations, especially those dealing with business, I perfer to have some bit of control over what's going on. I'm not saying that I'm control-freak, I just find that things move a lot more quickly and efficiently when I'm at the helm. Of course, that sounds a lot more meglomanical than intended, or realized, but that's just the way I feel. This project, however, has not, and will never be, completely in my hands... and that's okay. I have to learn to work with others, because the whole is always greater than any one part. It's good real world experience... a well-needed workout with waits. I can only grow <br/>stronger through this collaboration. And yes, I watched <i>the Apprentice</i> last night.<br/><br/>Problemo numero dos is that a newly unveiled downtown development plan will be bringing a brand new, multi-screen, first-run theater right into our backyard... literally. When I say that the new theater will be really close to <b>The Moxie</b>, I don't think the majority of the readers understand how really, really, really, <i>really</i> close I mean. When movie-goers exit our theater through the north doors, they will actually being exiting DIRECTLY into the lobby of the new theater. <i>That's</i> how close we are.<br/><br/>At first, this new development scared the bejesus out of me. I won't lie to you, I was really pissed off, but the more I thought about it, the less I worried. Sure, the new multi-plex will mean we'll have a harder time booking some of the borderline indies like <i>Garden State</i>, <i>Napoleon Dynamite</i>, and <i>Vanity Fair</i>, but I have faith in Paul Sturtz, our booking agent, and I have no doubt in my mind that he'll get us through the rough spots. Beyond that, I think we can use the new theater as a marketing tool. Dichotomies like this one, where the two businesses are so vastly different in size and character, always lean towards the little guy.... well, maybe not always, but it will in our case.<br/><br/>Think about it - most likely, this theater will be run by one of the three big Missouri chains: AMC, Wherenberg, or Goodrich. Either way, they'll be too big to focus their energy on the little twin-screen arthouse perched rebelliously on the outskirts of their parking lot... but you can bet your ass that we'll be targeting them. A friendly rivalry can be good for business; just ask the East and West coast factions in the gansta rap war. As long as we open our doors first, people will come to know that <b>The Moxie</b> is a fun-loving, twizzler-eating, cool place to be. They'll know our personality, and I don't think they'll blame us for poking a little fun at the big guy. Would you blame a mom and pop grocery store for teasing the Wal-Mart Supercenter that opened next door? NO! You'd probably stop shopping there since, let's face it America, Wal-Mart's prices can't be beat, but you sure as hell wouldn't blame them for standing up for themselves.<br/><br/>Here's what I'm thinking: Imagine this as a quick pre-show ad. The new multi-plex is in the background and a swarm of content movie-goers are streaming from it's door.<br/><br/>- - - - - - - - - - -<br/><br/><b>MOXIE MAN</b> - (approaches movie-goer) Excuse me. (Flags down a husband and wife with their children) Excuse me, sir. Sir!<br/><br/><b>DAD</b> - Yes?<br/><br/><b>MOXIE MAN</b> - Did you just see a movie here at College Park Cinema 16?<br/><br/><b>DAD</b> - Yeah, we just saw <i>Alien vs. Predator</i>. My son loves those action movies whe--<br/><br/><b>MOXIE MAN</b> - That's great! So who won?<br/><br/><b>DAD</b> - Excuse me?<br/><br/><b>MOXIE MAN</b> - Who won? In the movie? The Alien or the Predator?<br/><br/><b>DAD</b> - Well, I'd hate to ruin the movie for peo--<br/><br/><b>MOXIE MAN</b> - Fantastic! Did you know that <i>Garden State</i> is currently playing right over there (points behind him) at the Moxie. Did you know that, sir?<br/><br/><b>DAD</b> - Uh, no. I didn't.<br/><br/><b>MOXIE MAN</b> - How about you little boy (moves microphone to little boy). Did you know that \"Garden State\" is playing at the Moxie today?<br/><br/><b>BOY</b> - Nope.<br/><br/><b>MOXIE MAN</b> - \"Garden State\" is about a young man who returns to his hometown after the death of his mother, and quickly learns that the life he was leading wasn't what he had wanted it to be. He also reconciles with his father, whom he hadn't seen for nearly 8 years. What do you think about that, champ? Wouldn't you like to see that movie?<br/><br/><b>BOY</b> - Um, I liked the part where, um, the alien bit the one guy's neck, and, um, he didn't have a head.<br/><br/>[ uncomfortable pause ]<br/><br/><b>MOXIE MAN</b> - (moves microphone back up to the father) You do realize that the Moxie serv<br/>es beer, don't you?<br/><br/><b>DAD</b> - Honey, take the kids (hands his keys to his wife).<br/><br/><b>MOM</b> - But Steve, I thought we were...<br/><br/>[ <b>MOXIE MAN</b> and <b>DAD</b> are gone ]<br/><br/><b>MOM</b> - ... going... to... Lowes... ah, banana oil!<br/><br/>[ Cut to the lobby of the Moxie, where <b>DAD</b> and <b>MOXIE MAN</b> are enjoying a cold beer ]<br/><br/><b>MOXIE MAN</b> - (sips beer) Yet another happy Moxie convert. My job is done here.<br/><br/><b>DAD</b> - Can I feel your cape.<br/><br/><b>MOXIE MAN</b> - No.<br/><br/>- - - - - - - - - - -<br/><br/>Isn't that great? Well, I suppose I've bantered on long enough. \"There's work to be done,\" or so they say. If you have an idea for how we can market <b>The Moxie</b> with a giant theater right next door, I'd love to hear it. Otherwise, have a safe and happy Labor Day weekend!<br/><br/>(Man runs over to <b>DAN</b> and whispers in his ear)<br/><br/><b>DAN</b> - What? When? <br/><br/>(Man continues to whisper)<br/><br/><b>DAN</b> - Last WEEKEND?! You're kidding me! Why did I go to work on Monday then?<br/><br/>(More whispering)<br/><br/><b>DAN</b> - Damn it!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-09-10T19:21:46.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Oz",
      "body": "You're a funny boy.  A very funny boy.  Banana oil!  I'll have to remember that one.  Anyway, did you know that \"dooced\" almost definitely came from another blogger:  www.dooce.com ?  She mistakenly created the word dooce because she would mis-type the word dude (or doode) as duce or dooce until her nickname became Dooce.  Anyway, she ended up getting fired from her job because of her blog.  Perhaps you already know all this, but for those who don't, you should check out her blog.  It's FABULOUS.",
      "created_at": "2004-09-10T19:48:12.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks, Oz. I'm quite familiar with Dooce.com... in fact, I think I first found her through the link on your site. She's funny like a stick on a funny tree.",
      "created_at": "2004-09-10T19:52:48.000Z"
    },
    {
      "author": "einahpets",
      "body": "Long blog for not being able to write at work. My one comment,<br/><br/>\"Wherenburg theaters, ba ba ba ba bamp, ba ba bamp ba bamp, Whereneburg, wherenburg",
      "created_at": "2004-09-10T20:20:56.000Z"
    },
    {
      "author": "bjork24",
      "body": "Steph, short comment for being able to blog at work! Ha ha!<br/><br/>*whispers* Wherenberg, wherenberg",
      "created_at": "2004-09-10T20:29:14.000Z"
    },
    {
      "author": "whitty",
      "body": "Your desk is very tidy.<br/><br/>Now I feel bad about my messy cubicle.",
      "created_at": "2004-09-10T20:30:46.000Z"
    },
    {
      "author": "bjork24",
      "body": "Cleanliness is next to hungriness. Mmm, bean burrito from Taco Bell.",
      "created_at": "2004-09-10T20:47:10.000Z"
    },
    {
      "author": "Newell",
      "body": "You should buy a ticket into a really popular film at the new multiplex. Go in and sit down like you plan on actually watching it. Sit somewhere near the middle of the theater. Then, half way through the movie, stand up and shout as loud as you can, \"Man, this place stinks!!! I'M heading across the street to the Moxie where cool people go to see cool movies!\" then storm out. It would be beautiful.",
      "created_at": "2004-09-10T22:16:45.000Z"
    },
    {
      "author": "bjork24",
      "body": "I don't know, Newell. Most likely, I'll be a patron of the theater behind our building, so I don't know how wise it would be for me to pull such a prank. But I'm sure I could pay a punk college kid to do it. Or, if you're still out of work at that point, I could hire you to do it 3 times a day.",
      "created_at": "2004-09-10T22:23:32.000Z"
    },
    {
      "author": "Aaron",
      "body": "Who here misses the old Wehrenberg song? With the badass brass section?<br/><br/>*raises hand*",
      "created_at": "2004-09-11T00:35:05.000Z"
    },
    {
      "author": "Aaron",
      "body": "There's an idea! You guys need a special Moxie theme song to play before every show! With accordions and tambourines! And maybe the digeridoo! Bum bum bum bum MOXIE! M! O! X! I! E! MoooooooooooooooooooooooXIE!",
      "created_at": "2004-09-11T00:36:48.000Z"
    },
    {
      "author": "bjork24",
      "body": "Aaron, if you can get your hands on a digeridoo, we might have something.",
      "created_at": "2004-09-11T00:38:38.000Z"
    },
    {
      "author": "Tim",
      "body": "To hell with multiplexes.  I'm a Moxie lad all the way!  Yeeaahh!<br/><br/>Oh wait, I live hundreds of miles away.  Well, uh...good luck with that then. :)",
      "created_at": "2004-09-11T04:56:30.000Z"
    },
    {
      "author": "Newell",
      "body": "Dan, I didn't mean you and in YOU, I meant you as in an ambiguous and general you who could hire someone to do it for you. <br/><br/>Hmm... if you pay for the tickets, then I may have to consider a move to Springfield.",
      "created_at": "2004-09-11T05:37:24.000Z"
    },
    {
      "author": "elspeth",
      "body": "A very funny post Dan, me and the pet parrot guffawed loudly. Thank you.",
      "created_at": "2004-09-11T08:14:17.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thank you, Newell. The offer is open.<br/><br/>Thank you, elspeth. Parrots frighten me.",
      "created_at": "2004-09-11T08:41:32.000Z"
    },
    {
      "author": "whittler",
      "body": "That's a mighty fine desk. I could take that desk home to my mama.<br/><br/>Have you patented the boss-watch invention yet?",
      "created_at": "2004-09-11T09:04:51.000Z"
    },
    {
      "author": "Craig",
      "body": "Stick it to the man, I say... And is that a hair in the Thinking Putty?",
      "created_at": "2004-09-13T23:28:33.000Z"
    },
    {
      "author": "Flare",
      "body": "I want to see that ad - exactly as written",
      "created_at": "2004-09-16T16:38:02.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    },
    {
      "id": 13,
      "name": "Other job"
    },
    {
      "id": 14,
      "name": "Dialogue"
    }
  ]
}
