{
  "id": 610,
  "title": "Happy Birthday, Moxie!",
  "body": "For those of you who keep track, we'll be celebrating our FOUR YEAR anniversary on Monday, September 21st! Four years! We can't tell if it feels like four days, four months, or four lifetimes. Either way, we've had a great time so far, and want to thank all of our customers for making The Moxie what it is!<br/><br/>During the opening month of the theater, we heard a lot of people say, \"Springfield can't support something like this! I give you guys six months.\" Six months! Ha. <br/><br/>So to say thank you for allowing us to stay in business for well over six months, we're going to put our $50 bulk passes back on the market for one week only! That's right. Ten movie tickets for $50. We only have about 100 bulk passes left in print, and we won't set a limit to how many you purchase, so come early and stock up! They'll make great holiday presents (yes, we're already thinking about the holidays!). September 18 - 24th. No exceptions, no phone orders, no internet orders...you'll have to come in and see us personally to purchase them!<br/><br/>Now, let's see if I can pull up some fun statistics from the past four years:<br/><br/><ul><li><b>423</b> movies and special events shown in our theater.</li><br/><li><b>32</b> local and regional films showcased at The Moxie (not including all the SATO 48 films!).</li><br/><li>We've only had a total of <b>19</b> employees. Ten still work for us!</li><br/><li><b>Two</b> of our staff members have been with us pretty much since we opened...they even came to our test screenings before we knew them! (Nate & Caleb)</li><br/><li>Over <b>25000</b> bags of popcorn sold (not counting refills)!</li><br/><li>SLUMDOG MILLIONAIRE was our biggest grossing film at The Moxie.</li><br/><li>We won't tell you what our lowest grossing film was.</li><br/><li>Fitz's Root Beer is our most popular beverage sold, and Peanut M&Ms wins for candy.</li><br/><li><b>Four couples</b> have become engaged to be married at The Moxie (congrats!).</li><br/><li>Only <b>ONE</b> vacation taken by Dan and Nicole (not a business trip, not a friend or family visit, but a true, sit-on-the-beach-for-a-week-and-drink-margaritas vacation).</li></ul><br/>What have some of your favorite films been? Any good memories? We'd love to hear them!<br/><br/><br/><br/><br/><br/><br/><br/>",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2009-09-14T23:38:01.000Z",
  "author": "Nicole",
  "comments": [
    {
      "author": "nate",
      "body": "I have no idea where I'd even begin with my favorite movies.  I've seen well over a couple hundred at the Moxie, I think.  I might be able to narrow it down to a top 20, but it'd be tough and would take time.<br/><br/>I couldn't narrow down the memories either, because they encompass 4 years worth of friends, coworkers, crazy nights, customers both friendly & memorable, and even a few parties after hours.   I will say that it's been one of the best experiences of my life, and I look forward to more of it.  Thanks for being great bosses, guys.",
      "created_at": "2009-09-15T07:04:00.000Z"
    },
    {
      "author": "nicole",
      "body": "Aw shucks, Nate. I'm not sure if it's the pregnancy hormones or what, but that made me misty eyed.",
      "created_at": "2009-09-17T02:20:48.000Z"
    },
    {
      "author": "nicole",
      "body": "Also, I looked at pictures from our test screenings, and found not just two of our future employees, but SIX! Devoted guys, I tell you what. Give them a pat on the back next time you see them. I don't know what we'd do without them!",
      "created_at": "2009-09-17T02:24:32.000Z"
    },
    {
      "author": "SpeedyProductions",
      "body": "FOUR YEARS?!?  And I have only known about it for the last 1.5 years?!?  I think I am on my 6th bulk pass, so maybe 70 movies for me, and it is hard to name my FAVORITE.  Some that make the list:<br/><br/>Fanboys<br/>Religulous - THREE TIMES in your lil place.<br/>The Wrestler<br/>Forbidden Lies<br/>Man on Wire<br/>The Cove<br/>and of course... SATO48",
      "created_at": "2009-09-29T21:22:36.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
