{
  "id": 611,
  "title": "Fall for The Moxie!",
  "body": "While our Summer lineup consisted of about three or four great films, our Fall lineup is shaping up to include about three or four times the amount of great films! Here's a sneak preview:<br/><br/><ul><li><a href=\"http://www.moxiecinema.com/films/442\" class=\"broken\">COLD SOULS</a> (9/26) – An extistential comedy/drama starring Paul Giamatti as Paul Giamatti.</li><br/><li><a href=\"http://www.moxiecinema.com/films/443\" class=\"broken\">WORLD'S GREATEST DAD</a> (9/26) – Delightfully crude comedy directed by Bobcat Goldwaith and starring Robin Williams as a single dad with a raunchy teen.</li><br/><li><a href=\"http://www.moxiecinema.com/films/448\" class=\"broken\">BRIGHT STAR </a>(10/3) Love story directed by Jane Campion (The Piano) about John Keats and the girl next door.</li><br/><li><a href=\"http://www.moxiecinema.com/films/444\" class=\"broken\">BIG FAN</a> (10/9) – Patton Oswalt plays a 30-something obsessive sports fan in this drama directed by the writer of THE WRESTLER.</li><br/><li><a href=\"http://www.moxiecinema.com/films/446\" class=\"broken\">LORNA'S SILENCE </a>(10/16) – Dramatic thriller by the Dardennes Brothers. They're like the Coen Brothers of Europe.</li><br/><li><a href=\"http://www.moxiecinema.com/films/449\" class=\"broken\">IT MIGHT GET LOUD</a> (10/16) – Rock doc with The Edge, Jimmy Page, and Jack White, directed by AN INCONVENIENT TRUTH'S Davis Guggenheim.</li><br/><li><a href=\"http://www.moxiecinema.com/films/445\" class=\"broken\">NO IMPACT MAN</a> (10/23) – Eco doc about a NYC family who tries to leave no impact on the planet for one year. Can they do it?</li><br/><li><a href=\"http://www.moxiecinema.com/films/450\" class=\"broken\">THE SEPTEMBER ISSUE</a> (10/23) Inside look at Vogue Magazine's biggest issue ever, and its powerful editor, Anna Wintour.</li><br/><li><a href=\"http://www.moxiecinema.com/films/451\" class=\"broken\">THIRST </a>(10/23) – Korean Vampire story not for the faint of heart! From the director of OLD BOY.</li></ul><br/>Start dates are subject to change, so use this as a rough guide, and keep checking back on our website for updates!<br/><br/>Some of our annual fall and winter events (Rocky Horror Picture Show, Chocolat @ Askinosie Chocolate Factory, Holiday Films at The Gillioz) have unfortunately been put on the back burner due to scheduling conflicts, but will hopefully be returning next year bigger and better than ever!",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2009-09-18T05:10:21.000Z",
  "author": "Nicole",
  "comments": [],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
