{
  "id": 616,
  "title": "Exciting news!",
  "body": "Hi everyone! We have some very exciting news for you...The Moxie will be starting the post-apocalyptic film THE ROAD on December 18! Based on one of the best books written in the past 100 years (my opinion), it's about a father and son trying to survive years after some world-wide catastrophic event. We are very excited!\r\n\r\nOh yeah, we also had a baby! His name is Jasper, he weighed 7 pounds, 13 ounces, measured 20 inches in length, and came 15 days early (born on November 24). We think he's the bees knees, even when he keeps us up all night long wanting to eat and fuss. \r\n\r\nSo while we make the transition from a married couple to parents, please be patient if things are a little behind at The Moxie. Our staff does a terrific job running the place, but we might be out of your favorite bottle of wine or peanut butter brownie for a few days. We'll get everything running again smoothly in a couple more weeks.\r\n\r\nAnd here's a picture of our little guy!\r\n\r\n<img src=\"http://img690.imageshack.us/img690/3127/jasper.jpg\">",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2009-12-02T01:40:35.000Z",
  "author": "Nicole",
  "comments": [
    {
      "author": "cooper417",
      "body": "Congrats! He's a cute little bugger.  And I promise not to call him a bugger ever again.",
      "created_at": "2009-12-02T02:13:57.000Z"
    },
    {
      "author": "ianscottpaterson",
      "body": "Congratulations on parenthood and for bringing one of my personally most-anticipated movies to Springfield.\r\n\r\nI love everything about The Moxie -- Ian",
      "created_at": "2009-12-02T05:20:11.000Z"
    },
    {
      "author": "Paul",
      "body": "Congratulations!  Being a parent is an awesome, all-consuming thing!  You'll love him more every day...even when he's a teenager!",
      "created_at": "2009-12-03T20:34:25.000Z"
    },
    {
      "author": "suzy",
      "body": "jasper! excellent name choice. and he is sooooooo cute. so cute!",
      "created_at": "2009-12-03T20:39:52.000Z"
    },
    {
      "author": "SpeedyProductions",
      "body": "Congratulations Dan and Nichole!  That is so great you have a healthy baby boy!  Take some time to yourselves, you guys deserve it.\r\n\r\n-Speedy",
      "created_at": "2009-12-04T16:15:34.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
