{
  "id": 62,
  "title": "All work and no play",
  "body": "*** THE REAL POST IS AT THE BOTTOM ***<br/><br/>All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. <br/><br/>All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. <br/><br/>All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. <br/><br/>All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. <br/><br/>All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. <br/><br/>All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. <br/><br/>All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. <br/><br/>All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work an<br/>d no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. <br/><br/>All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. <br/><br/>All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. <br/><br/>All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy. All work and no play make Dan a dull boy.<br/><br/>I've been taking a little vacation from <b>The Moxie</b> over the last week or so. I figure there's going to be a lot of stuff to change and/or revise after our meeting with Andrew and Doug on the 25th, so I better take advantage of the downtime while I still can. After all, I think I've earned the right to take a little break... I mean, I've been working on this project for nigh upon six full months! Can you believe it? Well, can you? Damn it, man! Speak to me!<br/><br/>So what have I been doing with myself over my self-imposed mini-vacation, you ask? Well, let's see. I've been occasionally updating my blog, watching movies and old HBO mini-series, playing with my new digital camera, and just pretty much takin' her easy. I've showered a few times. Brushed my teeth. Once. Stared at the wall for awhile. Sat on the couch. Ate rice cakes. Vacuumed. Breathed through my nose.<br/><br/>I also signed up to take pilates with Nicole, which starts on Wednesday night. We bought our pilates mats tonight and ate gigantic burritos. My pilates kit came with a nice blue mat, some foam bricks, a strap, and a VHS (whatever that is)... sounds like the ingredients for a hot, steamy night of playing \"how many times do I have to hit myself in the head with this foam brick before it starts to hurt?\" Oh yeah. That's hot. Hotter than you can handle, my hot-thing lovin' amigo/a(s). I might even twirl the strap around and let the metal part bonk me on the back of my hand as it twists itself around. If you can't handle that kind of heat... you best get out of the heat-making room, pal.<br/><br/>I watched one of those news shows on Friday - 20/20, Dateline, 60 Minutes - I forget which one it was, but it was about that guy who got his arm stuck while hiking through a small canyon in Utah. I think his first name was Aaron... or Aron... or Erin... I forget. Anyways, it was a great 2 hour telecast. I was completely engaged.<br/><br/>Here's a <a href=\"http://moxie.danchilton.com/pix/grum/57_texas_stump.jpg\" target=\"_blank\">picture</a> I took of a stump that looks like the state of Texas.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-09-14T06:31:16.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Newell",
      "body": "All the stars at night,<br/>Are big and bright,<br/>*clap clap clap clap*<br/>Deep in the heart of Stuuump!<br/><br/>Hmm... not quite the same.",
      "created_at": "2004-09-14T07:09:25.000Z"
    },
    {
      "author": "bjork24",
      "body": "I don't know... I kinda like it.",
      "created_at": "2004-09-14T08:06:52.000Z"
    },
    {
      "author": "Einahpets",
      "body": "I really hope you wrote a cool computer program to write your paragraphs of being a dull boy. That's a lot of work to type them manually!",
      "created_at": "2004-09-14T16:49:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yurp. It's called the cut-n-paste program. Everytime anyone uses CTRL+C or CTRL+V they owe me $0.05.",
      "created_at": "2004-09-14T17:48:24.000Z"
    },
    {
      "author": "sandra",
      "body": "i'm not sure why, but i watched the same show about the hiker. they really could have fit the story into an hour.  donthca think?",
      "created_at": "2004-09-14T18:07:19.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'd have to agree with you there, Sandra.",
      "created_at": "2004-09-14T18:28:28.000Z"
    },
    {
      "author": "whitty",
      "body": "niffty new banner!",
      "created_at": "2004-09-14T18:53:25.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Whit!",
      "created_at": "2004-09-14T18:56:02.000Z"
    },
    {
      "author": "Oz",
      "body": "Your new banner is not nearly as patriotic as your old banner.  But that was a super cool picture of a stump.",
      "created_at": "2004-09-14T22:12:27.000Z"
    },
    {
      "author": "bjork24",
      "body": "It's a little bit Moxie, and a little bit rock and roll.",
      "created_at": "2004-09-14T22:14:40.000Z"
    },
    {
      "author": "nicole",
      "body": "JD said the word Moxie on Scrubs last night.",
      "created_at": "2004-09-15T17:19:55.000Z"
    },
    {
      "author": "bjork24",
      "body": "Was it JD or the doctor who talks in questions? I think he said it to Turk. \"Do I admire your moxie? Yes. Will I let you take the surgery? No.\"",
      "created_at": "2004-09-15T17:22:08.000Z"
    },
    {
      "author": "nicole",
      "body": "JD's cooler.",
      "created_at": "2004-09-16T16:12:23.000Z"
    },
    {
      "author": "Alex",
      "body": "Do you still go in for Pilates? ",
      "created_at": "2006-07-18T18:03:56.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
