{
  "id": 623,
  "title": "Spring Cleaning",
  "body": "Well, it's Spring 'round these parts...we think. (\"There's a saying in Missouri, if you don't like the weather just wait five minutes. In Blaine, with hard work, I think we can get that down to three or four minutes.\" --WAITING FOR GUFFMAN) \r\n\r\nAnyways, with Spring always comes the urge for changes, sprucing up, etc. And we've got a lot of changes coming. So over the next few weeks we'll be updating the blog and spreading the word, so keep checking back!\r\n\r\nBut here's a quick sneak peek at some of the things we're working on (some more exciting than others):\r\n\r\n<ul><li>Auditorium 1 (the small one) will get a makeover soon, <i>if</i> we can get a little help from our customers! We've been hinting at it on The Moxie Minute during Resurrection Sunday on Q102, and yes, it involves new chairs.</li>\r\n<li>April 1st will be the debut of new prices here at the theater. It kills us to do it, but in 5 years of operation, we've only raised prices once, and that was when we moved. Ticket prices will stay the same, but some of your concession items will raise slightly (less than $0.25). More details on that later this week.</li>\r\n<li>We've been experimenting with different art in our gallery, and in June we'll be hosting an Indie Craft Show! If you like crafting, and want to have your own table in The Moxie lobby, head over to <a href=\"http://whollycraftshow.com/\" class=\"broken\">the craft show blog</a> for more information! Space is obviously limited in our lobby...</li>\r\n<li>Local films, local films, local films! We've taken a break from supplemental programing over the past year (blame pregnancy), but now we have a stack of films and special events in the pipeline that we're excited to present! Including the annual <a href=\"http://www.sato48.com/\">SATO48 film competition</a>! It's not too late to register...</li></ul> \r\nHope you're just as energized this Spring! After this long and crummy winter, here's to sunny days and cool breezes! And lots of movie-going, of course.\r\n\r\n",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2010-03-28T22:50:57.000Z",
  "author": "Nicole",
  "comments": [],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 12,
      "name": "Thoughts"
    }
  ]
}
