{
  "id": 624,
  "title": "On the Rise",
  "body": "Here's the thing: We don't like loose change. Quarters are okay. As you've noticed when you purchase something from The Cinebar, it's usually an even amount, plus a 50-cents or so. To get that way, we make our prices really odd (for example, $7.41 for a ticket) and then add the sales tax to make it an even $8. In other words, tax is included. And we don't have to worry about pesky pennies.\r\n\r\nAt the end of each month, we run a report showing how much we made, and what percentage of that is sales tax, and then write a nice big check back to the state. I usually cry. (Don't get me wrong, we understand the value of taxes, and the new tax increase is a way to help pay for some of our local services, which is great...but nobody likes writing big checks, right?).\r\n\r\nOver the past few years our sales tax has risen significantly, which is fine (see above), but now it's much higher than our original prices allowed for.  So starting in April, if we keep the same concession prices, we'll be losing money. That is one thing no business likes to do!\r\n\r\nThe solution, unfortunately, is to raise concession prices. But not by much! Most items will be just a quarter more. So you can still get a popcorn, a 50-cent refill, a large soda (with free refills) and a box of candy for under $10, which is still more than you can get at any multiplex across this country.\r\n\r\nWe've always had the mentality that if we keep concession prices lower, more people will buy them. After all, as most people are aware, that's a movie theater's largest profit center. You might think it's highway robbery to pay $10 for snacks, but you could also consider it an investment into the arts and culture of Springfield. Without your concession purchases, there's no way we could pay our bills, and we're hoping to stick around for a while. So thank you in advance!",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2010-03-30T23:24:54.000Z",
  "author": "Nicole",
  "comments": [],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
