{
  "id": 626,
  "title": "Yes, We're for Sale",
  "body": "By now you might have heard a rumor that The Moxie is for sale. Or that it's sold. Or that we're closing. Or that you can't use your bulk passes. And if you haven't heard any of those rumors from other sources, than let us be the ones to tell you the official story.\r\n\r\nThe Moxie is indeed for sale. It was a tough decision, but one that Dan and I are very excited for. We have worked extremely  hard over the past five years to bring independent cinema to Springfield, and have loved almost every minute of it, but life changes and we're ready for the next stage. \r\n\r\nWhen we started, we were a young married couple who had no obligations, no debt, and lots of free time. We spent every day, night, and weekend working at The Moxie. But now we are unable to devote that much time to the business, and you may have noticed as a customer that we've been lacking in some of the quirky areas that used to make us so unique (Moxie TV, pre-show video introductions, lots of local film programing, mini film festivals, Moxie Shorts, late-night classics, etc).\r\n\r\nAnd when we found out Jasper would be making his debut, we knew the decision was the right one to make. So we felt it's time to pass the reigns to someone who has that energy and drive that we had when we started. \r\n\r\nThe business has been listed for six months, and we've kept quiet for two main reasons: we had some interested buyers, and we didn't want to disrupt the flow of business. But word travels fast in Springfield, so this week it seemed like every local media outlet was announcing our sale, and in return, many of you have been expressing concern about the fate of your local indie movie theater.\r\n\r\nLet us ease your fears: We have just listed the business right now. There are interested parties, but no buyer yet. We will be selective on who takes over, because we don't want to see this business in the wrong hands. And your bulk passes and gift certificates are still valid!\r\n\r\nIf you're still experiencing some anxiety, remember this: when we announced our expansion, many of you were so worried that we'd lose our character and charm, that things would change for the worse. Every day we'd hear, “Oh you can't move! We love it here! You'll lose your personality! Etc” But we're still here. You're still (thankfully) coming. Besides the occasional complaint about how small our auditoriums are, I think you still enjoy your experience, and if you don't we try really hard to make it up to you. And whoever takes over the business will understand the value of great customers like yourself, and will work just as hard as Dan and I have to keep you happy!\r\n\r\nSo until further notice, it's still under ownership by Dan and Nicole Chilton, and you can still come to expect the same Moxie Experience you've come to know and love. And rather than burning out and closing our doors, we're paving the way for the indefinite future of independent films in town!",
  "author_id": 2,
  "allow_comments": 1,
  "created_at": "2010-04-11T06:49:06.000Z",
  "author": "Nicole",
  "comments": [],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
