{
  "id": 628,
  "title": "Changing of the guard",
  "body": "Hello again! It’s been awhile since my last blog post (just over seven months, to be exact), but I’m back again, for one last time, to make an exciting announcement: The Moxie has sold! For those of you who had no idea we were even for sale, <a href=\"/posts/633\">this news</a> might come as a shock; and for those of you who have no idea what The Moxie is, why are you even reading this?! I <a href=\"http://twitter.com/bjork24/status/19852204359\">tweeted</a> about the sale after our closing on Thursday, and since then we’ve been flooded with questions, comments, and congratulations. I figured a blog post would be the easiest and most efficient way to answer all the questions and shed some light on the future of The Moxie.<br/><br/>So without further ado, let’s get rolling!<br/><br/><b>Why did you sell?</b><br/><br/>Long story short, we needed to shift our focus from work to our new family, for the good of both our babies: <a href=\"http://twitpic.com/1zdhlu\">Jasper</a> and the Moxie. As soon as we learned that we were “with child” back in March of last year, we knew one of us would need to take a second job to buffer our finances for the arrival of our bouncing baby boy. As luck would have it, I had already been exploring a job opening at AOL (where I worked as an editor, briefly, back in 2007) that would give me the ability to work from home, which meant I could still help out around the theater.<br/><br/>After two months of interviews and portfolio dissection, I was hired as the developer for <a href=\"http://www.engadget.com\">Engadget.com</a>, which over the course of a year, grew to a lead developer position overseeing several adjacent properties. It’s a fantastic gig that allows me all sorts of creativity, but it also meant an inevitable weaning from the Moxie. Nicole was up to the challenge of running the Moxie on her own, but her growing belly had different plans.<br/><br/>As the Summer and pregnancy progressed, Nicole found that she needed to take more and more time off from the theater to tend to baby stuff. I tried to cover the slack when I could, but the original project I was hired for (the redesign of Engadget) was in full swing and I was regularly working 12 to 14 hour days, seven days a week. It quickly became obvious that we were neglecting the theater, and we knew things weren’t going to get easier once the baby arrived, so we sat down and made a hard decision. We decided to sell the Moxie in hopes of ensuring its future, and allowing us to step away and focus on our new family.<br/><br/>It was a difficult decision, but in the end we knew it would be the best course of action for both the theater and our family. So, less than a month before Jasper was born, we listed the theater for sale, and that was that.<br/><br/><b>So who bought it?</b><br/><br/>First off, we’re viewing this less as a straight-up sale and more of an announcement that the Moxie will now be non-profit and operate under new management. This transaction has ensured the Moxie’s future and positioned it to become even more ingrained with the Springfield arts community, which was exactly the scenario Nicole and I had hoped for, and the reason we were so selective about who would take the reigns.<br/><br/>When we first listed the theater back in October, we decided it would be best to keep a lid on the potential sale so as not to cause an unneeded distraction or disrupt business, which worked pretty well until an unintentional leak sparked a frenzy of news reports back in April. In the beginning, when we were keeping the listing under wraps, the theater was garnering a steady stream of buyer interest, but after the media exposure, the number of inquiries exploded. It. Was. Awesome.<br/><br/>I can’t tell you how lucky and grateful we felt for such an enormous response. In the beginning, we didn’t know what to expect in terms of buyer interest, so you can imagine how pleased we were with the flurry of inquiries. Nicole and I knew we were going to be picky when it came to selecting a buyer, so we spent a lot of time vetting potential parties with our broker. If we felt a certain buyer wasn’t a good fit for the theater, we’d skip them and move on to the next offer.<br/><br/>I know that sounds boastful, but I’m not trying to brag; I’m simply emphasizing how incredibly important it was for us to be patient and wait for the exact right fit for the Moxie. For Nicole and I, this wasn’t just a sale. We had spent six years of our lives building the theater from scratch, so the idea of simply collecting a check and walking away wasn’t an option. We wanted a buyer who already knew the theater -- knew the Moxie experience, knew our films, knew our place in the community; we wanted a buyer with a similar sense of style, humor, work ethic, and customer-orientation; we wanted a buyer who was well-connected with the arts scene and wasn’t a stranger to downtown; but most importantly, we wanted a buyer who could devote resources -- time, money, passion -- back into the theater. We wanted someone who could take the Moxie, our first baby, and foster it into something that was beyond our means. That’s what we wanted, that’s what we waited for, and that’s what we got.<br/><br/>The Moxie has been handed over to a new non-profit entity, the Downtown Springfield Community Cinema, which will be administered by a volunteer board through the Community Foundation of the Ozarks. The board is made up of some of our most vocal and loyal supporters, and I have no doubt in my mind that they will usher the Moxie into a new era of prosperity and cultural significance.<br/><br/>Taking over as the new face of the Moxie will be Mike Stevens, a super cool dude (that’s an official designation) who recently moved back to Springfield from NYC specifically to run the theater. This isn’t Mike’s first foray into the Springfield arts scene -- local music aficionados might remember him from his days as a musician with Honky Tonk Chateau. We’ve just begun the transition phase, and Mike has eagerly jumped in with the same unbridled enthusiasm that Nicole and I had way back in 2005. I’m confident that our customers will see, just as we have, that he’s going to be a perfect fit for the Moxie. Make sure you say hello to him next time you’re in.<br/><br/><b>What does this mean for The Moxie?</b><br/><br/>Bottom line: it means you can expect the same great films to keep coming to Springfield for many, many more years. As I mentioned above, the newly formed board is built almost entirely of Moxie fans and supporters, and they know first-hand what’s worked for us over the years. There are no drastic, business-changing plans in store, so you can expect the same great Moxie experience you’ve come to know over the last five years.<br/><br/>Of course, that’s not to say that there won’t be any changes at all. The DSCC have some great ideas for improving the overall Moxie experience, many of which are things we’ve wanted to do ourselves, but could never find the resources or time to make happen. I won’t give them away here -- mainly because I don’t want to ruin the surprise before they’re unveiled -- but I will say that they’re highly requested changes that will do wonders for improving everyone’s overall enjoyment.<br/><br/>The change to non-profit status is the biggest and most exciting component of the entire transition. Customers now have two ways to show their support for the Moxie: 1) by coming to see movies (obviously), and now 2) by enrolling in a tax-deductible membership program, which will provide new and exciting benefits all year long. They’ll offer several membership levels that will fit any budget, and allow you to have a more active role in ensuring the longevity of your favorite Springfield cinema. Nicole and I are going to be annual members, and if you’ve enjoyed the Moxie over the last five years, I hope you’ll join us as well.<br/><br/><b>What will you do next?</b><br/><br/>Watch more movies, that’s for sure! Other than that, we’re still undecided, and we’re okay with that.<br/><br/>Nicole has had an incredibly stressful year, running the theater by herself and having a baby, so she’s going to enjoy some hard-earned relaxation time. I expect she’ll use the rest of the year to decompress, finish some decorating projects around the house, and spend as much time as possible with Jasper; then she can re-examine where she’s at and go from there.<br/><br/>As for me, I’m going to continue working for Engadget for the foreseeable future. My job offers a lot of flexibility, occasional trips to NYC, and a great avenue for my creativity, so I’m set for the time being. It will also be nice to spend time with Nicole again. Prior to starting at AOL, Nicole and I shared the same job for six years, and were literally together 24 hours a day. Over the last year, however, we’ve barely seen each other, so we have grand plans of movie nights, weekend jaunts, and long strolls with Jasper and Bogey. You can expect to see us at the Moxie as often as we can find a babysitter.<br/><br/>And, of course, we’ll always be available to help the Moxie in any way possible. It’s difficult to walk away from something you’ve created, but we were lucky enough to find new caretakers who will not only maintain the Moxie with the same passion as we did, but are also kind enough to let us stick around and help out when needed.<br/><br/>It’s been a fantastic run, and I wouldn’t trade the last five years of my life for anything. Nicole and I had an opportunity to follow our passion and create a business that has become a staple of downtown Springfield. Had that opportunity showed up five years earlier or five years later, we would’ve missed the boat, but we were lucky enough to be in the right place at the right time, and now we have enough memories to last a lifetime. Thank you for all your support.<br/><br/>Trash and recycling are right up front, and we have an intermission halfway through, as per usual. I’ll go get it rolling -- thanks for coming in tonight, and enjoy the film.",
  "author_id": 1,
  "allow_comments": 0,
  "created_at": "2010-08-03T23:02:34.000Z",
  "author": "Dan",
  "comments": [],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
