{
  "id": 64,
  "title": "Could it get any better?",
  "body": "As you may or may not know, many business projects, during the long march from concept to conception, fluctuate in regards to the amount of activity and/or energy that is being expended to move the project ahead. Some days are chocked full of pant-rending activities, while others fall more along the lines of pant-folding ho-hum-ery. Nicole and I are currently in a lull. We're delaying theater-related work until we return from our trip to Springfield next weekend.\r\n\r\nAnd I have to tell you, it's been a very relaxing break. In fact, this last week has been one of the best in recent memory. Here's a list of reasons why:\r\n\r\n<ol><li>I bought 2 Canon PowerShot SD100 digital cameras for Nicole and I, which we received last Thursday. They're great! Small, powerful, and great tasting too.</li>\r\n<li>Apple finally fixed my iPod and returned it to me. The problem wasn't fixed, unfortunately, but after being iPod-less for 2 weeks, I'm just glad to have it back - low battery life and all.</li>\r\n<li>Tammy Pescatelli was kicked off <i>Last Comic Standing</i>. I couldn't stand that woman because 1) she wasn't funny, 2) she really wasn't funny, and 3) she reminded me of our \"see you next Tuesday\" neighbor.</li>\r\n<li><i>Survivor</i> starts tonight, of which I am a big fan. Nicole and I only watch TV on Tuesdays and Thursdays, by the way... so there.</li>\r\n<li>My cell phone and DSL contracts both ran up last month, so when I called SBC to re-up my DSL, I was pleasantly surprised to learn about the service bundles for which I qualified. Since we get our home phone, cell phones, and DSL through SBC, we could add satelitte TV with TiVo for $30 LESS than what we paid last month. I had to sit there and think: <i>Hmmm, $30 dollars more and bunny-ears antenna, or $30 less and satelitte TV with TiVo. $30 dollars more and bunny-ears antenna, or $30 less and satelitte TV with TiVo. $30 dollars more and bunny-ears antenna, or $30 less and satelitte TV with TiVo.</i>\r\n\r\nSir, are you ready to order.\r\n\r\n<i>Shush, man! Don't bother me... now, where was I? $30 dollars more and bunny-ears antenna, or $30 less and satelitte TV with TiVo.</i></li>\r\n<li>I realize that I sound like a giant blog advertisement at this point, but I don't care. These are things that make me happy.</li>\r\n<li>I sold my old digital camera and DAZZLE video maker on eBay.</li>\r\n<li>Nicole and I discovered Qdoba's. Mmmm.</li>\r\n<li>And finally, our \"see you next Tuesday\" neighbor is finally, finally, FINALLY <a href=\"http://moxie.danchilton.com/pix/grum/56_evection.jpg\" target=\"_blank\">getting evicted</a>. After living above this woman for over a year, I can't express to you how happy I am. Tammy Pescatelli and our neighbor booted out in the same week? Can it get any better? The answer, my friend, is blowing in the wind... listen... NOOOOOOOOOOOOOO!!!!!!!!!!!!!</li></ol>\r\nWell, that's about it. I hope I haven't bored you all with my <i>life outside the Moxie</i>. I'm really into the italics tonight, aren't I? Ok, I have to take Bogey out.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-09-17T02:25:41.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "WhimsyChick",
      "body": "Qdoba! Yum! I found it about a year ago and all I have to say is YUM!",
      "created_at": "2004-09-17T05:15:53.000Z"
    },
    {
      "author": "dave",
      "body": "there's a couple of things you can do to conserve the iPod's battery life. turn off the backlight. use (long or looped) playlists to reduce the amount of time the HD spins. you can also optimize the HD with Norton speed disk which should also reduce the amount of time it spends looking for files.\r\n\r\nor you could just roof it.",
      "created_at": "2004-09-17T05:32:52.000Z"
    },
    {
      "author": "Chuck",
      "body": "My iPod's battery has been slipping lately. I've been thinking about the $50 replacement for a while.",
      "created_at": "2004-09-17T05:39:34.000Z"
    },
    {
      "author": "Einahpets",
      "body": "First things first, Qdoba is no Chipotle. It never will be. \r\n\r\nSecond, Tammy Pescitalli. If I heard her joke about not all Sicilians are in the mafia, the rest are in the witness protection program, I was gonna scream.\r\n\r\nAnd, if I hear Ant talking about sleeping with a girl and thinking of her brother again, you know what I'm going to do? Scream.",
      "created_at": "2004-09-17T16:50:39.000Z"
    },
    {
      "author": "bjork24",
      "body": "WhimsyChick, isn't Qdoba good? Mmm, so much better than Chipotle.\r\n\r\nDave and Chuck, gotta love the pod.\r\n\r\nEina, isn't Chipotle good? Mmm, so much better than Qdoba.",
      "created_at": "2004-09-17T17:11:23.000Z"
    },
    {
      "author": "Oz",
      "body": "Oh my, now that you have TiVo, your life will never be the same.  I have Dish Network's version of it, the PVR.  It is the best thing in the entire world.",
      "created_at": "2004-09-17T17:16:42.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'm excited for the TiVo. It will come in especially handy when we open the theater and have to work through all of our favorite shows. Now we can just TiVo them and watch them the following day before we head back to the theater! Woo hoo!",
      "created_at": "2004-09-17T17:25:38.000Z"
    },
    {
      "author": "Aaron",
      "body": "Things are slow here, too. I've finished the projects people were paying me for, and I'm in between posters, so for the moment I sit and read. Oh, I dropped the rest of my Moxie gift certificate on poetry by Ted Hughes and Billy Collins. I think I'm going to go out and drive.",
      "created_at": "2004-09-17T22:01:55.000Z"
    },
    {
      "author": "bjork24",
      "body": "Aaron, have fun driving.",
      "created_at": "2004-09-17T22:09:00.000Z"
    },
    {
      "author": "Newell",
      "body": "What's a qdoba???\r\n\r\nI wish I had a TiVo. I swear, as soon as I move out of the house, that's one of the first things I'm getting.",
      "created_at": "2004-09-17T22:24:18.000Z"
    },
    {
      "author": "bjork24",
      "body": "Newell, Qdoba is a big buritto place, like Chipotle... only better... unless you ask my sister-in-law.",
      "created_at": "2004-09-17T22:31:06.000Z"
    },
    {
      "author": "einahpets",
      "body": "Chipotle is better. Less selection=less people standing in line wondering what they want. Plus, their rice is way better.",
      "created_at": "2004-09-17T23:07:07.000Z"
    },
    {
      "author": "bjork24",
      "body": "See what I mean... Eina is the \"unofficial\" spokesperson for Chipotle.",
      "created_at": "2004-09-17T23:15:57.000Z"
    },
    {
      "author": "Aaron",
      "body": "The workers at Qdoba are almost as fast as the workers at Gates in KC. The only time it was too noisy for me, but the food was pretty good (at Qdoba).",
      "created_at": "2004-09-18T00:38:37.000Z"
    },
    {
      "author": "Newell",
      "body": "I've never heard of either of those places. As far as I knew, Chipotle was nothing more than a seasoning/spice type dealy.",
      "created_at": "2004-09-18T10:10:16.000Z"
    },
    {
      "author": "Tim",
      "body": "Cool logo.  Max Schreck's the most bestest vampire of them all.  All of the other ones suck.  Okay sorry, I'll go away now.",
      "created_at": "2004-09-20T01:29:30.000Z"
    },
    {
      "author": "Fyse",
      "body": "Well, I'd love to join the heated debate, but I really don't have a clue what either of those places are. Clearly they haven't yet penetrated this side of the pond.",
      "created_at": "2004-09-20T03:32:55.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 7,
      "name": "Lists"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
