{
  "id": 65,
  "title": "Back in jiffy...",
  "body": "There's some great, dare I say \"wonderful\", <b>Moxie</b> news coming down the pike, but I've decided not to share it just yet. I have a couple side projects that require my attention, so I'm going to focus all my energy into finishing them before we head down to Springfield on Friday. That means you won't be hearing from me until we return on Sunday, unless, of course, your religion specifically bans the reading of blogs on the Sabbath, in which case you'll have to wait until Monday morn. In the meantime, take a moment to browse the rest of the site. Reread the archives, sign the guestbook a few more times, or, if you haven't already, surf on over to some of the blogs listed in the sidebar. They're all good reads, but might I suggest <a href=\"http://tapioca.urlblue.com\" target=\"_blank\" class=\"broken\">Nicole's blog</a> in particular. It's filled with vicious lies, unattractive depictions of me in my skivvies, and misrepresentations of our marriage. Fantastic!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-09-21T03:27:02.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Rachel",
      "body": "Brad Pitt gave you $$ didn't he?!",
      "created_at": "2004-09-21T05:55:52.000Z"
    },
    {
      "author": "bjork24",
      "body": "I wish.",
      "created_at": "2004-09-21T06:31:34.000Z"
    },
    {
      "author": "Rachel",
      "body": "Give us a hint.  Jesus God, Skip Bo hell damn I can't wait until Sunday.  Judging by the response time on my previous comment I'm pretty sure you can spare a moment to give a hint.  You don't know how dependent I am on this website.  I've stopped sleeping.  All the carmel macchiatos I make at Barnes and Noble contain \"Moxie\" spelled out in carmel sauce.",
      "created_at": "2004-09-21T09:07:16.000Z"
    },
    {
      "author": "Einahpets",
      "body": "Last night I was daydreaming. I was at the emmy's at the \"real person presenter\" and they asked me who I wanted to meet. I said Marge Helgenberger. But then I said, wait, no! Brad Pitt. Shout out to Springfield, Mo! Can I have some money so my twin and her husband can start their own theater?! <br/><br/>Then my day dream ended.",
      "created_at": "2004-09-21T16:47:23.000Z"
    },
    {
      "author": "bjork24",
      "body": "Rachel, good things come to those who wait... and today the Star Wars DVD set FINALLY came out. Thank god! I've been waiting FOREVER!<br/><br/>Enia, what did Brad say to you? Did he give us some money?",
      "created_at": "2004-09-21T17:17:27.000Z"
    },
    {
      "author": "whitty",
      "body": "I just realized where you work... And I just got an invoice from you guys (as in \"you guys\" the company) yesterday.  A tiny, tiny world.",
      "created_at": "2004-09-21T19:50:44.000Z"
    },
    {
      "author": "whitty",
      "body": "and by realize, I mean, read Nicole's blog.",
      "created_at": "2004-09-21T19:52:42.000Z"
    },
    {
      "author": "bjork24",
      "body": "We musn't mention the name.",
      "created_at": "2004-09-21T20:54:15.000Z"
    },
    {
      "author": "whitty",
      "body": "no, of course not.",
      "created_at": "2004-09-21T22:02:33.000Z"
    },
    {
      "author": "Luke Norman",
      "body": "Did you know a 'jiffy' is a real unit of time - it's 1/100th of a second. So now you know",
      "created_at": "2004-09-22T00:16:54.000Z"
    },
    {
      "author": "elspeth",
      "body": "Why am I always the sole Moxie blog reader? I am always here on my own. Its as though you see me coming and run off and hide. Or maybe it has more to do with blogging late at night in the Pacific Time Zone. Anyway, can't wait to hear the news.",
      "created_at": "2004-09-23T10:13:36.000Z"
    },
    {
      "author": "Fyse",
      "body": "You're a cruel man, Dan. Why torture us so? Just tell us the news!",
      "created_at": "2004-09-24T04:43:13.000Z"
    },
    {
      "author": "Tim",
      "body": "Shaun Of the Dead:  Best zombie comedy of 2004?  I think so.  Have a nice trip D-man.",
      "created_at": "2004-09-26T21:47:11.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
