{
  "id": 66,
  "title": "Full Speed AHEAD!",
  "body": "It has been a long, tiring weekend, but regardless of how exhausted I am, a blog post was promised, and a blog post you shall get. Before I begin, allow me to rewind a bit and express some of the feelings I was having in respect to the project.\r\n\r\nAs I had so often eluded to, but never fully divulged, there were many times when the project felt like it was slipping away from me - and when I say \"slipping away from me,\" I don't mean in the sense that I was losing control over the project. That was never the case. When I say \"slipping away from me,\" I'm referring to the feeling of the project seeming less like a reality and more like a far-fetched fantasy that will never come to fruition.\r\n\r\nFor the last month or so, the project has been steadily slipping further and further into the realm of the fantastic. Subcontractors were quoting bids that were far greater than initially predicted, structural problems within the building were popping up left and right, the construction timeline was extending farther and farther into the distance, and the financial burden of the project was becoming too much for any one person, or celebrity, to shoulder. And of course, all of this drama was playing against the backdrop of the newly unveiled <a href=\"60\">\"College Station\"</a> development, which, while not posing a direct threat to our theater, does lend an increased sense of urgency to the entire project.\r\n\r\nThings were looking bleak for the Moxie.\r\n\r\n*** EDITORIAL NOTE: I apologize, but I'm finding it difficult to keep my mind focused on the task at hand. Since I've kept everyone waiting for the better part of a week, it would be pretty shitty of me to end the post now, so I'm going to give a quick overview of the events that have miraculously breathed new life into the Moxie and fill in the details over the course of the coming week. ***\r\n\r\nLast weekend, Andrew, Ellen (Andrew's wife) and Doug took a trip up to Columbia, MO to visit the <a href=\"http://www.ragtagfilm.com\" target=\"_blank\">Ragtag Cinemacafe</a>, which, as I stated in one of <a href=\" 4\">my earliest posts</a>, is the theater we based our business model on.\r\n\r\nLong story short - after seeing Ragtag firsthand, Andrew, Ellen and Doug realized that we were making the project into something bigger than it needed to be. Did we really need a 5,000 square foot building that would necessitate hundreds of thousands of dollars worth of renovation, when all we were really trying to do, from the very concept of our collaboration, was bring independent film to Springfield? The answer was \"no.\"\r\n\r\nHad we stayed with our initial plan, the financial strain that the required renovation would have put on the Moxie's success would have been unbearable. The pressure to succeed would have been too great. The margin of error, too small. The need for another comparison, too obvious. There was a definite need to do a complete overhaul of the project as it stands today.\r\n\r\nThe answer to our problem was sitting directly across the street in the shell of an old bank building, complete with vault.\r\n\r\n<img src=\"http://moxie.danchilton.com/pix/grum/55_10295.jpg\" width=\"420\" heigh=\"407\" alt=\"This building is our salvation!\">\r\n\r\nMore to come! Aren't I an ass?",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-09-27T07:23:15.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Newell",
      "body": "Yes.",
      "created_at": "2004-09-27T09:14:31.000Z"
    },
    {
      "author": "Fyse",
      "body": "Wow, that came totally out of the blue. Big change of plans then?\r\n\r\nOh, and yes, you are.",
      "created_at": "2004-09-27T14:10:25.000Z"
    },
    {
      "author": "einahpets",
      "body": "College Station? Coming to Springfield? So is Texas A&M moving too?",
      "created_at": "2004-09-27T16:58:23.000Z"
    },
    {
      "author": "Oz",
      "body": "I'm on the edge of my seat.  Looking forward to the next post....",
      "created_at": "2004-09-27T17:10:20.000Z"
    },
    {
      "author": "Aaron Scott",
      "body": "So, I take it Rare Breed is moving? When? Where? You know those kids are homeless, right? You don't plan on kicking a bunch of homeless kids out on the streets, do you? No, no, no, I'm sure they have their own plans.",
      "created_at": "2004-09-27T19:38:48.000Z"
    },
    {
      "author": "Aaron",
      "body": "Hey, I've gotta take a couple videos back to the rental place here in a while. Anyone have any recommendations on what I should take home?",
      "created_at": "2004-09-27T19:49:53.000Z"
    },
    {
      "author": "justin",
      "body": "How much for the scooter?",
      "created_at": "2004-09-27T20:09:25.000Z"
    },
    {
      "author": "bjork24",
      "body": "Aaron, the Rare Breed is currently in the process of moving to a new location across from Murphy's on Campbell. Their transition should be complete within the next 2 weeks.",
      "created_at": "2004-09-27T20:45:45.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Hey...just wanted to let you know that we got our The Moxie shirts...and they're really nice.  Matt wore his to work Friday (business casual), and I wore my tank this weekend.  Good material, great-looking logo.  We're quite pleased with them!",
      "created_at": "2004-09-27T20:52:49.000Z"
    },
    {
      "author": "bjork24",
      "body": "Stephanie, if you send in some action shots, I'll post them!",
      "created_at": "2004-09-27T21:01:32.000Z"
    },
    {
      "author": "Aaron",
      "body": "The Springfield Business Journal now knows about the Moxie. Or at least the Dan & Nicole Power Tag Team Riot (sorry, the WWE was at the Shrine last night).",
      "created_at": "2004-09-28T00:58:06.000Z"
    },
    {
      "author": "bjork24",
      "body": "Aaron, I just e-mailed you.",
      "created_at": "2004-09-28T01:07:15.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 9,
      "name": "Pictures"
    }
  ]
}
