{
  "id": 67,
  "title": "Ragtag saves the day!",
  "body": "Plain and simple, Ragtag Cinemacafe was the original inspiration for the Moxie. I can still remember the first time I saw a movie there...\r\n\r\nIt was late November 2000 and Americans were still reeling over Dan Rather's display of lightning wit on the election night that wouldn't end. \"This will show you how tight it is - it's spandex tight.\" I was still living in Springfield at that point, but had made one of my many trips up to Columbia to visit my number one gal, Nicky V.. She and I, along with our good friend Mora, decided to try out the new theater that had opened downtown over the summer. The movie that night was Christopher Nolan's <a href=\"http://www.imdb.com/title/tt0154506/\" target=\"_blank\">Following</a>, for which I still retain the ticket stub.\r\n\r\nI can still remember the way Ragtag's tiny, red lobby / concession area seemed to invite us in from the cold. The lobby was crowded, but we eventually squeezed our way through the throng of people and bought our tickets from the ticket seller-cum-taker-tearer. We pulled back the black curtain that separated the lobby from the auditorium, and WOW... it was like something I'd never seen. In fact, it <i>was</i> something that I had never seen. A cozy little theater filled with red shag carpeting, tons of old, comfy chairs and sofas, eclectic art along the walls, and a packed house of anxious movie-goers. I was beside myself... and so was Nicole, so I turned to my side and said, \"this place is tight - it's spandex tight.\" I then proceeded to make a snapping noise with the elastic waist of my black and red biking shorts until the people seated directly in front of my bulging boyhood decided to stand up and find \"better\" seats.\r\n\r\n\"Here we go,\" I said, motioning to the newly available seats.\r\n\r\nI think we can all agree that this flashback has gone on long enough. The moral of this story is that 1) Ragtag is, was, and will forever be tight like spandex, 2) it was the spark that lit the Moxie flame, and 3) I love wearing my black and red biker shorts.\r\n\r\nIn the beginning, Nicole and I talked up Ragtag to Andrew and Doug like we were trying to set them up on a blind date. \"Oh, you'd absolutely love this theater. It's soooo cool, and everyone says how cool it is, and it's got so much personality, and it would be right up your alley. Seriously.\" Even though we talked a blue streak, Ragtag remained something to be experienced, not heard second-hand from a jabbery couple in their early to mid twenties who shared a certain proclivity for adjectives like \"awesome\", \"really awesome\" and \"RagTastic.\"\r\n\r\nOnce Andrew, Ellen, and Doug experienced Ragtag for themselves, our collaboration was back on the same page. We all agreed that it was time to free ourselves from the shackles of sagging roofs and crumbling masonry and re-embrace the fields of milk and honey nut Cheerios.... mmm, Honey Nut Cheerios. I'll be right back.\r\n\r\n.... moments later....\r\n\r\nWe don't have any Honey Nut Cheerios.\r\n\r\nNow, where was I? Oh yeah. Thanks to Ragtag, we were all on the same page again, and the Moxie project took a huge step forward. We moved from an indefinitely delayed construction schedule, to the realistic goal of opening within the next 3 to 4 months. From hundreds of thousands of dollars in required renovation costs and assumed risk, to the relatively simple process of clearing out a few walls and framing in an auditorium. Ladies and gentlemen, the Moxie is back in business! Full steam ahead! Fever in the south and no doctor! Or as Dan Rather would say, \"If a frog had side pockets, he'd carry a hand gun.\"\r\n\r\n.... moments later....\r\n\r\nUpon rereading this post, I realize that I haven't shed much light on what's really going on. Perhaps it's my sheet excitement (\"sheet\" being better than \"sheer\") that the project is finally taking off... or maybe it's the fact that it's 87 degrees in our apartment... or it might possibly be the hunger that has been steadily growin\r\ng inside of me ever since I mentioned Honey Nut Cheerios. Either way, stay tuned. At this rate, you'll be up to speed by the end of the week. Scout's honor.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-09-28T06:14:50.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Aaron",
      "body": "Oh man, you guys should build a ticket booth in the front, like that Abundant Life church thing on the square. That would be wicked awesome! How's that for mid-twenties adjectives? Or would wicked Ragtastic be more appropriate?",
      "created_at": "2004-09-28T07:50:15.000Z"
    },
    {
      "author": "Newell",
      "body": "Of all the extended Cheerio family, Honey Nut Cheerios are by far my favorite. I've thoroughly enjoyed them since I was but a young lad. Scrum-diddly-umptious they are. Hmm... I think I'm going to go have some.",
      "created_at": "2004-09-28T08:31:54.000Z"
    },
    {
      "author": "einahpets",
      "body": "I once went to a movie with Mora. We saw Gladiator in a building on MU's campus. She cried and cried. I sat in awe of Russel...\r\n\r\nI'll still do the landscape on the sidewalk if needed at the new place if needed.",
      "created_at": "2004-09-28T16:51:36.000Z"
    },
    {
      "author": "bjork24",
      "body": "*blushes* Thanks, Oz!",
      "created_at": "2004-09-28T18:20:48.000Z"
    },
    {
      "author": "nicole",
      "body": "When Dan and I first started dating, my Mom had great expectations that he'd be a screen writer, make lots of money, and put in a swimming pool for her. She's a big fan of Dan's work.",
      "created_at": "2004-09-29T01:16:28.000Z"
    },
    {
      "author": "Oz",
      "body": "Dan, you are such a great writer.  Sometimes I think you should get out of the movie business (or never get into it?) and stick to writing.",
      "created_at": "2004-09-28T18:11:44.000Z"
    },
    {
      "author": "einahpets",
      "body": "When Dan and I first started dating, my mom was mad that I wouldn't tell Nicole...We had to stop seeing each other at the wedding.",
      "created_at": "2004-09-29T16:29:04.000Z"
    },
    {
      "author": "bjork24",
      "body": "Ah, Stephy. Those were the days. How I miss you so.",
      "created_at": "2004-09-29T16:43:35.000Z"
    },
    {
      "author": "Rachel",
      "body": "Dan you and Nicole are the bombizzle fo shizzle.  As is Ragtag.  The last movie I saw there before I left Columbia was \"Super Size Me\"...now it's out on DVD.  So is \"Eternal Sunshine...\" I saw that at Ragtag too.  Sigh.  For everything turn turn turn...",
      "created_at": "2004-09-30T00:30:04.000Z"
    },
    {
      "author": "chris",
      "body": "I'll give a second that Ragtag is truely this shiz.  ",
      "created_at": "2005-01-28T21:49:22.000Z"
    },
    {
      "author": "Holly",
      "body": "Just came across the blog - Ragtag folks say thanks for all the niceness.  We love you, too.  ",
      "created_at": "2005-05-13T17:53:23.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
