{
  "id": 68,
  "title": "Straight to it",
  "body": "Ok, no more beating around the bush. Today's post is going to lay out what's been happening with the theater, plain and simple. No frills, no thrills, no Claritin pills - I'm just going to tell it how it is.\r\n\r\n<b>Why did you switch buildings?</b>\r\n\r\nThe building we had originally planned on using (herein known as 425) needed a lot of work done, and at a considerable cost to Andrew and Doug. The most recent quotes for 425 were nearly $100,000 over what we were expecting. Had we stuck with that building, we would've been looking at a monthly lease of roughly $6,000. On top of that, due to the amount of money Andrew and Doug has invested into the project, they would own a large share of the Moxie as a business. To regain control of the business in totem, we would have had to gradually buy them out with monthly installments. Add those two costs together and you can see why 425 was looking less and less desirable as time went on.\r\n\r\n<b>So what sparked the change?</b>\r\n\r\nAndrew, his wife Ellen, and Doug took a trip up to Columbia to visit Ragtag Cinemacafe, which I described in detail in Monday's entry. After they saw how things worked at Ragtag, they realized we were overshooting our goal and we needed to scale it back a bit. So we abandoned 425 and hopped across the street to 408, which is already in excellent condition, from a construction/renovation stand-point.\r\n\r\n<b>Does 408 have a bank vault?</b>\r\n\r\nYes. It used to be the Bank of Springfield once upon a time. It has a bank vault, complete with door.\r\n\r\n<b>Will you lock Nicole inside?</b>\r\n\r\nYes.\r\n\r\n<b>So how does moving from 425 to 408 affect the project?</b>\r\n\r\nWell, not only are we seeing a drastic reduction in the amount of time and money needed to get the building ready for the theater, we're also benefiting from an across the board cut in risk and start-up capital. With 425, Nicole and I would've needed a loan for $75,000 or more to cover the equipment and interior design costs, but now we're looking more along the lines of $40,000 since we're going from two screens down to one.\r\n\r\n<b>How many screens will you have?</b>\r\n\r\nI just told you - one.\r\n\r\n<b>How can a single screen theater still be profitable in these days of modern multiplexes, electric cars, and disrespectful teenagers?</b>\r\n\r\nLuckily for us, our booking agent, and all-around go-to-guy, is Paul Sturtz, one of the original founders and current booking agent for Ragtag. Paul has plenty of experience dealing with distribution companies and negotiated deals where we'll be allowed to split product.\r\n\r\n<b>Huh?</b>\r\n\r\nIn other words, we'll be able to show 2 movies on 1 screen on the same day. We can show one movie at 7:00 and a completely different one at 9:00, which will allow us to have a more diverse schedule, and, in turn, bring in more movie-goers.\r\n\r\n<b>Will you serve things like food and drink?</b>\r\n\r\nYes. We'll serve both of those.\r\n\r\n<b>So what's next for Dan the Man?</b>\r\n\r\nI have to finish this post and do some \"real\" work. I'm starting to fall behind with some of my corporate chores.\r\n\r\n<b>But what do you have to do next in regards to the theater?</b>\r\n\r\nUm... right now the biggest thing is getting the business plan done. I've been bitching and moaning about the business plan from day one, mainly because I don't think it's as strong as it can be. In the end, I may have to set my perfectionism aside, swallow my pride, and let it ride.\r\n\r\n<b>You're quite the proficient rhymer?</b>\r\n\r\nThanks.\r\n\r\n<b>After the business plan is complete, what then?</b>\r\n\r\nWell, I've given myself a tentative deadline for the business plan of October 8th. Nicole and I are taking our first, and most likely last, vacation from our real jobs on the 9th through the 17th. I don't want to have to worry about the business plan over our vacation, so I'm going to try my hardest to finish it before then.\r\n\r\n<b>That's not very far away\r\n. Can you get it done in time?</b>\r\n\r\nI hope. I have to e-mail our insurance agent today and get a new quote for 408. I also have to contact our equipment vendor and get a new bid from him on a single screen theater.\r\n\r\n<b>Do you have to present your business plan to a bank?</b>\r\n\r\nNo. We send it in, along with our loan application and a copy of our lease, to the SFDC (Springfield Finance & Development Corporation) for review. We met with the President of the SFDC board and the underwriter when we were down in June for the roundtable discussion on film in Springfield. They both seemed very enthusiastic about the project.\r\n\r\n<b>Did you watch Scrubs last night?</b>\r\n\r\nYeah, it was hilarious!\r\n\r\n<b>What are you dressing up as for Halloween?</b>\r\n\r\nSlash from Guns n' Roses.\r\n\r\n<b>Sweet.</b>\r\n\r\nThis interview is over.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-09-29T18:16:43.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Newell",
      "body": "One screen theaters are still viable. One of my favorite theater is an art house/indy style theater in Norfolk, Va. called The Naro. It's been around since the 70's. It's got one screen and usually shows two or three movies each day. It even has a balcony... mmmm.\r\n\r\nOne of the things that got me going to the Naro on a somewhat regular basis was a program they held called the First Look Film Forum. Basically they showed independent and foreign films anywhere from a couple of weeks to several months before their general release. The catch: they didn't announce what the movie was until you showed up for the program. It was really great because you got to see movies you might not otherwise go to see without any preconceptions.  Plus you get to see them before anyone else (in the area at least) so you could tease.",
      "created_at": "2004-09-29T19:52:26.000Z"
    },
    {
      "author": "bjork24",
      "body": "Good idea, Newell!",
      "created_at": "2004-09-29T19:55:46.000Z"
    },
    {
      "author": "whitty",
      "body": "That is a good idea!  You should definately do that, Dan!  \r\n\r\nI am glad to hear things are still up and running.  Get here as fast as you can!",
      "created_at": "2004-09-29T21:06:17.000Z"
    },
    {
      "author": "Newell",
      "body": "Yeah, the First Look Film Forum is a great program. Last year we got to see 'Whale Rider' about three months before anyone else in the entire country! I hadn't even heard of it until the morning I stepped into the theater.",
      "created_at": "2004-09-29T23:48:17.000Z"
    },
    {
      "author": "Luke",
      "body": "That is all very great news.  I was beginning to get really bummed out for you guys over the last two weeks or so.\r\n\r\nIt really sounds like The Moxie is going to do really well.",
      "created_at": "2004-09-29T23:49:52.000Z"
    },
    {
      "author": "Rachel",
      "body": "Wow Dan, that was worth waiting for...my only question is:\r\n\r\nI missed Scrubs.  What was it about?",
      "created_at": "2004-09-30T00:25:09.000Z"
    },
    {
      "author": "nicole",
      "body": "I still vividly remember Audrey Horne from Twin Peaks getting blown up when she was locked in a bank vault. Of course, she handcuffed herself in there on purpose. But please don't lock me in a vault, Dan.",
      "created_at": "2004-09-30T06:44:14.000Z"
    },
    {
      "author": "einaphets",
      "body": "Wow, who was interviewing you?",
      "created_at": "2004-09-30T17:29:13.000Z"
    },
    {
      "author": "Bryan",
      "body": "How many seats are you going to be able to fit in there?  I imagine there not being a lot of room left after you put in the cafe/concession area, ticket booth, etc.  Of course I don't know the dimensions of banks, especially this one. Less people is less money, do you think 1 theatre will still generate enough of a revenue stream?",
      "created_at": "2004-09-30T18:40:42.000Z"
    },
    {
      "author": "bjork24",
      "body": "Bryan, we'll have between 50 to 60 seats from the onset. We're also making plans for an eventual transition to a larger theater in the same space that will add an additional 20 or so seats.",
      "created_at": "2004-09-30T18:52:06.000Z"
    },
    {
      "author": "Oz",
      "body": "When you described the Ragtag, you spoke of couches and armchairs.  Is the Moxie going to go that route?  Or will you have conventional rows of seats?",
      "created_at": "2004-09-30T19:31:51.000Z"
    },
    {
      "author": "bjork24",
      "body": "Oz, we'd like to have couches and chairs like Ragtag... if we can get it past the fire warden.",
      "created_at": "2004-09-30T19:33:50.000Z"
    },
    {
      "author": "Bryan",
      "body": "Tell the fire warden that the couches will be protected by the fireproof bank/theatre vault.",
      "created_at": "2004-09-30T22:34:43.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 5,
      "name": "Interviews"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
