{
  "id": 71,
  "title": "Time keeps on slippin...",
  "body": "... slippin', slippin' into the future.\r\n\r\nWell, it's a been a couple days since I last updated this old blog, and not much has happened since. We sent a rough draft of the business plan out to a select group of friends and family, but didn't receive much back in the way of criticism, which can mean one of two things: either it's nearly flawless, or it's too damn long for people to read through. Probably a little of both. Either way, it's going out tomorrow.\r\n\r\nIn other news, I've thought up a new, wild and crazy idea to lure people into our theater. It's tentatively called \"Live Nude Nicole\"! Ha ha ha, just kidding. That won't happen until at least our second or third year of business. The idea is called MHS: Moxie Heckling Series. Here's the gist of it:\r\n\r\nFirst, we book a really bad movie - it can be a contemporary stinker (e.g. <i>Gigli</i>, <i>From Justin to Kelly</i>, <i>Glitter</i>, <i>Baby Geniuses</i>) or an oldie but stinky (<i>The Pod People</i>, <i>Nothing But Trouble</i>, <i>Plan 9 From Outer Space</i>, <i>Heidi</i>). Then we invite people to come in and heckle it, Mystery Science Theater style. Of course, to insure optimum heckle saturation, we'd turn the sound down a bit and run specials on beer and wine at the Cinebar. The tickets would be cheap too. We could also collaborate with the SMS or Drury improv troupes - that way there will always be a trained individual on hand to break the heckling ice if an accident occurs or everyone freezes up.\r\n\r\n<b>PATRON A</b> - Don't open that door, you dipshit!\r\n<i>( laughs )</i>\r\n<b>PATRON B</b> - That dude looks like my aunt!\r\n<i>( giggles )</i>\r\n<b>PATRON C</b> - You've got a hot aunt! What's her number?\r\n<i>( guffaws )</i>\r\n<b>PATRON D</b> - My crotch is warm. I need some napkins AND I just ate 12 boogers.\r\n<i>( silence )</i>\r\n<b>IMPROVIST</b> - Uh... hey, where's the beef!\r\n<i>( laughs )</i>\r\n\r\nI think the college kids will love it! What do you guys think?",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-10-08T01:32:48.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Al",
      "body": "Compared to the idea of a dumpy art theater, it's good.",
      "created_at": "2004-10-08T03:52:47.000Z"
    },
    {
      "author": "bjork24",
      "body": "Al, I'm not sure if that was a compliment or a put down.",
      "created_at": "2004-10-08T03:55:57.000Z"
    },
    {
      "author": "Oz",
      "body": "Sounds like a great idea.  I do think it's a good plan to have some \"ringers\" in there to get the ball rolling.  Oh, and I'm definitely a proponent of using comtemporary stinkers.  I just saw Dirty Dancing II: Havana Nights.  I was almost rolling on the floor laughing with a friend of mine.  Add that to the line-up.",
      "created_at": "2004-10-08T04:52:49.000Z"
    },
    {
      "author": "justin",
      "body": "You could show a movie about the Hindenburg disaster and I could make a clever comment during a quiet moment after the explosion.  You could ruin it with one of those funny laser pointers.",
      "created_at": "2004-10-08T05:12:38.000Z"
    },
    {
      "author": "Luke",
      "body": "That's a fantastic idea.\r\n\r\nThere should be small, inexpensive \"Moxie\" megaphones involved.  Customers could use them to offer up their wit, and they would get a neat piece of memorabilia.",
      "created_at": "2004-10-08T06:10:03.000Z"
    },
    {
      "author": "dave",
      "body": "you should check of the local university has a film dept. and maybe show films that would be relevant to them. In other words, FORCE THE BASTIGES TO COME!",
      "created_at": "2004-10-08T07:39:35.000Z"
    },
    {
      "author": "whittler",
      "body": "A great idea. Have it once a month or something. People might get bored with it if it was a weekly thing.",
      "created_at": "2004-10-08T08:23:36.000Z"
    },
    {
      "author": "einahpets",
      "body": "Are you going to include robots made out of gumball machines and bowling pins?\r\n\r\nWhat about live nude twins? People get a kick out of that!",
      "created_at": "2004-10-08T16:39:22.000Z"
    },
    {
      "author": "nicole",
      "body": "Oh come on. Nude Nicole? What about Nude Dan? You're much better looking. I'm going to order megaphones like RIGHT NOW!",
      "created_at": "2004-10-08T17:34:01.000Z"
    },
    {
      "author": "Newell",
      "body": "OH MY GENTLE JESUS!!! Mystery Science Theater 3000 is probably my favoritest show of all time! I am SO coming to Springfield when you get this program up and running! I'm starting to vibrate with joy just by thinking about it!\r\n\r\nOh, and speaking of 'Plan 9', my local indy theater is playing it next weekend. I've never actually seen it before, but I love 'Ed Wood', so this should be oodles of fun. I can't wait!",
      "created_at": "2004-10-09T06:41:24.000Z"
    },
    {
      "author": "Tim",
      "body": "Sounds like an excellent plan.  Modern audiences are accustomed to blabbering their way through a film anyway, so why not let them unload on a deserving cinematic bowel movement like \"No Holds Barred\"?  Go for it.",
      "created_at": "2004-10-10T20:57:03.000Z"
    },
    {
      "author": "Sancho",
      "body": "I think that is a great idea.  The only weak point is that it will be about a 3 day commute for me to come heckle from Greeley CO.  Being a part of an improv group myself I think it would be great to have them be part of the fun.  Free publicity for all involved!",
      "created_at": "2004-10-11T01:54:42.000Z"
    },
    {
      "author": "nicholas",
      "body": "talk to jeff at the skinny improv. http://theskinnyimprov.com they just opened a theater on Park Central East and are a good troupe. plus, they have a \"no dirty words\" policy that might benefit the evening.",
      "created_at": "2004-11-07T23:29:14.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 14,
      "name": "Dialogue"
    }
  ]
}
