{
  "id": 77,
  "title": "Welcome back...",
  "body": "Hey everyone! Welcome to the NEW Moxie Blog. Feel free to mouse around and poke anything you want. A lot of stuff has been moved around, but it's not terribly difficult to relocate. That last sentence had two meanings! Be sure to check back later, b/c from hence forth, The Moxie Blog is going to be a multi-post... as in, several per day... well, per WEEK day. They'll be a lot smaller than what you're used to, but \"them or the marry her!\" Right? Right? Can I get a \"woot woot?\"<br/><br/>Also, if you haven't done so already, please update your bookmarks and links to <a href=\"/moxie\" class=\"broken\">blog.moxiecinema.com</a>. Urlblue.com will remain active, but only as a redirect. Woo hoo!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-10-26T17:21:52.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Fyse",
      "body": "First commentor on the new look blog!<br/><br/>Woot woot!!",
      "created_at": "2004-10-26T18:07:16.000Z"
    },
    {
      "author": "bjork24",
      "body": "Congratulations, Fyse!",
      "created_at": "2004-10-26T18:08:39.000Z"
    },
    {
      "author": "Fyse",
      "body": "I assume every post will still appear on the main blog page?<br/><br/>Also, 'Fyse's Floating Face'? Where'd that come from?!<br/><br/>However, I'm obviously now going to rechristen my blog. Perhaps I'll make you my blog's official godfather, in honour of your superior naming skills...",
      "created_at": "2004-10-26T18:33:40.000Z"
    },
    {
      "author": "bjork24",
      "body": "It came from the picture of your face floating at the top of your blog... thus, Fyse's Floating Face. I'm also a sucker for alliteration.",
      "created_at": "2004-10-26T18:39:38.000Z"
    },
    {
      "author": "einahpets",
      "body": "I found a typo. The small text underneath the links. It says it doesn't me I don't like you...But I like the template. Nice and clean looking.",
      "created_at": "2004-10-26T18:46:09.000Z"
    },
    {
      "author": "bjork24",
      "body": "Doh! That's what I get for writing it at 10:15 in the evening!",
      "created_at": "2004-10-26T18:47:14.000Z"
    },
    {
      "author": "Lor",
      "body": "Happy New Blog Day! <br/><br/>Have you named the little robot on the screen? You should give him/her a quirky little name. <br/><br/>In closing, woot woot.",
      "created_at": "2004-10-26T19:35:55.000Z"
    },
    {
      "author": "bjork24",
      "body": "Lor: his name is Benzo. He moderates the interview in the R.A.Q..",
      "created_at": "2004-10-26T19:39:51.000Z"
    },
    {
      "author": "Oz",
      "body": "Woot woot?",
      "created_at": "2004-10-26T20:12:47.000Z"
    },
    {
      "author": "bjork24",
      "body": "Oz, that \"woot woot\" seemed a tad less than enthusiastic.",
      "created_at": "2004-10-26T20:15:26.000Z"
    },
    {
      "author": "Oz",
      "body": "Don't blame me.  You specifically asked for a \"woot woot?\" so that's what you got.  Now, if you had asked, \"Can I get a 'woot woot'?\" I would have responded in an entirely different manner.",
      "created_at": "2004-10-26T20:25:28.000Z"
    },
    {
      "author": "bjork24",
      "body": "Damn my hide! You're right. I deserved that \"woot woot?\"!",
      "created_at": "2004-10-26T20:32:09.000Z"
    },
    {
      "author": "Matt",
      "body": "maybe i missed this before, but where did urlblue.com originally come from - any story behind it?",
      "created_at": "2004-10-27T08:50:23.000Z"
    },
    {
      "author": "bjork24",
      "body": "Matt: it didn't have any particular meaning... just one of the many domain names I had lying about.",
      "created_at": "2004-10-27T17:38:24.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    }
  ]
}
