{
  "id": 8,
  "title": "Distribution fees and the like",
  "body": "<b>Misconception</b>\r\n\r\n\"Dude, theaters must be rollin' in dough... look how much they're gettin' for tickets and concession. Psh, I think I'm gonna quit my job and start me up one of these joints, yo!\"\r\n\r\nExhibiting movies is not a lucrative venture. Believe it or not, theater owners rarely see any of the money that you, the movie-going public, spend on an average admission. Here's a nice little ticket price breakdown <a href='http://www.rialtocinemas.com' target='_blank' class='onWhite'>Ian</a> posted on <a href='http://www.bigscreenbiz.com' target='_blank' class='onWhite'>BigScreenBiz</a>:\r\n\r\n------------------------------------------\r\n\r\nAverage Ticket Price $7.20\r\n\r\nFilm Rental $3.55\r\nMarketing $0.72\r\nPayroll $1.03\r\nRent $0.90\r\nRepairs & Maintenance $0.15\r\nSupplies $0.18\r\nInsurance $0.18\r\nManagement $0.66\r\nTaxes $0.06\r\n\r\nTotal $7.43\r\n\r\n------------------------------------------\r\n\r\nThat's a profit of -0.23... not too shabby, eh? And that's not even the half of it - Ian's price model only reflects a distribution fee of roughly 49%, which is par for art-house theaters, but well below what the big first-run multiplexes pay. You see, distribution fees are proportionate to the release date and/or perceived popularity of the film they're attached to. \r\n\r\nFor instance, when the new <i>Harry Potter</i> movie opens on Friday, all of the first-run theaters will want to be showing it... why? Because a) it's a guaranteed blockbuster, b) everyone wants to see it, and c) it's brand spankin' new. These three factors will drive the distribution fee through the roof. Out of all the money made from <i>Harry Potter</i> admissions this weekend, 90% of it will go straight back to the distributor. That means if you have 25,000 muggles drop by your theater to see the movie, and they pay an average of $7.00 per ticket, you can expect to pay $157,500, out of the $175,000 you made, to the Warner Brothers... leaving you with a whopping $17,500 to pay all the other expenses you incurred over the weekend.\r\n\r\nOf course, as the movie engagement drags on and interest starts to wane, the distribution fees will inevitably begin to drop. <i>Harry Potter's</i> fee will probably drop to 80% in the third or fourth week of release, and then down to 70% after a month and a half, and then 60% around the two month mark, until it finally bottoms out around 50% to 40%, at which time it will be passed on to the lowly subrun (second-run) movie theaters who will continue to drain every last cent out of it until it comes out on DVD and you're forced to buy the extended director's cut.\r\n\r\nThe art-house scene is a little better off since the majority of films they show don't have to recoup multi-multi-million dollar budgets. Independent and foreign film distributors are much more eager to get their films shown, so they'll bring their fees down to an almost-but-not-quite-fair level in the hopes of luring smaller theaters to screen them. After showing a year's worth of quality films, most art-house theaters will end up paying an average distribution fee somewhere between 35% and 50%, which means they're in the clear to make some serious moolah, right? Wrong. Now you have to start considering demographics and film tastes.\r\n\r\nA lot more people will be seeing <i>Harry Potter</i> this weekend than will be <a href=\"http://www.imdb.com/title/tt0379225/\" target=\"_blank\">The Corporation</a>, a film that, from the looks of it, will end up being just as good, if not better, than yet another tale of teenage wizardry. Don't get me wrong, I love the Harry Potter franchise, and Nicole and I will most definitely be among the hordes of muggles who line up to see it on opening day, but that's not my point. The fact is, independent and foreign films will always, always, ALWAYS draw a smaller crowd than the mainstream blockbusters. That's just the rules of the game.\r\n\r\nA lot of people don't care to see smaller, lesser-known films. They like their blockbusters served with a fresh side of Julia Roberts (who, if you haven't heard already, is pregnant) and a nice tall glass of Orlando Bloom... and that's fine. To each his own. Keeping this in mind, the lower distribution fee makes perfect sense... just because we're paying half of what the big boys pay in fees, we're also seeing a quarter of what they do in attendance, so in the end, we're both feeling a firm thrust of the shaft.\r\n\r\n\"Damn, dude! How do you stay in business with all that distribution bull shyight?\"\r\n\r\nOne word: concessions. And that will be my topic for tomorrow.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-06-02T23:24:31.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Tim",
      "body": "I know what you mean. I used to work in a theater for a few years, got a film degree, did all the research. It's a losing proposition for sure. The funny thing is, every time I try to explain this to people they look at me like I just drop-kicked their dachsund. Maybe theater owners should post a sign explaining it all in one-syllable words, so people will stop whining about the price of popcorn. Anyway, nice blog. I'll be reading from now on.",
      "created_at": "2004-06-11T23:13:56.000Z"
    },
    {
      "author": "RD",
      "body": "My God, I wish movie tickets were only $7.00 out here. It's $8.00 just for a matinee. \r\n\r\nBTW: Interesting blog. I've only read the most recent posts due to fatigue, but I'll be a regular from now on.",
      "created_at": "2004-06-11T23:14:31.000Z"
    },
    {
      "author": "kayvz",
      "body": "Interesting blog, learned something new.",
      "created_at": "2004-06-11T23:15:37.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    }
  ]
}
