{
  "id": 82,
  "title": "Laying the bait",
  "body": "I just wrote an e-mail to Brian (the SFDC/SBA guy) that gave him all of my contact information... just in case, you know, he wants to get ahold of me to let me know that a certain loan has been approved. The e-mail was pretty pathetic, and I'm having second thoughts about having sent it. It went something like this:<br/><br/>+ + + + + + + + + + + + + +<br/><br/>Brian,<br/> <br/>I just realized that I forgot to give you my contact information when we last spoke. So, here it is:<br/> <br/>Home: 555.555.1719<br/>Cell: 555.555.9848<br/>E-Mail: dan@google.com or dan@amazon.com<br/> <br/>I hope all is well (except for the terrible hole the Cardinals have dug themselves into) and I look forward to hearing from you soon.<br/> <br/>Have a great day,<br/>Dan Awesomeness<br/><br/>PS - PLEASE TELL ME IF WE HAVE THE LOAN OR NOT! I CAN'T WAIT TO TELL MY BOSS THAT I'M LEAVING! YOU DON'T UNDERSTAND HOW MUCH I HATE MY JOB!!! OH MY GOD, PLEASE!!!<br/><br/>+ + + + + + + + + + + + + +<br/><br/>Perhaps I could've done without the post script.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-10-27T23:00:18.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Dave",
      "body": "back to work, Chilton.",
      "created_at": "2004-10-27T23:17:22.000Z"
    },
    {
      "author": "bjork24",
      "body": "Uh oh. I best watch my mouth or else I may get dooced. Back to work I go.",
      "created_at": "2004-10-27T23:20:17.000Z"
    },
    {
      "author": "Rachel",
      "body": "Whoa.  I like the new layout.  I was hesitant at first to embrace change...but you know how that is...REPUBLICAN!",
      "created_at": "2004-10-28T00:32:05.000Z"
    },
    {
      "author": "bjork24",
      "body": "Political talk is a big no-no here, Rach... unless you use Natalie Portman as a metaphor for something.",
      "created_at": "2004-10-28T00:34:07.000Z"
    },
    {
      "author": "Fyse",
      "body": "All the American blogs I read have been strangely silent with regards to Natalie Portman. Perhaps it's not that odd, since you're probably having Natalie Portman shoved down your throat 24/7, so weblogs can be a welcome haven from her. She's everyhwere in the news here, so I can only imagine (with much sympathy) what things are like over there.<br/><br/>Still, it'll all be over soon, and maybe there'll be a new Senator Amadala in the Galactic Senate? Here's hoping...",
      "created_at": "2004-10-28T01:28:30.000Z"
    },
    {
      "author": "Oz",
      "body": "I cannot offer any advice on how to communicate with people in charge of job-type-thingies.  I have demonstrated that time and time again.  But I can emphathize with you on wondering if the wording was wrong in an email you sent to such a person.  Feel my empathy.  Feel it, Danny-boy.",
      "created_at": "2004-10-28T01:32:45.000Z"
    },
    {
      "author": "Tim",
      "body": "Seemed pretty professional to me.  I think that's more or less the postscript Natalie used to get the Amadala gig with George Lucas.",
      "created_at": "2004-10-28T01:54:01.000Z"
    },
    {
      "author": "bjork24",
      "body": "Fyse: I could definitely stand hearing some more Natalie Portman news. No Natalie news is bad news.<br/><br/>Oz: I feel it!<br/><br/>Tim: I have a confession to make... I originally used that letter to beg for the role of Anakin. Alas, Lucas was looking for someone who, in his words, \"didn't look like a mix between Brad Pitt and Chris O'Donnell, with a side of Colin Farrell.\" Damn me!",
      "created_at": "2004-10-28T01:54:08.000Z"
    },
    {
      "author": "whittler",
      "body": "You should have added a PPS - \"I know where you live money-man!\"",
      "created_at": "2004-10-28T11:48:22.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yeah, he lives in Springfield... somewhere!",
      "created_at": "2004-10-28T17:08:33.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 13,
      "name": "Other job"
    }
  ]
}
