{
  "id": 84,
  "title": "Down to the wire",
  "body": "So much depends on the fate of our loan request. For instance, to be able to move out of our apartment in December, we have to give the leasing office our notice before November 1st (a.k.a. sometime within the month of October). Of course, as you all know, we only have 3 days left in October. Argh. I'm thinking we're going to have to give our notice whether we've heard back from Brian or not.<br/><br/>On top of that, we also need to shore things up with our jobs. Everyone in my department already knows about the Moxie, except for the departmental director. This wouldn't pose much of a problem if it wasn't for a gigantic intranet application I built called ePAS (eProduction Application Suite). Let me explain with the briefest of details:<br/><br/><ol><li>I built a program for our department that tracks every issue for every journal that we're currently responsible for, which is something like 400 billion journals.</li><br/><li>Every year, this \"tracking database\" needs to be replenished with the new issues for the upcoming year.</li><br/><li>Typically, this would be my job, but as you all know, I'm not going to be around for much longer (CALL BRIAN, CALL!), so it's imperative that I train someone how to do this uber-important task each and every November.</li><br/><li>When I leave, the ePAS torch will be passed to Dave, one of my coworkers in Philadelphia. It is imperative that Dave learn how to replenish ePAS. Also, in case Dave ever leaves, falls ill, or plays against the Boston Red Sox, someone will need to hold the ePAS torch while he regroups. That person is Jose, another coworker from the New York City office. It is imperative that Jose ALSO learn how to replenish ePAS.</li><br/><li>Simple math: it's cheaper to send Dan to NYC or PHL than it is to send Dave and Jose to STL.</li><br/><li>The only problem is... my director doesn't know I'm leaving yet, so she's under the assumption that I'm going to be replenishing ePAS for the rest of my life!</li><br/><li>We can't stress the necessity of sending me to the East coast until she learns of my imminent departure, which I refuse to do until I hear from Brian.</li><br/><li>So as the days tick by, the 2004 issues shrink smaller and smaller, while the looming 2005 issues grow bigger and bigger.</li><br/><li>I'm tempted to spill the beans, thus FORCING my director to the inevitable conclusion that, \"Yes, Dan keeps a jar of uncooked lima beans in his desk AND we need to send him to NYC so ePAS can live on forever and ever, Amen.\"</li><br/><li>I told my manager, who is not my director, that I'll have an answer for him on Monday... NO... MATTER... WHAT?</li></ol><br/>So there it is. I hope that made sense, because I'd hate to explain it again using the \"not-so-briefest of details\". Brian's phone call would mean so very much right now. The only thing that can take my mind off of the excruciating anticipation is knowing that I'll be wearing tight pleather pants to work tomorrow. I will win a prize for my costume. Oh yes, I will.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-10-28T22:20:27.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Fyse",
      "body": "Wearing a costume to work? Did I miss something? And what on earth are you going as?",
      "created_at": "2004-10-28T23:08:54.000Z"
    },
    {
      "author": "bjork24",
      "body": "I mentioned it several posts ago, Fyse. Geez, do you even READ my posts? Just kidding. I don't read them either.<br/><br/>I'll post pictures, don't you fret.",
      "created_at": "2004-10-28T23:11:39.000Z"
    },
    {
      "author": "Oz",
      "body": "It might be appropriate to call Brian and let him know that things--big things like where you live and where you work--hang in the balance.  While you understand that he might need time in order to process your application, it would be great if he could at least tell you when you can expect an answer.",
      "created_at": "2004-10-28T23:40:13.000Z"
    },
    {
      "author": "bjork24",
      "body": "If I don't hear from him by tomorrow, that's what I'm going to have to do... as much as I hate it.",
      "created_at": "2004-10-28T23:42:14.000Z"
    },
    {
      "author": "Fyse",
      "body": "Hmmm... Now you mention it I do remember something about fancy dress, but I can't spare the time to re-read previous posts. Geez, do you think I have nothing better to do?! I have a project to hand in tomorrow that is worth 10% of this year, and I have barely started it. Aaaarrrggghhhhh!<br/><br/>Checking to see if you've replied to my comment isn't procrastination. Oh no, not at all.",
      "created_at": "2004-10-29T00:28:39.000Z"
    },
    {
      "author": "bjork24",
      "body": "Good luck with your project, Fyse! I'm working on one too... it's worth 10% of my LIFE!",
      "created_at": "2004-10-29T00:30:22.000Z"
    },
    {
      "author": "Luke",
      "body": "mmmmmmmmm........pleather.",
      "created_at": "2004-10-29T07:39:32.000Z"
    },
    {
      "author": "bjork24",
      "body": "Luke: wait till you see the pictures!",
      "created_at": "2004-10-29T07:45:19.000Z"
    }
  ],
  "categories": [
    {
      "id": 7,
      "name": "Lists"
    },
    {
      "id": 13,
      "name": "Other job"
    }
  ]
}
