{
  "id": 86,
  "title": "Chairman of the board",
  "body": "If I had a lifelong goal of changing every member of my family into a business associate, I've almost reached it. I am now the Chairman of a board of investors consisting of my parents AND my in-laws. This is a sitcom waiting to happen.\r\n\r\nHere's the long and short of it:\r\n\r\n1. I called Brian after work. Before his bank can give us the loan, we need to get at least ONE guarantor to create \"joint and separate liability,\" which is just a fancy way of saying \"if you default on your loan, we need someone who actually HAS enough money to pay off your debt.\"\r\n\r\n2. I asked Brian, \"at this point, is this a case of, 'the loan is yours, you just need guarantors' or is it still a question of approval?\" His answer was grounding, yet subtly optimistic: \"Well, from our side, we've already approved the loan, but it would still be a matter of whether the SBA will approve it or not. We've been doing this for a long time, so we've learned to gauge which loans will or will not be approved by the SBA, but still, every once in a while, the SBA denies one of the loans we submit.\" Cautious optimism; a banker through and through.\r\n\r\n3. Since Nicole and I are already putting up an unearthly amount of money for our seed capital, the guarantors won't need to invest one shiny cent into our project. They will, however, have to submit a financial statement proving that they have what it takes to get sued by the bank if and when their darlings default on their loan.\r\n\r\n4. Our parents have tentatively agreed to be our gaurantors, but they want some assurances before they put their names on the dotted line. First on the list, they want us to go to the negotiation table with Andrew and Doug and settle on a final price for our lease. I've been holding off on this until we had our finances secured, but know it looks like it may be the other way around. NOTE TO SELF: Write an e-mail to Andrew and Doug regarding this topic.\r\n\r\n5. Now both sets of parents are guarantors, my sister is our CPA, and my wife is my business partner. NOTE TO SELF: Talk to Mee Ma and Peep (my grandparents) about working at the Cinebar.\r\n\r\nThree separate entities are looking out for their investments in this situation. Nicole and I want to see a return on the money we borrowed, our parents want to make sure we succeed so they don't have to pay off our loan, and Andrew and Doug want to see a return on their building investment. We have to find a common ground where all parties are happy... or just Nicole and I are happy. Either way, the game of Twister will most likely be involved.\r\n\r\nAlso, we've decided to go ahead and give our respective notices to our respective departments on Monday... respective Monday, that is. Our last day will be the day before Christmas Eve, and if I remember correctly, Christmas Eve falls on the 24th this year, which would put our last day on the 23rd. This is how we see it:\r\n\r\nBEST CASE SCENARIO:\r\nThe loan is approved. We work from St. Louis to get everything set up for our arrival in late December and then work like mad once we set up base in Springfield. Anticipated opening date: Valentine's Day weekend... with Amelie as a midnight movie perhaps?\r\n\r\nAVERAGE CASE SCENARIO: \r\nThe loan is delayed. We continue to set things up from St. Louis, but really move it into high gear once we get down to Springtown. Hopefully the loan delay will clear itself up in time for a late February / early March opening.\r\n\r\nWORST CASE SCENARIO:\r\nThe loan is rejected. We still move down to Springfield, take some time to regroup, and decide if we want to pursue alternate sources of financing or shelf the entire project and move on with our lives.\r\n\r\nAs you can see, our lives are 100% stress-free and our future looks brighter than ever. If a rabbit jumped by me right now, I'd be a god damn Downy fabric softener commercial.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-10-29T07:44:48.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Fyse",
      "body": "Have you ever thought about applying your considerable computer geeking skills to setting up some sort of cookie based system for remembering commentors details?\r\n\r\nSince you've got <i>so</i> much free time at the moment, I thought you might appreciate having the project...  :p",
      "created_at": "2004-10-29T14:08:08.000Z"
    },
    {
      "author": "bjork24",
      "body": "You're on, Fyse! I'll set that up sometime in the near future!",
      "created_at": "2004-10-29T16:38:16.000Z"
    },
    {
      "author": "einahpets",
      "body": "Well, even the worst case scenario sounds pretty good. I can think of a lot worse things that could happen. A fire downtown destroying all buildings, Bankruptcy from family members, having to move to Toledo...",
      "created_at": "2004-10-29T16:39:50.000Z"
    },
    {
      "author": "bjork24",
      "body": "I thought Toledo was kinda nice.",
      "created_at": "2004-10-29T17:16:41.000Z"
    },
    {
      "author": "nicole",
      "body": "Do you remember that Carrot Top movie called Chairman of the Board? Or was it Bored? I don't remember.",
      "created_at": "2004-10-29T18:20:34.000Z"
    },
    {
      "author": "bjork24",
      "body": "I've never seen a Carrot Top movie in my whole entire life!",
      "created_at": "2004-10-29T18:23:03.000Z"
    },
    {
      "author": "Luke",
      "body": "People let Carrot Top make movies?",
      "created_at": "2004-10-29T19:48:52.000Z"
    },
    {
      "author": "Luke",
      "body": "I can already see twenty years from now, after the Moxie empire has been built, Dan and Nicole's life becoming the topic of a sitcom, much like Arrested Development.",
      "created_at": "2004-10-29T19:50:34.000Z"
    },
    {
      "author": "bjork24",
      "body": "In my opinion, which is the only one that REALLY counts on this blog, Arrested Development is the funniest show on American TV right now. We just bought season 1 on DVD.",
      "created_at": "2004-10-29T19:52:37.000Z"
    },
    {
      "author": "Oz",
      "body": "Sounds scary, but it also sounds like there's nothing to do but to do it....",
      "created_at": "2004-10-30T05:11:14.000Z"
    }
  ],
  "categories": [
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
