{
  "id": 89,
  "title": "You ask",
  "body": "I deliver. You wanted an RSS feed, so I built one. Check it out over in the menu. However, I'd hate to think that people are just aggregating the RSS feed and not stopping by the blog to check out all the other cool stuff I have to offer... like... pony rides... and... gum.\r\n\r\nI still can't believe I didn't win the best costume award at work.\r\n\r\n*sigh*",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-10-30T07:52:36.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "whittler",
      "body": "Must see pictures. Must see pictures. ",
      "created_at": "2004-10-30T12:44:32.000Z"
    },
    {
      "author": "bjork24",
      "body": "Patience, my friend. Patience.",
      "created_at": "2004-10-30T18:39:41.000Z"
    },
    {
      "author": "Aaron",
      "body": "I still have no clue how RSS works.",
      "created_at": "2004-10-30T21:16:44.000Z"
    },
    {
      "author": "Aaron",
      "body": "Oh, and I have a friend who would already like to put in an application to work at the Cinebar, or something.",
      "created_at": "2004-10-30T21:17:10.000Z"
    },
    {
      "author": "bjork24",
      "body": "Aaron: I'm not a fan of RSS myself, but I realize a lot of others are. It's just another way to check up on your favorite blogs w/o actually needing to go to the site.\r\n\r\nAs for your friend's application, we haven't quite got to that stage of the game yet, so tell them to be patient.",
      "created_at": "2004-10-30T21:19:58.000Z"
    },
    {
      "author": "Luke",
      "body": "Wait a minute.  I've been a regular reader for some time now.  How did I miss my pony ride?\r\n\r\nI can let the gum slide I guess.",
      "created_at": "2004-10-30T21:54:28.000Z"
    },
    {
      "author": "bjork24",
      "body": "Luke: unfortunately, the pony rides were a slight exaggeration.",
      "created_at": "2004-10-30T22:05:11.000Z"
    },
    {
      "author": "nicole",
      "body": "The pony rides can be arranged, however. ",
      "created_at": "2004-10-31T00:31:56.000Z"
    },
    {
      "author": "bjork24",
      "body": "You'd be surprised.",
      "created_at": "2004-10-31T23:47:15.000Z"
    },
    {
      "author": "Aaron",
      "body": "Your dog is not THAT big, is he?",
      "created_at": "2004-10-31T23:17:50.000Z"
    },
    {
      "author": "Luke",
      "body": "Weeeeee!!!  Ponies!",
      "created_at": "2004-10-31T14:09:14.000Z"
    },
    {
      "author": "Otto",
      "body": "Actually, I do not use RSS feeds as a way for reading blogs without actually visiting them. I use Firefox's Live Bookmarks, which link to the actual website So I can check if there was any update (like I hadn't checked since I asked for this feature and it was so generously and promptly implemented), and then go to the website itself to read it. That's \"thank you very much\". :)",
      "created_at": "2004-11-04T09:40:57.000Z"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Blog"
    },
    {
      "id": 11,
      "name": "Techish talk"
    }
  ]
}
