{
  "id": 9,
  "title": "Concession is King",
  "body": "The point of <a href=\"/posts/8\">yerterday's post</a> was to demonstrate that there is very little profit in ticket sales. The only way a theater can sustain itself is through selling grossly overpriced concessions. And that's it. End of story. Over. Done. Period.<br/><br/>Of course, that's not completely true. Theaters can also whore themselves out to national ad services, who will in turn provide them with AT LEAST 20 minutes worth of commercials for the US Army, Mountain Dew, Fanta, and Axe Body Deoderant. Nothing makes an audience happier than being forced to watch 20 minutes of grainy, originally-filmed-for-television commercials... and nothing makes me happier than sitting through said advertisements and only getting to see one trailer... for Garfield. What was Bill Murray thinking?! I'm veering off subject here. My point is that theaters can only stay afloat through concessions and advertising.<br/><br/>All theaters are hungry for your concession money. They will do anything to get it... well, anything outside of charging a fair price for it, that is. It's been shown that only 20% of the movie-going public will make a trip to the concession area. That's only 1 out of every 5 people who walk through the door! Why so low? Well, who knows, but my personal opinion is that theaters don't try hard enough to earn your buck. The first thing they need to do is start offering a better concession selection.<br/><br/>A lot of theaters don't give you much of a choice beyond the typical popcorn and soda pop fare. You get to choose between Twizzlers (cunningly served in a package that makes it look like you're getting a lot more than what you actually end up with), Dots (if you're lucky), Squirms, Sour Patch Kids, Care Bear Gummi Bears (do kids still know who the Care Bears are?), Nestle Crunch Balls, Rasinettes, et al. Then you have the \"additional items,\" which can be anything from nachos to cotton candy to frozen bananas... these little jems rotate frequently and are usually selected strictly for their high profitability.<br/><br/>\"So what are you going to do that's different,\" you ask? Well, for starters, we're going to offer beer and wine. I know it sounds trite, but in Midwestburg it's a selling point. We'd be the only theater in town where you can watch a movie while sipping on some wine or chugging a beer. We're also going to sell hard-to-find candies, but I'm not sure which ones yet, because they're just so darned hard to find! Sorry, I couldn't resist. We're going to offer fresh pastries and baked goods from local bakeries, and gourmet coffee from a popular coffeehouse just down the street. In lieu of serving butter on our popcorn, we're going to offer a wide variety of specialty seasonings, so people can flavor to taste, and vice versa. We're going to serve our popcorn in bags - small, medium, large, and DAMN THAT'S HUGE, which will be served in a paper grocery bag. The DAMN THAT'S HUGE will be more of a novelty than anything else, but whatever gets people to the concession area is fine by me.<br/><br/>Uh... what else. I'm going on and on, aren't I? I better wrap things up, because I still have a lot of work to do on our business plan... and some real work to do too. The moral of today's post is that theaters need your money, so when you go see <i>Harry Potter</i> this weekend, make sure you remember to stop by the concession area and buy a little something to help keep your theater afloat. Unless, of course, you're seeing the movie at a huge, nameless, faceless, corporate-run MEGA-multiplex... in which case you should stop by your local convenience store, pick up some Dots, and smuggle them in under your shirt.<br/><br/><i>Let's all go to the lobby,<br/>Let's all go to the lobby,<br/>Let's all go to the lobby,<br/>And have ourselves a snack.<br/><br/>Please buy our overpriced Twizzlers,<br/>Please buy our overpriced Twizzlers,<br/>Please buy our overpriced Twizzlers,<br/>And something, something, something, something snack.</i>",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-06-03T23:01:33.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "R",
      "body": "Hi! It is quite a coincidence that we both posted about theater advertisements . . . thanks for visiting my corner of the world. <br/><br/>Nice blog, I like the layout immensely.<br/><br/>Here is a great source for \"hard to find\" retro candy. It has all the great stuff that I remember, maybe it is what you are looking for:<br/><br/>http://store.yahoo.com/candy-crate/candywarehouse.html",
      "created_at": "2004-06-11T23:17:02.000Z"
    },
    {
      "author": "Chuck",
      "body": "I've got nothing, as far as websites about candy are concerned; but I did want to thank you for checking out caliblog.com. We appreciate the audience. As for your site, I love it. I've read every post, so keep 'em coming. If we ever finish a movie, maybe we can premiere it at your theatre. One question though, is there really a Midwestburg?",
      "created_at": "2004-06-11T23:17:31.000Z"
    },
    {
      "author": "em.",
      "body": "its an interesting blog at least...<br/>being in a college town with absolutely zero interest in art/foreign films (monster was here for a whole of 3 days!) i can only wish that midwestberg is somehow miraculousy the same midwestberg im in.<br/>anyway...<br/>in terms of candy, have you tried <a href=\"http://groovycandies.com\">groovycandies</a>?",
      "created_at": "2004-06-11T23:18:32.000Z"
    },
    {
      "author": "L",
      "body": "Australian ticket prices...<br/>$11.50 concession<br/><br/>...i found an old skool theatre <br/>$3 concession",
      "created_at": "2004-06-11T23:19:01.000Z"
    },
    {
      "author": "Otto",
      "body": "What do you mean 'smuggle them under your shirt'? Here in Brazil everybody thought it was indeed forbidden to take outside candy, soda, etc. into the theater, until someone went on national television saying it was just fine, legally speaking, and people started shamelessly bringing their own big bags of whatever to the movies. Not everyone, though, since you said they profit almost exclusively out of that stuff and there is still a big and ever-growing number of rooms out there (mostly the same big-ass-mega-corporate-blockbuster-showing ones you mentioned).",
      "created_at": "2004-06-11T23:21:21.000Z"
    },
    {
      "author": "The Hey",
      "body": "It's so true about the advertisments being an nessasary evil for exhibition these days. I explain this to my friends but they are still pissed off by it. At least Regal is taking a different approach to this and is delevoping more \"infotainment\" advertising before a feature in some of the more modern locations.<br/><br/>I do not know if this is still true or not anymore as I have not been in the business for a few years, but there was a time that Disney in it's animation heyday (Aladdin, Lion King) was asking for 100% of ticket sales PLUS a small piece of the concession gross.<br/><br/>As for candy selection, the mega chains (for which I used to work for) would choose a candy that either made a person thirsty so they would buy a drink (good examples are M&Ms, Sour Patch Kids, Sno Caps and Raisinetts) or something that didn't last long in a customers mouth (almost anything chocolate). The select items for a theatre's \"Pic n Mix\" would be the above as well as \"heavy\" candy (like Swedish Fish and assorted Gummy Animals) that would make the weight of the bag higher than the customer expects. Forbidden to sell is candy that you could make last a least half the movie like Juicyfruits, Gobstoppers and ANY hard candy.<br/><br/>As theatres of course need to do all this for survive (espically now with all the overbuilding), but there are \"tricks of the trade\" that help it along.<br/><br/>-hey",
      "created_at": "2004-06-11T23:21:50.000Z"
    },
    {
      "author": "lsubatgirl",
      "body": "Have you thought about daquiri machines? In New Orleans they have theatres that sell beer, daquiris, and frozen jack and cokes and it is very popular.",
      "created_at": "2004-06-11T23:22:24.000Z"
    },
    {
      "author": "Rick",
      "body": "Great blog... I've dabbled a bit in the theater buisness. I think that one of the biggest draws is having REAL butter on the popcorn. People come just for that. Plus it being an art house/2nd run theater makes a big difference.<br/><br/>Another nearby theater: <a href=\"http://www.blogger.com/r?http%3A%2F%2Fwww.laurelhursttheater.com%2Fhome.html\">The Laurelhurst</a> serves beer, wine, and best of all - Pizza!<br/><br/>So for $20 you can get dinner, movie, and a date for two!",
      "created_at": "2004-06-11T23:23:08.000Z"
    },
    {
      "author": "Brian",
      "body": "I followed a few years at a typical regional-circuit mallplex with a couple years at an art-house multiplex and one of the things that I noticed was that the art-house crowd was much less willing to shell out for concessions. Concessions dollars-per-ticket were best when we had action/horror or children's movies at the mall. I hope the beer-and-wine trick helps to compensate for that, and that the attendant licensing headaches keep it worthwhile. Good luck man, and don't use that nasty vegetable oil.",
      "created_at": "2004-06-11T23:23:31.000Z"
    }
  ],
  "categories": [
    {
      "id": 2,
      "name": "Business"
    },
    {
      "id": 4,
      "name": "Informative"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
