{
  "id": 90,
  "title": "SPECIAL: Slash Pictorial",
  "body": "<b>From Dan to Slash in 10 minutes flat</b><br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/16_phase1.jpg\" width=\"400\"><br/>This is what I typically look like on any given day of the week. Bright-eyed, bushy-tailed, and wearing mocassins.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/17_phase2.jpg\" width=\"400\"><br/>The first step on the road to becoming Slash is removing my hat.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/18_phase3.jpg\" width=\"400\"><br/>Step 2 is more of a mental process - to become Slash on the outside, I must first rid my psyche of all things non-Slash. Does Slash smile and give a thumbs up all the time? No. Slash only has one expression, and this is it.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/19_phase4.jpg\" width=\"400\"><br/>It took me 10 minutes to squeeze into these pleather pants, and 15 to get them off. Note how my skin gets progressively paler as my clothes grow darker.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/20_phase5.jpg\" width=\"400\"><br/>How SWEET is this shirt? It's actually the product of two shirts sewn together by the lovely and talented Nicole.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/21_phase6.jpg\" width=\"400\"><br/>Here's a detail shot of the shirt. In reality, I doubt Slash would ever wear a shirt with a picture of Axl brandishing his crotch in a pair of red leather hot pants, but come on... this shirt is AWESOME!<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/22_phase7.jpg\" width=\"400\"><br/>The safety pins held my sleeves up to ensure optimal bicep exposure.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/23_phase8.jpg\" width=\"400\"><br/>As you can see, the original shirt's color was more navy than black, which, in my opinon, makes the shirt even cooler.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/24_phase9.jpg\" width=\"400\"><br/>Here's a nice shot of my virgin bicep - sans tattoo. Please take a moment to notice how the 4 moles on my arm form a perfect arrow pointing down to my pleather pants.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/25_phase10.jpg\" width=\"400\"><br/>Here I am using a yellow dish sponge to apply my fake tattoo. My arms smelled like taco meat for the rest of the evening... just like Slash!<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/26_phase11.jpg\" width=\"400\"><br/>Here's tattoo #1 - the burning rose.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/27_phase12.jpg\" width=\"400\"><br/>And here's tattoo #2 - the big rose with decorative lines placed between the moles that form an arrow pointing down to my pleather pants.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/28_phase13.jpg\" width=\"400\"><br/>Here I am with my new tattoos and brown socks.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/29_phase14.jpg\" width=\"400\"><br/>Add boots, which, like the pleather pants, were far too small.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/30_phase15.jpg\" width=\"400\"><br/>The wrist studs help accentuate my bad ass-ness.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/31_phase16.jpg\" width=\"400\"><br/>With my black aviator glasses and 5-day beard stuble I could almost pass for George Michael or...<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/32_phase17.jpg\" width=\"400\"><br/>Benny, the gay biker bar boy with a double chin!<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/33_phase18.jpg\" width=\"400\"><br/>My Benny joke didn't go over well with Bogart, so I have to take a moment to explain it to him in more detail.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/34_phase19.jpg\" width=\"400\"><br/>This is actually a jumbo afro wig that I bundled together at the top to make it a tad less afro-like. You know, without my hat on, I look a little like a <a href=\"http://www.abcgallery.com/M/monet/monet119.html\" target=\"_blank\">Monet haystack</a>. Bogey is still confused about the Benny joke.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/35_phase20.jpg\" width=\"400\"><br/>The top hat fits perfectly over the fro bundle and pushes just enough hair over my face to obscure it from view. Please note the HUGE chunk of fro hair hanging above my left sholder<br/>.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/36_phase21.jpg\" width=\"400\"><br/>Here's a detail shot of the top hat. We used a strip of material from the Axl shirt and stapled foil-covered cardboard circles to it. Nothing funny about that.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/37_phase22.jpg\" width=\"400\"><br/>With the addition of the fake cigarette, the costume in now complete... complete with a GIANT hair chunk over my left shoulder, that is. Is it just me, or did it grow since the last picture?<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/38_phase23.jpg\" width=\"400\"><br/>Here's a close-up of one of the fake cigarettes I used. Quite realistic, eh? They even puffed out smoke when you blew into them, but I used up all the fake smoke within 30 seconds of receiving them in the mail.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/39_phase24.jpg\" width=\"400\"><br/>Here I am, as Slash, playing air guitar. There's two things you should notice about this picture: 1) Although I look more like I'm holding an imaginary shotgun than a guitar, I DID manage to form the C chord with my left hand. 2) There's an unusal spectral-looking target hovering over my crotch.<br/><br/><b>Action shots</b><br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/40_action1.jpg\" width=\"400\"><br/>Here's Slash chilling out on a bean bag in a dungeon. Please note the second cigarette stashed in my hair and the fact that my right leg is twice as long as the rest of my entire body.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/41_action2.jpg\" width=\"400\"><br/>Slash. Dark. Fog. Coolness.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/42_action3.jpg\" width=\"400\"><br/>Here's Slash with an unidentified Boston Red Sox fan.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/43_action4.jpg\" width=\"400\"><br/>Slash sits down to a meal of beer and stew.<br/><br/><b>Company Costume Contest</b><br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/44_contest2.jpg\" width=\"400\"><br/>Slash arrives to the company costume contest and surveys the area for likely competition.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/45_contest3.jpg\" width=\"400\"><br/>Slash makes his way to the front of the cafeteria, while the women talk about his unnaturally taut bottom.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/46_contest4.jpg\" width=\"400\"><br/>Slash stops for a moment to flex his buttocks.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/47_contest5.jpg\" width=\"400\"><br/>Slash knows that eating during the costume judging is strictly prohibited, but Slash doesn't care. It's a CAFETERIA for Christ's sake!<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/48_contest6.jpg\" width=\"400\"><br/>This super close-up zoom shot catches Slash as he slips out through the back to get more food.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/49_bjork1.jpg\" width=\"400\"><br/>I'd like to take a moment to thank Bjork, my little Swan Princess, for being patient enough to take a bunch of silly pictures of me.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/50_bjork2.jpg\" width=\"400\"><br/>This picture doesn't do justice to Nicole's entire costume. It's all handmade, except for the wig, which Nicole pinned up into 3 little Bjork bobs all along the back.<br/><br/><img src=\"http://moxie.danchilton.com/pix/grum/51_theEnd.jpg\" width=\"400\"><br/>THE END<br/>",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-11-01T00:14:51.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Dave",
      "body": "dude. i could've done without that last shot. time to load up on booze and sleeping pills.",
      "created_at": "2004-11-01T05:02:38.000Z"
    },
    {
      "author": "bjork24",
      "body": "Dave: you know you liked it.",
      "created_at": "2004-11-01T05:24:03.000Z"
    },
    {
      "author": "Dave",
      "body": "i did.",
      "created_at": "2004-11-01T05:36:56.000Z"
    },
    {
      "author": "whitty",
      "body": "okay, i went through the slash pictorial with three people watching over my shoulder and my sister on the phone.  please come to springfield soon.  we need something to do on a rainy halloween night.  sigh.",
      "created_at": "2004-11-01T05:38:21.000Z"
    },
    {
      "author": "Luke",
      "body": "And Slash didn't win?  Surely there is no justice in the world.  You were up against what, scarecrows, and it looks like Dorothy from The Wizard of Oz, a cafeteria lady in green, and some kind of weird clown?  Totally bogus!",
      "created_at": "2004-11-01T05:51:52.000Z"
    },
    {
      "author": "bjork24",
      "body": "Whitty: we'll be down before you know it!<br/><br/>Luke: me losing the costume contest was just another example of the man trying to keep Slash down! PATHETIC!",
      "created_at": "2004-11-01T06:25:01.000Z"
    },
    {
      "author": "Whittler",
      "body": "You was robbed! I like the transmogrification. Kind of like Jeff Goldblum in the Fly.",
      "created_at": "2004-11-01T09:16:52.000Z"
    },
    {
      "author": "John",
      "body": "You were starting to look like Rob Halford there for a while.<br/><br/>Not that I would recommend it, but if you really wanted to start \"being\" Slash, you would have shot up some heroin and banged some groupies. ",
      "created_at": "2004-11-01T13:23:02.000Z"
    },
    {
      "author": "Fyse",
      "body": "That last shot will haunt me for ever...",
      "created_at": "2004-11-01T14:06:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "Whittler: Thanks. It's funny you mention that, b/c parts of my costume kept falling off all night... just like Jeff Goldblum's ear!<br/><br/>John: I was going to draw heroin tracts on my arms and bring a \"loose groupie\" with me to the party, but Nicole wouldn't have it.<br/><br/>Fyse: you know you liked it.",
      "created_at": "2004-11-01T18:39:22.000Z"
    },
    {
      "author": "einahpets",
      "body": "Ah, the tears in my eyes. Tears of jealousy. Nic doesn't know how good she has it with that hot peice of ace.  ",
      "created_at": "2004-11-01T19:54:33.000Z"
    },
    {
      "author": "bjork24",
      "body": "Nicole bounces quarters off of it on a semi-regular basis.",
      "created_at": "2004-11-01T20:03:16.000Z"
    },
    {
      "author": "Dan Tobin",
      "body": "Your Slash costume is infinitely better than mine was in '96.  Although I didn't need no stinkin' wig for it back then.",
      "created_at": "2004-11-01T21:41:36.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Dan!",
      "created_at": "2004-11-01T21:43:50.000Z"
    },
    {
      "author": "Oz",
      "body": "Even Slash would have the fashion sense to know that black, pleather pants do NOT go with brown leather boots.  What's your problem, man?  You dissin' Slash?  You givin' him a bad name?<br/><br/>Luckily, you have made up for it with the Axel Rose crotch shot t-shirt.  Pure gold, baby, pure gold.",
      "created_at": "2004-11-01T22:37:11.000Z"
    },
    {
      "author": "bjork24",
      "body": "Oz: Come on, those boots weren't just BROWN, they were REDDISH brown!",
      "created_at": "2004-11-01T22:43:59.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Hey Dan; thanks for stopping by.  You made a great Slash...you even managed to pull off the herion-chic look!",
      "created_at": "2004-11-02T03:21:20.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks Stephanie!",
      "created_at": "2004-11-02T03:43:15.000Z"
    },
    {
      "author": "Rachel",
      "body": "Wow.  I am so in love with Dan and Nicole.  If only there was a picture of you playing a guitar on train tracks.  I can't believe you lost.  Nicole, you are my crafty hero.",
      "created_at": "2004-11-06T09:36:15.000Z"
    },
    {
      "author": "blacky",
      "body": "you gotta be kiddin' me !<br/>what was that ????<br/>what in the name of all what is good and pure is this clown trying to do ??<br/>HOW DARE YOU MUTTAFU***R ??<br/>if this teenager, all he wanted was to get some atention , believe me ,he's gotta do something better than trying to bring down someone else's image,<br/>'cuz that was was loser stuff,totally !!<br/>  feel free to answer me clown ,<br/>not just for nuthin i hate these damn faggots . . .  how can you be so shameless??",
      "created_at": "2005-05-21T09:33:05.000Z"
    },
    {
      "author": "M",
      "body": "Dude.......You are so pathetic!!",
      "created_at": "2005-07-03T20:10:22.000Z"
    },
    {
      "author": "Adam",
      "body": "Don't listen to them dude, I thought this was totally kick ass... Keep on keeping on Bro!",
      "created_at": "2005-10-24T15:47:32.000Z"
    },
    {
      "author": "Jez",
      "body": "hey yea...slash totally rules....and i am from england....o yea and blacky or who ever the fuck you r...shut the F*ck up you M*ther F*cker slash rules and it was only a competition so dont take it so serious you dick wad! lame brain cum stain...hey that rhymes and you know it does!<br/>bitch.....keep on rocking there Dan...<br/>from Jez",
      "created_at": "2006-03-12T03:07:08.000Z"
    },
    {
      "author": "Emilie",
      "body": "Haha, this was just fuckin' funny! Could be because I'm soooo tired.. It's in the middle of the night here right now, and I saw Guns yesterday!! I have the right to be tired.<br/><br/>But like I said, you rock, man!",
      "created_at": "2006-06-28T01:47:20.000Z"
    },
    {
      "author": "Rebecka",
      "body": "Haha!omg,so funny rofl :D<br/>fuckin great!and all your little comments under each pic,hahaha :D<br/>I saw Guns yesterday too,with Emilie. Fuckin great show,even if Slash wasn't there. ;)<br/>",
      "created_at": "2006-06-28T04:12:02.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 9,
      "name": "Pictures"
    },
    {
      "id": 13,
      "name": "Other job"
    }
  ]
}
