{
  "id": 94,
  "title": "Going all in...",
  "body": "When the banker asked me if Nicole and I would be able to come up with $10,000 in seed money to help secure the loan, I answered without hesitation. <i>Yes, we can come up with $10,000.</i> I wasn't lying either. If Nicole and I scrounge up all of our savings and all of the money from my freelance work and all the money between our couch cushions and break a couple piggy banks, we can cover the seed capital on our own, which is something that is very important to us. It's <i>our</i> idea, <i>our</i> business, <i>our</i> ass on the line, so it should be <i>our</i> money. I'd feel moochy if it were any other way.<br/><br/>But, belive you me, coming up with $10,000 wasn't easy. We literally have to push all our chips into the middle of the table and hope for the best. We will have no savings whatsoever to rely on, which is unfortunate, because we'd like to make a few changes to the house we'll be moving into in Springfield. At this rate, we won't even have enough money to buy a can of paint! If Nicole, Bogey, or I get sick, we'll just have to lick our wounds and roll around in aloe vera until we have enough money to buy some mediocre health insurance.<br/><br/>So, I think we're going to ask for a couple buckets of paint for Christmas. Paint and a table for our kitchen. And, if there's enough good will going around, maybe a bed too. Ha ha. Now I'm just fishing for pity points. We don't really need a bed. Just sheets and pillows.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-11-03T21:00:38.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "einahpets",
      "body": "I think everyone should register for all occassions. That way, you can go to target and pick out what you want. Darn it Dan. Don't ask for that for Christmas! I already bought you a gift! ",
      "created_at": "2004-11-03T21:14:03.000Z"
    },
    {
      "author": "bjork24",
      "body": "Can your gift be used to eat and/or sleep on?",
      "created_at": "2004-11-03T21:15:11.000Z"
    },
    {
      "author": "einahpets",
      "body": "No, but you will be able to use it for when you are in Springfield. And be the envy of the town.",
      "created_at": "2004-11-03T21:55:21.000Z"
    },
    {
      "author": "bjork24",
      "body": "It's a giant cashew chicken fork, isn't it.",
      "created_at": "2004-11-03T21:56:51.000Z"
    },
    {
      "author": "Oz",
      "body": "I guess this is what they mean by putting your money where your mouth is.  You got balls.  I know I'm not the first to say it, but I can't think of a better way to put it.",
      "created_at": "2004-11-03T22:09:22.000Z"
    },
    {
      "author": "bjork24",
      "body": "I hope my mouth doesn't get me in trouble.",
      "created_at": "2004-11-03T22:30:16.000Z"
    },
    {
      "author": "Stephanie",
      "body": "How about cookies?  I can ship really tasty cookies...",
      "created_at": "2004-11-03T22:49:16.000Z"
    },
    {
      "author": "bjork24",
      "body": "Stephanie: we might take you up on that.",
      "created_at": "2004-11-03T22:50:14.000Z"
    },
    {
      "author": "Stephanie",
      "body": "Ask around; I make the best damn cookies you'll ever taste...check with http://jlynnsmith30.blogspot.com/ or http://eln2004.blogspot.com/...or my buddy Tim, who writes for Goldmine magazine.<br/><br/>And I *do* take requests...",
      "created_at": "2004-11-03T23:17:06.000Z"
    },
    {
      "author": "bjork24",
      "body": "You make a compelling case.",
      "created_at": "2004-11-04T00:03:19.000Z"
    },
    {
      "author": "Aaron",
      "body": "Where did you guys find a place?",
      "created_at": "2004-11-04T00:43:30.000Z"
    },
    {
      "author": "bjork24",
      "body": "Over on the Southwest side of town. Close to Kansas and Sunshine... about 7 minutes from the theater.",
      "created_at": "2004-11-04T01:03:25.000Z"
    },
    {
      "author": "whitty",
      "body": "You can totally have some of my paint.  My mom made me store all our extra paint from when we remodeled my under kitchen sink.  There isn't even enough room for my dishwasher soap.  I would love to get rid of it.  And damn, I just sold my kitchen table.",
      "created_at": "2004-11-04T01:27:13.000Z"
    },
    {
      "author": "bjork24",
      "body": "Whitty: you're too kind.",
      "created_at": "2004-11-04T01:30:24.000Z"
    },
    {
      "author": "Aaron",
      "body": "Over thereabouts by Elfindale? There's a cool little antique store over there at the corner of Fort and Sunshine that is chock-full of mod type stuff. Last time I was there they had one of those egg chairs that spins around.",
      "created_at": "2004-11-04T08:00:06.000Z"
    },
    {
      "author": "bjork24",
      "body": "Cool! We'll have to check that out.",
      "created_at": "2004-11-04T08:28:24.000Z"
    },
    {
      "author": "John",
      "body": "I just threw out the two half-full cans of paint in the basement, but I do have a slightly used paint brush and a brand new piece of sand paper. Want 'em?",
      "created_at": "2004-11-04T09:13:56.000Z"
    },
    {
      "author": "bjork24",
      "body": "Hmm, I might take you up on that offer, John.",
      "created_at": "2004-11-04T09:16:03.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
