{
  "id": 96,
  "title": "Scenario rhymes with Cheerio, which is good thing, especially considering my addict-like dependence upon those scrumptious little toasted O's.",
  "body": "So I've been thinking, \"what would really happen if the Moxie went bust?\" As much as I hate to consider this option, it's something that every business owner, large or small, needs to do from time to time. Develop an exit strategy.<br/><br/>As you may recall, both Nicole’s and my parents have been gracious enough to act as guarantors for our loans, which relieves a lot of the stress of having our loan approved. On the flip side, their involvement also adds a certain amount of pressure that having a less emotionally-involved investor would not. If the Moxie goes down in flames, the last thing I want to happen is for my family to get pulled down with it. Regardless of who guarantees or co-signs the loan, I want the burden of success to fall squarely upon my shoulders.<br/><br/>Now, with that being said, let’s look at the numbers:<br/><br/>Believe it or not, our loan is not much more than what we’d be borrowing if Nicole and I were purchasing our first home. Here’s how the numbers break down:<br/><br/>1. Equipment - $35,000<br/>2. Working capital - $15,000<br/>3. Everything else - $25,000<br/><br/>That brings our total loan package to $75,000, which, after our initial capital injection of $10,000, will drop to $65,000. Our monthly loan repayment will be somewhere between $1,100 and $1,400, which is roughly the cost of a nice apartment in a large city (with the exception of San Francisco and New York City, where upside-down laundry baskets typically rent for as high as $2,000 to $2,500 per month).<br/><br/>So, let’s assume we pay back $13,000 over the course of our first year and then go bust. We sell our equipment back to the vendor at a little less than 50% depreciation ($17,000), and now we’re looking at a loan repayment of $35,000, which we can either refinance or continue paying at our predetermined payments and finish a year or two earlier than our planned seven year term. Either way, our rent is cheap enough in Springfield that it shouldn’t be too difficult for Nicole and I to find jobs and pay off the remainder over the course of next 3 to 4 years. Once the loan is paid off, we move on with our lives. Simple as that.<br/><br/>We may have to live like peasants while we’re paying back the loan, but that’s the cost you have to pay to follow your dreams. How LAME did that sound. Of course, all of this is a moot point since we’re going to be spectacularly successful, I’m going to pen three novels and five screenplays during my downtime, and then we’re going to sell the Moxie to Landmark theatres and retire to Iceland. Yippee!",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-11-05T22:26:08.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "justin",
      "body": "You said \"bust\".",
      "created_at": "2004-11-05T22:33:05.000Z"
    },
    {
      "author": "bjork24",
      "body": "I also said \"Cheerio\", which is good thing, especially considering my addict-like dependence upon those scrumptious little toasted O's.",
      "created_at": "2004-11-05T22:34:10.000Z"
    },
    {
      "author": "WhimsyChick",
      "body": "\"we’re going to be spectacularly successful, I’m going to pen three novels and five screenplays during my downtime, and then we’re going to sell the Moxie to Landmark theatres and retire to Iceland. Yippee!\"<br/><br/>AND you're going to remember all the little people who were here cheering you on. Right? RIGHT???",
      "created_at": "2004-11-05T22:46:44.000Z"
    },
    {
      "author": "bjork24",
      "body": "Absolutely!",
      "created_at": "2004-11-05T22:49:46.000Z"
    },
    {
      "author": "Einahpets",
      "body": "I like shredded mini-wheats. If you guys are splendidly successful, how about giving the theaters in Ann Arbor a run for its money and move up there first? You'll love the weather!",
      "created_at": "2004-11-05T23:05:05.000Z"
    },
    {
      "author": "Dave",
      "body": "if you go bust you take that equipment, sell it off for 17,000$. you can then take that 17,000$ and use it to buy a kilo of cocaine which you can reprocess into crack. and sell on the streets at a huge profit, repaying the loan in no time.",
      "created_at": "2004-11-05T23:29:19.000Z"
    },
    {
      "author": "bjork24",
      "body": "Einahpets: that's always a possibility.<br/><br/>Dave: why I didn't think of that before, I have no idea. It's perfect!",
      "created_at": "2004-11-06T00:09:07.000Z"
    },
    {
      "author": "Aaron",
      "body": "Speaking of going down in flames, there is a new steakhouse a block away from the future Moxie site called Flame. Wow!",
      "created_at": "2004-11-06T02:17:42.000Z"
    },
    {
      "author": "bjork24",
      "body": "Aren't they owned by Bijan's?",
      "created_at": "2004-11-06T02:18:45.000Z"
    },
    {
      "author": "whitty",
      "body": "Aren't all the resturants downtown owned by bijan's?<br/><br/>Crack isn't selling in spfld, meth is the way to go.",
      "created_at": "2004-11-06T03:30:22.000Z"
    },
    {
      "author": "Oz",
      "body": "Your plan sounds good.  The only thing that worries me is that you thing scenario rhymes with Cheerio.  It's not sceneerio.  Nor is it Chario.  It's like saying fear rhymes with stair.  But other than that, you go boy.",
      "created_at": "2004-11-06T04:54:04.000Z"
    },
    {
      "author": "bjork24",
      "body": "Whitty: in 5 years downtown will be nothing but Bijan's, Mudhouse, and Moxie.",
      "created_at": "2004-11-06T08:20:02.000Z"
    },
    {
      "author": "bjork24",
      "body": "Oz: you pronounce scenario realy funny like.",
      "created_at": "2004-11-06T08:20:31.000Z"
    },
    {
      "author": "Brandon",
      "body": "...if anyone is in the central or southern ohio area, you all are invited to cruise to my small town to catch the broadway production of West Side Story.  I personally play Tony, and i'll get you some nice seats if you e-mail me with your request.  6 bucks for adults, 4 for students/senior citizens.  Fri, Sat, Sun, Nov. 12, 13, 14.  tickets also sold at the door.  the first two shows start @ 7:30, and the sunday matenee's at 2:30.  the place is \"Washington Court House, OH\" -- about 40 mi. south-southwest of columbus. just an offer for locals or whatever.",
      "created_at": "2004-11-06T08:35:47.000Z"
    },
    {
      "author": "bjork24",
      "body": "Brandon: wow. That comment really means a lot.",
      "created_at": "2004-11-06T09:09:55.000Z"
    },
    {
      "author": "Newell",
      "body": "I always thought scenario rhymed with banana nut bread.",
      "created_at": "2004-11-07T10:10:59.000Z"
    },
    {
      "author": "Newell",
      "body": "Oh, and speaking of addictions: I'm addicted to Altoids. I love the things. I go through a single tin in about a day and a half. Someone once asked me if there are any side effects to my excessive consumption. I said, \"I don't know... does having it smell like wintergreen when you pee count as a side effect?\" Wintergreen Altoids are my favorite. Peppermint be damned. ",
      "created_at": "2004-11-07T10:14:29.000Z"
    },
    {
      "author": "bjork24",
      "body": "I can make a tin of cinnamon altoids last for nearly 3 months.",
      "created_at": "2004-11-07T21:53:23.000Z"
    },
    {
      "author": "nicholas",
      "body": "i don't think you're going to need to worry about an exit plan. i've been talking you up, and everyone here is about to burst at the seams in anticipation. we mentioned you guys at the film alliance meeting last week. by-the-by, you might think about joining as a supporter once the business gets going. then, your theater can be on the film festival circuit. http://springfieldarts.org/film",
      "created_at": "2004-11-07T23:24:50.000Z"
    },
    {
      "author": "bjork24",
      "body": "Thanks for the good news, Nick. I thought you moved back to NYC?",
      "created_at": "2004-11-08T04:28:18.000Z"
    },
    {
      "author": "Newell",
      "body": "I'm not so big on the cinammon altoids. They're not as... minty as the rest. And to me that kind of defeats the purpose of eating something that has been labelled, \"the curiously strong mint\".",
      "created_at": "2004-11-08T10:11:16.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
