{
  "id": 97,
  "title": "Growing a beard",
  "body": "I haven't shaved (or is it shaven?) for almost 2 weeks, so I now have a fairly heavy beard clinging to my face. It's itchy and feels like a brillo pad, but I love it SOOOO much. Which brings me to my second point: I almost had a nervous breakdown on Friday... special emphasis on the word <i>almost</i>.\r\n\r\nThroughout the long process of getting the Moxie up and on its feet, our project has faltered on numerous occasions. The project has seemed doomed just as many times as it's seemed a shoe-in, but, as you can probably surmise, the feelings of doom were much easier to handle before we gave our resignation notices. While Friday's revelation doesn't shelve the project forever, it does, once again, throw the fate of the Moxie to the wayward winds... may it fall where it might.\r\n\r\nHere's the lowdown:\r\n\r\nAs you know, we were all but golden after our parents agreed to act as guarantors for the loan. Nicole and I had to pony up $10,000 of our own money, but the loan looked to be all but done. Then the bottom fell out. The bank informed me that someone was going to need to pledge liquefiable assets to secure the loan. Apparently, none of the equipment we were buying with the money could be used as collateral, nor were our parent's signed confirmations good enough to secure the loan. The bank now needed someone to PLEDGE liquefiable assets (i.e. house, cars, boats, horses, etc.) that were worth at least $40,000 so they could have something to repossess immediately on the off-chance of a default.\r\n\r\n*moan*\r\n\r\nI didn't expect either set of parents to do this. In fact, I felt that the demand for additional assets was border-line ridiculous. It's not like we're asking for $750,000 to buy and sell swamp land in Florida! All we need is $75,000, nearly half of which is being used to buy tangible, liquefiable theater equipment. If Nicole and I were applying for a loan for our first house, I guarantee we'd be able to pre-qualify for a $80,000 to $90,000 mortgage... without the need for our parents to co-sign. If Springfield were more of a seller's market, I'd suggest we buy a house and then immediately turn it around and use the money for the theater.\r\n\r\nAs I expected, neither set of parents was willing to pledge additional assets. My mom has been a banker for nearly 30 years – and before you ask, her bank is too small to deal with commercial loans, which is why we didn't go through her in the first place - so she called the SBA loan officer and assured him that her signature would be sufficient to guarantee that they would not default on the loan. No dice. The SBA officer informed her that with a business like ours, someone had, had, HAD to pledge assets totaling up to $40,000. My mom felt terrible, but she had done all she could.\r\n\r\nThat's when I started to lose it. I've dealt with a lot of stress working with this project over the last nine months, but it had never hit me like this. When I read my mom's e-mail, my back and head immediately started to throb. It felt like someone had poured concrete into my body and it was slowly hardening above my lumbar region. I went home for lunch, laid on the bed, and didn't move a muscle for nearly an hour. That hour was the lowest point I've experienced throughout this entire process. Everything felt like it was slipping away at that point. If our parents couldn't secure the loan, who could? Nicole and I couldn't. It seemed like the Moxie was slipping away.\r\n\r\nHowever, on the urging of Nicole and her mom, I decided to write a stunningly desperate e-mail to Brian and plead for his advise. After several exchanges, we came to the tentative agreement of lowering the loan package to $65,000 (35 for equipment, 25 for everything else, 5 for working capital). In this arrangement, Nicole and I still supply the required injected capital, our parents will continue to act as guarantors, but no pledging will be required. However, this doesn't mean we're golden. Brian still has to run th\r\ne new arrangement by the SBA loan officer, who then has to submit it to the SBA for approval. If we get rejected during either one of those steps, we're back to square one.\r\n\r\nMy last e-mail with Brian was on Friday. I'm patiently awaiting his next correspondence, which could come at any time.\r\n\r\nBut as I was saying... I love my beard.\r\n",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-11-08T23:02:47.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Fyse",
      "body": "Fingers crossed for you.\r\n\r\nOh, and we are gonna need pictures Dan. I checked back to the ones on Nicole's site, but they don't show the beard in its full majesty.",
      "created_at": "2004-11-08T23:10:15.000Z"
    },
    {
      "author": "bjork24",
      "body": "I'll wait until I get ready to shave it off, then I'll take pictures of it.",
      "created_at": "2004-11-08T23:17:21.000Z"
    },
    {
      "author": "Luke",
      "body": "Jeez man.  Will there be no end to your torture?  Here's hoping for the best!",
      "created_at": "2004-11-08T23:44:09.000Z"
    },
    {
      "author": "Luke",
      "body": "I've decided that since I've never been to Sprinfield, when The Moxie opens I will have to take a short vacation from New Orleans just to check out the theater and the city.\r\n\r\nWhen I get there I would like to walk up to the box office or concession stand and shake the hands of Dan and Nicole.  When this happens I will commend both of you for having the moxie to see this project all the way to the end.\r\n\r\nHow's that for motivation to keep going?",
      "created_at": "2004-11-08T23:58:40.000Z"
    },
    {
      "author": "Oz",
      "body": "You'll figure out a way to do it.  You have very few other choices, right?  If worse comes to worse, do the buy a house and sell it thing (you're completely right that you can get a loan for a house without all that bullshit).  It might take a couple months longer, but if your Moxie partners are willing to wait it out a bit longer, you can make it work.",
      "created_at": "2004-11-09T00:00:27.000Z"
    },
    {
      "author": "bjork24",
      "body": "Luke: thanks for the shot of motivation. I'll make sure that Nicole and I are both working when you show up.\r\n\r\nOz: I have a sneaking suspicion that it may not be that easy. But who knows? Let's hope it doesn't come to that.",
      "created_at": "2004-11-09T00:04:43.000Z"
    },
    {
      "author": "Oz",
      "body": "I never said it would be easy, Dan.  Just that you would figure it out.  You've figured out everything else.  You'll figure this out too.",
      "created_at": "2004-11-09T00:26:30.000Z"
    },
    {
      "author": "bjork24",
      "body": "As always, thanks for support, Oz.",
      "created_at": "2004-11-09T00:27:37.000Z"
    },
    {
      "author": "Einahpets",
      "body": "Well, if worse DOES come to worse, I'll buy a house here in T-Town and then I'll pledge my ass. Oh, assets. Don't tell Joel this plan though!",
      "created_at": "2004-11-09T01:06:29.000Z"
    },
    {
      "author": "whitty",
      "body": "If the worst comes (which it won't) I will personally make you a \"I tried to get a commercial loan and all I got was this lousy beard\" shirt.  Let's hope it doesn't come to that, my t-shirts tend to really suck.",
      "created_at": "2004-11-09T01:07:36.000Z"
    },
    {
      "author": "bjork24",
      "body": "Steph: thanks. I won't tell Joel.\r\n\r\nWhitty: if we get the loan, can I still have the shirt?",
      "created_at": "2004-11-09T01:08:44.000Z"
    },
    {
      "author": "whitty",
      "body": "One sucky t-shirt coming up.  I will bring it to Moxie's opening night!",
      "created_at": "2004-11-09T02:34:23.000Z"
    },
    {
      "author": "bjork24",
      "body": "Woo hoo!",
      "created_at": "2004-11-09T02:35:34.000Z"
    },
    {
      "author": "nicole",
      "body": "You can get a glimpse of Dan's beard in the making on our \"shakeskin\" faces (on my blog). These pictures were taken last Thursday.",
      "created_at": "2004-11-09T06:00:12.000Z"
    },
    {
      "author": "Newell",
      "body": "Have you considered playing the lottery?",
      "created_at": "2004-11-09T06:24:12.000Z"
    },
    {
      "author": "John",
      "body": "What is it they say? Nothing worthwhile is ever easy? Hell, I don't know... I don't even know who \"they\" are. Forget I said that.\r\n\r\nI do hope to see your hirsute epidermis on Shakeskin though.",
      "created_at": "2004-11-09T07:22:09.000Z"
    },
    {
      "author": "bjork24",
      "body": "Nic: my beard is barely visible in those pictures. Now everyone thinks I'm a wimp. Aw man!\r\n\r\nNewell: yes. I have considered it.\r\n\r\nJohn: My facial skin isn't loose enough to make worthwhile shakeskin photos.",
      "created_at": "2004-11-09T07:32:46.000Z"
    },
    {
      "author": "John",
      "body": "Be patient... Loose skin comes with age, my friend.",
      "created_at": "2004-11-09T22:50:14.000Z"
    },
    {
      "author": "bjork24",
      "body": "*sigh* I wish I were a grown-up RIGHT NOW.",
      "created_at": "2004-11-09T22:51:40.000Z"
    }
  ],
  "categories": [
    {
      "id": 8,
      "name": "MOXIE"
    }
  ]
}
