{
  "id": 98,
  "title": "SBA Oddity",
  "body": "Moxie Blog to SBA<br/>Moxie Blog to SBA<br/>Read our business plan and put your helmet on<br/><br/>Moxie Blog to SBA<br/>Approve our loan and we'll be gone<br/>Check financials and may Dan's blog be with you<br/><br/>This is Moxie Blog to SBA<br/>You've really caused me stress<br/>And the readers want to know if the loan's okay<br/>Now it's time to write Dan an e-mail today<br/><br/>\"This is SBA to Moxie Blog<br/>I'm looking through the loan<br/>And I'm reading in a most peculiar way<br/>And your graphs look very excellent today\"<br/><br/>\"For here am I sitting in my small cube<br/>Far above the floor<br/>Lunch time is at noon<br/>And I smell like a baboon\"<br/><br/>\"Though I've read one hundred thousand words<br/>I'm feeling very good<br/>And I think my red pen knows which box to mark<br/>Tell your wife hello and Bogart not to bark\"<br/><br/>Moxie Blog to SBA<br/>Your e-mail's down, there's something wrong<br/>Will you write me, SBA?<br/>Will you write me, SBA?<br/>Will you write me, SBA?<br/>Will you....<br/><br/>\"Here am I sitting in my small cube<br/>Far above the floor<br/>Lunch time is at noon<br/>And I smell like a baboon\"",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-11-10T20:36:39.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Oz",
      "body": "Dan, you're so cute.  I'm glad to see a post, though.  I came here with every intention of contributing a threatening comment to your previous post, demanding something, anything!  Even an update on your beard!",
      "created_at": "2004-11-10T21:09:08.000Z"
    },
    {
      "author": "bjork24",
      "body": "My beard is doing good. Thanks for asking!",
      "created_at": "2004-11-10T21:11:22.000Z"
    },
    {
      "author": "Lor",
      "body": "You should record the song as an MP3, then we can all download it and send it to the SBA. Yeah, it'd probably annoy the SBA to the point they reject the loan, but you could become some sort of musical superstar and become as big a star as Slash.<br/><br/>Imagine it, some random person with a blog posting up Halloween pictures excitedly, of them dressed up as \"Dan\"...",
      "created_at": "2004-11-10T21:36:13.000Z"
    },
    {
      "author": "bjork24",
      "body": "That would be pretty sweet, wouldn't it.",
      "created_at": "2004-11-10T22:02:34.000Z"
    },
    {
      "author": "nicole",
      "body": "Diabetic!",
      "created_at": "2004-11-10T22:49:02.000Z"
    },
    {
      "author": "bjork24",
      "body": "Nicole, what on earth are you talking about?",
      "created_at": "2004-11-10T22:49:47.000Z"
    },
    {
      "author": "justin",
      "body": "Dianetics!",
      "created_at": "2004-11-11T00:21:31.000Z"
    },
    {
      "author": "bjork24",
      "body": "!!!",
      "created_at": "2004-11-11T00:24:02.000Z"
    },
    {
      "author": "Einahpets",
      "body": "Sweet. Diabetic. Just like candy. Whoooo.",
      "created_at": "2004-11-11T00:27:41.000Z"
    },
    {
      "author": "bjork24",
      "body": "This is getting bizarre.",
      "created_at": "2004-11-11T00:29:25.000Z"
    },
    {
      "author": "nicole",
      "body": "I guess only Stephanie gets me.",
      "created_at": "2004-11-11T00:37:04.000Z"
    },
    {
      "author": "bjork24",
      "body": "Twins.",
      "created_at": "2004-11-11T01:04:04.000Z"
    }
  ],
  "categories": [
    {
      "id": 6,
      "name": "Grum"
    }
  ]
}
