{
  "id": 99,
  "title": "Six LONG hours",
  "body": "<i>E-mail I wrote six hours ago:</i>\r\n\r\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\r\n\r\nGood morning,\r\n \r\nI'm just writing to check on the progress of the revised theater loan. If there's anything else either one of you need from me, please don't hesitate to ask. Thanks again for your help and cooperation throughout this rather extended process.\r\n \r\nSincerely,\r\nDan C.\r\n\r\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\r\n\r\n<i>E-mail I received back:</i>\r\n\r\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\r\n\r\nAt this point in the game, patience is a rare commodity.",
  "author_id": 1,
  "allow_comments": 1,
  "created_at": "2004-11-11T01:51:03.000Z",
  "author": "Dan",
  "comments": [
    {
      "author": "Dave",
      "body": "reading between the lines:\r\n\r\nDID WE GET IT? DID WE? WHY WON'T YOU ANSWER ME? ARRRRRRRG!!!!!!\r\n(thud)",
      "created_at": "2004-11-11T02:31:59.000Z"
    },
    {
      "author": "bjork24",
      "body": "Yeah, that sums it up quite nicely.",
      "created_at": "2004-11-11T02:33:33.000Z"
    },
    {
      "author": "whitty",
      "body": "Ahhh, have pity on your loan guys!  They might be buried under piles of money somewhere. Or busy making origami cranes out of $100 bills. Or rolling around in tubs of cash and giggling. Or filling the lining of their  car trunks with crisp $50 bills. The busy life of the loan guy, no time for emails!",
      "created_at": "2004-11-11T03:08:19.000Z"
    },
    {
      "author": "Oz",
      "body": "Dan, welcome to what my life is like for two weeks out of every four.  It sucks, sucks, sucks.  But you'll make it through because you have no choice.\r\n\r\nYou could always start up two more blogs.  Maintaining three of them does tend to help pass the time.",
      "created_at": "2004-11-11T03:30:28.000Z"
    },
    {
      "author": "Fyse",
      "body": "Waiting for news is awful. The other week, I was told I would receive really important news 'tomorrow', and ended up fretting for 12 days before finally being told. Not pleasant.",
      "created_at": "2004-11-11T04:10:51.000Z"
    },
    {
      "author": "bjork24",
      "body": "*moan*\r\n\r\nEven worse, tomorrow is Veteran's day. That means all the banks are C-L-O-S-E-D.",
      "created_at": "2004-11-11T05:59:17.000Z"
    },
    {
      "author": "Otto",
      "body": "My family also depends on big loans on a regular basis (businesses and all), and that already sux by itself. Having to wait for its approval every single time, and knowing that having gotten it the previous times doesn't make the next one any easier, sux even more. Right now is one of those times, so we're kinda in the same boat. Good luck for us all! If I ever go to the U.S. again, I'd very much like to drop by your theater :)",
      "created_at": "2004-11-11T08:07:36.000Z"
    },
    {
      "author": "Einahpets",
      "body": "It's ok Dan. I can write you an email saying you got the loan. It would be purely for make-believe, but hey, that's fun.",
      "created_at": "2004-11-11T18:30:38.000Z"
    }
  ],
  "categories": [
    {
      "id": 3,
      "name": "Day-to-day"
    },
    {
      "id": 8,
      "name": "MOXIE"
    },
    {
      "id": 12,
      "name": "Thoughts"
    }
  ]
}
